[
  {
    "id": "bloomberg-business-youtube-4e448e8d",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "S&P, Dow Slips Ahead of CPI Hearing | Closing Bell",
    "url": "https://www.youtube.com/watch?v=5szTzvET2cg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:41:50.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4e448e8d"
  },
  {
    "id": "zerohedge-660d283b",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Chaos In South China Sea: China Rams Own Warship While In Pursuit Of Philippine Vessel",
    "url": "https://www.zerohedge.com/geopolitical/chaos-south-china-sea-china-rams-own-warship-while-pursuit-philippine-vessel",
    "summary": "Chaos In South China Sea: China Rams Own Warship While In Pursuit Of Philippine Vessel Dramatic footage has emerged showing two Chinese navy vessels colliding while chasing a Philippine patrol boat near Scarborough Shoal in the South China Sea on Monday - an area considered by...",
    "fullContent": "Chaos In South China Sea: China Rams Own Warship While In Pursuit Of Philippine Vessel Dramatic footage has emerged showing two Chinese navy vessels colliding while chasing a Philippine patrol boat near Scarborough Shoal in the South China Sea on Monday - an area considered by some as a geopolitical flashpoint between Manila and Beijing. \"The (China Coast Guard vessel) CCG 3104, which was chasing the (Filipino coast guard vessel) BRP Suluan at high speed, performed a risky manoeuvre from the (Philippine) vessel's starboard quarter, leading to the impact with the PLA (People's Liberation Army) Navy warship,\" Philippine Coast Guard (PCG) officer Jay Tarriela said in a statement, quoted by AFP News. \"This resulted in substantial damage to the CCG vessel's forecastle, rendering it unseaworthy,\" Tarriela said. Tarriela released the footage on X. He described what unfolded: Here is a longer video capturing the collision between the PLA Navy 164 and the China Coast Guard 3104. The Philippine Coast Guard (PCG) has consistently urged the Chinese government to respect the COLREGS and to approach these matters with professionalism, especially considering their role in enforcing maritime laws. We have also emphasized that such reckless behavior at sea could ultimately lead to accidents. Our thoughts are with the CCG personnel who may have been injured in this incident. Here is a longer video capturing the collision between the PLA Navy 164 and the China Coast Guard 3104. The Philippine Coast Guard (PCG) has consistently urged the Chinese government to respect the COLREGS and to approach these matters with professionalism, especially considering… https://t.co/n7vcU4lGWq pic.twitter.com/cHU7rG2wAj — Jay Tarriela (@jaytaryela) August 11, 2025 The incident is the latest in a series of dangerous encounters in the South China Sea that could easily trigger broader conflict. Tensions in the area have been rising since Beijing seized Scarborough Shoal in 2012. Related: Building Frenzy In The South China Sea - Who Is Fortifying Islands? China Seizes Disputed Reef In South China Sea, Next To Key Philippines Military Base Disputes In South China Sea Could Disrupt Trade Lanes, Lead To War, Experts Say All of this plays into a broader theme of a more chaotic world heading into the 2030s, with the global order fracturing into a dangerous bipolar state. Tyler Durden Mon, 08/11/2025 - 16:40",
    "publishedAt": "2025-08-11T20:40:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "660d283b"
  },
  {
    "id": "bloomberg-markets-2d34323",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "S&P, Dow Slips Ahead of CPI Hearing | Closing Bell",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/s-p-dow-slips-ahead-of-cpi-hearing-closing-bell-video",
    "summary": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Romaine Bostick, Vonnie Quinn, Isabelle Lee and Tim Stenovec. (Source: Bloomberg)",
    "fullContent": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Romaine Bostick, Vonnie Quinn, Isabelle Lee and Tim Stenovec. (Source: Bloomberg)",
    "publishedAt": "2025-08-11T20:35:19.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2d34323"
  },
  {
    "id": "bloomberg-markets-15525390",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Klein: Nvidia, AMD Deal Doesn't Mean \"Free-for-All\" For Companies Selling to China",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/klein-nvidia-amd-deal-doesn-t-mean-free-for-all-video",
    "summary": "US President Donald Trump signaled on Monday that he’d be open to allowing Nvidia Corp. to sell a scaled-back version of its most advanced AI chip to China. Trump said he would consider a deal that would allow Nvidia to ship its Blackwell chips to China if the company could...",
    "fullContent": "US President Donald Trump signaled on Monday that he’d be open to allowing Nvidia Corp. to sell a scaled-back version of its most advanced AI chip to China. Trump said he would consider a deal that would allow Nvidia to ship its Blackwell chips to China if the company could design it to be less advanced. “It’s possible I’d make a deal” on a “somewhat enhanced — in a negative way — Blackwell” processor, he said in a briefing with reporters. “In other words, take 30% to 50% off of it.” Jordan Klein, Managing Director at Mizuho Securities USA tells Bloomberg Businessweek Daily says the policy change enables Nvidia to sell more chips. (Source: Bloomberg)",
    "publishedAt": "2025-08-11T20:31:48.000Z",
    "fetchedAt": "2025-08-12T02:23:20.602Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15525390"
  },
  {
    "id": "cnbc-markets-45f9c1e1",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump extends China tariff deadline by 90 days",
    "url": "https://www.cnbc.com/2025/08/11/trump-china-tariffs-deadline-extended.html",
    "summary": "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
    "fullContent": "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
    "publishedAt": "2025-08-11T20:31:33.000Z",
    "fetchedAt": "2025-08-12T02:23:21.251Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45f9c1e1"
  },
  {
    "id": "bloomberg-politics-6811841a",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump’s Deal for Chip Revenue May Usher In Trade Policy Shift",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-11/trump-s-deal-for-chip-revenue-may-usher-in-trade-policy-shift",
    "summary": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Every Monday, Bloomberg Intelligence senior analyst Nathan Dean gives his insights into what’s been happening and what’s coming up in the nooks and crannies of government and...",
    "fullContent": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Every Monday, Bloomberg Intelligence senior analyst Nathan Dean gives his insights into what’s been happening and what’s coming up in the nooks and crannies of government and markets. Sign up here and follow us at @bpolitics. Email our editors here.",
    "publishedAt": "2025-08-11T20:31:30.000Z",
    "fetchedAt": "2025-08-12T02:23:21.297Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6811841a"
  },
  {
    "id": "business-insider-d47809e",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I lived 2,000 miles away from my dying mother. I traveled to her as often as I could, but caregiving took its toll on my family.",
    "url": "https://www.businessinsider.com/caregiving-dying-mother-difficult-lived-far-away-2025-8",
    "summary": "My mother was diagnosed with cancer and dementia. I tried to visit her at least once a month, but I felt guilty not being there for her.",
    "fullContent": "My mother was diagnosed with cancer and dementia. I tried to visit her at least once a month, but I felt guilty not being there for her.",
    "publishedAt": "2025-08-11T20:31:12.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d47809e"
  },
  {
    "id": "ndtv-profit-youtube-6a671a12",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump News | Trump Says He’s Placing DC Police Under Federal Control, Deploying National Guard",
    "url": "https://www.youtube.com/shorts/Eysod4Isx6E",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:30:02.000Z",
    "fetchedAt": "2025-08-12T02:23:30.423Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6a671a12"
  },
  {
    "id": "oil-price-6741aed9",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Azerbaijan Orders Emergency Aid to Ukraine After SOCAR Drone Strike",
    "url": "https://oilprice.com/Latest-Energy-News/World-News/Azerbaijan-Orders-Emergency-Aid-to-Ukraine-After-SOCAR-Drone-Strike.html",
    "summary": "Azerbaijan has allocated $2 million to help Ukraine restore energy infrastructure damaged in recent Russian missile and drone attacks, President Ilham Aliyev announced Monday. The funds, drawn from the president’s reserve, will be transferred to the Ministry of Energy for the...",
    "fullContent": "Azerbaijan has allocated $2 million to help Ukraine restore energy infrastructure damaged in recent Russian missile and drone attacks, President Ilham Aliyev announced Monday. The funds, drawn from the president’s reserve, will be transferred to the Ministry of Energy for the purchase and delivery of Azerbaijani-made electrical equipment, according to APA News Agency. The decision follows a phone call between Aliyev and Ukrainian President Volodymyr Zelensky on Sunday, during which both leaders condemned recent Russian strikes on a SOCAR-operated…",
    "publishedAt": "2025-08-11T20:30:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.382Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "6741aed9"
  },
  {
    "id": "bloomberg-markets-5836d1af",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Extends China Truce, Open to Scaled-Back Blackwell Sales | Bloomberg Businessweek Daily 8/11/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/bloomberg-businessweek-daily-8-11-2025-video",
    "summary": "On today's episode of Bloomberg Businessweek Daily, Tim Stenovec and Isabelle Lee speak with Jordan Klein, Managing Director at Mizuho Securities USA on the signal from President Trump that he would be open to allowing Nvidia Corp.",
    "fullContent": "On today's episode of Bloomberg Businessweek Daily, Tim Stenovec and Isabelle Lee speak with Jordan Klein, Managing Director at Mizuho Securities USA on the signal from President Trump that he would be open to allowing Nvidia Corp. to sell a scaled-back version of its most advanced AI chip to China. They also spoke with Senior Non-Resident Fellow at New York University Ed Price on Trump's extension of the 90 day trade truce with China, and upcoming summit with Russian President Vladimir Putin. Finally, Tim Herbert, president and CEO of Inspire Medical System, discussed his company's earnings and share buyback announcement. (Source: Bloomberg)",
    "publishedAt": "2025-08-11T20:29:34.000Z",
    "fetchedAt": "2025-08-12T02:23:20.602Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5836d1af"
  },
  {
    "id": "bbc-business-71fcd7c1",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "AOL ends dial-up service after more than 30 years",
    "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "The internet service which soared in popularity in the 1990s will come to an end from 30 September.",
    "fullContent": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
    "publishedAt": "2025-08-11T20:26:24.000Z",
    "fetchedAt": "2025-08-12T02:23:23.542Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "71fcd7c1"
  },
  {
    "id": "bloomberg-business-youtube-1d59db2a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Lithium prices surged after one of the world's largest mines closed in China",
    "url": "https://www.youtube.com/shorts/urL9EgW9xmw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:25:34.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1d59db2a"
  },
  {
    "id": "ft-economics-27f93de7",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "Trump extends trade war truce with China",
    "url": "https://www.ft.com/content/82126a13-e66b-4f3b-bb6d-74f165a291d0",
    "summary": "US leader postpones new tariffs on world’s biggest exporter for another 90 days.",
    "fullContent": "US leader postpones new tariffs on world’s biggest exporter for another 90 days",
    "publishedAt": "2025-08-11T20:22:56.000Z",
    "fetchedAt": "2025-08-12T02:23:22.368Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "27f93de7"
  },
  {
    "id": "the-verge-78f672c2",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Even the lowly canister vacuum now wants access to your Wi-Fi network",
    "url": "https://www.theverge.com/news/757731/miele-guard-l1-electro-canister-vacuum-smart-wifi-mobile-app",
    "summary": "Despite the convenience of cordless stick vacs, canister vacuums are still very much a thing for those with battery anxiety or those who want a lighter cleaner. Miele still offers over 20 different models of canister vacs in the US, but its latest is the company’s first to...",
    "fullContent": "Despite the convenience of cordless stick vacs, canister vacuums are still very much a thing for those with battery anxiety or those who want a lighter cleaner. Miele still offers over 20 different models of canister vacs in the US, but its latest is the company’s first to introduce smart functionality making it yet another [&#8230;]",
    "publishedAt": "2025-08-11T20:20:32.000Z",
    "fetchedAt": "2025-08-12T02:23:23.096Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "78f672c2"
  },
  {
    "id": "bloomberg-business-youtube-a69a16a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Could Let Nvidia Sell Scaled-Down Blackwell Chip to China",
    "url": "https://www.youtube.com/watch?v=GjuiflzWWS0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:20:10.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "a69a16a"
  },
  {
    "id": "zerohedge-5be31ad1",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "RussiaGate: 'A Murder Of American Democracy Was Committed'",
    "url": "https://www.zerohedge.com/political/russiagate-murder-american-democracy-was-committed",
    "summary": "RussiaGate: 'A Murder Of American Democracy Was Committed' Authored by James Howard Kunstler, Under Color Of Law \"The second-order and third-order damages of RussiaGate are incalculable. A murder of American democracy was committed.",
    "fullContent": "RussiaGate: 'A Murder Of American Democracy Was Committed' Authored by James Howard Kunstler, Under Color Of Law \"The second-order and third-order damages of RussiaGate are incalculable. A murder of American democracy was committed.\" - Mike Benz on \"X\" Surely you’ve noticed the ominous cone of silence around the DOJ and the FBI as rumors of “accountability” mount against well-known figures who used government to make war against its own citizens. That is exactly what happened, by the way, in case you’re baffled by the news. The agencies aren’t leaking this time, especially not to the mendacious scribes that infest The New York Times and The WashPo, who function as vanguard to the corps of traitors in the rogue fourth branch of government called the Blob. So, the silence begs you to ask: Are they doing anything in there? Yes, they are making cases. And they are not yapping idly about it in the news, legacy or alt. They are preparing evidence for grand juries that will decide if probable cause exists to indict those well-known figures — several of whom have become cable news performers, foolishly, if obliquely, advertising their own culpability for years now. You’ll just have to wait, though perhaps not for long. It is August, after all, the horse latitudes of the year when things go still. You are lectured incessantly and sanctimoniously by these same suspects about the rule of law (in “our democracy”). Many of these characters are maestros in the dark arts of lawfare, which, paradoxically, is the practice of using law to pervert and dishonor the rule of law. Lately, you are introduced to a similar sounding phrase, under color of law, with a related meaning. Understand it and you will see what has been behind virtually all the mischief in our public affairs this past, vicious decade. Under color of law has deep roots in Anglo-American jurisprudence because law, by its nature, lends itself to abuse and nefarious misuse. The law’s “nature” is that it is a set of rules to decide matters of consequence, both personal and public, where much is at stake: ownership of property, liberty, life itself. At times, actions are taken in the name of the law to unjustly deprive persons of life, liberty, and property, usually for the benefit of other persons. The phrase, life, liberty, and property, derives from John Locke’s Two Treatises on Government (1689), which argued that these are natural rights, God-given, and that it is government’s duty to protect these rights, government being the practical application of law. The phrase life, liberty, and property deeply influenced America’s founders. Thomas Jefferson changed it up a bit in the Declaration of Independence as “life, liberty, and the pursuit of happiness,” with a eudaimonian twist to inspire America to flourish on its own, off England’s leash. It was also Jefferson’s way of detaching the Declaration from the issue of slavery, where “property” could refer to human beings. But the Lockean original, life, liberty and property, reappears in the Bill of Rights to the Constitution. It is in the Fifth Amendment, protecting persons from the arbitrary deprivation of these rights without due process by the federal government, and in the Fourteenth Amendment applying the same principle of law to state governments. Where lawfare comes in is under due process. Lawfare’s aim is to pervert due process, to use officers of the courts to act unfairly and unjustly in the name of the law, and thus, under color of law. This is exactly what you saw in the several cases brought against Mr. Trump in New York State in 2024, a three-ring circus of process-abuse engineered by the “Joe Biden” White House, coordinated with Merrick Garland’s DOJ (through Deputy AG Lisa Monaco), with assists from NY AG Letitia James and Manhattan DA Alvin Bragg. Ditto the RICO case attempted in Atlanta under Fulton County DA Fani Willis, a spectacular botch. And ditto, the cases brought under Special Counsel Jack Smith in Florida and DC, also badly botched. The slovenly ineptitude of these cases was really something to behold, including the sordid romantic complications around Fani Willis and her chosen chief prosecutor, “boyfriend” Nathan Wade, a divorce lawyer with no experience in criminal law. Throw in the disgraceful, self-conflicted antics of the Judges Kaplan, Engoron, and Merchan in the New York cases, and the oafish conduct of Jack Smith and his assistants in Florida and DC — and what you get is a demonstration of how crude an instrument sheer lying actually is in the practice of law, and how easily it breaks against the people using it. Some of these characters are just now coming to grief: Letitia James faces a DOJ action on depriving Mr. Trump’s rights, and SC Jack Smith is under active FBI investigation for evidence tampering and other crimes of process abuse. It would be fitting for all the prosecutors and the three judges in the New York cases to face similar inquiries. The phrase under color of law establishes liability for abuse of power for officials vested with the terrible authority for upending people’s lives. The phrase “deprivation of rights” appears explicitly in federal statutes primarily focused on holding government officials and others acting with apparent legal authority accountable for willfully violating an individual’s constitutional or legal rights. The most relevant statute is 18 U.S.C. § 242, which directly criminalizes such conduct. Additional statutes, such as 18 U.S.C. § 241, 18 U.S.C. § 250, 18 U.S.C. § 2243, and 18 U.S.C. § 2244. That’s where all this is going, even if all that’s coming out of the DOJ and FBI for the moment is that ominous silence. Tyler Durden Mon, 08/11/2025 - 16:20",
    "publishedAt": "2025-08-11T20:20:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5be31ad1"
  },
  {
    "id": "cnbc-markets-6198f6b8",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "C3 AI stock falls 26% as CEO Siebel calls preliminary sales numbers 'completely unacceptable'",
    "url": "https://www.cnbc.com/2025/08/11/c3-ai-stock-ceo-thomas-siebel.html",
    "summary": "C3 AI shares tumbled after it announced preliminary financial results and a restructuring of its global sales and services organization.",
    "fullContent": "C3 AI shares tumbled after it announced preliminary financial results and a restructuring of its global sales and services organization.",
    "publishedAt": "2025-08-11T20:15:59.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6198f6b8"
  },
  {
    "id": "techmeme-1b1e4f93",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Trump family's World Liberty Financial is using a publicly listed company, ALT5 Sigma, to raise $1.5B for the purchase of its WLFI token (Ben Weiss/Fortune)",
    "url": "http://www.techmeme.com/250811/p24#a250811p24",
    "summary": "Ben Weiss / Fortune: Trump family's World Liberty Financial is using a publicly listed company, ALT5 Sigma, to raise $1.5B for the purchase of its WLFI token — World Liberty Financial cofounders Zach Witkoff (left) and Eric Trump.",
    "fullContent": "Ben Weiss / Fortune: Trump family's World Liberty Financial is using a publicly listed company, ALT5 Sigma, to raise $1.5B for the purchase of its WLFI token — World Liberty Financial cofounders Zach Witkoff (left) and Eric Trump. — The Trump family's crypto business, World Liberty Financial &hellip;",
    "publishedAt": "2025-08-11T20:15:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1b1e4f93"
  },
  {
    "id": "business-insider-2058c953",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I spent 2 nights in a tiny home hotel in Germany. 7 things surprised me about the 2-story, 100-square-foot house.",
    "url": "https://www.businessinsider.com/tiny-home-hotel-slube-germany-surprising-things",
    "summary": "From its tubular two-story shape to its smart tech and clever storage hacks, I was very impressed by the tiny home I booked in Germany.",
    "fullContent": "From its tubular two-story shape to its smart tech and clever storage hacks, I was very impressed by the tiny home I booked in Germany.",
    "publishedAt": "2025-08-11T20:14:41.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2058c953"
  },
  {
    "id": "cnbc-markets-4511f5b8",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Cannabis stocks rally after Trump says he is weighing drug reclassification",
    "url": "https://www.cnbc.com/2025/08/11/cannabis-stocks-trump-considering-reclassification-weed.html",
    "summary": "Trump said he's considering reclassifying marijuana's danger level. That drove cannabis stocks up Monday.",
    "fullContent": "Trump said he's considering reclassifying marijuana's danger level. That drove cannabis stocks up Monday.",
    "publishedAt": "2025-08-11T20:13:58.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4511f5b8"
  },
  {
    "id": "bloomberg-markets-3c70b4ed",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Merck KGaA Plans $4 Billion Bond Sale to Fund SpringWorks Therapeutics Acquisition",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/merck-kgaa-is-said-to-plan-4-billion-bond-sale-to-fund-purchase",
    "summary": "Merck KGaA, a German maker of drugs and electronics, is looking to sell around $4 billion of US investment-grade bonds to help fund its acquisition of SpringWorks Therapeutics Inc., according to people with knowledge of the matter.",
    "fullContent": "Merck KGaA, a German maker of drugs and electronics, is looking to sell around $4 billion of US investment-grade bonds to help fund its acquisition of SpringWorks Therapeutics Inc., according to people with knowledge of the matter.",
    "publishedAt": "2025-08-11T20:13:45.000Z",
    "fetchedAt": "2025-08-12T02:23:20.602Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c70b4ed"
  },
  {
    "id": "cnbc-markets-68fbb3e0",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "AMC significantly narrows losses, posts second-quarter revenue growth",
    "url": "https://www.cnbc.com/2025/08/11/amc-earnings-q2-2025-narrow-losses.html",
    "summary": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "fullContent": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "publishedAt": "2025-08-11T20:07:57.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68fbb3e0"
  },
  {
    "id": "cnbc-business-68fbb3e0",
    "sourceId": "cnbc-business",
    "sourceName": "CNBC Business",
    "title": "AMC significantly narrows losses, posts second-quarter revenue growth",
    "url": "https://www.cnbc.com/2025/08/11/amc-earnings-q2-2025-narrow-losses.html",
    "summary": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "fullContent": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "publishedAt": "2025-08-11T20:07:57.000Z",
    "fetchedAt": "2025-08-12T02:23:22.013Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68fbb3e0"
  },
  {
    "id": "bloomberg-business-youtube-760b86b0",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Confirms Nvidia Chips Payment | Balance of Power 8/11/2025",
    "url": "https://www.youtube.com/watch?v=QpJ3Ykn9BWg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:06:10.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "760b86b0"
  },
  {
    "id": "bloomberg-markets-50196dd0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Bitcoin-Miner MARA Strikes $168 Million Deal for EDF Unit",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/bitcoin-miner-mara-said-to-near-168-million-deal-for-edf-unit",
    "summary": "MARA Holdings Inc. has agreed to acquire a majority stake in Exaion from Electricite de France SA as the largest Bitcoin miner looks to extend its reach into artificial intelligence as an infrastructure provider.",
    "fullContent": "MARA Holdings Inc. has agreed to acquire a majority stake in Exaion from Electricite de France SA as the largest Bitcoin miner looks to extend its reach into artificial intelligence as an infrastructure provider.",
    "publishedAt": "2025-08-11T20:03:22.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "50196dd0"
  },
  {
    "id": "cnbc-markets-4370ad2b",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Sequoia's Moritz backs Intel CEO Lip-Bu Tan after Trump's 'artless bullying'",
    "url": "https://www.cnbc.com/2025/08/11/sequoia-moritz-intel-ceo-trump.html",
    "summary": "Sequoia Capital's Michael Moritz is calling on Intel to stand by CEO Lip-Bu Tan after President Donald Trump demanded his resignation last week.",
    "fullContent": "Sequoia Capital's Michael Moritz is calling on Intel to stand by CEO Lip-Bu Tan after President Donald Trump demanded his resignation last week.",
    "publishedAt": "2025-08-11T20:02:52.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4370ad2b"
  },
  {
    "id": "ndtv-profit-youtube-77cc579d",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Tariff News | Trump Says ‘We’ll See What Happens’ On China Tariffs As Midnight Deadline Looms",
    "url": "https://www.youtube.com/shorts/EfAUBrZ8nUw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:00:37.000Z",
    "fetchedAt": "2025-08-12T02:23:30.423Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "77cc579d"
  },
  {
    "id": "oil-price-e571031",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Trump’s Tariff Gambit Puts India in an Oil Price Bind",
    "url": "https://oilprice.com/Energy/Crude-Oil/Trumps-Tariff-Gambit-Puts-India-in-an-Oil-Price-Bind.html",
    "summary": "In one of his more controversial decisions last week, President Trump said the U.S. would impose an additional 25% on many Indian imports—because of India’s imports of Russian crude oil. The news lifted oil prices, and Indian refiners suspended their Russian oil orders.",
    "fullContent": "In one of his more controversial decisions last week, President Trump said the U.S. would impose an additional 25% on many Indian imports—because of India’s imports of Russian crude oil. The news lifted oil prices, and Indian refiners suspended their Russian oil orders. But the bigger picture shows India at a crossroads not dissimilar to that of the EU: a choice between cheap and expensive energy with all that either option entails. On the face of it, the choice is pretty simple, as laid out by the Economic Times in an article that…",
    "publishedAt": "2025-08-11T20:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.382Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "e571031"
  },
  {
    "id": "bloomberg-business-youtube-a19bd5b",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump-Putin Summit: Will a Deal About Ukraine be Reached in Alaska?",
    "url": "https://www.youtube.com/watch?v=n2G0gweMv04",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:59:39.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "a19bd5b"
  },
  {
    "id": "techmeme-7361b9ef",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Anthropic adds a memory feature for Claude to reference information from past chats, available now for Max, Team, and Enterprise plans, and soon for other plans (Zac Hall/9to5Mac)",
    "url": "http://www.techmeme.com/250811/p23#a250811p23",
    "summary": "Zac Hall / 9to5Mac: Anthropic adds a memory feature for Claude to reference information from past chats, available now for Max, Team, and Enterprise plans, and soon for other plans — Anthropic has introduced a helpful new feature for Claude that solves a problem similar to one...",
    "fullContent": "Zac Hall / 9to5Mac: Anthropic adds a memory feature for Claude to reference information from past chats, available now for Max, Team, and Enterprise plans, and soon for other plans — Anthropic has introduced a helpful new feature for Claude that solves a problem similar to one ChatGPT already addressed.",
    "publishedAt": "2025-08-11T19:55:01.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7361b9ef"
  },
  {
    "id": "cnbc-markets-24cfb02f",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "A new piece of Wall Street research prompted us to change our rating on Salesforce",
    "url": "https://www.cnbc.com/2025/08/11/a-new-piece-of-wall-street-research-prompted-us-to-change-our-rating-on-salesforce.html",
    "summary": "Melius Research's downgrade of Adobe makes the case that AI is a major threat to software providers like Salesforce.",
    "fullContent": "Melius Research's downgrade of Adobe makes the case that AI is a major threat to software providers like Salesforce.",
    "publishedAt": "2025-08-11T19:53:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "24cfb02f"
  },
  {
    "id": "wsj-opinion-5ae6b7c2",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Napoleon&#x2019;s Lessons for Trump",
    "url": "https://www.wsj.com/opinion/napoleons-lessons-for-trump-president-power-france-emperor-bf60820b",
    "summary": "The president grasps power dynamics but should learn from the French emperor&#x2019;s fall.",
    "fullContent": "The president grasps power dynamics but should learn from the French emperor&#x2019;s fall.",
    "publishedAt": "2025-08-11T19:53:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "5ae6b7c2"
  },
  {
    "id": "wsj-opinion-6a5341fa",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Recognizing a Palestinian State Is a Rebuke to Hamas",
    "url": "https://www.wsj.com/opinion/recognizing-a-palestinian-state-is-a-rebuke-to-hamas-middle-east-gaza-ee687a6c",
    "summary": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "fullContent": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "publishedAt": "2025-08-11T19:52:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "6a5341fa"
  },
  {
    "id": "wsj-opinion-4e3c7ab5",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Can Trump Tame the Washington, D.C., Streets?",
    "url": "https://www.wsj.com/opinion/can-trump-tame-the-d-c-streets-washington-home-rule-81bb61be",
    "summary": "Home rule is likely here to stay, but there are things he can do.",
    "fullContent": "Home rule is likely here to stay, but there are things he can do.",
    "publishedAt": "2025-08-11T19:52:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e3c7ab5"
  },
  {
    "id": "wsj-world-news-1e9296e4",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Recognizing a Palestinian State Is a Rebuke to Hamas",
    "url": "https://www.wsj.com/opinion/recognizing-a-palestinian-state-is-a-rebuke-to-hamas-middle-east-gaza-ee687a6c",
    "summary": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "fullContent": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "publishedAt": "2025-08-11T19:52:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.952Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "1e9296e4"
  },
  {
    "id": "ft-markets-1cdc29c",
    "sourceId": "ft-markets",
    "sourceName": "Financial Times Markets",
    "title": "Trump says gold imports will not face US tariffs",
    "url": "https://www.ft.com/content/9e757ba7-73a5-4d19-bb76-4ddc303b26dd",
    "summary": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge.",
    "fullContent": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge",
    "publishedAt": "2025-08-11T19:51:44.000Z",
    "fetchedAt": "2025-08-12T02:23:21.590Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1cdc29c"
  },
  {
    "id": "ft-economics-1cdc29c",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "Trump says gold imports will not face US tariffs",
    "url": "https://www.ft.com/content/9e757ba7-73a5-4d19-bb76-4ddc303b26dd",
    "summary": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge.",
    "fullContent": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge",
    "publishedAt": "2025-08-11T19:51:44.000Z",
    "fetchedAt": "2025-08-12T02:23:22.368Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "1cdc29c"
  },
  {
    "id": "wsj-markets-main-33079fbf",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Opinion | No Help Wanted, No Economic Growth",
    "url": "https://www.wsj.com/opinion/no-help-wanted-no-economic-growth-central-banking-cuts-109e4aaf?mod=rss_markets_main",
    "summary": "The economy faces problems more pressing than inflation.",
    "fullContent": "The economy faces problems more pressing than inflation.",
    "publishedAt": "2025-08-11T19:51:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.177Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "33079fbf"
  },
  {
    "id": "wsj-opinion-4e686203",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "No Help Wanted, No Economic Growth",
    "url": "https://www.wsj.com/opinion/no-help-wanted-no-economic-growth-central-banking-cuts-109e4aaf",
    "summary": "The economy faces problems more pressing than inflation.",
    "fullContent": "The economy faces problems more pressing than inflation.",
    "publishedAt": "2025-08-11T19:51:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e686203"
  },
  {
    "id": "zerohedge-13892265",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Goldman Finds \"Sharp Declines\" In Import Prices As Foreigners Absorb Trump's Tariffs",
    "url": "https://www.zerohedge.com/markets/goldman-finds-sharp-declines-import-prices-foreigners-absorb-trumps-tariffs",
    "summary": "Goldman Finds \"Sharp Declines\" In Import Prices As Foreigners Absorb Trump's Tariffs Back in late June, we were first to point out something startling: contrary to conventional wisdom according to which prices of heavily-tariffed goods would surge and spark runaway inflation...",
    "fullContent": "Goldman Finds \"Sharp Declines\" In Import Prices As Foreigners Absorb Trump's Tariffs Back in late June, we were first to point out something startling: contrary to conventional wisdom according to which prices of heavily-tariffed goods would surge and spark runaway inflation (just skim this from certified idiot Paul Krugman), we found just the opposite, namely that Japanese passenger car export prices had plunged by the most on record, demonstrating that it was foreign producers that were eating the bulk of the tariffs, certainly in this particular case. well would you look at that: guess who is eating all those tariff costs (hint, it's not US consumers) pic.twitter.com/iwdKyeqTII — zerohedge (@zerohedge) June 22, 2025 Three days later, our chart ended up in front of Fed Chair Jerome Powell during his periodic grilling in Congress, where he was unable to give a clear explanation as to why the export prices of Japanese autos would be plunging in response to sharply higher tariffs (the answer, of course, is simple: foreign producers simply can not pass through costs to the US market without losing much if not all of their market share, so they have no choice but to eat the loss). well would you look at that: three days later Powell has to discuss this chart https://t.co/6AfkRRSjJp pic.twitter.com/SOGjff2Fsl — zerohedge (@zerohedge) June 25, 2025 Fast forward to today when Goldman, similar to Morgan Stanley over the weekend, tried to analyze why those tariffs which it - and so many other economists predicted incorrectly - would already have sent inflation soaring, have failed to do so. While there is a bunch of stuff in the report (which pro subs can read at their leisure here), what was most notable is the \"discovery\" that it's not just Japanese car makers. As Goldman's Jan Hatzius reveals, \"we find that US import prices on tariffed goods have declined somewhat, suggesting that foreign exporters have absorbed some tariff costs by lowering their export prices to the US, unlike during the 2018-2019 trade war.\" Our updated analysis shows that a 1pp increase in the product-level tariff rate led to a 0.25% cumulative decline in import prices over the first three months of implementation, with minimal impact thereafter. Of course, here Goldman had to mix fact with projection to not sound like a bunch of wrong, confused career economists. When one strips away hypothesis and forecast, here is what actually happened: \"following the implementation of China and auto tariffs, import prices (exclusive of tariffs) of both consumer and non-consumer goods from China, as well as import prices of passenger cars (exclusive of tariffs) from the EU and Japan, all experienced sharp declines.\" Looking forward, Goldman concludes that whereas \"foreign exporters had absorbed 14% of the cost of all tariffs implemented so far through June, their share will rise to 25% if the more recent tariffs follow the same pattern as the earliest tariffs on China.\" This also means that the 9% increase in the effective tariff rate through June has reduced import prices by at least 1.3% so far, and that the total 14% increase in the effective tariff rate that Goldman expects in 2025 will likely reduce import prices by 3.7%, if not much more assuming foreign producers continue to keep prices reduced to remain competitive with lower-cost domestic producers. The rest of the Goldman note goes on to do what Morgan Stanley tried to do yesterday: forecast just when all those tariffs will eventually finally show up in inflation... an exercise they have to do because both giant banks were very wrong in incorrectly assuming that inflation would already be far higher than it is so far. Don't be surprise if tomorrow's CPI comes in tame yet again, prompting even more revisions to Goldman's inflation ETA. Much more in the full Goldman note, available to pro subscribers. Tyler Durden Mon, 08/11/2025 - 15:45",
    "publishedAt": "2025-08-11T19:45:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.062Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "13892265"
  },
  {
    "id": "ndtv-profit-youtube-55285c7d",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "If You're Weak And Pathetic, I Will Fire You So Fast: Trump Jokes With Top US Marshall",
    "url": "https://www.youtube.com/shorts/8Fki9-64o3Y",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:42:08.000Z",
    "fetchedAt": "2025-08-12T02:23:30.423Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "55285c7d"
  },
  {
    "id": "techmeme-7d78f9ec",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Revel plans to wind down rideshare operations in its home city of New York after four years, pivoting to an EV-charging business that counts Uber as a partner (Natalie Lung/Bloomberg)",
    "url": "http://www.techmeme.com/250811/p22#a250811p22",
    "summary": "Natalie Lung / Bloomberg: Revel plans to wind down rideshare operations in its home city of New York after four years, pivoting to an EV-charging business that counts Uber as a partner — Revel Transit Inc.",
    "fullContent": "Natalie Lung / Bloomberg: Revel plans to wind down rideshare operations in its home city of New York after four years, pivoting to an EV-charging business that counts Uber as a partner — Revel Transit Inc. plans to wind down rideshare operations after weathering stiff competition in its home city of New York &hellip;",
    "publishedAt": "2025-08-11T19:40:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7d78f9ec"
  },
  {
    "id": "fortune-31c4d6fc",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Disney adds to sports streaming war chest with ESPN/Fox bundle priced at $39.99 per month",
    "url": "https://fortune.com/2025/08/11/espn-fox-sports-streaming-bundle-disney-price/",
    "summary": "You can save $10 a month by signing up for this bundle, instead of ESPN’s and Fox’s separate stand-alone services, debuting in August.",
    "fullContent": "You can save $10 a month by signing up for this bundle, instead of ESPN’s and Fox’s separate stand-alone services, debuting in August.",
    "publishedAt": "2025-08-11T19:36:21.000Z",
    "fetchedAt": "2025-08-12T02:23:23.467Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "31c4d6fc"
  },
  {
    "id": "cnbc-markets-524aa629",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "California Gov. Newsom warns Trump he'll retaliate if Texas GOP draws new congressional maps",
    "url": "https://www.cnbc.com/2025/08/11/trump-newsom-texas-california-house-congress.html",
    "summary": "Republicans have a slim majority in the House of Representatives. Texas GOP lawmakers are seeking to preserve that edge over Democrats in the 2026 election.",
    "fullContent": "Republicans have a slim majority in the House of Representatives. Texas GOP lawmakers are seeking to preserve that edge over Democrats in the 2026 election.",
    "publishedAt": "2025-08-11T19:35:36.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "524aa629"
  },
  {
    "id": "cnbc-tv18-youtube-42789bb3",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "'वोट चोरी' के आरोप पर फंस गए राहुल? | #biharelection2025 #rahulgandhi #viral #shorts",
    "url": "https://www.youtube.com/shorts/-trlyWuMb6M",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:35:14.000Z",
    "fetchedAt": "2025-08-12T02:23:27.267Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "42789bb3"
  },
  {
    "id": "zerohedge-1ad3b04c",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "\"Prepare Now\": Substation Failure Puts Baltimore At Risk Of \"Widespread\" Blackout",
    "url": "https://www.zerohedge.com/ai/prepare-now-substation-failure-puts-baltimore-risk-widespread-blackouts",
    "summary": "\"Prepare Now\": Substation Failure Puts Baltimore At Risk Of \"Widespread\" Blackout Over a million residents across central Maryland, particularly in the Baltimore metro, were warned moments ago by the local utility that a substation failure linked to a major power plant could...",
    "fullContent": "\"Prepare Now\": Substation Failure Puts Baltimore At Risk Of \"Widespread\" Blackout Over a million residents across central Maryland, particularly in the Baltimore metro, were warned moments ago by the local utility that a substation failure linked to a major power plant could trigger widespread blackouts this afternoon. The alert comes barely a week after President Trump handed Maryland Governor Wes Moore and the Democratic Party in Annapolis a political lifeline to prevent power blackouts, underscoring the fragility of the state's power grid under the weight of failed Democrat-driven green energy policies. It's an unbelievable disgrace what the Democrats have done to the people of this state. https://t.co/ogqeCHafQQ — Robin Grammer (@RobinGrammer) August 11, 2025 Baltimore Gas and Electric (BGE) has asked all 1.3 million of its electric customers in central Maryland \"to conserve electricity to reduce the potential for widespread outages this afternoon and evening, due to a power plant experiencing an unplanned disconnection from the BGE electric system.\" BGE is asking all customers to conserve electricity to reduce the potential for widespread outages this afternoon and evening as the result of a power plant experiencing an unplanned disconnection from the BGE electric system. — BGE (@MyBGE) August 11, 2025 The Maryland Freedom Caucus reports that a substation linked to the Brandon Shores Power Plant experienced a failure earlier today, which could leave the supply insufficient when demand peaks later. As a result, Baltimore City and surrounding areas may face rolling blackouts this afternoon. The Maryland Freedom Caucus blamed what it called \"irresponsible Democrats\" and their \"failed green energy policies\" for the crisis. The Maryland Freedom Caucus urges residents in affected areas to take precautions to limit the impact of any outages. But make no mistake—this crisis is the direct result of radical, extremist energy policies from Maryland Democrats and Governor Wes Moore, which are driving reliable power plants toward closure and leaving our grid on the brink. This situation has the real possibility of being a regular occurrence if we do not change course. We renew our call to Governor Moore to stop relying on federal bailouts and use his executive authority to protect Maryland's energy future: Keep our existing plants open and reopen recently closed facilities End the Green Energy Scam mandates strangling our economy Eliminate the EmPOWER surcharge that drains ratepayers without cooling their homes Immediately add nuclear to Maryland's Tier 1 energy options. A short time ago, we were alerted to a substation failure that feeds the Brandon Shores Power Plant that may result in brief blackouts in the Baltimore region. We are urging impacted residents to prepare now but also those who can be held accountable to step up and do the right… pic.twitter.com/vQjqutPNhl — Maryland Freedom Caucus (@MDFreedomCaucus) August 11, 2025 Last week, U.S. Energy Secretary Chris Wright granted Democrats in the state a massive political lifeline to prevent rolling blackouts by granting a 90-day emergency waiver allowing the H.A. Wagner power plant to exceed pollution limits to avoid rolling blackouts in the Baltimore metro area. We no longer need to explain how Maryland is becoming the epicenter of the Democratic Party's imploding policies - all on display for the nation to see, especially on the green issue. \"Another Reason To Leave\": Top Maryland Power Official Warns Of Regular Rolling Blackouts Maryland Democrats Scramble As Green Energy Agenda Sparks Power Bill Hyperinflation Democrats Spark \"Manufactured Power Crisis\" In Maryland As Left Begins To Panic \"You're Welcome\": Pennsylvania Boasts About Saving 'Green' Maryland From Near Power Grid Collapse Far-Left Panic: Dark Money NGO Floods Baltimore Airwaves With Propaganda To Save Governor Trump Admin Throws Maryland Democrats A Lifeline To Halt Power Blackout Threat After Green Policies Backfire Meanwhile, failed green policies and increasing baseload power demand, driven by data centers, EVs, and other electrification trends, have created a perfect storm of hyperinflated power bills for residents. Power CPI in U.S... In one year, this will be the most popular chart on this site pic.twitter.com/h93gWXMoNL — zerohedge (@zerohedge) August 11, 2025 Correct. Forced electric load reduction and possible rolling blackouts in Maryland. Electric system in crisis. Got Coal? pic.twitter.com/GyW45fTu1i — WV Coal Association (@WV_coal1) August 11, 2025 Any blackout today would be disastrous, not just for Gov. Moore, who is being groomed for 2028, but also for Democrats, as their green energy agenda short-circuits with failures. Tyler Durden Mon, 08/11/2025 - 15:35",
    "publishedAt": "2025-08-11T19:35:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.063Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1ad3b04c"
  },
  {
    "id": "cnbc-tv18-youtube-637c1beb",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "'डबल वोटर' के दावे से राहुल की मुश्किल डबल? #rahulgandhi #electioncommission #viral #biharelection",
    "url": "https://www.youtube.com/shorts/64JJzKTmsOg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:33:14.000Z",
    "fetchedAt": "2025-08-12T02:23:27.267Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "637c1beb"
  },
  {
    "id": "ndtv-profit-youtube-60fb4301",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Tariff News | Trump Says ‘We’ll See What Happens’ On China Tariffs As Midnight Deadline Looms",
    "url": "https://www.youtube.com/watch?v=KHP82hJRpJs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:33:02.000Z",
    "fetchedAt": "2025-08-12T02:23:30.423Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "60fb4301"
  },
  {
    "id": "business-insider-5a87632e",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "YouTube's former chief product officer says getting money from Google felt like pitching a VC",
    "url": "https://www.businessinsider.com/youtube-cpo-shishir-mehrotra-ask-investment-google-2025-8",
    "summary": "Shishir Mehrotra said there was not &#34;infinite money&#34; when he was chief product officer at YouTube. He had to pitch Google for more capital.",
    "fullContent": "Shishir Mehrotra said there was not &#34;infinite money&#34; when he was chief product officer at YouTube. He had to pitch Google for more capital.",
    "publishedAt": "2025-08-11T19:32:09.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5a87632e"
  },
  {
    "id": "the-verge-511cf4ed",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Reddit will block the Internet Archive",
    "url": "https://www.theverge.com/news/757538/reddit-internet-archive-wayback-machine-block-limit",
    "summary": "Reddit says that it has caught AI companies scraping its data from the Internet Archive’s Wayback Machine, so it’s going to start blocking the Internet Archive from indexing the vast majority of Reddit.",
    "fullContent": "Reddit says that it has caught AI companies scraping its data from the Internet Archive’s Wayback Machine, so it’s going to start blocking the Internet Archive from indexing the vast majority of Reddit. The Wayback Machine will no longer be able to crawl post detail pages, comments, or profiles; instead, it will only be able [&#8230;]",
    "publishedAt": "2025-08-11T19:31:52.000Z",
    "fetchedAt": "2025-08-12T02:23:23.097Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "511cf4ed"
  },
  {
    "id": "the-verge-2e16325a",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "This see-thru Game Boy is a work of art — because she designed a transparent circuit board",
    "url": "https://www.theverge.com/games/757662/natalie-the-nerd-transparent-translucent-game-boy-pcb",
    "summary": "Have you heard of Natalie the Nerd? She’s a pillar of the Nintendo Game Boy modding scene who taught herself to reverse engineer and design Game Boy circuit boards. Now, she’s put her skills to work in probably the most beautiful build I’ve ever seen: a working see-through...",
    "fullContent": "Have you heard of Natalie the Nerd? She’s a pillar of the Nintendo Game Boy modding scene who taught herself to reverse engineer and design Game Boy circuit boards. Now, she’s put her skills to work in probably the most beautiful build I’ve ever seen: a working see-through Game Boy Color where even the circuit [&#8230;]",
    "publishedAt": "2025-08-11T19:31:03.000Z",
    "fetchedAt": "2025-08-12T02:23:23.096Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "2e16325a"
  },
  {
    "id": "cnbc-tv18-youtube-68176420",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Russia Ukraine War : ज़ेलेंस्की की 'अलास्का बग़ावत', जंग करेंगे ज़मीन नहीं देंगे?",
    "url": "https://www.youtube.com/watch?v=jCmpgpZXo2E",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:30:07.000Z",
    "fetchedAt": "2025-08-12T02:23:27.267Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "68176420"
  },
  {
    "id": "bloomberg-business-youtube-5cc6c1fd",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Why Trump is still under fire for his handling of Epstein case",
    "url": "https://www.youtube.com/shorts/rcwAORS4Xq0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:28:31.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5cc6c1fd"
  },
  {
    "id": "bloomberg-business-youtube-7ab4669c",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Colombia Presidential Hopeful Dies Two Months After Shooting",
    "url": "https://www.youtube.com/shorts/TjpGVm8PREc",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:26:50.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7ab4669c"
  },
  {
    "id": "zerohedge-19373ed9",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Massachusetts Teachers Demand New Wealth Tax",
    "url": "https://www.zerohedge.com/personal-finance/massachusetts-teachers-demand-new-wealth-tax",
    "summary": "Massachusetts Teachers Demand New Wealth Tax Authored by Jonathan Turley, I have long opposed wealth taxes based on both constitutional and practical grounds. When Elizabeth Warren pushed her own wealth tax, I noted that the high starting income or wealth levels would likely...",
    "fullContent": "Massachusetts Teachers Demand New Wealth Tax Authored by Jonathan Turley, I have long opposed wealth taxes based on both constitutional and practical grounds. When Elizabeth Warren pushed her own wealth tax, I noted that the high starting income or wealth levels would likely be lowered with time if Congress were ever allowed to cross this constitutional Rubicon. The Massachusetts Teachers Association (MTA) is now demanding an amendment to the state constitution to tax the “wealth of the richest 1%” to pay for free public college. Previously, the state passed a constitutional amendment to place a 4 % tax on income above $1 million. This would add a new wealth tax to that earlier “Fair Share Amendment.” In a press release, the teachers union president Max Page declared: “if we are serious about social and economic justice and nurturing a culturally rich and welcoming state of involved citizens, we will provide all residents with the best vehicle for a prosperous future – public education.” New York City socialist mayoral candidate Zohran Mamdani has made a similar proposal that, in addition to taxing corporations, he will “tax the wealthiest 1% of New Yorkers—those earning above $1 million annually—a flat 2% tax.” Not surprisingly, Warren recently declared Mamdani the future of the Democratic Party. Massachusetts is already in the top ten highest tax jurisdictions. These tax increases are why many of us have opposed the state and local (SALT) tax deduction. As high-tax states continue to increase their rates, they expect residents in low tax states to subsidize them. My forthcoming book, Rage and the Republic: The Unfinished Story of the American Revolution, discusses the wealth tax controversy and how these moves are likely to increase in the coming years. Tyler Durden Mon, 08/11/2025 - 15:25",
    "publishedAt": "2025-08-11T19:25:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.063Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19373ed9"
  },
  {
    "id": "wired-56d102bb",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "OpenAI Scrambles to Update GPT-5 After Users Revolt",
    "url": "https://www.wired.com/story/openai-gpt-5-backlash-sam-altman/",
    "summary": "GPT-5 was touted as a major upgrade to ChatGPT. Not all users think that’s the case, posting threads like “Kill 4o isn’t innovation, it’s erasure” on Reddit.",
    "fullContent": "GPT-5 was touted as a major upgrade to ChatGPT. Not all users think that’s the case, posting threads like “Kill 4o isn’t innovation, it’s erasure” on Reddit.",
    "publishedAt": "2025-08-11T19:13:08.000Z",
    "fetchedAt": "2025-08-12T02:23:23.226Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "56d102bb"
  },
  {
    "id": "bloomberg-markets-709e73a3",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Why Trump Is Still Under Fire for His Handling of the Epstein Case",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/trump-under-fire-for-his-handling-of-epstein-case-video",
    "summary": "A federal judge denied a request by the Trump administration to release sealed grand jury materials in the criminal case against Ghislaine Maxwell. Both Democrats and Republicans continue to criticize Trump after the DOJ’s decision not to release additional information...",
    "fullContent": "A federal judge denied a request by the Trump administration to release sealed grand jury materials in the criminal case against Ghislaine Maxwell. Both Democrats and Republicans continue to criticize Trump after the DOJ’s decision not to release additional information connected to Jeffrey Epstein’s case. Erik Larson explains how we got here. (Source: Bloomberg)",
    "publishedAt": "2025-08-11T19:10:36.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "709e73a3"
  },
  {
    "id": "wsj-youtube-43e01824",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Trump to Deploy National Guard in D.C. 'to Take Our Capital Back' | WSJ News",
    "url": "https://www.youtube.com/watch?v=S8J8xArCegs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:10:06.000Z",
    "fetchedAt": "2025-08-12T02:23:52.419Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "43e01824"
  },
  {
    "id": "business-insider-49c7eaba",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "My partner and I each moved home to save money. We miss living together, but can finally afford our dream trips.",
    "url": "https://www.businessinsider.com/partner-and-i-moved-home-save-money-pros-outweigh-cons-2025-8",
    "summary": "My boyfriend and I left San Francisco and each moved in with family. We're dating long-distance, but the arrangement lets us travel and save money.",
    "fullContent": "My boyfriend and I left San Francisco and each moved in with family. We're dating long-distance, but the arrangement lets us travel and save money.",
    "publishedAt": "2025-08-11T19:08:10.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49c7eaba"
  },
  {
    "id": "wsj-youtube-65220bc1",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Prominent Al Jazeera Reporter Among Five Journalists Killed by Israel | WSJ News",
    "url": "https://www.youtube.com/watch?v=AqAQSeBmbuo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:07:59.000Z",
    "fetchedAt": "2025-08-12T02:23:52.418Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "65220bc1"
  },
  {
    "id": "economist-business-589a6b9b",
    "sourceId": "economist-business",
    "sourceName": "Economist Business",
    "title": "How AI could create the first one-person unicorn",
    "url": "https://www.economist.com/business/2025/08/11/how-ai-could-create-the-first-one-person-unicorn",
    "summary": "The technology is allowing entrepreneurs to start and grow businesses on their own.",
    "fullContent": "The technology is allowing entrepreneurs to start and grow businesses on their own",
    "publishedAt": "2025-08-11T19:05:01.000Z",
    "fetchedAt": "2025-08-12T02:23:22.001Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "589a6b9b"
  },
  {
    "id": "zerohedge-5aa97b21",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Israeli Strike Kills 5 Al Jazeera Journalists In Gaza, IDF Says They Were Part Of Hamas Cell",
    "url": "https://www.zerohedge.com/geopolitical/israel-strike-kills-5-al-jazeera-journalists-gaza-idf-says-they-were-part-hamas-cell",
    "summary": "Israeli Strike Kills 5 Al Jazeera Journalists In Gaza, IDF Says They Were Part Of Hamas Cell Israel's military (IDF) has stepped up its bombing of Gaza City, and already there are mounting civilian casualties and an international outcry, especially after a well-known regional...",
    "fullContent": "Israeli Strike Kills 5 Al Jazeera Journalists In Gaza, IDF Says They Were Part Of Hamas Cell Israel's military (IDF) has stepped up its bombing of Gaza City, and already there are mounting civilian casualties and an international outcry, especially after a well-known regional reporter and his crew were killed in a weekend strike Five journalists and staff members working for Al Jazeera were among seven total people killed in a late Sunday night strike. They were sheltered in a press-marked tent near Al-Shifa hospital, various sources indicate. The Hamas-run Government Media Office in Gaza has condemned the attack on the press group as \"deliberate and premeditated\". It's identified prominent Al Jazeera correspondent Anas al-Sharif as among the dead. The 28-year-old Al Jazeera Arabic journalist was known to have reported extensively from northern Gaza, and recently Israel identified him as among six 'compromised' journalists from Al Jazeera who have alleged ties with Hamas. The network has said Israel is falsely seeking to justify its war crimes against journalists. Anas al-Sharif. Source: Al Jazeera Also among the dead weere Mohammed Qraiqeh and three photographers: Ibrahim Zaher, Moamen Aliwa and Mohammed Noufal. However, Israel is claiming these were military targets and not journalists. The NY Times writes, \"The Israeli military confirmed that it had conducted a strike targeting one of the men killed, whom it accused of being a Hamas fighter posing as a reporter, an allegation that he and the network had rejected.\" The United Nations is not accepting Israel's defense of its actions, instead calling the attack a \"serious violation of international humanitarian law.\" The UN issued a statement on X saying, \"We condemn the Israeli military’s killing of six Palestinian journalists by targeting their tent — a grave breach of international humanitarian law,” and emphasized that “Israel must uphold its obligation to protect all civilians, including journalists.\" The UN further said at least 242 Palestinian journalists have died in Gaza since October 7, 2023, and is urging greater security and protection for journalists in the midst of the conflict. \"Israel must respect and protect all civilians, including journalists,\" it said. Funerals for the men are already underway on Monday. As for Anas Al-Sharif, the IDF alleges he was leading a Hamas cell. The Qatar-based Al Jazeera network is pushing back: Meron Rapoport, a veteran Israeli journalist and editor of the Local Call news site, has said the Israeli military’s accusation that Al Jazeera correspondent Anas al-Sharif was a Hamas member “doesn’t make sense at all”. “The Israeli explanations are, at best, very lacking,” Rapoport told Al Jazeera from Tel Aviv. He said that if the claims were true, Israel would have been expected to have targeted or arrested al-Sharif a long time ago. He said Israel likely targeted al-Sharif now because of two main factors – first, his important role in “telling the world that there is famine in Gaza”, which “really hurt Israel internationally”; and, second, because of the planned upcoming invasion of Gaza City, which Israel wants to minimise coverage of. Al Jazeera offices in Israel and the West Bank have already long ago been raided and shut down by Israeli security forces. Israeli leaders have long conisdered the Mideast regional channel to be adversarial. Journalist Anas al-Sharif along with four other Al Jazeera staff have been killed by an Israeli attack which targeted a tent for the press outside al-Shifa Hospital’s main gate. pic.twitter.com/hfwWdDCCji — Al Jazeera English (@AJEnglish) August 11, 2025 It was only in July that Al Jazeera warned that Israel threatened to directly target its correspondent Al-Sharif: Al Jazeera Media Network has denounced the Israeli military for what it called a “campaign of incitement” against its reporters in the Gaza Strip, including most notably Al Jazeera Arabic correspondent Anas al-Sharif. In a statement on Friday, Al Jazeera said it “strongly condemns and denounces these relentless efforts, which have consistently incited against its staff since the beginning of its coverage of the ongoing Israeli war on Gaza”. In May of 2022, the IDF shot dead an even more well-known Al Jazeera journalist. Shireen Abu Akleh, a Palestinian Christian, was killed while covering the siege of Jenin refugee camp. She had been wearing a press vest at the time and was huddled with other journalists at the moment she was shot. Tyler Durden Mon, 08/11/2025 - 15:05",
    "publishedAt": "2025-08-11T19:05:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.063Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5aa97b21"
  },
  {
    "id": "the-verge-719ad767",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Revel shutters rideshare business, pivots to EV charging",
    "url": "https://www.theverge.com/news/757661/revel-shutters-rideshare-business-pivots-to-ev-charging",
    "summary": "Revel is shutting down its ridehail business, citing heightened competition from rideshare leaders like Uber and Lyft. The company, which began as an electric moped business before shifting to rideshare, plans to pivot to electric vehicle charging.",
    "fullContent": "Revel is shutting down its ridehail business, citing heightened competition from rideshare leaders like Uber and Lyft. The company, which began as an electric moped business before shifting to rideshare, plans to pivot to electric vehicle charging. “At the end of the day, rideshare is a very competitive market and asset-heavy,” Revel CEO Frank Reig [&#8230;]",
    "publishedAt": "2025-08-11T19:04:26.000Z",
    "fetchedAt": "2025-08-12T02:23:23.096Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "719ad767"
  },
  {
    "id": "bloomberg-business-youtube-2f34ff7e",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Krugman: Waller 'Solid,' Which Means He Won't Be Chosen",
    "url": "https://www.youtube.com/watch?v=ypvkm0Ni_NI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:02:49.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2f34ff7e"
  },
  {
    "id": "cnbc-tv18-youtube-5b19e850",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Bareilly News : न्याय के लिए IG पिता से भिड़ गई वकील बेटी, कोर्ट में साबित की बेगुनाही | UP News",
    "url": "https://www.youtube.com/watch?v=ncod4CRXEYk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:00:49.000Z",
    "fetchedAt": "2025-08-12T02:23:27.267Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5b19e850"
  },
  {
    "id": "oil-price-7ab55a22",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Big Oil&#039;s \"Managed Decline\" Strategy Masks An Expansion Push",
    "url": "https://oilprice.com/Energy/Crude-Oil/Big-Oils-Managed-Decline-Strategy-Masks-An-Expansion-Push.html",
    "summary": "For years, the talk in boardrooms and investor presentations has been about “discipline” and “capital efficiency.” These are the code words for a strategy that keeps production largely flat, trims high-risk exploration budgets, and returns more cash to shareholders in the form...",
    "fullContent": "For years, the talk in boardrooms and investor presentations has been about “discipline” and “capital efficiency.” These are the code words for a strategy that keeps production largely flat, trims high-risk exploration budgets, and returns more cash to shareholders in the form of dividends and buybacks. The era of endlessly chasing production growth at any cost is over, replaced by an approach that seeks to manage fossil fuel portfolios like mature, declining assets. The optics are powerful. European majors like BP and Shell…",
    "publishedAt": "2025-08-11T19:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.382Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "7ab55a22"
  },
  {
    "id": "business-insider-3f9ec259",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Quant pioneer Renaissance Technologies' painful summer continued in July",
    "url": "https://www.businessinsider.com/renaissance-technologies-july-performance-quant-rout-2025-8",
    "summary": "It's been a painful summer for quant funds, though the end of July may have been the start of a turnaround for the subsector.",
    "fullContent": "It's been a painful summer for quant funds, though the end of July may have been the start of a turnaround for the subsector.",
    "publishedAt": "2025-08-11T18:59:12.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3f9ec259"
  },
  {
    "id": "wsj-markets-main-5ed7627",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "U.S. Natural-Gas Futures Fall on Forecast Loss of Late August Heat",
    "url": "https://www.wsj.com/finance/commodities-futures/european-gas-holds-below-33-euros-a-megawatt-hour-as-markets-eye-trump-putin-talks-311138ed?mod=rss_markets_main",
    "summary": "Natural-gas futures settled lower after hovering below the key $3 level for most of the session as forecasts point to cooler weather for late August.",
    "fullContent": "Natural-gas futures settled lower after hovering below the key $3 level for most of the session as forecasts point to cooler weather for late August.",
    "publishedAt": "2025-08-11T18:58:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5ed7627"
  },
  {
    "id": "cnbc-markets-2b81dad3",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Microsoft's GitHub chief is leaving as competition ramps up in AI coding market",
    "url": "https://www.cnbc.com/2025/08/11/microsofts-github-chief-is-leaving-competition-ramps-up-in-ai-coding.html",
    "summary": "Microsoft, which is seeking to fend off competition from AI coding startups like Cursor, is losing GitHub chief Thomas Dohmke.",
    "fullContent": "Microsoft, which is seeking to fend off competition from AI coding startups like Cursor, is losing GitHub chief Thomas Dohmke.",
    "publishedAt": "2025-08-11T18:55:27.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2b81dad3"
  },
  {
    "id": "et-markets-18a808b1",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "LIC's goal is 'Insurance for All' by 2047, policy numbers should grow from Q2: R Doraiswamy, MD & CEO",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/lics-goal-is-insurance-for-all-by-2047-policy-numbers-should-grow-from-q2-r-doraiswamy-md-ceo/articleshow/123246892.cms",
    "summary": "LIC's new chief aims to boost profitability through diversified products, particularly non-PAR plans, targeting 40% of APE. R Doraiswamy plans to increase bancassurance sales beyond 10% and strategically invest in debt and equity markets.",
    "fullContent": "LIC's new chief aims to boost profitability through diversified products, particularly non-PAR plans, targeting 40% of APE. R Doraiswamy plans to increase bancassurance sales beyond 10% and strategically invest in debt and equity markets. LIC is exploring health insurance ventures and addressing regulatory challenges regarding its stake in IDBI Bank.",
    "publishedAt": "2025-08-11T18:54:25.000Z",
    "fetchedAt": "2025-08-12T02:23:21.276Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18a808b1"
  },
  {
    "id": "bloomberg-politics-341a1ab4",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Tax Law Squeezes Poor, Boosts Income for Wealthy, CBO Says",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/trump-tax-cuts-finances-for-poor-boosts-income-for-wealthy",
    "summary": "President Donald Trump’s tax and spending law will deal a financial blow to the poorest Americans while boosting the income of wealthier households, according to a new analysis from the Congressional Budget Office.",
    "fullContent": "President Donald Trump’s tax and spending law will deal a financial blow to the poorest Americans while boosting the income of wealthier households, according to a new analysis from the Congressional Budget Office.",
    "publishedAt": "2025-08-11T18:52:07.000Z",
    "fetchedAt": "2025-08-12T02:23:21.297Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "341a1ab4"
  },
  {
    "id": "nse-online-announcements-5873e37d",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Vasa Denticity Limited",
    "url": "https://nsearchives.nseindia.com/corporate/VASADENTICITY_11082025185120_intimation_of_receipt_of_request_for_reclassification_under_reg_30.pdf",
    "summary": "Vasa Denticity Limited has informed regarding Disclosure of material issue |SUBJECT: Disclosure of material issue.",
    "fullContent": "Vasa Denticity Limited has informed regarding Disclosure of material issue |SUBJECT: Disclosure of material issue",
    "publishedAt": "2025-08-11T18:51:28.000Z",
    "fetchedAt": "2025-08-11T13:21:51.174Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "5873e37d"
  },
  {
    "id": "nse-online-announcements-3063a657",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "NBCC (India) Limited",
    "url": "https://nsearchives.nseindia.com/corporate/NBCC_11082025185051_AudiorecordinglinkIntimation_Q1_FY_2025-26.pdf",
    "summary": "NBCC (India) Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "NBCC (India) Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:51:06.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "3063a657"
  },
  {
    "id": "nse-online-announcements-473e87ca",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Dhunseri Ventures Limited",
    "url": "https://nsearchives.nseindia.com/corporate/DVL_11082025185009_updates110825.pdf",
    "summary": "Dhunseri Ventures Limited has informed the Exchange regarding updates in relation to 109th AGM |SUBJECT: Updates.",
    "fullContent": "Dhunseri Ventures Limited has informed the Exchange regarding updates in relation to 109th AGM |SUBJECT: Updates",
    "publishedAt": "2025-08-11T18:51:03.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "473e87ca"
  },
  {
    "id": "nse-online-announcements-622fe1a4",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Tilaknagar Industries Limited",
    "url": "https://nsearchives.nseindia.com/corporate/gthakur_11082025184440_Outcome_BM_Aug_2025_Final.pdf",
    "summary": "Tilaknagar Industries Limited has submitted to the Exchange, the financial results for the period ended Jun 30, 2025. |SUBJECT: Outcome of Board Meeting.",
    "fullContent": "Tilaknagar Industries Limited has submitted to the Exchange, the financial results for the period ended Jun 30, 2025. |SUBJECT: Outcome of Board Meeting",
    "publishedAt": "2025-08-11T18:50:56.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "622fe1a4"
  },
  {
    "id": "nse-online-announcements-28ce4244",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Priti International Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/PRIOR_INTIMATION_63806_1508730_11082025065047_WEB.xml",
    "summary": "PRITI INTERNATIONAL LIMITED has informed the Exchange about Board Meeting to be held on 14-Aug-2025 to inter-alia consider and approve the Unaudited Financial results of the Company for the Quarterly ended June 2025 . |SUBJECT: Board Meeting Intimation.",
    "fullContent": "PRITI INTERNATIONAL LIMITED has informed the Exchange about Board Meeting to be held on 14-Aug-2025 to inter-alia consider and approve the Unaudited Financial results of the Company for the Quarterly ended June 2025 . |SUBJECT: Board Meeting Intimation",
    "publishedAt": "2025-08-11T18:50:47.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "28ce4244"
  },
  {
    "id": "nse-online-announcements-4baf3cbc",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Advanced Enzyme Technologies Limited",
    "url": "https://nsearchives.nseindia.com/corporate/AETL_11082025184953_Intimation.pdf",
    "summary": "Advanced Enzyme Technologies Limited has informed the Exchange about Transcript |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Advanced Enzyme Technologies Limited has informed the Exchange about Transcript |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:50:18.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "4baf3cbc"
  },
  {
    "id": "nse-online-announcements-3fac4ba9",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "LLOYDS ENGINEERING WORKS LIMITED",
    "url": "https://nsearchives.nseindia.com/corporate/LSIL_11082025184935_IntimationforInvestorsMeeting11082025signed.pdf",
    "summary": "LLOYDS ENGINEERING WORKS LIMITED has informed the Exchange about Schedule of Investors / Analyst meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "LLOYDS ENGINEERING WORKS LIMITED has informed the Exchange about Schedule of Investors / Analyst meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:50:00.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "3fac4ba9"
  },
  {
    "id": "bloomberg-politics-73791ffb",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Colombian Senator’s Murder Threatens Petro’s Radical Peace Plan",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/colombian-senator-s-murder-threatens-petro-s-radical-peace-plan",
    "summary": "Two days before a teenage assassin shot him in the head, presidential candidate Miguel Uribe Turbay warned that Colombia’s radical peace plan was empowering violent criminals and plunging the country into chaos.",
    "fullContent": "Two days before a teenage assassin shot him in the head, presidential candidate Miguel Uribe Turbay warned that Colombia’s radical peace plan was empowering violent criminals and plunging the country into chaos.",
    "publishedAt": "2025-08-11T18:49:49.000Z",
    "fetchedAt": "2025-08-12T02:23:21.297Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "73791ffb"
  },
  {
    "id": "nse-online-announcements-1d6dc06c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Baazar Style Retail Limited",
    "url": "https://nsearchives.nseindia.com/corporate/BSRL2024_11082025184926_signedsuit.pdf",
    "summary": "Baazar Style Retail Limited has informed the Exchange regarding 'Dismissal of the civil suit as per disclosure attached'. |SUBJECT: Updates.",
    "fullContent": "Baazar Style Retail Limited has informed the Exchange regarding 'Dismissal of the civil suit as per disclosure attached'. |SUBJECT: Updates",
    "publishedAt": "2025-08-11T18:49:44.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "1d6dc06c"
  },
  {
    "id": "nse-online-announcements-618228c5",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Concord Enviro Systems Limited",
    "url": "https://nsearchives.nseindia.com/corporate/CONCORDENVIRO_11082025184854_Intimation_InvestorMeet_14082025.pdf",
    "summary": "Concord Enviro Systems Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Concord Enviro Systems Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:49:34.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "618228c5"
  },
  {
    "id": "nse-online-announcements-3061bc63",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Manali Petrochemicals Limited",
    "url": "https://nsearchives.nseindia.com/corporate/MPLSECTL_11082025184841_SE_Recdate_Bookcl_BM_110825sd.pdf",
    "summary": "Manali Petrochemicals Limited has informed the Exchange that Record date for the purpose of Dividend is 08-Sep-2025. |SUBJECT: Record Date.",
    "fullContent": "Manali Petrochemicals Limited has informed the Exchange that Record date for the purpose of Dividend is 08-Sep-2025. |SUBJECT: Record Date",
    "publishedAt": "2025-08-11T18:49:22.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "3061bc63"
  },
  {
    "id": "business-insider-52543e75",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "The 50 best-selling music artists of all time",
    "url": "https://www.businessinsider.com/best-selling-music-artists-of-all-time-2016-9",
    "summary": "Beyoncé, Mariah Carey, Taylor Swift, Garth Brooks, Michael Jackson, and Elvis Presley are among the top artists of all time.",
    "fullContent": "Beyoncé, Mariah Carey, Taylor Swift, Garth Brooks, Michael Jackson, and Elvis Presley are among the top artists of all time.",
    "publishedAt": "2025-08-11T18:48:09.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "52543e75"
  },
  {
    "id": "nse-online-announcements-49d4e8b0",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Sunflag Iron And Steel Company Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SUNFLAG_11082025184500_SE_outcome_11_Aug_2025__Book_Closure.pdf",
    "summary": "Sunflag Iron And Steel Company Limited has informed the Exchange that Record date for the purpose of Dividend is 12-Sep-2025. |SUBJECT: Record Date.",
    "fullContent": "Sunflag Iron And Steel Company Limited has informed the Exchange that Record date for the purpose of Dividend is 12-Sep-2025. |SUBJECT: Record Date",
    "publishedAt": "2025-08-11T18:48:01.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "49d4e8b0"
  },
  {
    "id": "nse-online-announcements-7ff0618f",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "KKV Agro Powers Limited",
    "url": "https://nsearchives.nseindia.com/corporate/KKVAPOW_11082025184626_KKVAPOW_AGM_Intimation_2025.pdf",
    "summary": "KKV Agro Powers Limited has informed the Exchange regarding Notice of Annual General Meeting to be held on September 02, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "KKV Agro Powers Limited has informed the Exchange regarding Notice of Annual General Meeting to be held on September 02, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-11T18:47:37.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "7ff0618f"
  },
  {
    "id": "nse-online-announcements-517a3571",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Fortis Healthcare Limited",
    "url": "https://nsearchives.nseindia.com/corporate/FORTIS_11082025184632_Outcomeofagm.pdf",
    "summary": "Fortis Healthcare Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 11, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "Fortis Healthcare Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 11, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-11T18:47:12.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "517a3571"
  },
  {
    "id": "the-verge-58d396ca",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "You can save $30 on the OnePlus Watch 3, a great Galaxy Watch 8 alternative",
    "url": "https://www.theverge.com/tech/757554/oneplus-watch-3-2-back-to-school-deal-sale",
    "summary": "OnePlus has kicked off its back-to-school sale, and the deals are pretty solid. There are discounts on the company’s impressive tablets, but the highlights are the new low prices on its smartwatches. Right now, you can buy the 43mm OnePlus Watch 3 for $269.",
    "fullContent": "OnePlus has kicked off its back-to-school sale, and the deals are pretty solid. There are discounts on the company’s impressive tablets, but the highlights are the new low prices on its smartwatches. Right now, you can buy the 43mm OnePlus Watch 3 for $269.99 ($30 off), while the 46mm is $319.99 ($30 off). Even the [&#8230;]",
    "publishedAt": "2025-08-11T18:47:08.000Z",
    "fetchedAt": "2025-08-12T02:23:23.096Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "58d396ca"
  },
  {
    "id": "nse-online-announcements-68cd4e8c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "AION-TECH SOLUTIONS LIMITED",
    "url": "https://nsearchives.nseindia.com/corporate/GOLDTECH_11082025184630_ATS_OUTCOME_OCMR-sign.pdf",
    "summary": "Un-Audited Standalone and Consolidated Financial Statements of the Company for the First Quarter ended June 30, 2025 along with the limited review report |SUBJECT: Integrated Filing- Financial.",
    "fullContent": "Un-Audited Standalone and Consolidated Financial Statements of the Company for the First Quarter ended June 30, 2025 along with the limited review report |SUBJECT: Integrated Filing- Financial",
    "publishedAt": "2025-08-11T18:46:40.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "68cd4e8c"
  },
  {
    "id": "nse-online-announcements-6a9fe251",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Capacit'e Infraprojects Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/CIM_63805_1508717_11082025064614_WEB.xml",
    "summary": "CAPACITE INFRAPROJECTS LIMITED has informed the Exchange about Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent |SUBJECT: Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent.",
    "fullContent": "CAPACITE INFRAPROJECTS LIMITED has informed the Exchange about Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent |SUBJECT: Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent",
    "publishedAt": "2025-08-11T18:46:14.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "6a9fe251"
  },
  {
    "id": "et-markets-69acf687",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "SBI halts Nayara transactions over US tariffs, sanctions risk",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-halts-nayara-transactions-over-us-tariffs-sanctions-risk/articleshow/123246877.cms",
    "summary": "State Bank of India has ceased processing trade and foreign currency transactions for Nayara Energy due to potential US sanctions following recent tariff increases. This decision aims to prevent SBI from facing US and European Union restrictions.",
    "fullContent": "State Bank of India has ceased processing trade and foreign currency transactions for Nayara Energy due to potential US sanctions following recent tariff increases. This decision aims to prevent SBI from facing US and European Union restrictions. The move follows EU sanctions restricting Russian fuel imports and a price cap on Russian crude, impacting banks with international operations.",
    "publishedAt": "2025-08-11T18:46:13.000Z",
    "fetchedAt": "2025-08-12T02:23:21.276Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "69acf687"
  },
  {
    "id": "nse-online-announcements-543375e5",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Prestige Estates Projects Limited",
    "url": "https://nsearchives.nseindia.com/corporate/PRESTIGE_11082025184524_Intimation.pdf",
    "summary": "Prestige Estates Projects Limited has informed the Exchange about Transcript of Investor/ Analyst Call conducted on August 06, 2025 |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Prestige Estates Projects Limited has informed the Exchange about Transcript of Investor/ Analyst Call conducted on August 06, 2025 |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:45:42.000Z",
    "fetchedAt": "2025-08-11T13:21:51.175Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "543375e5"
  },
  {
    "id": "nse-online-announcements-39f4ed21",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Orient Technologies Limited",
    "url": "https://nsearchives.nseindia.com/corporate/Orient97_11082025184513_Cover_Intimation_Signed.pdf",
    "summary": "Orient Technologies Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Orient Technologies Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:45:26.000Z",
    "fetchedAt": "2025-08-11T13:21:51.176Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "39f4ed21"
  },
  {
    "id": "nse-online-announcements-2a637535",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Axita Cotton Limited",
    "url": "https://nsearchives.nseindia.com/corporate/AXITA_11082025184207_BMOutcomeFR11082025.pdf",
    "summary": "Axita Cotton Limited has informed the Exchange regarding Board meeting held on August 11, 2025. |SUBJECT: Outcome of Board Meeting.",
    "fullContent": "Axita Cotton Limited has informed the Exchange regarding Board meeting held on August 11, 2025. |SUBJECT: Outcome of Board Meeting",
    "publishedAt": "2025-08-11T18:45:15.000Z",
    "fetchedAt": "2025-08-11T13:21:51.176Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "2a637535"
  },
  {
    "id": "nse-online-announcements-6fa20141",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Edelweiss Financial Services Limited",
    "url": "https://nsearchives.nseindia.com/corporate/EDELWEISS_11082025184456_Transcript.pdf",
    "summary": "Edelweiss Financial Services Limited has informed the Exchange about Transcript |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Edelweiss Financial Services Limited has informed the Exchange about Transcript |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:45:10.000Z",
    "fetchedAt": "2025-08-11T13:21:51.176Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "6fa20141"
  },
  {
    "id": "techmeme-31db0dd5",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: GM plans a renewed push on driverless cars, focused on personal use rather than a robotaxi service, and is trying to bring back some ex-Cruise workers (David Welch/Bloomberg)",
    "url": "http://www.techmeme.com/250811/p21#a250811p21",
    "summary": "David Welch / Bloomberg: Sources: GM plans a renewed push on driverless cars, focused on personal use rather than a robotaxi service, and is trying to bring back some ex-Cruise workers — General Motors Co.",
    "fullContent": "David Welch / Bloomberg: Sources: GM plans a renewed push on driverless cars, focused on personal use rather than a robotaxi service, and is trying to bring back some ex-Cruise workers — General Motors Co. is seeking to lure back some former employees of its defunct Cruise autonomous-vehicle business as part &hellip;",
    "publishedAt": "2025-08-11T18:45:02.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "31db0dd5"
  },
  {
    "id": "zerohedge-73ac296f",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Fatal 'Laughing Gas' Poisonings Skyrocket As Recreational Use Spreads",
    "url": "https://www.zerohedge.com/medical/fatal-laughing-gas-poisonings-skyrocket-recreational-use-spreads",
    "summary": "Fatal 'Laughing Gas' Poisonings Skyrocket As Recreational Use Spreads Authored by George Citroner via The Epoch Times (emphasis ours), The last decade has seen a 578 percent rise in deaths due to nitrous oxide poisoning, a new research letter shows, revealing a sharp rise in...",
    "fullContent": "Fatal 'Laughing Gas' Poisonings Skyrocket As Recreational Use Spreads Authored by George Citroner via The Epoch Times (emphasis ours), The last decade has seen a 578 percent rise in deaths due to nitrous oxide poisoning, a new research letter shows, revealing a sharp rise in U.S. fatalities linked to the gas—often called “laughing gas”—over the past 13 years. Ink Drop/Shutterstock The colorless, odorless gas is used recreationally as a euphoric and hallucinogenic drug. The same drug used as anesthesia in dentists’ offices is now easily purchased by teenagers at corner stores and inhaled for a quick high—and it’s proving increasingly deadly. “On the streets, the slang term for nitrous oxide is ‘whippits,’” Brian Townsend, a retired supervisory special agent with the U.S. Drug Enforcement Administration and not involved in the study, told The Epoch Times. “The gas comes from canisters, typically released into balloons before the user inhales it. This gives them a brief euphoric feeling or ‘high.’” Fatalities have climbed from 23 in 2010 to 156 in 2023, with researchers linking the increase to the spread of whippits among American youth. A Steep Increase In the letter, recently published in JAMA, researchers examined death records from 2010 to 2023 using data from the Centers for Disease Control and Prevention’s Wide-Ranging Online Data for Epidemiologic Research database. The study focused on fatalities among Americans ages 15 to 74, where nitrous oxide poisoning was identified as the cause of death. They found a mortality rate of 0.01 per 100,000 population in 2010, which climbed to 0.0622 per 100,000 by 2023. While deaths showed a consistent upward trend, researchers noted a particularly sharp increase after 2016, when fatalities jumped from 120 to 149. “At that continued rate, we could be looking at a much larger problem,” Andrew Yockey, University of Mississippi assistant professor of public health and author of the research letter, stated in a press release. “We have evidence that nitrous oxide poisoning is a very real danger, but this is very often ignored or trivialized,” said letter co-author Rachel Hoopsick, assistant professor of health and kinesiology at the University of Illinois. “Sellers of nitrous oxide rarely, if ever, provide health warnings. I think the public sees it as a party drug.” The findings also highlight a growing public health concern related to the misuse of nitrous oxide, with researchers emphasizing the importance of increased awareness and prevention strategies to reduce these preventable deaths—especially as recreational use appears to be rising. Researchers also noted that young people were the most common users of nitrous oxide, with eighth graders making up a large portion of those misusing inhalants. Earlier this year, the U.S. Food and Drug Administration issued an advisory warning consumers not to inhale nitrous oxide products, which are not federally controlled, due to the potential for severe adverse health events if used recreationally. Flying Under the Radar Nitrous oxide is readily sold in canisters from smoke shops. Researchers and addiction specialists point to concerning marketing practices that may target young people. Nitrous oxide products come in flavored varieties with names like bubblegum and mango. “There is no age limit, and this is available online and in gas stations across the country,” Yockey stated in another press release. Townsend said homeless people with substance use disorders often use nitrous oxide because it’s inexpensive and easy to get. Nitrous oxide is one of those substances that “flies under the radar” because it seems harmless, said Dr. Raj Dasgupta, quadruple-board certified in pulmonary, sleep, internal, and critical care medicine and chief medical advisor for Sleepopolis. “This study highlights a problem that’s quietly gotten worse over the years,” Dasgupta said. Serious Health Risks Recreational use can deprive the brain of oxygen, leading to short-term effects like dizziness or unconsciousness and long-term issues like nerve damage or even paralysis. “There’s also a serious risk of addiction and mental health decline when use becomes habitual,” said Sarah Grado, chief programs officer at notMYkid, a nonprofit dedicated to helping youth overcome addiction challenges. It is unclear how nitrous oxide causes side effects, but inhaling large amounts of it can cause asphyxiation, and heavy use can cause vitamin B12 deficiency over time, which can cause nervous system issues like lasting nerve damage or difficulty walking. Inhaling large amounts of the gas in a short period can cause nitrous oxide poisoning, Grado said. Symptoms of nitrous oxide overdose include seizures, psychosis, rapid heartbeat, and tightness in the chest. Prolonged inhalation of nitrous oxide recreationally can also lead to weakness in the limbs, problems with bowel and bladder control, and psychiatric problems such as dissociation, delusions, hallucinations, paranoia, and depression. Recreational nitrous oxide is unregulated and used without medical supervision, said Jessica Tate, chief clinical officer at Milton Recovery Center. In medical settings, the drug is mixed with oxygen, but recreational users often inhale it in its pure form, making it far more potent and dangerous. Social Media Influence According to the 2023 National Survey on Drug Use and Health, more than 13 million Americans have misused nitrous oxide in their lifetimes. Social media exposure showing people using nitrous oxide is also driving increased use, according to Michele Bowers, clinical director and therapist at Sophros Recovery. “Think back to big tobacco; they deliberately targeted young people with cartoons, fun flavors, and flashy colors,” Hoopsick said. “That is a parallel we’re seeing now with nitrous oxide.” Bowers noted that many health care providers lack sufficient training to recognize nitrous oxide abuse and often do not screen for it. Tyler Durden Mon, 08/11/2025 - 14:45",
    "publishedAt": "2025-08-11T18:45:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.064Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "73ac296f"
  },
  {
    "id": "nse-online-announcements-3bcd8be5",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "AION-TECH SOLUTIONS LIMITED",
    "url": "https://nsearchives.nseindia.com/corporate/GOLDTECH_11082025184239_ATS_OUTCOME_OCMR-sign.pdf",
    "summary": "AION-TECH SOLUTIONS LIMITED has informed the Exchange regarding Appointment of as Non- Executive Independent Director of the company w.e.f. August 11, 2025. |SUBJECT: Appointment.",
    "fullContent": "AION-TECH SOLUTIONS LIMITED has informed the Exchange regarding Appointment of as Non- Executive Independent Director of the company w.e.f. August 11, 2025. |SUBJECT: Appointment",
    "publishedAt": "2025-08-11T18:44:53.000Z",
    "fetchedAt": "2025-08-11T13:21:51.176Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "3bcd8be5"
  },
  {
    "id": "nse-online-announcements-106562e2",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Bata India Limited",
    "url": "https://nsearchives.nseindia.com/corporate/BATAINDIA_11082025183921_BATA-PR-AUGUST25.pdf",
    "summary": "Pursuant to Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, Bata India Limited has informed about Results Press Release |SUBJECT: Press Release.",
    "fullContent": "Pursuant to Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, Bata India Limited has informed about Results Press Release |SUBJECT: Press Release",
    "publishedAt": "2025-08-11T18:43:42.000Z",
    "fetchedAt": "2025-08-11T13:21:51.176Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "106562e2"
  },
  {
    "id": "nse-online-announcements-13d8efd2",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "JK Tyre & Industries Limited",
    "url": "https://nsearchives.nseindia.com/corporate/JKTYRE_11082025183932_Audiorecording.pdf",
    "summary": "JK Tyre & Industries Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "JK Tyre & Industries Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:43:28.000Z",
    "fetchedAt": "2025-08-11T13:21:51.176Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "13d8efd2"
  },
  {
    "id": "nse-online-announcements-1290f322",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "GPT Healthcare Limited",
    "url": "https://nsearchives.nseindia.com/corporate/GPTHEALTHCARE_11082025184219_GHLInvestorMeetingPhyscial20082025.pdf",
    "summary": "GPT Healthcare Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "GPT Healthcare Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-11T18:42:53.000Z",
    "fetchedAt": "2025-08-11T13:21:51.176Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "1290f322"
  }
]