[
  {
    "id": "bloomberg-markets-23bc1d99",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/philippine-inflation-slows-to-0-9-in-july-nearly-six-year-low",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T01:04:49.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "23bc1d99"
  },
  {
    "id": "bloomberg-markets-4393d50e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/philippine-inflation-slows-to-0-9-in-july-nearly-six-year-low",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T01:04:49.000Z",
    "fetchedAt": "2025-08-05T04:57:57.241Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4393d50e"
  },
  {
    "id": "et-markets-79b96aa5",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-revision-of-rpt-rules-to-ease-compliance-for-listed-firms/articleshow/123106787.cms",
    "summary": "![CDATA[SEBI proposed revisions to related party transaction (RPT) rules, easing compliance for listed firms. The regulator suggested turnover-based thresholds to determine 'material' RPTs requiring shareholder approval, replacing the current ₹1,000 crore or 10% of turnover...",
    "fullContent": "",
    "publishedAt": "2025-08-05T01:00:38.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "79b96aa5"
  },
  {
    "id": "thehindubusinessline-7a6437fe",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Today’s Stock Recommendation: August 5, 2025",
    "url": "https://www.thehindubusinessline.com/multimedia/video/todays-stock-recommendation-august-5-2025/article69893472.ece",
    "summary": "The stock idea that we have for you today is Sheela Foam.",
    "fullContent": "The stock idea that we have for you today is Sheela Foam",
    "publishedAt": "2025-08-05T01:00:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.245Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a6437fe"
  },
  {
    "id": "thehindubusinessline-5b286463",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Stock to buy today: Sheela Foam (₹707) – BUY",
    "url": "https://www.thehindubusinessline.com/portfolio/technical-analysis/stock-to-buy-today-sheela-foam-707-buy/article69893421.ece",
    "summary": "",
    "fullContent": "Sheela Foam share price can rise to ₹770",
    "publishedAt": "2025-08-05T01:00:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.245Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5b286463"
  },
  {
    "id": "bbc-business-4214fc64",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "",
    "url": "https://www.bbc.com/news/articles/ce3791ep6gko?at_medium=RSS&amp;at_campaign=rss",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:59:32.000Z",
    "fetchedAt": "2025-08-05T02:40:14.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4214fc64"
  },
  {
    "id": "bbc-business-745ad0ec",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "£100m of premium bond prizes remain unclaimed",
    "url": "https://www.bbc.com/news/articles/ce3791ep6gko?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Critics want the system used to trace accounts to be reformed so people do not miss out on prizes.",
    "fullContent": "Critics want the system used to trace accounts to be reformed so people do not miss out on prizes.",
    "publishedAt": "2025-08-05T00:59:32.000Z",
    "fetchedAt": "2025-08-05T11:27:56.048Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "745ad0ec"
  },
  {
    "id": "zerohedge-7866bff6",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Against The \"Impossible\"",
    "url": "https://www.zerohedge.com/political/against-impossible",
    "summary": "Against The \"Impossible\" div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-summary field--label-hidden field__i.",
    "fullContent": "Against The \"Impossible\" Authored by Josiah Lippincott via American Greatness, Earlier this year, I was talking with a prominent libertarian economist on matters of fiscal and monetary policy. I noted that, in my view, the core problem in this unholy nexus was the Federal Reserve’s ongoing dominance over the nation’s money supply and financial industry. It was critical, I said, that we dissolve the central bank. The inevitable consequence of credit expansion (money printing) is inflation and malinvestment. The very existence of the Federal Reserve robs savers of their purchasing power and occludes true market data, leading to investors pouring their limited resources into schemes that should not exist in a free market. In doing so, these investors did not place their funds into products that buyers actually want. This inevitably leads to cycles of boom and bust that are ruinous for the common good. I expected him to agree. After all, this was a libertarian economist; I assumed that ranting against the Fed, fiat money, and government interference would be his thing. Instead, he simply shrugged. Getting rid of the Fed is impossible, he told me. We therefore had no choice but to make our peace with this system and try to make it work as well as we could. “Impossible.” That word stood out to me. Precision in language matters. When we use a word, we should know what it means. We should not say things cavalierly. Without clear language, there can be no clear thought. If something is in fact impossible, then, of course, we should not spend time debating about it. It is impossible, for instance, to have the sum of the three angles of a triangle add up to any number other than 180 degrees. It is likewise impossible to drop a heavy weight from a height and expect it to float or for a human being to give birth to an oak tree. These things are truly impossible. By the rules of logic in the world we inhabit, certain things cannot be otherwise. They simply are. These brute facts are not a subject of deliberation. Nothing is to be done about them. We should be deeply wary, however, in assigning this status of immovable fact to things that, as it turns out, can be other than what they are. Just because a thing is difficult to accomplish or unlikely does not make it impossible. Political regimes can change. There are, for instance, many different kinds of governments on the earth, and they differ in crucial ways. Laws are made and unmade. People move. Governments come into being and are overthrown. There was, for instance, a time in this nation’s history when the Federal Reserve did not exist. There may come a time when it will once again cease to be. Congress brought the Federal Reserve into being by law. It could be undone by the same process. Human institutions do not possess the certitude and unchanging quality of the basic axioms at the heart of logical thinking. 2 + 2 has always and everywhere equaled 4, but the Soviet Union ceased to exist in 1991. That government has not always existed everywhere and always. Man has a nature. He always and everywhere has the same features. All men seek good things and avoid bad things. Men may disagree wildly about what those things are, but all of us are engaged in this fundamental pursuit. If a suicidal man thought he would be better off alive than dead, he would not kill himself. Moreover, we see that human beings always give birth to human beings. We all need to sleep, eat, and defecate. Man is always and everywhere a being unto death. These are unchanging realities for us. It is incorrect, however, to attribute an unchanging nature to things that are in fact changeable. I notice that on the American right, there is often a profound sense of pessimism and melancholy that stems from this error. Many an influencer, activist, or commentator I have known will proclaim a given policy or campaign to be “impossible.” They will write it off as unfeasible with a wave of the hand. It cannot be done. Why even try? This despairing view of reality has poisoned many great projects and prevented countless others from even getting off the ground. There are indeed many policy changes that are not wise to pursue or that require resources that would be better spent elsewhere. Trade-offs and opportunity costs are simply part of life. They are unchanging features of human action. But to say that a thing comes at a price or is difficult is not the same as saying it is impossible. Nor are crude references to statistics a substitute for thought. The odds of any given American becoming a billionaire are only 1 in 380,000, but those odds are not definitive statements about an individual’s ability to create a groundbreaking innovation (or utilize government regulations to monopolize a lucrative market). At the end of the day, pointing to aggregates is not enough to understand the individuals that are part of the whole. Averages can be useful politically and can even help guide personal decisions. But an average isn’t everything. It isn’t the last word. Precision in thought—knowledge of what we know and acknowledgment of what we don’t—is crucial for political life. Despair is a sin, and pessimism is not necessarily wisdom. You often can, it turns out, just do things. And you should! As the American right moves forward in the coming years, we need to remind ourselves of this core truth. Real change, both for good and ill, is always possible. It is an error to presume to have knowledge that we really don’t have. Both mindless optimism and free-falling pessimism are wrong. The latter is, among conservatives, more common than the former. It poses a greater spiritual danger. The temptation to sit on one’s hands, wishing and whining but never doing anything useful, is very powerful on the right. A whole legion of anklebiters, cranks, and dour-faced losers surrounds us. These people are a spiritual dead end. There is nothing to be gained, in the end, from complaining or fantasizing about an apocalypse in which action will then and only then become possible. We live in this world, right here, right now. We should focus on that! I don’t know, for instance, if we will succeed in my lifetime in eliminating the Federal Reserve. I am not certain that it should be the highest priority for conservatives in this moment. But I am certain that we cannot live in peace and freedom while the central bank burrows its way into every aspect of the American economy. The right thing to do is to oppose tyranny wherever it is found. We should be honest, if only to ourselves, about what needs to be done. We should never pretend that slavery is preferable to liberty or defeat to victory. We should fight. We should make a day of it. We should follow the words of Virgil’s Aeneid: Do not give in to evil but proceed ever more boldly against it! Tyler Durden Mon, 08/04/2025 - 20:55",
    "publishedAt": "2025-08-05T00:55:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.177Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7866bff6"
  },
  {
    "id": "et-markets-2fa343c8",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/vishal-mega-mart-swiggy-may-be-included-in-msci-standard-index/articleshow/123106697.cms",
    "summary": "![CDATA[Nuvama Alternative & Quantitative Research anticipates significant changes in MSCI's Standard index, with potential additions like Vishal Mega Mart, Swiggy, Hitachi Energy India, and Waaree Energies, attracting an estimated $1.03 billion in inflows.",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:54:26.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2fa343c8"
  },
  {
    "id": "et-markets-5c218a43",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-can-soar-to-89000-by-june-2026-morgan-stanley/articleshow/123106649.cms",
    "summary": "![CDATA[Morgan Stanley anticipates Indian equities will reach new peaks, projecting the Sensex to hit 89,000 by June 2026, a 10% increase from Monday's close. High growth, low volatility, and declining interest rates are driving higher Price to Earnings ratios.",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:50:32.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5c218a43"
  },
  {
    "id": "bbc-business-31059c48",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "",
    "url": "https://www.bbc.com/news/articles/c3v3w62ekq2o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:50:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "31059c48"
  },
  {
    "id": "bbc-business-36ba5ed8",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Why Donald Trump is talking about actress Sydney Sweeney",
    "url": "https://www.bbc.com/news/articles/c3v3w62ekq2o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "The actress stars in a controversial American Eagle advert that has become a political flashpoint in the US.",
    "fullContent": "The actress stars in a controversial American Eagle advert that has become a political flashpoint in the US.",
    "publishedAt": "2025-08-05T00:50:00.000Z",
    "fetchedAt": "2025-08-05T11:27:56.048Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "36ba5ed8"
  },
  {
    "id": "thehindubusinessline-4d0bf732",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Day Trading Guide for August 5, 2025: Intraday supports, resistances for Nifty50 stocks",
    "url": "https://www.thehindubusinessline.com/portfolio/day-trading-guide/day-trading-guide-for-august-05/article69893428.ece",
    "summary": "Day Trading Guide gives you the key intraday supports and resistances to watch out for on the Nifty Futures and other widely traded stocks such as Reliance Industries, Infosys, HDFC Bank, TCS, SBI.",
    "fullContent": "Day Trading Guide gives you the key intraday supports and resistances to watch out for on the Nifty Futures and other widely traded stocks such as Reliance Industries, Infosys, HDFC Bank, TCS, SBI.",
    "publishedAt": "2025-08-05T00:50:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.245Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4d0bf732"
  },
  {
    "id": "et-markets-6fbe3efc",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/adani-infra-buys-21-83-in-psp-projects/articleshow/123106591.cms",
    "summary": "![CDATA[Adani Infra acquired a significant stake in PSP Projects. The deal involved the purchase of 8.65 million shares. The transaction occurred through a block deal on the BSE. Each share was priced at ₹640. Promoter Prahaladbhai S Patel sold a portion of his holdings.",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:47:02.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6fbe3efc"
  },
  {
    "id": "yahoo-finance-471f37a9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Oil prices fall as OPEC+ output hikes counter Russia disruption concerns",
    "url": "https://finance.yahoo.com/news/oil-little-changed-hitting-one-004613119.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:46:13.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "471f37a9"
  },
  {
    "id": "techmeme-61a0b48e",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Google agrees with two power utilities to pause non-essential AI workloads during peak demand or adverse weather events that reduce supply (Tobias Mann/The Register)",
    "url": "http://www.techmeme.com/250804/p35#a250804p35",
    "summary": "Tobias Mann / The Register: Google agrees with two power utilities to pause non-essential AI workloads during peak demand or adverse weather events that reduce supply — Google will pause non-essential AI workloads to protect power grids, the advertising giant announced on...",
    "fullContent": "Tobias Mann / The Register: Google agrees with two power utilities to pause non-essential AI workloads during peak demand or adverse weather events that reduce supply — Google will pause non-essential AI workloads to protect power grids, the advertising giant announced on Monday. — The web giant already does &hellip; ]]",
    "publishedAt": "2025-08-05T00:45:01.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "61a0b48e"
  },
  {
    "id": "thehindubusinessline-568ff318",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Data exchanges can boost digital public infrastructure",
    "url": "https://www.thehindubusinessline.com/opinion/data-exchanges-can-boost-digital-public-infrastructure/article69894622.ece",
    "summary": "With right governance, data exchanges can unlock innovation, inclusion, and economic growth.",
    "fullContent": "With right governance, data exchanges can unlock innovation, inclusion, and economic growth",
    "publishedAt": "2025-08-05T00:45:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.245Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "568ff318"
  },
  {
    "id": "thehindubusinessline-1317745d",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "RBI likely to hold rates",
    "url": "https://www.thehindubusinessline.com/opinion/rbi-likely-to-hold-rates/article69894602.ece",
    "summary": "Tariff uncertainty will weigh on central bank’s move.",
    "fullContent": "Tariff uncertainty will weigh on central bank’s move",
    "publishedAt": "2025-08-05T00:45:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.245Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1317745d"
  },
  {
    "id": "scmp-business-5dd02ef6",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Black rainstorm warning to stay in force in Hong Kong until 3pm",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3320746/second-black-rainstorm-warning-6-hours-stay-force-hong-kong-until-11am?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. Hong Kong’s weather forecaster issued a black rainstorm signal for a second time in six hours on Tuesday as heavy showers drenched the city, paralysing many public services and prompting authorities to suspend classes. The Hong Kong Observatory raised the highest-level rainstorm warning at...",
    "publishedAt": "2025-08-05T00:44:44.000Z",
    "fetchedAt": "2025-08-05T02:40:14.890Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5dd02ef6"
  },
  {
    "id": "scmp-business-672de734",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Black rainstorm warning to stay in force in Hong Kong until 3pm",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3320746/second-black-rainstorm-warning-6-hours-stay-force-hong-kong-until-11am?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. Hong Kong’s weather forecaster issued a black rainstorm signal for a second time in six hours on Tuesday as heavy showers caused flash floods and wrecked havoc across the city, paralysing many public services and prompting authorities to suspend classes. The Hong Kong Observatory raised the...",
    "publishedAt": "2025-08-05T00:44:44.000Z",
    "fetchedAt": "2025-08-05T06:57:36.076Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "672de734"
  },
  {
    "id": "scmp-business-68423a88",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Black rainstorm warning to stay in force in Hong Kong until 5pm",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3320746/second-black-rainstorm-warning-6-hours-stay-force-hong-kong-until-11am?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. Hong Kong’s weather forecaster issued a black rainstorm signal for a second time in six hours on Tuesday as heavy showers caused flash floods and wreaked havoc across the city, paralysing many public services and prompting authorities to suspend classes. The Hong Kong Observatory raised the...",
    "publishedAt": "2025-08-05T00:44:44.000Z",
    "fetchedAt": "2025-08-05T09:19:04.797Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68423a88"
  },
  {
    "id": "et-markets-1e4464fe",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/promoters-of-cleanmax-raise-rs-400-crore-in-pre-ipo-round/articleshow/123106535.cms",
    "summary": "![CDATA[CleanMax's promoters, backed by Brookfield Corp, have secured ₹400 crore from 360 One Asset Management in a pre-IPO funding round. This investment will enable founder Kuldeep Jain to increase his stake in the renewable energy company from 14% to 21% before its planned...",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:43:56.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e4464fe"
  },
  {
    "id": "et-markets-1641ce2c",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/bonds/government-saves-rs-560-crore-in-interest-costs-through-bond-switches-amid-rising-debt-maturity/articleshow/123106455.cms",
    "summary": "![CDATA[The government has reaped significant financial benefits this fiscal year through strategic bond switches and conversions, extending the debt maturity profile and reducing interest expenses.",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:37:23.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1641ce2c"
  },
  {
    "id": "nyt-business-75ec88b9",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Tensions Flare Between Two Federal Agencies Charged With Aviation Safety",
    "url": "https://www.nytimes.com/2025/08/04/us/politics/faa-ntsb-dc-crash.html",
    "summary": "A marathon of recent public hearings highlighted a rift over the investigation into the fatal midair crash in January between an Army helicopter and a passenger jet.",
    "fullContent": "A marathon of recent public hearings highlighted a rift over the investigation into the fatal midair crash in January between an Army helicopter and a passenger jet.",
    "publishedAt": "2025-08-05T00:35:23.000Z",
    "fetchedAt": "2025-08-05T02:40:12.739Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "75ec88b9"
  },
  {
    "id": "et-markets-6a3bf4e6",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sp-upgrades-its-outlook-on-three-adani-group-companies/articleshow/123106417.cms",
    "summary": "![CDATA[S&P Global Ratings has revised the outlook for Adani Electricity Mumbai, Adani Ports, and Adani Green Energy, citing sustained operational strength and continued funding access. The agency affirmed the credit ratings of the three entities, upgrading APSEZ to 'Positive'...",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:33:47.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6a3bf4e6"
  },
  {
    "id": "et-markets-243cbccb",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/forex/rupee-hits-record-low-amid-dollar-demand-and-market-pressure/articleshow/123106372.cms",
    "summary": "![CDATA[The Indian rupee plummeted to a record low of 87.65 against the dollar, driven by demand from oil companies and importers despite a weaker Dollar Index. Foreign investors selling Indian equities further pressured the rupee.",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:30:40.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "243cbccb"
  },
  {
    "id": "invest-marcellus-youtube-30e7082a",
    "sourceId": "invest-marcellus-youtube",
    "sourceName": "Invest with Marcellus YouTube",
    "title": "Beyond Generic: What Affluent Indians REALLY Need?",
    "url": "https://www.youtube.com/shorts/a5sEItimFCg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:30:21.000Z",
    "fetchedAt": "2025-08-05T02:40:59.271Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "30e7082a"
  },
  {
    "id": "scmp-business-1bc83816",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Wellcome’s CEO is on a drive to win Hongkongers back from Shenzhen",
    "url": "https://www.scmp.com/business/companies/article/3320582/dfi-cut-wellcomes-prices-compete-shenzhen-hongkongers-grocery-trolleys?utm_source=rss_feed",
    "summary": "For the boss of Hong Kong’s largest retail chain – which operates Wellcome, Mannings and 7-Eleven – the key to retaining customers is simple: ensure stores match prices in Shenzhen. DFI Retail Group, formerly known as Dairy Farm, has increased the number of countries it imports...",
    "fullContent": "For the boss of Hong Kong’s largest retail chain – which operates Wellcome, Mannings and 7-Eleven – the key to retaining customers is simple: ensure stores match prices in Shenzhen. DFI Retail Group, formerly known as Dairy Farm, has increased the number of countries it imports from to 54 from 26 over the last year, helping to bring prices down by 20 per cent, according to group chief executive Scott Price. A tie-up six weeks ago with mainland Chinese fresh food platform Dingdong (Cayman) has...",
    "publishedAt": "2025-08-05T00:30:07.000Z",
    "fetchedAt": "2025-08-05T02:40:14.890Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1bc83816"
  },
  {
    "id": "scmp-business-280ae73a",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Wellcome supermarket is on a drive to win Hongkongers back from Shenzhen",
    "url": "https://www.scmp.com/business/companies/article/3320582/dfi-cut-wellcomes-prices-compete-shenzhen-hongkongers-grocery-trolleys?utm_source=rss_feed",
    "summary": "For the boss of Hong Kong’s largest retail chain – which operates Wellcome, Mannings and 7-Eleven – the key to retaining customers is simple: ensure stores match prices in Shenzhen. DFI Retail Group, formerly known as Dairy Farm, has increased the number of countries it imports...",
    "fullContent": "For the boss of Hong Kong’s largest retail chain – which operates Wellcome, Mannings and 7-Eleven – the key to retaining customers is simple: ensure stores match prices in Shenzhen. DFI Retail Group, formerly known as Dairy Farm, has increased the number of countries it imports from to 54 from 26 over the last year, helping to bring prices down by 20 per cent, according to group chief executive Scott Price. A tie-up six weeks ago with mainland Chinese fresh food platform Dingdong (Cayman) has...",
    "publishedAt": "2025-08-05T00:30:07.000Z",
    "fetchedAt": "2025-08-05T04:58:00.220Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "280ae73a"
  },
  {
    "id": "zerohedge-a48b77b",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Bolsonaro Placed Under House Arrest By US-Sanctioned Brazilian Supreme Court Head",
    "url": "https://www.zerohedge.com/geopolitical/us-sanctioned-brazilian-supreme-court-head-places-bolsonaro-under-house-arrest",
    "summary": "Bolsonaro Placed Under House Arrest By US-Sanctioned Brazilian Supreme Court Head div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body f.",
    "fullContent": "Bolsonaro Placed Under House Arrest By US-Sanctioned Brazilian Supreme Court Head Late Monday there's been more escalation in the Trump-Brazil standoff over the legal fate of former Brazilian President Jair Bolsonaro. The country's top justices have ordered him to be put under house arrest. The Supreme Court, which is still in the process of ruling on the Bolsonaro case - as he's accused of an alleged coup attempt against his leftist rival President Luiz Inácio Lula da Silva - has now said he has defied a court order banning Bolsonaro from social media. Jair Bolsonaro and justice Alexandre de Moraes. source: Secom/TSE They say he's attacking the nation's institutions while still on trial, and after he's already wearing a ankle monitoring brace. Brazil has faced US sanctions (targeting among others Bolsonaro's main rival and man driving what Trump has called a \"witch hunt\" - Supreme Court Justice Alexandre de Moraes) as well as the highest tariff rates in the world. Moraes himself issued the house arrest order, despite now being specifically targeted by the Trump administration. \"Moraes said Bolsonaro had violated precautionary measures imposed by the court restricting the former president’s social media usage and political messaging,\" according to Al Jazeera. Moraes has said that Bolsonaro, who was president of the country between 2019 and 2022, has spread messages with \"a clear content of encouragement and instigation to attacks against the Supreme Court and a blatant support for foreign intervention in the Brazilian Judiciary.\" Trump's recent heightened intervention has added fuel to the fire, and the standoff has intensified, with the Lula government so far having refused to bend the knee. Bolsonaro's family members have also been very vocal, often acting as 'messenger' - for example hailing Trump's punitive actions targeting the Supreme Court and Lula officials. Brazilians are against the tyranny of Alexandre de Moreas and Lula. Down with the PT/STF regime pic.twitter.com/LeOaiVwzLb — Direita Cristã Floripa (@direcrisflop) August 4, 2025 Sunday saw tens of thousands of Bolsonaro supporters in the streets, in the major cities of Sao Paulo and Rio de Janeiro. They, with Trump, want a full pardon for Bolsonaro and his officials which have been persecuted with him. Tyler Durden Mon, 08/04/2025 - 20:30",
    "publishedAt": "2025-08-05T00:30:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.178Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a48b77b"
  },
  {
    "id": "thehindubusinessline-d133cc4",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "External flows’ shifting paths",
    "url": "https://www.thehindubusinessline.com/opinion/external-flows-shifting-paths/article69894420.ece",
    "summary": "The rise of external financing by emerging market economies using local currency bonds may not be all good news.",
    "fullContent": "The rise of external financing by emerging market economies using local currency bonds may not be all good news",
    "publishedAt": "2025-08-05T00:30:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.246Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d133cc4"
  },
  {
    "id": "thehindubusinessline-6186ae42",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "VC capital flows where IP grows, says Accel’s Prashanth Prakash",
    "url": "https://www.thehindubusinessline.com/companies/vc-capital-flows-where-ip-grows-says-accels-prashanth-prakash/article69893700.ece",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:30:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.246Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6186ae42"
  },
  {
    "id": "thehindubusinessline-1f5b4742",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Towards an Indian growth model — III",
    "url": "https://www.thehindubusinessline.com/opinion/towards-an-indian-growth-model-iii/article69894593.ece",
    "summary": "It is better for fiscal policy to focus on improving supply, while monetary policy does the cyclical demand adjustment.",
    "fullContent": "It is better for fiscal policy to focus on improving supply, while monetary policy does the cyclical demand adjustment",
    "publishedAt": "2025-08-05T00:30:00.000Z",
    "fetchedAt": "2025-08-05T11:27:54.246Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1f5b4742"
  },
  {
    "id": "et-markets-40038944",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-capital-net-profit-up-3-on-asset-boost/articleshow/123106331.cms",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:27:24.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "40038944"
  },
  {
    "id": "business-insider-4e9b2a9c",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "GitHub CEO delivers stark message to developers: Embrace AI or get out.",
    "url": "https://www.businessinsider.com/github-ceo-developers-embrace-ai-or-get-out-2025-8",
    "summary": "Thomas Dohmke wrote that humans are often resistant to change. He said that's okay, but these people should probably find another profession.",
    "fullContent": "Thomas Dohmke wrote that humans are often resistant to change. He said that's okay, but these people should probably find another profession.",
    "publishedAt": "2025-08-05T00:26:54.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4e9b2a9c"
  },
  {
    "id": "business-insider-2398d191",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Blake Lively demands that Justin Baldoni's lawyer be sanctioned after accusing him of creating a 'media circus'",
    "url": "https://www.businessinsider.com/blake-lively-demands-sanctions-against-justin-baldoni-lawyer-2025-8",
    "summary": "In the &#34;It Ends With Us&#34; legal war, Blake Lively wants sanctions against Justin Baldoni's lawyer for allegedly leaking to the tabloids.",
    "fullContent": "In the &#34;It Ends With Us&#34; legal war, Blake Lively wants sanctions against Justin Baldoni's lawyer for allegedly leaking to the tabloids.",
    "publishedAt": "2025-08-05T00:21:21.000Z",
    "fetchedAt": "2025-08-05T02:40:12.328Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2398d191"
  },
  {
    "id": "bloomberg-markets-18831664",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/gold-xauusd-holds-gain-as-fed-rate-cut-bets-bolstered-by-weak-us-data",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:21:14.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18831664"
  },
  {
    "id": "bloomberg-markets-1c6f1595",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Gold Steadies After Extended Gains on Weak US Job Data",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/gold-xauusd-holds-gain-as-fed-rate-cut-bets-bolstered-by-weak-us-data",
    "summary": "Gold edged lower on Tuesday, following two days of gains on weak US jobs data.",
    "fullContent": "Gold edged lower on Tuesday, following two days of gains on weak US jobs data.",
    "publishedAt": "2025-08-05T00:21:14.000Z",
    "fetchedAt": "2025-08-05T13:22:42.699Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1c6f1595"
  },
  {
    "id": "et-markets-31bf042b",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/capri-global-capital-reports-rs-175-crore-net-profit-despite-rise-in-bad-loan-provisions/articleshow/123106253.cms",
    "summary": "![CDATA[Capri Global Capital witnessed a significant surge in net profit, more than doubling to ₹175 crore year-on-year. However, the profit experienced a slight dip of 2% compared to the previous quarter.",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:20:51.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "31bf042b"
  },
  {
    "id": "yahoo-finance-6b34b25b",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Some in BOJ saw scope to hike rates if trade friction eases, June minutes show",
    "url": "https://finance.yahoo.com/news/boj-saw-scope-resume-rate-002043063.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:20:43.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6b34b25b"
  },
  {
    "id": "ndtv-profit-youtube-1f84cdfd",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Israel Gaza War | Israel-Gaza: An Unending War – NDTV Reports From The Frontline",
    "url": "https://www.youtube.com/watch?v=Yw6qmTdBvis",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:18:56.000Z",
    "fetchedAt": "2025-08-05T02:40:21.770Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1f84cdfd"
  },
  {
    "id": "marketwatch-3c1f7885",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Denny&#x2019;s offers mixed views on restaurant industry, as bigger rivals prepare to report earnings this week",
    "url": "https://www.marketwatch.com/story/dennys-offers-mixed-views-on-restaurant-industry-as-bigger-rivals-prepare-to-report-earnings-this-week-6ea89ee5?mod=mw_rss_topstories",
    "summary": "As more big restaurant chains prepare to report quarterly results this week, casual-dining chain Denny&#x2019;s Corp.&#x2019;s diagnosis of U.S. diners wasn&#x2019;t great, as customers try to sniff out more discounts.",
    "fullContent": "As more big restaurant chains prepare to report quarterly results this week, casual-dining chain Denny&#x2019;s Corp.&#x2019;s diagnosis of U.S. diners wasn&#x2019;t great, as customers try to sniff out more discounts.",
    "publishedAt": "2025-08-05T00:18:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.492Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c1f7885"
  },
  {
    "id": "marketwatch-72294d1b",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Palantir&#x2019;s stock gains as &#x2018;bombastic&#x2019; AI demand fuels an earnings milestone",
    "url": "https://www.marketwatch.com/story/palantirs-stock-gains-as-bombastic-ai-demand-fuels-an-earnings-milestone-7528a9c8?mod=mw_rss_topstories",
    "summary": "Quarterly revenue surpassed $1 billion for the first time and accelerated for the eighth quarter in a row.",
    "fullContent": "Quarterly revenue surpassed $1 billion for the first time and accelerated for the eighth quarter in a row",
    "publishedAt": "2025-08-05T00:17:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.492Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "72294d1b"
  },
  {
    "id": "bloomberg-business-youtube-6f69274a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "S&P 500 Rallies Since May as Traders Sift Through Results | The Close 8/4/2025",
    "url": "https://www.youtube.com/watch?v=kjRe9eeffsI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:15:41.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6f69274a"
  },
  {
    "id": "marketwatch-663a2490",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Hims & Hers sees &#x2018;an exciting period of growth,&#x2019; but stock falls",
    "url": "https://www.marketwatch.com/story/hims-hers-sees-an-exciting-period-of-growth-but-stock-falls-3c8d9c43?mod=mw_rss_topstories",
    "summary": "Shares of Hims & Hers Inc. fell after hours on Monday after the wellness and telehealth platform&#x2019;s third-quarter forecast came up shy of Wall Street&#x2019;s estimates, although the company stuck with its full-year outlook.",
    "fullContent": "Shares of Hims & Hers Inc. fell after hours on Monday after the wellness and telehealth platform&#x2019;s third-quarter forecast came up shy of Wall Street&#x2019;s estimates, although the company stuck with its full-year outlook.",
    "publishedAt": "2025-08-05T00:14:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.492Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "663a2490"
  },
  {
    "id": "et-markets-626ba98",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/gmr-airports-plans-rs-6000-crore-ncd-issue-to-refinance-existing-liabilities/articleshow/123106152.cms",
    "summary": "![CDATA[GMR Airports is securing ₹6,000 crore through non-convertible debentures. The aim is to refinance current debts. Banks and mutual funds are participating in this fundraising. The interest rate could reach 10.50%. This move is expected to reduce average borrowing costs.",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:13:43.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "626ba98"
  },
  {
    "id": "bloomberg-business-youtube-52cb9658",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Texas Dems Leave State to Halt Redistricting Plan | Balance of Power: Late Edition 8/04/2025",
    "url": "https://www.youtube.com/watch?v=D803-zhuu9s",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:12:39.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "52cb9658"
  },
  {
    "id": "zerohedge-7cfcfc96",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Trump Says Americans Could Get Dividends From Tariff Revenues",
    "url": "https://www.zerohedge.com/political/trump-says-americans-could-get-dividends-tariff-revenues",
    "summary": "Trump Says Americans Could Get Dividends From Tariff Revenues div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with.",
    "fullContent": "Trump Says Americans Could Get Dividends From Tariff Revenues Authored by Aldgra Fredly via The Epoch Times (emphasis ours), President Donald Trump suggested on Sunday that his administration could distribute dividends from tariff revenues to Americans with certain income levels. US President Donald Trump delivers remarks during a reception with Republican members of Congress at the White House on July 22, 2025. Andrew Caballero-Reynolds/AFP via Getty Images Speaking to reporters before boarding Air Force One, Trump said that a distribution of dividends to selected U.S. households is possible, even as the government works to pay down the national debt. “We have a lot of money coming in, much more money than the country has ever seen, by hundreds of billions of dollars,” he said. “There could be a distribution for dividends to the people of our country. I would say for people that would be middle-income people and lower-income people, we could do a dividend.” He also reaffirmed the government’s commitment to lower drug prices, in line with his May 12 executive order that requires drug manufacturers to offer American consumers “the most-favored-nation lowest price” for prescription drugs. “We‘ll be dropping drug prices, it will start over the next two to three months, by 1,200, 1,300 and even 1,400 percent,” he said. “We will pay as low as the lowest nation in the world.” Trump did not specify the potential amount of dividends he could distribute. The U.S. government collected $28 billion in tariff revenues in July, marking a record monthly high and bringing the total revenue for the fiscal year to more than $151 billion, according to Treasury data. Treasury Secretary Scott Bessent told last month’s cabinet meeting that tariff collections could reach $300 billion by the end of the year, as a result of Trump’s trade campaign. Trump imposed a 10 percent baseline tariff on nearly all U.S. trading partners in April, along with reciprocal tariffs that vary depending on their trade barriers with the United States, as part of an effort to address trade deficits. He later implemented a 90-day pause on the reciprocal tariffs, before extending the reprieve to Aug. 1 to allow time for negotiations. The president signed an executive order on July 31 imposing reciprocal tariffs of between 10 percent and 41 percent on more than 60 U.S. trading partners. The new tariff rates, which are set to take effect on Aug. 7, were determined based on whether each nation has reached an agreement with the United States and the nature of those agreements. In his order, Trump stated that some trading partners have agreed to or are close to making “meaningful trade and security commitments with the United States,” while others have proposed terms that he thinks fail to adequately address trade imbalances or “align sufficiently with the United States on economic and national-security matters.” “There are also some trading partners that have failed to engage in negotiations with the United States or to take adequate steps to align sufficiently with the United States on economic and national security matters,” the order stated. The Trump administration is working on a trade deal with China, which is subject to an extended deadline through Aug. 12, following a May 12 agreement in which the two largest economies agreed to lower tariffs and roll back certain trade restrictions for 90 days. Joseph Lord and Reuters contributed to this report. Tyler Durden Mon, 08/04/2025 - 20:05",
    "publishedAt": "2025-08-05T00:05:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.178Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7cfcfc96"
  },
  {
    "id": "yahoo-finance-2755b773",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "ThredUp Gains Shoppers Weary of Economic Uncertainty",
    "url": "https://www.wsj.com/business/retail/thredup-gains-shoppers-weary-of-economic-uncertainty-fe3961ce?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:05:00.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2755b773"
  },
  {
    "id": "bloomberg-politics-dd1104d",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/missouri-republicans-weigh-joining-texas-in-house-redistricting",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T00:01:13.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "dd1104d"
  },
  {
    "id": "bloomberg-politics-4eaa30ad",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Missouri Republicans Consider Joining Texas to Redraw House Maps",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/missouri-republicans-weigh-joining-texas-in-house-redistricting",
    "summary": "Missouri Republicans are mulling a redistricting plan similar to one taking shape in Texas that President Donald Trump has pushed to bolster the chances for the GOP to maintain control of Congress after the 2026 midterm elections.",
    "fullContent": "Missouri Republicans are mulling a redistricting plan similar to one taking shape in Texas that President Donald Trump has pushed to bolster the chances for the GOP to maintain control of Congress after the 2026 midterm elections.",
    "publishedAt": "2025-08-05T00:01:13.000Z",
    "fetchedAt": "2025-08-05T11:27:53.474Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4eaa30ad"
  },
  {
    "id": "techmeme-625bfc83",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "SEO is being supplanted by generative-engine optimization, or GEO, which focuses on AI chatbots and does not benefit from longstanding SEO tricks (John Herrman/New York Magazine)",
    "url": "http://www.techmeme.com/250804/p34#a250804p34",
    "summary": "John Herrman / New York Magazine: SEO is being supplanted by generative-engine optimization, or GEO, which focuses on AI chatbots and does not benefit from longstanding SEO tricks — Search-engine optimization now feels dated.",
    "fullContent": "John Herrman / New York Magazine: SEO is being supplanted by generative-engine optimization, or GEO, which focuses on AI chatbots and does not benefit from longstanding SEO tricks — Search-engine optimization now feels dated. Generative-engine optimization is all about trying to trick AI chatbots. ]]",
    "publishedAt": "2025-08-05T00:00:14.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "625bfc83"
  },
  {
    "id": "business-insider-1beaaa85",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "The hottest jobs today didn't exist a few years ago — and degrees won't get you there, one of LinkedIn's top economists told BI",
    "url": "https://www.businessinsider.com/jobs-changing-degree-linkedin-exec-head-economist-asia-pacific-2025-8",
    "summary": "From data scientist to content creator, many job titles didn't exist 20 years ago, said LinkedIn's head economist for Asia-Pacific.",
    "fullContent": "From data scientist to content creator, many job titles didn't exist 20 years ago, said LinkedIn's head economist for Asia-Pacific.",
    "publishedAt": "2025-08-05T00:00:01.000Z",
    "fetchedAt": "2025-08-05T02:40:12.328Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1beaaa85"
  },
  {
    "id": "yahoo-finance-290af517",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Beleaguered TL carrier Pamt Corp. names new CEO",
    "url": "https://finance.yahoo.com/news/beleaguered-tl-carrier-pamt-corp-235257512.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:52:57.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "290af517"
  },
  {
    "id": "et-markets-192bc58f",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-yes-bank-vodafone-idea-now-indias-most-widely-held-stocks/articleshow/123105879.cms",
    "summary": "![CDATA[Tata Motors, Yes Bank, and Vodafone Idea are now India's most widely held stocks. They replaced Reliance Power, Reliance Industries, and SBI. Tata Motors leads with over 67.5 lakh shareholders. Yes Bank follows with 63.5 lakh. Vodafone Idea's count jumped significantly.",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:52:55.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "192bc58f"
  },
  {
    "id": "cnbc-markets-62393912",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Jim Cramer attributes market resilience to Big Tech's earnings success",
    "url": "https://www.cnbc.com/2025/08/04/jim-cramer-attributes-market-resilience-to-big-techs-earnings-success.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:46:22.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62393912"
  },
  {
    "id": "cnbc-markets-77e324ec",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Jim Cramer attributes market resilience to Big Tech's earnings success",
    "url": "https://www.cnbc.com/2025/08/04/jim-cramer-attributes-market-resilience-to-big-techs-earnings-success.html",
    "summary": "CNBC's Jim Cramer reviewed Monday's market action and told investors that stocks' rebound was lead by positive news from the Magnificent Seven Tech stocks.",
    "fullContent": "CNBC's Jim Cramer reviewed Monday's market action and told investors that stocks' rebound was lead by positive news from the Magnificent Seven Tech stocks.",
    "publishedAt": "2025-08-04T23:46:22.000Z",
    "fetchedAt": "2025-08-05T11:27:53.400Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "77e324ec"
  },
  {
    "id": "yahoo-finance-5265fc24",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "How a HELOC Impacts Your Credit Score — Before, During, and After",
    "url": "https://finance.yahoo.com/news/heloc-impacts-credit-score-during-234618574.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:46:18.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5265fc24"
  },
  {
    "id": "cnbc-tv18-youtube-719dbd61",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Top News LIVE: PM Modi | Rahul Gandhi | India on US Tariff | Donald Trump | Shibu Soren Last Rites",
    "url": "https://www.youtube.com/watch?v=TFnEz7eMV9o",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:41:35.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "719dbd61"
  },
  {
    "id": "wsj-markets-main-376aa781",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "White House Preps Order to Punish Banks That Discriminate Against Conservatives",
    "url": "https://www.wsj.com/finance/regulation/white-house-preps-order-to-punish-banks-that-discriminate-against-conservatives-8af18854?mod=rss_markets_main",
    "summary": "The president is expected to sign an executive order as soon as this week that targets so-called debanking of businesses including crypto companies.",
    "fullContent": "The president is expected to sign an executive order as soon as this week that targets so-called debanking of businesses including crypto companies.",
    "publishedAt": "2025-08-04T23:40:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.095Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "376aa781"
  },
  {
    "id": "zerohedge-7225ff28",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "China's Grip On Critical Minerals Disrupts U.S. Defense Supply Chain",
    "url": "https://www.zerohedge.com/military/chinas-grip-critical-minerals-disrupts-us-defense-supply-chain",
    "summary": "China's Grip On Critical Minerals Disrupts U.S. Defense Supply Chain div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-te.",
    "fullContent": "China's Grip On Critical Minerals Disrupts U.S. Defense Supply Chain In 2023, Raytheon CEO Greg Hayes warned that Beijing effectively has the US military's supply chain by the balls, thanks to America's reliance on rare earths and other materials which either come from, or are processed in, China. F-35 Lightning II jet (Adobe Stock) According to Hayes, Raytheon has \"several thousand suppliers in China,\" because of which \"decoupling ... is impossible.\" \"We can de-risk but not decouple,\" he told the Financial Times, adding that he thinks this is the case \"for everybody.\" \"Think about the $500bn of trade that goes from China to the US every year. More than 95 per cent of rare earth materials or metals come from, or are processed in, China. There is no alternative,\" he said. Fast forward two years later - and China’s recent curbs on the export of critical minerals are rippling through the U.S. defense supply chain, slowing production schedules and sending manufacturers on a global search for scarce materials needed in everything from munitions to fighter jets. (And of course, last month ZeroHedge premium subs were treated to \"The Coming Rare Earth Revolution And How To Profit\" - full of names that have exploded higher since publication...) In short, amid a surge in U.S.-China trade tensions earlier this year, Beijing tightened its control over rare earth exports. Those shipments resumed after the Trump administration reached a set of trade concessions in June, however China has kept a firm hold on materials destined for defense use. Accounting for roughly 90 percent of the world’s rare earth output - and dominating the supply of other strategic minerals - China has also barred the sale of germanium, gallium and antimony to the United States since December. The three metals are essential for bullet hardening, night-vision optics and other military applications, the WSJ reports. A Ukrainian soldier using night-vision goggles during a mission in 2023. Photo: Felipe Dana/AP Some contractors warn that their reserves are running dangerously low. Bill Lynn, chief executive of Leonardo DRS, said Wednesday that his company’s supply of germanium has fallen to “safety stock” levels. The metal is used in infrared sensors for missiles and other systems. “In order to sustain timely product deliveries, material flow must improve in the second half” of 2025, he told investors. Leonardo DRS, a U.S. subsidiary of Italy’s Leonardo, is exploring alternative suppliers and possible substitutes. For others, the bottleneck has already meant missed deadlines. One drone-parts maker supplying the U.S. military delayed orders by as much as two months while hunting for non-Chinese sources of magnets, which are produced from rare earth elements. Traders say prices for some materials have multiplied several times over; samarium, used in high-temperature magnets for jet engines, has been offered at 60 times its typical price. The Pentagon has instructed defense contractors to phase out magnets containing Chinese minerals by 2027. While some firms have stockpiled magnets, most carry only months of supply for other critical materials. Smaller drone manufacturers — often startups with limited resources — are considered especially exposed. Dak Hardwick, vice president of international affairs at the Aerospace Industries Association, said the problem is discussed constantly within the industry. “I can tell you…we talk about this daily and our companies talk about it daily,” he said. A recent analysis by defense software firm Govini found that more than 80,000 components used in U.S. weapons systems contain minerals now under Chinese export controls. Nearly all such supply chains depend on at least one Chinese source. Western buyers say Chinese authorities have begun demanding detailed disclosures - including images of products and production lines - before approving shipments. In May, New Hampshire-based ePropelled received such requests from a Chinese magnet supplier, along with a list of questions about its customers and assurances the magnets would not be used for military purposes. “Of course we are not going to provide the Chinese government with that information,” said Chris Thompson, the firm’s vice president of global sales. When the company refused, shipments stopped, extending delivery times to twice their usual length. The firm turned to suppliers in the United States, Europe, Japan and Taiwan, as well as to emerging producers Vulcan Elements in North Carolina and USA Rare Earth in Oklahoma. Those new sources are not expected to deliver until later this year and will need to develop non-Chinese supply chains of their own. Washington has begun to respond. The Pentagon has invested in expanding domestic output, including a $14 million grant last year to a Canadian firm producing germanium substrates for defense satellites and a $400 million stake in MP Materials, which operates the largest rare-earth mine in the Americas. On an earnings call, Lockheed Martin CEO James Taiclet described the MP Materials deal as “groundbreaking” for securing magnets needed in F-35 fighters and cruise missiles. Nicholas Myers, CEO of Massachusetts-based Phoenix Tailings, said large defense companies are now moving aggressively to secure their own mineral supplies. “They recognize that they’re just not going to get the magnets… unless they get involved,” he said. Beijing’s hard line is also affecting shipments in transit. Earlier this year, United States Antimony Corporation attempted to route 55 metric tons of Australian-mined antimony to its Mexican smelter via the Chinese port of Ningbo, a process it had used before without incident. In April, Chinese customs officials held the cargo for three months, eventually releasing it only on the condition it be returned to Australia. When it arrived, company CEO Gary Evans said the seals had been broken. “The shipping company, everyone who was involved, they’d never seen this happen before,” he said. Tyler Durden Mon, 08/04/2025 - 19:40",
    "publishedAt": "2025-08-04T23:40:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.178Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7225ff28"
  },
  {
    "id": "business-insider-50f9cd3a",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Palantir CEO Alex Karp takes a shot at elite colleges and says the company offers 'a new credential independent of class'",
    "url": "https://www.businessinsider.com/palantir-ceo-alex-karp-criticizes-elite-colleges-earnings-call-2025-8",
    "summary": "CEO Alex Karp dismisses elite education and says that those without college degrees &#34;are creating a lot of value&#34; using Palantir software.",
    "fullContent": "CEO Alex Karp dismisses elite education and says that those without college degrees &#34;are creating a lot of value&#34; using Palantir software.",
    "publishedAt": "2025-08-04T23:39:15.000Z",
    "fetchedAt": "2025-08-05T02:40:12.328Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "50f9cd3a"
  },
  {
    "id": "bloomberg-economics-3ae2922c",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/japan-panel-urges-record-minimum-pay-hike-in-bright-sign-for-boj",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:38:40.000Z",
    "fetchedAt": "2025-08-05T02:40:12.335Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "3ae2922c"
  },
  {
    "id": "bloomberg-economics-2b7a94f0",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Japan Panel Urges Record Minimum Pay Hike in Bright Sign for BOJ",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/japan-panel-urges-record-minimum-pay-hike-in-bright-sign-for-boj",
    "summary": "A panel advising Japan’s government called for a record increase to the minimum wage for a second straight year, sending a positive signal to the Bank of Japan as it pursues demand-led economic growth.",
    "fullContent": "A panel advising Japan’s government called for a record increase to the minimum wage for a second straight year, sending a positive signal to the Bank of Japan as it pursues demand-led economic growth.",
    "publishedAt": "2025-08-04T23:38:40.000Z",
    "fetchedAt": "2025-08-05T11:27:53.475Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "2b7a94f0"
  },
  {
    "id": "yahoo-finance-2f1618c4",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Warren Buffett's Advice: 'If You Aren't Willing To Own A Stock For Ten Years, Don't Even Think About Owning It For Ten Minutes'",
    "url": "https://finance.yahoo.com/news/warren-buffetts-advice-arent-willing-233102952.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:31:02.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2f1618c4"
  },
  {
    "id": "yahoo-finance-4f7cd797",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Company advised by Trump sons said it hoped to benefit from fed money, then took it back",
    "url": "https://finance.yahoo.com/news/company-advised-trump-sons-said-233046460.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:30:46.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4f7cd797"
  },
  {
    "id": "bloomberg-markets-73a6b5e6",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/traders-burned-by-august-meltdown-keep-betting-on-japan-stocks",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:30:29.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "73a6b5e6"
  },
  {
    "id": "bloomberg-markets-7238593d",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/traders-burned-by-august-meltdown-keep-betting-on-japan-stocks",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:30:29.000Z",
    "fetchedAt": "2025-08-05T09:18:58.456Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7238593d"
  },
  {
    "id": "scmp-business-f550671",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong trade promoter to form ‘strategic alliance’ with Bank of China",
    "url": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3320723/hong-kong-trade-promoter-form-strategic-alliance-bank-china-frederick-ma?utm_source=rss_feed",
    "summary": "The Hong Kong Trade Development Council (HKTDC) will form a “strategic alliance” with the Bank of China (BOC) to get mainland Chinese companies to rely on the city as a “superconnector” as they venture overseas, its new chairman, Frederick Ma Si-hang, has said.",
    "fullContent": "The Hong Kong Trade Development Council (HKTDC) will form a “strategic alliance” with the Bank of China (BOC) to get mainland Chinese companies to rely on the city as a “superconnector” as they venture overseas, its new chairman, Frederick Ma Si-hang, has said. The council’s new task would be part of an expansion of its role in response to continuing geopolitical tensions, he told the Post in an exclusive interview last week. As Ma outlined his vision to realign the statutory body’s global...",
    "publishedAt": "2025-08-04T23:30:08.000Z",
    "fetchedAt": "2025-08-05T02:40:14.890Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "f550671"
  },
  {
    "id": "cnbc-tv18-youtube-19616862",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Russia and China Challenge the US: Escalating Tensions in Ukraine and the Pacific | N18G",
    "url": "https://www.youtube.com/watch?v=Oy-gSTZd4YQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:30:07.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "19616862"
  },
  {
    "id": "yahoo-finance-822df7e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "This High-Yield Dividend Stock Is Staging a Comeback. Should You Buy Shares Now?",
    "url": "https://finance.yahoo.com/news/high-yield-dividend-stock-staging-233002479.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:30:02.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "822df7e"
  },
  {
    "id": "bloomberg-markets-6ae797a1",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/latest-oil-market-news-and-analysis-for-aug-5",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:28:51.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6ae797a1"
  },
  {
    "id": "bloomberg-markets-28c9a694",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/latest-oil-market-news-and-analysis-for-aug-5",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:28:51.000Z",
    "fetchedAt": "2025-08-05T06:57:32.783Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "28c9a694"
  },
  {
    "id": "bloomberg-markets-d4fc1f0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/latest-oil-market-news-and-analysis-for-aug-5",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:28:51.000Z",
    "fetchedAt": "2025-08-05T09:50:42.991Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d4fc1f0"
  },
  {
    "id": "bloomberg-markets-2f001538",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Falls as Traders Weigh Trump’s Latest India Tariffs Threat",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/latest-oil-market-news-and-analysis-for-aug-5",
    "summary": "Oil extended a three-day drop, as investors weighed US President Donald Trump’s threat to penalize India for buying Russian oil against fresh comments on lower energy prices.",
    "fullContent": "Oil extended a three-day drop, as investors weighed US President Donald Trump’s threat to penalize India for buying Russian oil against fresh comments on lower energy prices.",
    "publishedAt": "2025-08-04T23:28:51.000Z",
    "fetchedAt": "2025-08-05T13:22:42.699Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2f001538"
  },
  {
    "id": "bloomberg-politics-71d210b9",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/doj-opens-probe-of-alleged-russiagate-conspiracy-against-trump",
    "summary": "![CDATA[The US Justice Department has opened a criminal investigation into claims that national security officials participated in a conspiracy in late 2016 and early 2017 to link President Donald Trump to Russia’s election interference and undermine his legitimacy, according to...",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:26:59.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "71d210b9"
  },
  {
    "id": "bloomberg-politics-24982205",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "DOJ Probing Alleged ‘Russiagate’ Conspiracy Against Trump",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/doj-opens-probe-of-alleged-russiagate-conspiracy-against-trump",
    "summary": "The US Justice Department has opened a criminal investigation into claims that national security officials participated in a conspiracy in late 2016 and early 2017 to link President Donald Trump to Russia’s election interference and undermine his legitimacy, according to a...",
    "fullContent": "The US Justice Department has opened a criminal investigation into claims that national security officials participated in a conspiracy in late 2016 and early 2017 to link President Donald Trump to Russia’s election interference and undermine his legitimacy, according to a person familiar with the matter.",
    "publishedAt": "2025-08-04T23:26:59.000Z",
    "fetchedAt": "2025-08-05T11:27:53.474Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "24982205"
  },
  {
    "id": "bloomberg-markets-6d7e1eba",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/the-close-8-4-2025-video",
    "summary": "![CDATA[Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are BlackRock’s Stephen Laipply, EQT’s Toby Rice, DA Davidson & Co’s Gil Luria, Morgan Stanley’s...",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:26:07.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6d7e1eba"
  },
  {
    "id": "yahoo-finance-9ee8984",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Pontera Offers Retirement Oversight & Advice: Co-Founder",
    "url": "https://finance.yahoo.com/video/pontera-offers-retirement-oversight-advice-232526232.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:25:26.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "9ee8984"
  },
  {
    "id": "bloomberg-markets-4c7d1e73",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/pontera-offers-retirement-oversight-advice-co-founder-video",
    "summary": "![CDATA[Uri Levine, co-founder of Waze and Pontera, says one of the biggest challenges in the U.S. market is that people aren’t saving enough for retirement, emphasizing that many are not making the right financial decisions or getting proper advice.",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:24:37.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c7d1e73"
  },
  {
    "id": "yahoo-finance-a9c7ea8",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Fed rate cuts could spark a new stock bubble, SocGen says. Here's the level to watch in the S&P 500.",
    "url": "https://finance.yahoo.com/news/fed-rate-cuts-could-spark-232423024.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:24:23.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a9c7ea8"
  },
  {
    "id": "bloomberg-politics-5c9acd0",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/-fight-fire-with-fire-california-democrats-plan-redistricting",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:23:41.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5c9acd0"
  },
  {
    "id": "bloomberg-politics-5a6cbd56",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "‘Fight Fire With Fire:’ California Democrats Plan Redistricting",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/-fight-fire-with-fire-california-democrats-plan-redistricting",
    "summary": "California Democrats are pushing a plan to redraw the state’s congressional boundaries, a move aimed at countering a Republican redistricting effort in Texas that could help President Donald Trump’s party win more seats in Congress.",
    "fullContent": "California Democrats are pushing a plan to redraw the state’s congressional boundaries, a move aimed at countering a Republican redistricting effort in Texas that could help President Donald Trump’s party win more seats in Congress.",
    "publishedAt": "2025-08-04T23:23:41.000Z",
    "fetchedAt": "2025-08-05T11:27:53.474Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5a6cbd56"
  },
  {
    "id": "yahoo-finance-79ddfafa",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Harley-Davidson Names Topgolf Leader as New CEO",
    "url": "https://finance.yahoo.com/news/harley-davidson-names-topgolf-leader-114400578.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:23:00.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "79ddfafa"
  },
  {
    "id": "bloomberg-markets-6d38f547",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/fed-september-meeting-a-50-50-outcome-state-street-s-dixon",
    "summary": "![CDATA[State Street Senior Macro Strategist Noel Dixon sees the Federal Reserve's September meeting a 50-50 outcome and that will cause volatility in markets. He also discusses the outlook for the \"American Exceptionalism\" trade with Bloomberg's Annmarie Hordern and Dani Burger...",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:22:07.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6d38f547"
  },
  {
    "id": "bloomberg-politics-72e863de",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/australia-selects-japanese-frigate-plan-boosting-strategic-ties",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:16:20.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "72e863de"
  },
  {
    "id": "bloomberg-politics-1b7adfab",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/australia-selects-japanese-frigate-plan-boosting-strategic-ties",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:16:20.000Z",
    "fetchedAt": "2025-08-05T04:57:57.465Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1b7adfab"
  },
  {
    "id": "bloomberg-politics-4630a9ab",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/australia-selects-japanese-frigate-plan-boosting-strategic-ties",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:16:20.000Z",
    "fetchedAt": "2025-08-05T06:57:33.061Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4630a9ab"
  },
  {
    "id": "bloomberg-politics-4bb74e53",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Japan’s Defense Ambitions Boosted by Australia Warship Deal",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/australia-selects-japanese-frigate-plan-boosting-strategic-ties",
    "summary": "Japan’s Mitsubishi Heavy Industries won a multi-billion dollar deal to build a fleet of advanced naval frigates for Australia, boosting Tokyo’s ambitions to become a major exporter of military equipment and develop its defense sector.",
    "fullContent": "Japan’s Mitsubishi Heavy Industries won a multi-billion dollar deal to build a fleet of advanced naval frigates for Australia, boosting Tokyo’s ambitions to become a major exporter of military equipment and develop its defense sector.",
    "publishedAt": "2025-08-04T23:16:20.000Z",
    "fetchedAt": "2025-08-05T11:27:53.474Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4bb74e53"
  },
  {
    "id": "the-verge-6e5c3bf7",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/analysis/718436/amazon-alexa-skill-ended-for-sengled-smart-lighting",
    "summary": "![CDATA[After repeatedly leaving customers without smart control of their lights, Sengled has been booted from Amazon's Works With Alexa program. As first reported by TechHive, beginning August 1st, Sengled's Alexa skill for controlling its line of LED lights, plugs, switches,...",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:15:56.000Z",
    "fetchedAt": "2025-08-05T02:40:13.907Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6e5c3bf7"
  },
  {
    "id": "the-verge-6b4d4af9",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Sengled’s downfall shows the peril of relying on cloud connections for smart home control",
    "url": "https://www.theverge.com/analysis/718436/amazon-alexa-skill-ended-for-sengled-smart-lighting",
    "summary": "After repeatedly leaving customers without smart control of their lights, Sengled has been booted from Amazon's Works With Alexa program. As first reported by TechHive, beginning August 1st, Sengled's Alexa skill for controlling its line of LED lights, plugs, switches, and...",
    "fullContent": "After repeatedly leaving customers without smart control of their lights, Sengled has been booted from Amazon's Works With Alexa program. As first reported by TechHive, beginning August 1st, Sengled's Alexa skill for controlling its line of LED lights, plugs, switches, and sensors with your voice and routines is no longer available. In a statement to [&#8230;]",
    "publishedAt": "2025-08-04T23:15:56.000Z",
    "fetchedAt": "2025-08-05T11:27:55.120Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6b4d4af9"
  },
  {
    "id": "zerohedge-79245f2d",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Huge Drug And Weapons Haul In French Polynesia Echoes Kash Patel's Warnings",
    "url": "https://www.zerohedge.com/geopolitical/huge-drug-and-weapons-haul-french-polynesia-echoes-kash-patels-warnings",
    "summary": "Huge Drug And Weapons Haul In French Polynesia Echoes Kash Patel's Warnings div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--",
    "fullContent": "Huge Drug And Weapons Haul In French Polynesia Echoes Kash Patel's Warnings Authored by Rex Wilderstrom via The Epoch Times (emphasis ours), While countering Beijing’s influence in the Pacific was chief among the reasons given by FBI Director Kash Patel when he opened the agency’s new office in Wellington last week, both he and New Zealand’s security ministers also spoke of rising transnational crime affecting the region. The 11 Glock pistols and 22 magazines seized from the intercepted ship. OFAST/Comgend Polynésie Française In a statement, the U.S. Embassy in Wellington described the purpose of the new office as working “to investigate and disrupt a wide range of threats and criminal activities, including terrorism, cybercrime and fraud, organised crime and money laundering, child exploitation, and foreign intelligence threats.” The latest seizure of drugs and weapons in the region bears out the reality of that threat. Comgend Polynésie Française—the national police force of French Polynesia—has announced that it has seized a “historic” quantity of drugs with a total street value of €331 million (US$382.66 million) from a yacht caught in the Marquesas Islands, about 1,400 kilometres north of Tahiti. After towing it to Pape'ete, the capital of Tahiti, and dismantling it, over 700 kilograms of drugs were found concealed in the boat’s structure. In total, 1,646.8 kilograms of cocaine and 232.4 kilograms of methamphetamine were seized from the boat. They also discovered 11 Glock semi‑automatic pistols and 24 magazines. Shipment Believed to be Bound For Australia The yacht was believed to have left Mexico and to be headed to Australia via Tonga. The three men onboard, a German skipper and two Dutch nationals, remain in custody, local Public Prosecutor Solène Belaouar said in a statement on Aug. 2. The head of French Polynesia’s Customs Department, Serge Puccetti, told local media the shipment was not destined for French Polynesia. He said French authorities regularly share intelligence with law enforcement agencies in the United States, Australia, and New Zealand. Echoing Patel’s warning, he said the Pacific is now a major transit area between narcotic production in South America and users in Australia, which has emerged as a major market, as well as to New Zealand and Asia. Organised crime syndicates from Southeast Asia are also using the Pacific Islands, including Papua New Guinea, as transit points to ship opium-based drugs and methamphetamines to the U.S. market. Smugglers were now using all kinds of transport modes: air, sea, onboard containers, and sailboats, Puccetti said. “On each of these vectors, we are vigilant,” he said. New Caledonia’s Divisional Head of Customs, Hervé Matho, told local media, “In terms of cocaine consumption, the U.S. market is now saturated. That’s why traffickers are searching for new markets, [in] Europe and, in the Pacific region, Australia and New Zealand.” Tyler Durden Mon, 08/04/2025 - 19:15",
    "publishedAt": "2025-08-04T23:15:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.178Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "79245f2d"
  },
  {
    "id": "bloomberg-markets-6a5ffea2",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/tariffs-starting-to-slow-growth-morgan-stanley-s-zezas-video",
    "summary": "![CDATA[Michael Zezas, Morgan Stanley’s head of U.S. public policy research, says that over the next two to three months, we need to look carefully at inflation, labor data, as well as, product-by-product breakdowns to understand how the economy is absorbing tariff actions.",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:09:44.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6a5ffea2"
  },
  {
    "id": "the-verge-4670e8c5",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/21289209/best-apple-watch-deals",
    "summary": "![CDATA[In September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest...",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:09:37.000Z",
    "fetchedAt": "2025-08-05T02:40:13.907Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4670e8c5"
  },
  {
    "id": "the-verge-758a95d5",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Here are the best Apple Watch deals available right now",
    "url": "https://www.theverge.com/21289209/best-apple-watch-deals",
    "summary": "In September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also...",
    "fullContent": "In September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now more Apple Watch models on [&#8230;]",
    "publishedAt": "2025-08-04T23:09:37.000Z",
    "fetchedAt": "2025-08-05T11:27:55.120Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "758a95d5"
  },
  {
    "id": "bloomberg-markets-21b891f3",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/an-electrified-world-needs-more-natural-gas-eqt-ceo-video",
    "summary": "![CDATA[Toby Rice, CEO of EQT, says he sees short-term weakness in natural gas prices, but looking 6 to 12 months out, “it’s hard not to get really excited” about the commodity. He speaks with Romaine Bostick and Scarlet Fu on \"The Close,\" and raises the question of how the U.S.",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:09:34.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "21b891f3"
  },
  {
    "id": "bbc-business-161f2281",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "",
    "url": "https://www.bbc.com/news/articles/cp3l4qz1l9qo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:06:39.000Z",
    "fetchedAt": "2025-08-05T02:40:14.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "161f2281"
  },
  {
    "id": "bbc-business-370efc41",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Will new greener brake pads be more expensive?",
    "url": "https://www.bbc.com/news/articles/cp3l4qz1l9qo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Automotive industry will have to change techniques and materials as new EU rules come into force in 2026.",
    "fullContent": "Automotive industry will have to change techniques and materials as new EU rules come into force in 2026",
    "publishedAt": "2025-08-04T23:06:39.000Z",
    "fetchedAt": "2025-08-05T11:27:56.048Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "370efc41"
  },
  {
    "id": "yahoo-finance-16d34320",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures make slight gains as Wall Street eyes earnings with trade tensions ahead",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-make-slight-gains-as-wall-street-eyes-earnings-with-trade-tensions-ahead-230420521.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:04:20.000Z",
    "fetchedAt": "2025-08-05T09:50:42.725Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "16d34320"
  },
  {
    "id": "yahoo-finance-661b66e1",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures nudge higher as Wall Street eyes earnings, trade tensions",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-nudge-higher-as-wall-street-eyes-earnings-trade-tensions-230420217.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T23:04:20.000Z",
    "fetchedAt": "2025-08-05T13:22:42.603Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "661b66e1"
  }
]