[
  {
    "id": "bloomberg-economics-63c66b83",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Asian Container Liners Set for Profit Drop as Tariff Boom Fades",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/asian-container-liners-set-for-profit-drop-as-tariff-boom-fades",
    "summary": "Asian container liners’ profits might have just peaked.",
    "fullContent": "Asian container liners’ profits might have just peaked.",
    "publishedAt": "2025-08-05T22:00:00.000Z",
    "fetchedAt": "2025-08-06T02:38:36.221Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "63c66b83"
  },
  {
    "id": "zerohedge-175c4c80",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Border Encounters, Apprehensions Hit Record Low In July: Homeland Security",
    "url": "https://www.zerohedge.com/political/border-encounters-apprehensions-hit-record-low-july-homeland-security",
    "summary": "Border Encounters, Apprehensions Hit Record Low In July: Homeland Security div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--t.",
    "fullContent": "Border Encounters, Apprehensions Hit Record Low In July: Homeland Security The Department of Homeland Security (DHS) said preliminary data from July 2025 show that for the third time this year, the agency set record lows for nationwide encounters and single-day border apprehensions. There were 24,630 nationwide encounters with illegal immigrants in July, the lowest on record, down 2.4 percent from June and nearly 90 percent lower than the monthly average under the previous administration, the agency said on Aug. 1. Border Patrol apprehensions hit 6,177 individuals in July, breaking June’s all-time low. Daily apprehensions averaged just 148 per day. Last July, during the Biden administration, the average apprehension rate was 152 individuals every two hours. “History made, again. The numbers don’t lie—this is the most secure the border has ever been,” DHS Secretary Kristi Noem said. “President Trump didn’t just manage the crisis—he obliterated it. No more excuses. No more releases. We’ve put the cartels on defense and taken our border back.” On July 20, the country recorded its lowest single-day apprehension numbers in history, with 88 at the Southwest border and 116 nationwide. Along the southwest border, authorities reported 4,598 apprehensions for the entire month of July, which is lower than the daily average under the Biden administration, DHS said. As Naveen Athrappully reports for The Epoch Times, the Trump administration’s stringent measures against the influx of illegal immigrants have come under criticism from some immigration organizations. Last month, advocacy group American Immigration Council released a report alleging that the administration’s immigration policy “strikes at the foundation of American democracy,” according to a July 23 statement from the group. It said the Trump administration has effectively ended asylum at the southern border, demolished the refugee program, boosted funding for immigrant detention, and jammed legal immigration pathways via processing freezes, large fee increases, and opaque barriers. “This isn’t just a hardline immigration agenda,” said Nayna Gupta, the organization’s policy director. “It’s a wholesale effort to use immigrants and the U.S. immigration system to attack core tenets of our democracy and exercise unchecked executive power to realign the American government around exclusion and fear.” Last month, Sen. Alex Padilla (D-Calif.) announced legislation designed to “expand a pathway to lawful permanent residency” for millions of noncitizens who have been living in the United States for a long time. Accusing the Trump administration of “cruel scapegoating of hardworking immigrants and fearmongering of California communities,” Padilla said in a July 25 statement from his office that “there’s a better path forward.” According to data from Customs and Border Protection (CBP), nationwide encounters of illegal immigrants between February and June, the first five full months of the Trump presidency, stood at 141,550 individuals, down from nearly 1.2 million in the same period last year. Homeland Security Secretary Kristi Noem (C) rides a four-wheeler during a tour along the Nogales border wall at the Mariposa Port of Entry in Nogales, Ariz., on March 15, 2025. Alex Brandon/AFP via Getty Images Falling Crime Rates In a July 28 statement, the agency said violent crime in American cities has declined as Immigration and Customs Enforcement (ICE) removes the “worst of the worst” criminal illegal immigrants from the country. DHS cited a July 2025 report from the think tank Council for Criminal Justice, which revealed that homicide rates across 30 cities declined by 17 percent in the first half of 2025 from the same period last year. Aggravated assaults fell by 10 percent, gun assaults by 21 percent, robbery by 20 percent, sexual assaults by 10 percent, and carjackings by 24 percent, the report said. “Under President Trump and Secretary Noem, our law enforcement is working at lightning speed to remove violent criminal illegal aliens from the U.S. Every single day we are arresting gang members, murderers, pedophiles, and violent predators,” Assistant Secretary for Public Affairs Tricia McLaughlin said. “70 percent of ICE arrests are of illegal aliens who have been convicted or charged with a crime. These arrests and deportations of criminal illegal aliens are having real impact on public safety.” On July 29, Noem announced a series of nationwide ads promoting the CBP Home App that encourages illegal immigrants to self-deport from the United States back to their home nations. “The CBP Home app gives aliens the option to leave now, and self deport, so they may still have the opportunity to return legally in the future and live the American dream,” Noem said. “If they don’t, we will find them, we will deport them, and they will never return.” Tyler Durden Tue, 08/05/2025 - 18:00",
    "publishedAt": "2025-08-05T22:00:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.528Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "175c4c80"
  },
  {
    "id": "oil-price-bbfa718",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "After OPEC’s Oil Supply Cuts, What Now?",
    "url": "https://oilprice.com/Energy/Crude-Oil/After-OPECs-Oil-Supply-Cuts-What-Now.html",
    "summary": "OPEC+ will complete the unwinding of its largest production cut next month after agreeing this weekend to boost output by 547,000 barrels per day (bpd) in September in a move that was widely expected by the market and oil industry analysts.",
    "fullContent": "OPEC+ will complete the unwinding of its largest production cut next month after agreeing this weekend to boost output by 547,000 barrels per day (bpd) in September in a move that was widely expected by the market and oil industry analysts. What’s next for the OPEC+ oil production policy and the last remaining layer of production cuts of 1.66 million bpd is anyone’s guess. The group of OPEC and non-OPEC producers, led by Saudi Arabia and Russia, left the door wide open to any further production adjustment – in either direction…",
    "publishedAt": "2025-08-05T22:00:00.000Z",
    "fetchedAt": "2025-08-06T06:59:54.472Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "bbfa718"
  },
  {
    "id": "wsj-youtube-1d8637b7",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Gov. Pritzker on Possible Illinois Remap: ‘Everything Is On the Table’ | WSJ News",
    "url": "https://www.youtube.com/watch?v=2AaFAqO9bos",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T21:58:12.000Z",
    "fetchedAt": "2025-08-06T02:39:08.849Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1d8637b7"
  },
  {
    "id": "cnbc-markets-1809795c",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Lucid softens full-year production forecast as EV maker misses second-quarter estimates",
    "url": "https://www.cnbc.com/2025/08/05/lucid-lcid-results-q2-2025.html",
    "summary": "The electric vehicle maker now anticipates producing between 18,000 and 20,000 vehicles for the year after previously projecting a goal of 20,000.",
    "fullContent": "The electric vehicle maker now anticipates producing between 18,000 and 20,000 vehicles for the year after previously projecting a goal of 20,000.",
    "publishedAt": "2025-08-05T21:56:56.000Z",
    "fetchedAt": "2025-08-06T02:38:35.707Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1809795c"
  },
  {
    "id": "bloomberg-business-youtube-6a7c4e42",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Dow, S&P, Nasdaq Drop on Soft ISM Report | Closing Bell",
    "url": "https://www.youtube.com/watch?v=7JIURlsPk2w",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T21:55:51.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6a7c4e42"
  },
  {
    "id": "bloomberg-markets-9f23e16",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Some Reshoring Goals Could Take Decades: Caldwell",
    "url": "https://www.bloomberg.com/news/videos/2025-08-05/some-reshoring-goals-could-take-decades-caldwell-video",
    "summary": "Didi Caldwell, president and CEO of Global Location Strategies, says some reshoring efforts could take decades, emphasizing that the United States remains closely tied to China on rare earth minerals. She speaks with Romaine Bostick and Sonali Basak on “The Close.",
    "fullContent": "Didi Caldwell, president and CEO of Global Location Strategies, says some reshoring efforts could take decades, emphasizing that the United States remains closely tied to China on rare earth minerals. She speaks with Romaine Bostick and Sonali Basak on “The Close.” (Source: Bloomberg)",
    "publishedAt": "2025-08-05T21:51:45.000Z",
    "fetchedAt": "2025-08-06T02:38:35.615Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "9f23e16"
  },
  {
    "id": "bloomberg-markets-29c01e94",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump Always Wants a Better Deal: Fmr. Trump Offical",
    "url": "https://www.bloomberg.com/news/videos/2025-08-05/trump-always-wants-a-better-deal-fmr-trump-offical-video",
    "summary": "Kate Kalutkiewicz, Trade Practice Lead, McLarty Associates, says Trump always wants to negotiate and believes he can get a better trade deal. She speaks with Romaine Bostick on “The Close” about the impact of tariffs on the auto industry. (Source: Bloomberg)",
    "fullContent": "Kate Kalutkiewicz, Trade Practice Lead, McLarty Associates, says Trump always wants to negotiate and believes he can get a better trade deal. She speaks with Romaine Bostick on “The Close” about the impact of tariffs on the auto industry. (Source: Bloomberg)",
    "publishedAt": "2025-08-05T21:51:08.000Z",
    "fetchedAt": "2025-08-06T02:38:35.615Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "29c01e94"
  },
  {
    "id": "bloomberg-markets-79011d2d",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Snap Second-Quarter Sales Fall Short on Advertising Glitch",
    "url": "https://www.bloomberg.com/news/videos/2025-08-05/snap-second-quarter-sales-fall-short-video",
    "summary": "Snap Inc. reported second-quarter sales that were shy of Wall Street’s average estimates as the company, owner of the Snapchat photo-sharing app, dealt with a technical issue with its ad-buying tools that slowed revenue growth. The company’s shares tumbled in late trading.",
    "fullContent": "Snap Inc. reported second-quarter sales that were shy of Wall Street’s average estimates as the company, owner of the Snapchat photo-sharing app, dealt with a technical issue with its ad-buying tools that slowed revenue growth. The company’s shares tumbled in late trading. Snap reported sales of $1.345 billion, slightly less than the $1.35 billion analysts were looking for. Revenue was crimped when the company inadvertently shipped an update to its advertising auction that allowed marketers to buy ads at “substantially reduced prices,” Snap said. That issue has been fixed, according to a letter to shareholders Tuesday, and “advertising revenue growth has improved.” Snap’s sales in the current period will likely be higher than analysts projected. Revenue will be $1.48 billion to $1.51 billion, according to the statement Tuesday. Analysts on average had projected sales at the low end of that range. (Source: Bloomberg)",
    "publishedAt": "2025-08-05T21:50:42.000Z",
    "fetchedAt": "2025-08-06T02:38:35.615Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "79011d2d"
  },
  {
    "id": "bloomberg-politics-36354cb0",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Lebanon Asks Army to Plan Arms Control Despite Hezbollah’s Defiance",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/lebanon-asks-army-to-plan-arms-control-despite-hezbollah-s-defiance",
    "summary": "The Lebanese government commissioned the army to set out an action plan to keep all weapons in the war-weary country under state control by year’s end, a step that may ratchet up tensions between authorities and Iran-backed militant group Hezbollah.",
    "fullContent": "The Lebanese government commissioned the army to set out an action plan to keep all weapons in the war-weary country under state control by year’s end, a step that may ratchet up tensions between authorities and Iran-backed militant group Hezbollah.",
    "publishedAt": "2025-08-05T21:47:35.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "36354cb0"
  },
  {
    "id": "bloomberg-markets-7f9eeb70",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Dow, S&P, Nasdaq Drop on Soft ISM Report | Closing Bell",
    "url": "https://www.bloomberg.com/news/videos/2025-08-05/dow-s-p-nasdaq-drop-on-soft-ism-report-closing-bell-video",
    "summary": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Romaine Bostick, Sonali Basak, Carol Massar and Matt Miller. (Source: Bloomberg)",
    "fullContent": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Romaine Bostick, Sonali Basak, Carol Massar and Matt Miller. (Source: Bloomberg)",
    "publishedAt": "2025-08-05T21:43:05.000Z",
    "fetchedAt": "2025-08-06T02:38:35.615Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7f9eeb70"
  },
  {
    "id": "ft-economics-1c7a7eaa",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "FirstFT: Investors warn over Trump’s assault on economic data",
    "url": "https://www.ft.com/content/b48eb806-2d4c-4d9b-81d1-e134f4ffc404",
    "summary": "Also in today’s newsletter, former TSMC staff arrested for alleged ‘trade secret leaks’, and OpenAI releases models to compete with DeepSeek.",
    "fullContent": "Also in today’s newsletter, former TSMC staff arrested for alleged ‘trade secret leaks’, and OpenAI releases models to compete with DeepSeek",
    "publishedAt": "2025-08-05T21:42:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.981Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "1c7a7eaa"
  },
  {
    "id": "techmeme-110c513c",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Wikipedia editors adopt a policy giving admins the authority to quickly delete AI-generated articles that meet certain criteria, like incorrect citations (Emanuel Maiberg/404 Media)",
    "url": "http://www.techmeme.com/250805/p46#a250805p46",
    "summary": "Emanuel Maiberg / 404 Media: Wikipedia editors adopt a policy giving admins the authority to quickly delete AI-generated articles that meet certain criteria, like incorrect citations — \"The ability to quickly generate a lot of bogus content is problematic if we don't have a way...",
    "fullContent": "Emanuel Maiberg / 404 Media: Wikipedia editors adopt a policy giving admins the authority to quickly delete AI-generated articles that meet certain criteria, like incorrect citations — \"The ability to quickly generate a lot of bogus content is problematic if we don't have a way to delete it just as quickly.\"",
    "publishedAt": "2025-08-05T21:40:01.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "110c513c"
  },
  {
    "id": "zerohedge-4b1c4b49",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "'1619 Project' Is Brazen Deception In The Service Of Statism",
    "url": "https://www.zerohedge.com/political/1619-project-brazen-deception-service-statism",
    "summary": "'1619 Project' Is Brazen Deception In The Service Of Statism div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-",
    "fullContent": "'1619 Project' Is Brazen Deception In The Service Of Statism Authored by George Leaf via TheDailyEconomy.org, It is useful to have frequent reminders that people often resort to deception to peddle their beliefs. The book The 1619 Project Myth by Phillip W. Magness is highly valuable in that regard, as it devastates the historical accuracy of “The 1619 Project” published by The New York Times. That long magazine piece was the brainchild of one of its writers, Nikole Hannah-Jones, who used it to make her breathtaking claim that the true date of America’s founding was not 1776, but rather 1619, the year when the first slaves were landed in North America. Why say that? The answer is that, like so many “progressives,” Nikole Hannah-Jones wants to undermine the idea that the United States was founded to increase the people’s freedom and replace it with the notion that the nation’s founding was rooted in slavery and oppression. The American Revolution was fought, in her telling, to preserve slavery, which the colonists feared was going to be ended by the British government. Moreover, she and several of her co-authors maintained, the effects of slavery are still with us. What better way to get people to think of America as a terrible nation that’s in need of radical (or revolutionary) transformation? Almost immediately after its publication, “The 1619 Project” came under fire from scholars (and not just those on the political right) who found its claims to be unsupported, implausible, and misleading. Among the first was economic historian Phillip W. Magness, now a Senior Fellow at The Independent Institute. He wrote several critical essays about different aspects of the Project, which he compiled into a book in 2020. Now, with more time to reflect on the issues and respond to recent spin-offs from the Project, he has put out a new version. It’s a demolition job of the first magnitude. Magness writes, “Each new permutation of Hannah-Jones’s work has veered more heavily into political advocacy, taking greater liberties with evidence in the process.” But, faced with a mountain of counter-argument, the New York Times has only made one carefully hidden concession about the doubtful claims in it, while Hannah-Jones and her major contributing author, Professor Matthew Desmond, avoid serious confrontations with those who criticize their work and resort to ad hominem attacks. The book is more than a point-by-point refutation of the claims in the Project. In it, readers also learn a lot about the history of capitalism in America that they probably would not find anywhere else. Here’s just one example. While Hannah-Jones and her collaborators want to make people believe that slavery and capitalism were somehow in league in early America, that’s the opposite of the truth. Magness recounts the story of the Tappan brothers of New York City. They were successful merchants who opposed slavery. In 1834, they invited Rev. Samuel Cornish, a black American and abolitionist, to their Sunday worship service. That led to a mob attack on their business and homes, as pro-slavery New Yorkers called their gesture of solidarity an invitation to a slave revolt. Between mob violence and a boycott against them, the Tappans were nearly ruined. But, just when all seemed lost, Lewis Tappan came up with a brilliant plan to revive his business by offering to deal on credit with trusted associates in the abolitionist movement. The result was the New York Mercantile Agency, the forerunner of Dun & Bradstreet. Capitalism and slavery were friends? Nothing could be further from the truth. Or consider the thesis, advanced by Prof. Desmond, that the American economy was extremely dependent on cotton produced by slavery — so dependent that it was really the driving force behind the nation’s early growth. Magness demonstrates that his claim is not remotely supported by the evidence, then turns the tables by informing the readers that one of the foremost advocates of slavery in antebellum America was one George Fitzhugh, who ranted against the ideas of Adam Smith and other free-market advocates. Fitzhugh declared that the South “must throw Adam Smith, Say, Ricardo & Co. in the fire.” In short, the philosophy of capitalism was utterly incompatible with slavery, and the pro-slavery crowd knew it. Of course, you will hear none of that from Hannah-Jones or her supporters. Another revealing spin-off from the 1619 Project is how it affected the American Historical Association (AHA). The president of the AHA, James Sweet, had the temerity to cast doubt on the truthfulness of the claims in a tweet, writing, “As journalism, it is powerful and effective, but is it history?” Sweet quickly learned that one is not permitted to ask questions about something so important to the left as this. Magness writes, “Incensed at even the mildest suggestion that politicization was undermining the integrity of historical scholarship, the activist wing of the history profession showed up at the AHA’s thread and began demanding Sweet’s cancellation.” So great was the uproar that Sweet felt the need to issue a groveling apology for having “caused harm” with his tweet. The activists did not bother to engage with Sweet and defend the 1619 Project — they just wanted to see him punished for his apostasy. If there was ever the slightest doubt as to the political purpose of the 1619 Project, it was erased when Hannah-Jones, in the subsequent Hulu TV series based upon it, called for the nation to pay reparations for slavery. That idea has long been dismissed by scholars of all races as unjust and economically ruinous. Nevertheless, she blithely stated that reparations were needed to atone for our racist past and, to explain how we could pay for the trillions it would cost, told viewers that the government can afford anything it wants just by printing enough money. How do we know that? Because a few crank economists who subscribe to Modern Monetary Theory say so. Thus, the 1619 Project combines false history with ludicrous economics to promote the statist agenda. It shouldn’t surprise anyone to learn that the American education establishment has been eager to embrace the 1619 Project and bring its materials into school and college classrooms. The leftists who say that the Project is just about teaching students some neglected aspects of American history are simply lying — the materials in it are deceptive rather than informative. Magness’s book will be of use to parents or officials who don’t want students to be indoctrinated with propaganda meant to sow hatred for the country and mislead students about capitalism. The next time you hear anything positive about the 1619 Project, reach for Magness’s excellent book. Tyler Durden Tue, 08/05/2025 - 17:40",
    "publishedAt": "2025-08-05T21:40:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.528Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4b1c4b49"
  },
  {
    "id": "ndtv-profit-youtube-3d857ef2",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Sukhi Chahal's Death, Khalistan Propaganda & NRI Diaspora Divide | Indian Abroad | Priyanka Deo",
    "url": "https://www.youtube.com/watch?v=FuG4ul9zQEo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T21:38:29.000Z",
    "fetchedAt": "2025-08-06T02:38:46.477Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3d857ef2"
  },
  {
    "id": "wsj-opinion-431a2a48",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Is the Fervor Surrounding ICE Arrests Cooling Off?",
    "url": "https://www.wsj.com/opinion/is-the-fervor-surrounding-ice-arrests-cooling-off-5d2b7abf",
    "summary": "Students discuss raids, deportations and Trump&#x2019;s immigration policy.",
    "fullContent": "Students discuss raids, deportations and Trump&#x2019;s immigration policy.",
    "publishedAt": "2025-08-05T21:36:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.121Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "431a2a48"
  },
  {
    "id": "bloomberg-markets-4dead2e7",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Climate Leader Brazil Is Frantically Drilling for More Oil",
    "url": "https://www.bloomberg.com/news/videos/2025-08-05/climate-leader-brazil-frantically-drilling-for-more-oil-video",
    "summary": "Brazil chose a city near the mouth of the Amazon to host the world’s most important climate conference. It’s also where the country's oil company is planning to launch a contested offshore exploration campaign.",
    "fullContent": "Brazil chose a city near the mouth of the Amazon to host the world’s most important climate conference. It’s also where the country's oil company is planning to launch a contested offshore exploration campaign. Peter Millard explains how the contrast shows just how hard it is for Brazil and the world to ditch fossil fuels. (Source: Bloomberg)",
    "publishedAt": "2025-08-05T21:34:55.000Z",
    "fetchedAt": "2025-08-06T02:38:35.615Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4dead2e7"
  },
  {
    "id": "wsj-opinion-4e74a878",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Political Race for Fewer Cures",
    "url": "https://www.wsj.com/opinion/donald-trump-most-favored-nation-drug-price-controls-pharma-biotech-aaadcd51",
    "summary": "Trump&#x2019;s MFN price controls on drugs will harm U.S. companies and patients.",
    "fullContent": "Trump&#x2019;s MFN price controls on drugs will harm U.S. companies and patients.",
    "publishedAt": "2025-08-05T21:34:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.121Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e74a878"
  },
  {
    "id": "fortune-3101c6a3",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "The ousted founder of millennial athleisure darling Outdoor Voices has resurfaced: &#8216;We&#8217;re back, baby&#8217;",
    "url": "https://fortune.com/2025/08/05/outdoor-voices-ousted-founder-back-athleisure-millennials/",
    "summary": "Ty Haney has returned to her athleisure company Outdoor Voices.",
    "fullContent": "Ty Haney has returned to her athleisure company Outdoor Voices.",
    "publishedAt": "2025-08-05T21:33:11.000Z",
    "fetchedAt": "2025-08-06T02:38:39.922Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3101c6a3"
  },
  {
    "id": "wsj-opinion-4443d9dc",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Kill Jews, Get Your Own State",
    "url": "https://www.wsj.com/opinion/ghazi-hamad-hamas-palestinian-state-israel-2290c711",
    "summary": "A Hamas leader says new global recognition for Palestinian statehood is a reward for the Oct. 7 massacre.",
    "fullContent": "A Hamas leader says new global recognition for Palestinian statehood is a reward for the Oct. 7 massacre.",
    "publishedAt": "2025-08-05T21:33:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.121Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4443d9dc"
  },
  {
    "id": "wsj-opinion-15e504b0",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Democratic Protectorate of Illinois",
    "url": "https://www.wsj.com/opinion/illinois-democrats-gerrymandering-texas-lawmakers-j-b-pritzker-9720b2be",
    "summary": "Few do partisan gerrymanders better than Springfield liberals.",
    "fullContent": "Few do partisan gerrymanders better than Springfield liberals.",
    "publishedAt": "2025-08-05T21:33:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.121Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "15e504b0"
  },
  {
    "id": "wsj-world-news-7d9d793e",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Kill Jews, Get Your Own State",
    "url": "https://www.wsj.com/opinion/ghazi-hamad-hamas-palestinian-state-israel-2290c711",
    "summary": "A Hamas leader says new global recognition for Palestinian statehood is a reward for the Oct. 7 massacre.",
    "fullContent": "A Hamas leader says new global recognition for Palestinian statehood is a reward for the Oct. 7 massacre.",
    "publishedAt": "2025-08-05T21:33:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.198Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "7d9d793e"
  },
  {
    "id": "the-verge-a9ee020",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "OpenAI releases a free GPT model that can run on your laptop",
    "url": "https://www.theverge.com/openai/718785/openai-gpt-oss-open-model-release",
    "summary": "OpenAI is releasing a new open-weight model dubbed GPT-OSS that can be downloaded for free, be customized, and even run on a laptop. The model comes in two variants: 120-billion-parameter and 20-billion-parameter versions.",
    "fullContent": "OpenAI is releasing a new open-weight model dubbed GPT-OSS that can be downloaded for free, be customized, and even run on a laptop. The model comes in two variants: 120-billion-parameter and 20-billion-parameter versions. The bigger version can run on a single Nvidia GPU and performs similarly to OpenAI's existing o4-mini model, while the smaller version [&#8230;]",
    "publishedAt": "2025-08-05T21:32:09.000Z",
    "fetchedAt": "2025-08-06T02:38:39.025Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "a9ee020"
  },
  {
    "id": "techmeme-9f11e72",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "The DOJ says two Chinese nationals were arrested in California on charges of illegally shipping AI chips, including Nvidia H100s, to China from 2022 to 2025 (Karen Freifeld/Reuters)",
    "url": "http://www.techmeme.com/250805/p45#a250805p45",
    "summary": "Karen Freifeld / Reuters: The DOJ says two Chinese nationals were arrested in California on charges of illegally shipping AI chips, including Nvidia H100s, to China from 2022 to 2025 — Two Chinese nationals were arrested in California and charged with illegally shipping tens of...",
    "fullContent": "Karen Freifeld / Reuters: The DOJ says two Chinese nationals were arrested in California on charges of illegally shipping AI chips, including Nvidia H100s, to China from 2022 to 2025 — Two Chinese nationals were arrested in California and charged with illegally shipping tens of millions of dollars' worth of AI chips to China &hellip;",
    "publishedAt": "2025-08-05T21:30:01.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "9f11e72"
  },
  {
    "id": "bloomberg-markets-4c02b732",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "YPF Said to Be Close to Buying Total’s Argentina Shale Assets",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/ypf-said-to-be-close-to-buying-total-s-argentina-shale-assets",
    "summary": "Argentina’s state-run oil and gas producer YPF SA is close to an agreement to acquire shale oil assets from France’s TotalEnergies SE, according to people familiar with the matter.",
    "fullContent": "Argentina’s state-run oil and gas producer YPF SA is close to an agreement to acquire shale oil assets from France’s TotalEnergies SE, according to people familiar with the matter.",
    "publishedAt": "2025-08-05T21:28:55.000Z",
    "fetchedAt": "2025-08-06T02:38:35.615Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c02b732"
  },
  {
    "id": "bloomberg-politics-30ebff6c",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Says JD Vance Is ‘Most Likely’ Heir to His Political Movement",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/trump-says-vance-most-likely-heir-to-his-political-movement",
    "summary": "President Donald Trump said Vice President JD Vance was “most likely” the heir-apparent to his Make America Great Again movement, but added there were also other potential candidates and that it was too early to make that call.",
    "fullContent": "President Donald Trump said Vice President JD Vance was “most likely” the heir-apparent to his Make America Great Again movement, but added there were also other potential candidates and that it was too early to make that call.",
    "publishedAt": "2025-08-05T21:26:27.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "30ebff6c"
  },
  {
    "id": "cnbc-markets-60f40c3e",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Healthy Returns: Medicare, Medicaid will reportedly pilot covering obesity drugs – a potential win for drugmakers",
    "url": "https://www.cnbc.com/2025/08/05/healthy-returns-trump-administration-to-pilot-covering-obesity-drugs.html",
    "summary": "The Trump administration is planning to pilot covering weight loss drugs. A longtime healthcare exec moves to a strategic advisory role at General Catalyst.",
    "fullContent": "The Trump administration is planning to pilot covering weight loss drugs. A longtime healthcare exec moves to a strategic advisory role at General Catalyst.",
    "publishedAt": "2025-08-05T21:20:49.000Z",
    "fetchedAt": "2025-08-06T02:38:35.708Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "60f40c3e"
  },
  {
    "id": "zerohedge-4885312a",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Shocking, Record Explosion In Student Loan Delinquencies Marks The Start Of Next Debt Crisis",
    "url": "https://www.zerohedge.com/markets/shocking-record-explosion-student-loan-delinquencies-marks-start-next-debt-crisis",
    "summary": "Shocking, Record Explosion In Student Loan Delinquencies Marks The Start Of Next Debt Crisis div property=\"schema:text\" class=\"clearfix text-formatted field field-",
    "fullContent": "Shocking, Record Explosion In Student Loan Delinquencies Marks The Start Of Next Debt Crisis Total household debt rose by $185 billion in the second quarter of 2025, a 1% rise from Q1 2025. Balances now stand at $18.39 trillion and have increased by $4.24 trillion since the end of 2019, just before the pandemic recession. Before is a snapshot of the latest Q2 data, courtesy of the NY Fed: Balances Mortgage balances grew by $131 billion during the second quarter of 2025 and totaled $12.94 trillion at the end of June. Balances on home equity lines of credit (HELOC) rose by $9 billion, the thirteenth consecutive quarterly increase. There is now $411 billion in outstanding HELOC balances, $94 billion above the low reached in the first quarter of 2022. Credit card balances rose by $27 billion during the second quarter and now total $1.21 trillion outstanding and are 5.87% above the level a year ago. Auto loan balances rose by $13 billion, and now stand at $1.66 trillion. Other balances, which include retail cards and consumer finance loans, were roughly unchanged at $540 billion. Student loan balances edged up by $7 billion and now stand at $1.64 trillion. In total, non-housing balances increased by $45 billion, a 0.9% increase from 2025Q1. Originations Mortgage originations increased slightly, with $458 billion newly originated in Q2. There were $188 billion in new auto loans and leases during Q2, an increase from the $166 billion observed in the first quarter of 2025. Aggregate limits on credit cards continued to rise, with a $78 billion (1.5%) uptick in the second quarter. Home equity lines of credit (HELOC) limits rose by $18 billion, continuing the growth in HELOC limits that began in 2022 Credit Quality Credit quality of newly originated loans was mixed: The credit scores of newly originated auto loans decreased, as the median score for auto loan originations decreased by 6 points. There was an improvement in the credit quality of mortgages, as the median score of newly originated mortgage loans increased by 5 points and the tenth percentile score increased by 13 points. About 53,000 individuals had new foreclosure notations on their credit reports, a decline from the previous quarter All of the above is more or less as expected: yes, the US consumer is drowning in (ever more) debt, but that's hardly a surprise: since life for middle class Americans is now largely unaffordable, most Americans have no choice but to take on even more debt. There was, however, one big shock, and it had to do with the trillions in student debt in general, and the end of the repayment moratorium in particular (see \"Trump Admin Begins Collecting On Student Loans In Default\"). As the NY Fed notes, aggregate delinquency rates \"remained elevated in the second quarter of 2025\" which is putting it mildly. As of the end of June, 4.4% of outstanding debt was in some stage of delinquency, which is 0.1% higher than the first quarter. And while transition into early delinquency held steady for nearly all debt types; the exception was for student loans, which saw another uptick in the rate at which balances went from current to delinquent due to the resumption of reporting of delinquent student loans on credit reports after a nearly 5-year pause due to the pandemic. Student loan delinquencies have been on the rise since the beginning of the year, after the government ended Biden's years-long payment freeze. As the charts below show, transition rates into serious delinquency, defined as 90 or more days past due, were largely stable for auto loans and credit cards (although both were elevated compared to previous years), edged up slightly for mortgages and HELOCs ... and absolutely exploded higher for student loans, as the share of student-loan debt entering serious delinquency was 12.9%, the highest in 21 years of data! In fact, as one can clearly see there has never been such a catastrophic deterioration in student loan in US history across borrowers of virtually all ages, but especially those 50 and over! The record surge in delinquencies suggests American households, especially those with student loans, are facing increasing financial distress this year amid high interest rates and a slowdown in hiring. Recent data showed consumer spending fell in the first six months of 2025, even before tariffs started to boost prices. While transitions into delinquency is the start of the bankruptcy pipeline, the end is also getting busier, and about 131.000 consumers had a bankruptcy notation added to their credit reports in Q2, an increase from the previous quarter. Expect this number to explode once all those student loan delinquencies transition to defaults in a few months at which point the student loan crisis becomes front and center. The dramatic deterioration will be another factor forcing the Fed to cut rates in September. Last week, Fed chair Jerome Powell said of delinquency rates, “Essentially, you have a consumer that’s in good shape and is spending,” though admittedly “not at a rapid rate.” Actually, turns out the consumer - when it comes to student loans - is now broker than ever. In a briefing with reporters, New York Fed researchers said student-loan delinquencies would likely continue to rise, eventually returning to pre-pandemic levels. Between late 2012 and early 2020, the share of student debt that was seriously delinquent ranged between 10.7% and 11.8%. “This quarter’s flow of household debt into serious delinquency was mixed across debt types, with credit card and auto loans holding steady, student loans continuing to rise and mortgages edging up slightly,” Joelle Scally, an economic policy adviser at the New York Fed, said in a press release, underplaying the clearly catastrophic surge in student loan delinquencies, and soon, defaults which will result in tens of millions of consumers suddenly finding themselves carved out from the US consumer economy just as the student loan crisis goes front and center. Full New York Fed Household Credit slideshow can be found here. Tyler Durden Tue, 08/05/2025 - 17:20",
    "publishedAt": "2025-08-05T21:20:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.528Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4885312a"
  },
  {
    "id": "bloomberg-markets-2a8b8e32",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump Says He’ll Make Fed Governor Decision This Week",
    "url": "https://www.bloomberg.com/news/videos/2025-08-05/trump-says-he-ll-make-fed-governor-decision-this-week-video",
    "summary": "President Donald Trump says he will make his decision on a replacement for outgoing Federal Reserve Governor Adriana Kugler this week.",
    "fullContent": "President Donald Trump says he will make his decision on a replacement for outgoing Federal Reserve Governor Adriana Kugler this week.",
    "publishedAt": "2025-08-05T21:18:05.000Z",
    "fetchedAt": "2025-08-06T02:38:35.615Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2a8b8e32"
  },
  {
    "id": "techmeme-713b0eb1",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Alibaba's Qwen releases Qwen-Image, an AI image generation model focused on accurate text rendering, with support for alphabetic and logographic scripts (Carl Franzen/VentureBeat)",
    "url": "http://www.techmeme.com/250805/p44#a250805p44",
    "summary": "Carl Franzen / VentureBeat: Alibaba's Qwen releases Qwen-Image, an AI image generation model focused on accurate text rendering, with support for alphabetic and logographic scripts — After seizing the summer with a blitz of powerful, freely available new open source language and...",
    "fullContent": "Carl Franzen / VentureBeat: Alibaba's Qwen releases Qwen-Image, an AI image generation model focused on accurate text rendering, with support for alphabetic and logographic scripts — After seizing the summer with a blitz of powerful, freely available new open source language and coding focused AI models that matched &hellip;",
    "publishedAt": "2025-08-05T21:15:01.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "713b0eb1"
  },
  {
    "id": "bloomberg-politics-29ca3fc1",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Says He’s Readying More Tariffs on Russian Energy Buyers",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/trump-says-he-s-readying-more-tariffs-on-russian-energy-buyers",
    "summary": "President Donald Trump suggested he would impose increased tariffs on additional countries buying energy from Russia — including China — after saying earlier Tuesday that he would raise levies on Indian exports within 24 hours.",
    "fullContent": "President Donald Trump suggested he would impose increased tariffs on additional countries buying energy from Russia — including China — after saying earlier Tuesday that he would raise levies on Indian exports within 24 hours.",
    "publishedAt": "2025-08-05T21:09:01.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "29ca3fc1"
  },
  {
    "id": "bloomberg-politics-7aa74356",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Says He Will Decide on Fed Governor Before End of the Week",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/trump-says-he-will-decide-on-fed-governor-before-end-of-the-week",
    "summary": "President Donald Trump said he would make his decision on a replacement for outgoing Federal Reserve Governor Adriana Kugler this week as he looks to make his imprint on the central bank’s monetary policy.",
    "fullContent": "President Donald Trump said he would make his decision on a replacement for outgoing Federal Reserve Governor Adriana Kugler this week as he looks to make his imprint on the central bank’s monetary policy.",
    "publishedAt": "2025-08-05T21:08:20.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "7aa74356"
  },
  {
    "id": "wsj-markets-main-3e4fbb15",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Trump Says Banks Discriminate Against Conservatives&#x2014;Including Him",
    "url": "https://www.wsj.com/finance/regulation/trump-says-banks-discriminate-against-conservativesand-that-he-was-a-victim-c5e16bac?mod=rss_markets_main",
    "summary": "The president recounted his experiences when asked about an executive order the White House is preparing.",
    "fullContent": "The president recounted his experiences when asked about an executive order the White House is preparing.",
    "publishedAt": "2025-08-05T21:08:00.000Z",
    "fetchedAt": "2025-08-06T02:38:35.793Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3e4fbb15"
  },
  {
    "id": "wsj-opinion-2382ab2f",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Scholar Who Saw Zohran Mamdani Coming in 2003",
    "url": "https://www.wsj.com/opinion/the-scholar-who-saw-mamdani-coming-in-2003-socialism-politics-c38e41d8",
    "summary": "Socialism has never been held accountable for its tyranny and slaughter, Alan Charles Kors noted.",
    "fullContent": "Socialism has never been held accountable for its tyranny and slaughter, Alan Charles Kors noted.",
    "publishedAt": "2025-08-05T21:08:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.121Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "2382ab2f"
  },
  {
    "id": "wsj-opinion-496ffbcd",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "China&#x2019;s Z.ai and America&#x2019;s Self-Defeating AI Strategy",
    "url": "https://www.wsj.com/opinion/chinas-z-ai-and-americas-self-defeating-ai-strategy-77af6552",
    "summary": "The company&#x2019;s success despite U.S. sanctions proves export restrictions are counterproductive.",
    "fullContent": "The company&#x2019;s success despite U.S. sanctions proves export restrictions are counterproductive.",
    "publishedAt": "2025-08-05T21:08:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.121Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "496ffbcd"
  },
  {
    "id": "wsj-world-news-c76a46f",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | China&#x2019;s Z.ai and America&#x2019;s Self-Defeating AI Strategy",
    "url": "https://www.wsj.com/opinion/chinas-z-ai-and-americas-self-defeating-ai-strategy-77af6552",
    "summary": "The company&#x2019;s success despite U.S. sanctions proves export restrictions are counterproductive.",
    "fullContent": "The company&#x2019;s success despite U.S. sanctions proves export restrictions are counterproductive.",
    "publishedAt": "2025-08-05T21:08:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.198Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "c76a46f"
  },
  {
    "id": "wsj-opinion-4e5375e3",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Trump&#x2019;s Trade Revolution",
    "url": "https://www.wsj.com/opinion/trumps-trade-revolution-politics-tariff-war-policy-d88f74c3",
    "summary": "In his tariff war, his chaos is triumphing, not his ideas (if any).",
    "fullContent": "In his tariff war, his chaos is triumphing, not his ideas (if any).",
    "publishedAt": "2025-08-05T21:07:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.121Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e5375e3"
  },
  {
    "id": "business-insider-3fd871f7",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "The career rise of Linda Yaccarino, from NBCU intern to leading Elon Musk's X before stepping down",
    "url": "https://www.businessinsider.com/who-is-linda-yaccarino",
    "summary": "From her early days as an intern at NBCU to getting hired by Elon Musk to be CEO of X, to leading a telehealth company, follow Linda Yaccarino's career rise.",
    "fullContent": "From her early days as an intern at NBCU to getting hired by Elon Musk to be CEO of X, to leading a telehealth company, follow Linda Yaccarino's career rise.",
    "publishedAt": "2025-08-05T21:01:28.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3fd871f7"
  },
  {
    "id": "ft-economics-69454d26",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "Diageo raises cost-cutting target as US tariffs bite",
    "url": "https://www.ft.com/content/8777113b-df51-482c-b91e-bd1a8a5503cc",
    "summary": "Profits at maker of Guinness and Johnnie Walker fall by almost 30% amid downturn in alcohol sales.",
    "fullContent": "Profits at maker of Guinness and Johnnie Walker fall by almost 30% amid downturn in alcohol sales",
    "publishedAt": "2025-08-05T21:01:25.000Z",
    "fetchedAt": "2025-08-06T02:38:37.981Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "69454d26"
  },
  {
    "id": "techmeme-302d919e",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Super Micro reports Q4 revenue up 7.5% YoY to $5.76B, vs. $6.01B est., and lowers its fiscal year sales forecast; SMCI drops 16%+ after hours (Dina Bass/Bloomberg)",
    "url": "http://www.techmeme.com/250805/p43#a250805p43",
    "summary": "$6.01B est., and lowers its fiscal year sales forecast; SMCI drops 16%+ after hours — Super Micro Computer Inc. shares plunged after the company lowered its fiscal-year revenue forecast and projecting quarterly profit that fell short of estimates ...",
    "fullContent": "Dina Bass / Bloomberg: Super Micro reports Q4 revenue up 7.5% YoY to $5.76B, vs. $6.01B est., and lowers its fiscal year sales forecast; SMCI drops 16%+ after hours — Super Micro Computer Inc. shares plunged after the company lowered its fiscal-year revenue forecast and projecting quarterly profit that fell short of estimates &hellip;",
    "publishedAt": "2025-08-05T21:00:13.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "302d919e"
  },
  {
    "id": "bloomberg-economics-3597f3ea",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "BOJ Faces Costs From Deposit Facility as Market Eyes Rate Hike",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/boj-faces-costs-from-deposit-facility-as-market-eyes-rate-hike",
    "summary": "As speculation mounts that the Bank of Japan will raise interest rates later this year, there’s a growing risk that required payments to its deposit facility could put added strain on the bank’s finances.",
    "fullContent": "As speculation mounts that the Bank of Japan will raise interest rates later this year, there’s a growing risk that required payments to its deposit facility could put added strain on the bank’s finances.",
    "publishedAt": "2025-08-05T21:00:00.000Z",
    "fetchedAt": "2025-08-06T02:38:36.221Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "3597f3ea"
  },
  {
    "id": "zerohedge-48eef85f",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "DARPA's Theory Of Mind Warfare",
    "url": "https://www.zerohedge.com/geopolitical/darpas-theory-mind-warfare",
    "summary": "DARPA's Theory Of Mind Warfare div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-summary field--label-hidden fi.",
    "fullContent": "DARPA's Theory Of Mind Warfare Authored by Matt Smith via InternationalMan.com, The Defense Advanced Research Projects Agency (DARPA) has an initiative called the Theory of Mind program. This effort is designed to give national security decision-makers the ability to model, simulate, and ultimately anticipate the intentions and behaviors of adversaries using a combination of advanced algorithms and human expertise. At its core, the program aims to: Build algorithmic models that “decompose” adversary strategies into elemental behaviors. Use massive data—signals intelligence, open-source information, even social media—to create high-fidelity “avatars” of enemy decision-makers. Simulate possible responses to a range of U.S. and allied actions, exploring which ones best deter, incentivize, or nudge adversaries toward preferred outcomes. Integrate insights from psychological profiling and machine learning to continually update these models as real-world conditions shift. The promise is profound: a system that doesn’t just predict what an adversary might do, but actively guides policymakers toward courses of action that shape the adversary’s decision calculus—minimizing escalation and maximizing U.S. strategic advantage. DARPA’s Theory of Mind program fundamentally changes how conflicts are managed. Decision-makers can run gaming scenarios at unprecedented detail and speed, customizing incentives or deterrents tailored to both cultural and individual psychologies. Risks of unintended escalation might be sharply reduced, while opportunities to “push the line” without crossing it become clearer. Theory of Mind Warfare Turned on the American Public in 2020 The same tools originally designed for military use were later deployed against the American (and global) public in 2020 AI-powered behavioral analytics, inspired by military-grade “theory of mind” models, were strategically employed during the COVID-19 pandemic to not just inform but actively shape public perception, sentiment, and compliance—creating a continuous feedback loop between government actions and public psychology. These systems quietly moved the world’s response from reactive to adaptive, fundamentally influencing how populations experienced and responded to the scamdemic. How These Systems Shaped Public Minds 1. Real-Time Sentiment Analysis and Information Targeting AI-powered platforms actively monitored social media, news, and digital conversations to track shifts in public mood, anxieties, and resistance to emerging health policies. These tools analyzed tone, emotional context, and response patterns following government announcements, often providing immediate feedback to policymakers on how their messaging was being received. 2. Tailored Messaging and Adaptive Communication Insights from these platforms allowed authorities to: Refine government communication strategies Push “approved” narratives to counter “misinformation” Adjust messaging in real time to allay public fears, address misconceptions, or reinforce confidence in health measures such as lockdowns or vaccines Remember this… 3. Behavioral Nudges and Targeted Interventions. Governments, aided by behavioral insights teams and AI analysts, designed “nudge” interventions—such as targeted text reminders, default scheduling of vaccine appointments, and personalized risk feedback—to increase uptake of desired behaviors. Rapid A/B testing determined which messages or policy tweaks worked best for specific populations. 4. Feedback Loops for Policy Calibration. Behavioral and sentiment data were continuously fed back into policy decision-making. If public adherence waned or opposition spiked (visible through sentiment tracking), messaging and interventions could be swiftly recalibrated to regain support or mitigate disinformation spikes. 5. Data-Driven Misinformation Management. AI-driven platforms scanned for and flagged viral misinformation. Rapid response teams could then deploy counter-messaging or media campaigns—often through the same platforms—using knowledge of which narratives resonated with hesitant demographics. Covid Was Just the Beginning: The Theory of Mind at Work in Recent Theaters of War Given the ambition of such strategic modeling, it’s worth asking whether this kind of “hyper-rational,” AI-enabled approach helps explain what we’ve seen in several recent, high-stakes military theaters. The Pager Attack and Decapitation of Hezbollah’s Leadership What Happened: In September 2024, thousands of pagers distributed to Hezbollah operatives in Lebanon and Syria exploded nearly simultaneously. The devices, covertly manufactured and seeded by Israel through a shell company, had been rigged with miniature explosives. The result: dozens killed or wounded—mostly Hezbollah operatives, but also some civilians—crippling the group’s command structure and sowing panic throughout its ranks. Fit with Theory of Mind: This operation demonstrates the power of deep adversary modeling. Israeli intelligence anticipated Hezbollah would switch to “low-tech” communications to evade modern surveillance. By predicting both the technological pivot and its psychological underpinnings, Israel was able to seed and trigger a devastating attack at a moment of maximum vulnerability—an almost textbook application of an algorithmic Theory of Mind approach. It wasn’t just about killing leaders; it was about destabilizing the group’s sense of security, disrupting its decision-making networks, and shaping its strategies long-term. Israel’s Operation Red Wedding & Operation Narnia: The 2025 Strikes on Iran What Happened: The Israeli attack that kicked off the 12-day war with Iran in June 2025 stands as one of the most dramatic and meticulously orchestrated military operations in recent Middle East history. This surprise assault was codenamed Operation Red Wedding (targeting Iran’s top military leadership) and Operation Narnia (targeting nuclear scientists), both designed to deliver a strategic shock to Iran’s command, control, and nuclear capabilities. In the early hours of June 13, 2025, Israel launched intensive airstrikes and covert operations inside Iran. Leveraging deep intelligence penetration, Israeli operatives lured over 30 of Iran’s top military leaders—including Brigadier General Amir Ali Hajizadeh, head of the IRGC’s Aerospace Force—into a fortified underground bunker in Tehran, where they were killed with precision strikes. Simultaneously, Israeli forces targeted Iran’s nuclear program by assassinating at least nine senior nuclear scientists and striking several critical sites. The initial waves consisted of over 200 strike sorties and more than 330 munitions used against nearly 100 high-priority targets, decapitating Iran’s military leadership and significantly damaging its nuclear infrastructure. The aftermath included at least 1,100 Iranian dead (over 30 senior commanders and 11 nuclear scientists), thousands wounded, massive damage to nuclear and missile facilities, and extensive civilian displacement. The algo must have hiccupped, because Iran didn’t collapse, they fought back. Iran’s retaliation included over 550 ballistic missiles and 1,000 suicide drones fired at Israel, bringing about a wide regional escalation, but the AI system gained control over the situation likely directing US involvement and ultimately stopping short of all-out open war. Fit with Theory of Mind: This operation reflects detailed adversary modeling and scenario simulation. Israel orchestrated a complex deception to gather Iranian leadership, carefully timed simultaneous strikes, and targeted high-value assets. The approach failed to correctly anticipate Iranian responses, but sought to degrade capabilities and leveraged psychological impact to magnify the strategic effect. This was an operation not only of military power, but of insight into adversary psychology and escalation management—embodying the goals and tools of Theory of Mind-style strategy. The decapitation plan failed, but the AI driven system kept working on the problem until a satisfactory resolution was achieved, “The Twelve Day War” was over. Operation Spiderweb: Ukraine’s Drone Assault on Russia’s Bomber Fleet What Happened: Operation Spiderweb was an unprecedented Ukrainian covert operation that dramatically changed modern warfare by targeting Russia’s strategic bomber fleet. On June 1, 2025, Ukraine’s Security Service (SBU) launched the largest drone attack of the war against Russian airbases deep inside Russian territory—reaching as far as Siberia. Over 18 months, Ukrainian operatives smuggled 117 FPV (first-person view) drones into Russia, hiding them atop trucks near key airfields, where they were remotely activated for the attack. Targets included airbases at Belaya, Dyagilevo, Ivanovo Severny, Olenya, and Ukrainka. At least 41 Russian military aircraft—Tu-160, Tu-95, Tu-22M bombers, and A-50 Airborne Early Warning aircraft—were claimed damaged or destroyed. The strikes severely impacted about one-third of Russia’s cruise missile carrier fleet and forced Moscow to disperse its remaining bombers, exposing a previously assumed safe strategic asset and dealing a psychological and operational blow to Russia. Fit with Theory of Mind: Operation Spiderweb exemplified adversary modeling and calculated escalation management. Ukrainian planners anticipated the psychological, strategic, and logistical ramifications of attacking these high-value targets—carefully avoiding nuclear escalation. By choosing the fleet’s means of launch (aircraft and support assets) rather than command centers or nuclear warheads, the operation demonstrated deep understanding of Russian red lines and risk thresholds. This is precisely the kind of strategic, “mind-reading” planning that DARPA’s Theory of Mind program envisions: leveraging intelligence and simulation to shape adversary perceptions, limit escalation, and achieve operational surprise. The events in Lebanon, Iran, Russia, and in our own countries suggest that today’s “gray zone” warfare is increasingly being shaped by decision-makers armed with unprecedented, algorithmic insight into adversary psychology and strategy—the very vision that DARPA’s Theory of Mind program is bringing to the fore. These are not just wars of bombs and bullets, but of information, perception, and calculated influence—run through a cybernetic loop of prediction, adaptation, and real-time feedback. This Is What Modern Warfare Looks Like The United States and its allies have clearly adopted the new “Theory of Mind” model of warfare not merely as a technological leap, but as a strategic necessity. No kinetic action could have moved the American public the way the covid psychological operations did. And in the conflict with Russia, traditional methods of waging war could easily result in total nuclear war. In other cases, our conventional systems alone don’t provide us with the technological supremacy they once did. The US is seeking supremacy elsewhere – algorithmic adversary modeling, predictive analytics, and adaptive scenario simulation to anticipate, shape, and, if necessary, outmaneuver opponents in political and military “gray zones” as well as open conflict. Theory of Mind Warfare Advantages Pace & Complexity: Modern battlefields blend information, cyber, economic, and kinetic operations. AI-driven systems offer an edge in parsing this complexity and accelerating the decision loop, enabling more adaptive and precise responses—far faster than traditional command structures alone can manage. Red Line Management: As conflicts brush up against escalation thresholds (nuclear, regional, or domestic-political), decision-makers must test boundaries without inadvertently crossing them. Predictive tools allow strategists to simulate outcomes, calibrate messaging, and “push the line” while minimizing catastrophic missteps. Deterrence & Shaping: The aim is less about destruction and more about influencing adversaries’ perceptions, decision timelines, and threat assessments—using information dominance and rapid feedback to keep the upper hand. War? What War?: Perhaps best of all, Theory of the Mind warfare leaves the adversary in a state of uncertainty. If Americans knew FOR SURE we were under attack and BY WHOM during the Covid hysteria, how would we have responded? Even Russia, despite red lines being crossed repeatedly, still considers itself not at war. The New Weapons of Warfare We are seeing the emergence of military ecosystems where software platforms like those developed by Palantir and defense partners serve as digital backbones for the DARPA “theory of mind” concept. The company leading this new weapons system revolution is Palantir. Their Maven system has been deployed by the IDF and is known to have been used in Gaza. In all likelihood, it was used in Lebanon and Iran as well. Palantir’s Maven integrates satellite imagery, geolocation, communications intercepts, and other sensor data into a unified analysis platform. It enables real-time adversary modeling, target selection, and campaign simulation—crucially, using AI to predict responses and ripple effects well beyond the immediate area of operations. During the PLANDEMIC Palantir’s Gotham and Foundry platforms were vital in integrating demographic, health, and behavioral data for agencies like the CDC, providing not only epidemiological tracking but also feedback on the public’s response to evolving guidelines and restrictions. Since Trump came into office, the DoD doubled its contract with Palantir to nearly $1.3b. ICE signed a deal with Palantir to develop a real-time platform for tracking migrants inside the US. Palantir also signed deals with DHS, Social Security Administration, and the IRS to centralize data platforms and expand Palantir Foundry’s use. Where’s this all going? And most important, Are we still the adversary? * * * As DARPA’s “Theory of Mind” warfare quietly shapes the global battlefield—and even the public consciousness—it’s clear we’ve entered a new era where perception is the primary terrain and algorithmic influence is the weapon of choice. Whether it’s drones over Russia, digital nudges during pandemics, or psychological pressure campaigns at home, the future is no longer about brute force—it’s about control of the narrative, and control of your decisions. If you understand what that truly means… you know this isn’t just a military shift. It’s a signal. One that tells us the systems designed to outmaneuver foreign adversaries are now being repurposed to manage you. So the question is: Will you be modeled, or will you opt out of the model? Doug Casey has been warning about this convergence of war, finance, and control for decades. His Crisis Investing service is not just about protecting your capital—it’s about reclaiming your autonomy in a world being reprogrammed around you. Click here now to subscribe to Doug Casey’s full Crisis Investing and discover how to prepare, protect, and profit—before the next simulation begins. Tyler Durden Tue, 08/05/2025 - 17:00",
    "publishedAt": "2025-08-05T21:00:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.529Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "48eef85f"
  },
  {
    "id": "oil-price-25c189d8",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Global Energy Demand Outpaces Renewable Expansion",
    "url": "https://oilprice.com/Alternative-Energy/Renewable-Energy/Global-Energy-Demand-Outpaces-Renewable-Expansion.html",
    "summary": "In recent years, many optimistic narratives have overstated the impact of renewables on fossil fuel consumption. The reality is more sobering: renewables are not displacing fossil fuels—especially in non-OECD countries and energy-intensive sectors.",
    "fullContent": "In recent years, many optimistic narratives have overstated the impact of renewables on fossil fuel consumption. The reality is more sobering: renewables are not displacing fossil fuels—especially in non-OECD countries and energy-intensive sectors. They’re growing fast, but they’re still playing catch-up with rising global energy demand. That is a key takeaway from the 2025 Statistical Review of World Energy. Yes, renewable energy posted impressive gains in 2024. But it still wasn’t enough to bend the curve on global fossil…",
    "publishedAt": "2025-08-05T21:00:00.000Z",
    "fetchedAt": "2025-08-06T06:59:54.472Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "25c189d8"
  },
  {
    "id": "the-verge-3947b09b",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Apple is suing Apple Cinemas",
    "url": "https://www.theverge.com/news/719382/apple-cinemas-sand-media-lawsuit-theater-chain",
    "summary": "Apple is suing the owner of the Apple Cinemas theater chain, Sand Media, over alleged trademark infringement, as reported by Reuters. In the lawsuit, Apple alleges that Apple Cinemas and Sand Media have made efforts to “capitalize on the highly-regarded Apple brand in connection...",
    "fullContent": "Apple is suing the owner of the Apple Cinemas theater chain, Sand Media, over alleged trademark infringement, as reported by Reuters. In the lawsuit, Apple alleges that Apple Cinemas and Sand Media have made efforts to “capitalize on the highly-regarded Apple brand in connection with the aggressive nationwide expansion” and that they have “refused to [&#8230;]",
    "publishedAt": "2025-08-05T20:58:59.000Z",
    "fetchedAt": "2025-08-06T02:38:39.025Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3947b09b"
  },
  {
    "id": "oil-price-153e1191",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Strong Crude Draw Jolts Oil Prices",
    "url": "https://oilprice.com/Latest-Energy-News/World-News/Strong-Crude-Draw-Jolts-Oil-Prices.html",
    "summary": "The American Petroleum Institute (API) estimated that crude oil inventories in the United States fell this week, shrinking by 4.2 million barrels in the week ending August 1. Analysts had expected a 1.8 million barrel draw.",
    "fullContent": "The American Petroleum Institute (API) estimated that crude oil inventories in the United States fell this week, shrinking by 4.2 million barrels in the week ending August 1. Analysts had expected a 1.8 million barrel draw. So far this year, crude oil inventories are up nearly 9 million barrels, according to Oilprice calculations of API data. Earlier this week, the Department of Energy (DoE) reported that crude oil inventories in the Strategic Petroleum Reserve (SPR) added another 300,000 barrels to 403 million barrels in the week ending August…",
    "publishedAt": "2025-08-05T20:58:04.000Z",
    "fetchedAt": "2025-08-06T06:59:54.472Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "153e1191"
  },
  {
    "id": "the-verge-6eed629a",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "TP-Link’s new travel router delivers Wi-Fi 7 speeds",
    "url": "https://www.theverge.com/news/719334/tp-link-be3600-wifi-7-travel-router-vpn",
    "summary": "Connecting to free airport or hotel Wi-Fi can often be a time-consuming and frustrating task that doesn&#8217;t seem worth the effort for a bag full of wireless devices. TP-Link has announced its first Wi-Fi 7 travel router, providing up to a total of 3.",
    "fullContent": "Connecting to free airport or hotel Wi-Fi can often be a time-consuming and frustrating task that doesn&#8217;t seem worth the effort for a bag full of wireless devices. TP-Link has announced its first Wi-Fi 7 travel router, providing up to a total of 3.6 Gbps of bandwidth while also making it easier to get multiple [&#8230;]",
    "publishedAt": "2025-08-05T20:56:42.000Z",
    "fetchedAt": "2025-08-06T02:38:39.025Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6eed629a"
  },
  {
    "id": "techmeme-5dd5e2fd",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "AMD reports Q2 revenue up 32% YoY to $7.7B vs. $7.43B est., and diluted EPS of $0.48, vs. $0.49 est.; AMD drops 5%+ after hours (Ian King/Bloomberg)",
    "url": "http://www.techmeme.com/250805/p42#a250805p42",
    "summary": "$7.43B est., and diluted EPS of $0.48, vs. $0.49 est.; AMD drops 5%+ after hours — Advanced Micro Devices Inc., the second-largest maker of artificial intelligence processors, warned that its return to the crucial China market remains a work in progress ...",
    "fullContent": "Ian King / Bloomberg: AMD reports Q2 revenue up 32% YoY to $7.7B vs. $7.43B est., and diluted EPS of $0.48, vs. $0.49 est.; AMD drops 5%+ after hours — Advanced Micro Devices Inc., the second-largest maker of artificial intelligence processors, warned that its return to the crucial China market remains a work in progress &hellip;",
    "publishedAt": "2025-08-05T20:50:00.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5dd5e2fd"
  },
  {
    "id": "techmeme-6f1a2d4a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "AMD reports Q2 revenue up 32% YoY to $7.7B vs. $7.43B est., and diluted EPS of $0.48, vs. $0.49 est.; AMD drops 5%+ after hours (Ian King/Bloomberg)",
    "url": "http://www.techmeme.com/250805/p42#a250805p42",
    "summary": "$7.43B est., and diluted EPS of $0.48, vs. $0.49 est.; AMD drops 5%+ after hours — Takeaways by Bloomberg AI — Hide ... Tell us how AI is shaping your news experience. Share your feedback — Advanced Micro Devices Inc. ...",
    "fullContent": "Ian King / Bloomberg: AMD reports Q2 revenue up 32% YoY to $7.7B vs. $7.43B est., and diluted EPS of $0.48, vs. $0.49 est.; AMD drops 5%+ after hours — Takeaways by Bloomberg AI — Hide &hellip; Tell us how AI is shaping your news experience. Share your feedback — Advanced Micro Devices Inc. &hellip;",
    "publishedAt": "2025-08-05T20:50:00.000Z",
    "fetchedAt": "2025-08-06T04:55:22.383Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6f1a2d4a"
  },
  {
    "id": "cnbc-markets-1e7fd18c",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Hinge Health stock pops 6% after first quarterly report since IPO",
    "url": "https://www.cnbc.com/2025/08/05/hinge-heatlh-hnge-stock-q2-2025-earnings.html",
    "summary": "The company reported quarterly results for the first time since its debut on the New York Stock Exchange in May.",
    "fullContent": "The company reported quarterly results for the first time since its debut on the New York Stock Exchange in May.",
    "publishedAt": "2025-08-05T20:49:54.000Z",
    "fetchedAt": "2025-08-06T02:38:35.707Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e7fd18c"
  },
  {
    "id": "wsj-markets-main-609809a9",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Service-Sector Data Brings Downbeat Day for Stocks",
    "url": "https://www.wsj.com/finance/stocks/service-sector-data-brings-downbeat-day-for-stocks-29672545?mod=rss_markets_main",
    "summary": "Monday&#x2019;s rally lost steam as the Nasdaq and S&P 500 slipped.",
    "fullContent": "Monday&#x2019;s rally lost steam as the Nasdaq and S&P 500 slipped.",
    "publishedAt": "2025-08-05T20:46:00.000Z",
    "fetchedAt": "2025-08-06T02:38:35.793Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "609809a9"
  },
  {
    "id": "bloomberg-business-youtube-2cb3e1d2",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Axon, maker of nonlethal tasers, aims to cut police deaths by 50%",
    "url": "https://www.youtube.com/shorts/WvfDVnGA1JI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T20:43:17.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2cb3e1d2"
  },
  {
    "id": "bloomberg-politics-585755b3",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Michigan Governor Confronts Trump on Tariff Hit to Auto Industry",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/michigan-s-gretchen-whitmer-confronts-trump-on-tariff-hit-to-auto-industry",
    "summary": "Michigan Democratic Governor Gretchen Whitmer told President Donald Trump that his tariffs are having a negative effect on her state’s flagship auto industry during a closed-door meeting at the White House.",
    "fullContent": "Michigan Democratic Governor Gretchen Whitmer told President Donald Trump that his tariffs are having a negative effect on her state’s flagship auto industry during a closed-door meeting at the White House.",
    "publishedAt": "2025-08-05T20:40:48.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "585755b3"
  },
  {
    "id": "techmeme-315cd59",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Match Q2: revenue of $864M, flat YoY, net earnings of $125.5M, down from $133.3M YoY, and provides a Q3 forecast beating estimates; MTCH jumps 5%+ after (Natalie Lung/Bloomberg)",
    "url": "http://www.techmeme.com/250805/p41#a250805p41",
    "summary": "Natalie Lung / Bloomberg: Match Q2: revenue of $864M, flat YoY, net earnings of $125.5M, down from $133.3M YoY, and provides a Q3 forecast beating estimates; MTCH jumps 5%+ after — Match Group Inc. provided a better-than-expected third-quarter sales forecast and pledged to...",
    "fullContent": "Natalie Lung / Bloomberg: Match Q2: revenue of $864M, flat YoY, net earnings of $125.5M, down from $133.3M YoY, and provides a Q3 forecast beating estimates; MTCH jumps 5%+ after — Match Group Inc. provided a better-than-expected third-quarter sales forecast and pledged to invest $50 million in product development &hellip;",
    "publishedAt": "2025-08-05T20:40:01.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "315cd59"
  },
  {
    "id": "zerohedge-3697c7e7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Never-Before-Seen Photos Inside Jeffrey Epstein's Creepy Mansion",
    "url": "https://www.zerohedge.com/political/never-seen-photos-inside-jeffrey-epsteins-creepy-mansion",
    "summary": "Never-Before-Seen Photos Inside Jeffrey Epstein's Creepy Mansion div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-w.",
    "fullContent": "Never-Before-Seen Photos Inside Jeffrey Epstein's Creepy Mansion The New York Times published never-before-seen photos from inside Jeffrey Epstein's erie seven-story Upper East Side townhouse on Tuesday, revealing surveillance cameras placed in bedrooms and a first edition of \"Lolita\" prominently displayed throughout the New York City mansion. Among the bizarre scenes is a macabre sculpture of a woman in a bridal gown dangling from a rope greeting visitors in the entryway, alongside dozens of framed fake eyeballs in a display that raises serious questions about what really went on behind closed doors. A copy of “Lolita,” the 1955 novel where a deviant repeatedly rapes a 12-year-old girl with whom he has become obsessed, was also spotted in an office. Among Epstein’s possessions was a first edition of Vladimir Nabokov’s novel “Lolita” — in which the main character rapes a 12-year-old girl with whom he has become obsessed. SDNY However, the most eyebrow-raising photo is a $1 bill bearing a handwritten note from Microsoft co-founder Bill Gates. \"I was wrong!\" Gates appeared to have scrawled on the note. Epstein's residence was also adorned with framed photographs featuring prominent figures such as Saudi Arabia’s Crown Prince Mohammed bin Salman, Donald Trump, Bill Clinton, Pope John Paul II, Richard Branson, Elon Musk, and others, according to the Times. Another flight up, on the third floor, was Mr. Epstein’s sanctum — a suite that included his bedroom, the mansion’s infamous massage room and a cluster of bathrooms. More via the Times: As a gift for Jeffrey Epstein’s 63rd birthday, friends sent letters in tribute to the wealthy financier and convicted sex offender. Several shared a common theme: recounting the dinner gatherings that Mr. Epstein regularly hosted at his palatial townhouse on Manhattan’s Upper East Side. Ehud Barak, former prime minister of Israel, and his wife noted the great diversity of guests. “There is no limit to your curiosity,” they wrote in their message, which was compiled with others in January 2016. “You are like a closed book to many of them but you know everything about everyone.” The media mogul Mortimer Zuckerman suggested ingredients for a meal that would reflect the culture of the mansion: a simple salad and whatever else “would enhance Jeffrey’s sexual performance.” And the director Woody Allen described how the dinners reminded him of Dracula’s castle, “where Lugosi has three young female vampires who service the place.” The freshly published photos have slowly emerged over the years as part of the mountain of evidence that came to light when Epstein was finally arrested in 2019 on child sex-trafficking charges. The photos are the latest development in the ongoing Epstein saga, which continues to generate controversy after the Department of Justice and the FBI released a joint memo last month claiming that an \"exhaustive review\" of evidence from Epstein's death definitively ruled out murder. \"After a thorough investigation, FBI investigators concluded that Jeffrey Epstein committed suicide in his cell at the Metropolitan Correctional Center in New York City on August 10, 2019,\" the memo reads. The agencies also denied the existence of a \"client list\" tied to Epstein, directly contradicting earlier remarks by Attorney General Pam Bondi. Bondi had previously suggested on Fox News that such a list was \"sitting on my desk\" for review, igniting speculation about Epstein's possible blackmailing of globalist elites. A photo from 2011 shows (from left) James Staley, Lawrence Summers, Epstein, Bill Gates and Boris Nikolic at the late pedophile’s Manhattan home. Trump has repeatedly sought to dismiss the scandal, accusing Democrats of fabricating a hoax around Epstein to thwart his agenda. Additionally, new questions have emerged about surveillance footage from the night before Epstein's death. An unidentified orange object seen in the surveillance video near the jail cell of deceased pedophile Jeffrey Epstein on the evening before his death has prompted a flurry of questions from forensic experts. The pixelated shape, first witnessed by CBS News, is seen shifting towards Epstein's cell block at the Metropolitan Correctional Center around 10:40 p.m.The object was a corrections officer \"carrying linen or inmate clothing,\" according to federal investigators. However, experts told CBS News that it could in fact be an inmate wearing a jumpsuit. \"Based on the limited video, it's more likely a person in an [orange] uniform,\" Conor McCourt, forensic video expert, said in a statement. \"To say that there's no way that someone could get to that, the stairs up to his room, without being seen is false,\" Jim Safford, another forensic expert, told the news network. Epstein was discovered deceased in his cell on August 10, 2019. An official autopsy, corroborated by a joint investigation from the Department of Justice and FBI, concluded that the disgraced financier died by suicide through hanging. Epstein’s home office featured a taxidermied tiger. In a statement to CBS News, the Justice Department's Office of the Inspector General said the footage does not change its conclusion on Epstein's death. \"Our comprehensive assessment of the circumstances over the weeks, days, and hours before Epstein's death included the effects of the longstanding, chronic staffing crisis in the [Bureau of Prisons] and the BOP's failure to provide and maintain quality camera coverage within its facilities,\" the statement to the outlet read. Tyler Durden Tue, 08/05/2025 - 16:40",
    "publishedAt": "2025-08-05T20:40:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.529Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3697c7e7"
  },
  {
    "id": "business-insider-78dae7a0",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Linda Yaccarino is ditching Musk world for weight-loss drugs. It makes total sense.",
    "url": "https://www.businessinsider.com/linda-yaccarino-new-ceo-job-surprise-emed-x-2025-8",
    "summary": "Linda Yaccarino was named CEO of EMed, a telehealth company, a turn for someone who's made her name in media.",
    "fullContent": "Linda Yaccarino was named CEO of EMed, a telehealth company, a turn for someone who's made her name in media.",
    "publishedAt": "2025-08-05T20:35:20.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "78dae7a0"
  },
  {
    "id": "techmeme-33815a10",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Filing: in its ChatGPT lawsuit, the NYT asked OpenAI to produce 120M user chats to analyze how often ChatGPT regurgitates its articles, after OpenAI offered 20M (Ashley Belanger/Ars Technica)",
    "url": "http://www.techmeme.com/250805/p40#a250805p40",
    "summary": "Ashley Belanger / Ars Technica: Filing: in its ChatGPT lawsuit, the NYT asked OpenAI to produce 120M user chats to analyze how often ChatGPT regurgitates its articles, after OpenAI offered 20M — OpenAI is preparing to raise what could be its final defense to stop The New York...",
    "fullContent": "Ashley Belanger / Ars Technica: Filing: in its ChatGPT lawsuit, the NYT asked OpenAI to produce 120M user chats to analyze how often ChatGPT regurgitates its articles, after OpenAI offered 20M — OpenAI is preparing to raise what could be its final defense to stop The New York Times from digging through a spectacularly broad range &hellip;",
    "publishedAt": "2025-08-05T20:35:01.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "33815a10"
  },
  {
    "id": "ndtv-profit-youtube-52fd2560",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Job Loss Due To AI | Report Suggests Record Job Losses Due To AI",
    "url": "https://www.youtube.com/watch?v=j-FlCUw4TZo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T20:34:38.000Z",
    "fetchedAt": "2025-08-06T02:38:46.477Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "52fd2560"
  },
  {
    "id": "bloomberg-politics-2c876176",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Texas Map Battle Threatens to Ignite a Multistate Free-for-All",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-05/texas-map-battle-threatens-to-ignite-a-multistate-free-for-all",
    "summary": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Today, congressional correspondent Erik Wasson looks at the widening fight over House districts. Sign up here and follow us at @bpolitics. Email our editors here.",
    "fullContent": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Today, congressional correspondent Erik Wasson looks at the widening fight over House districts. Sign up here and follow us at @bpolitics. Email our editors here.",
    "publishedAt": "2025-08-05T20:33:56.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "2c876176"
  },
  {
    "id": "business-insider-c70b68e",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Billionaire gaming CEO buys superyacht company that built his and Jeff Bezos' boats",
    "url": "https://www.businessinsider.com/gaming-ceo-gabe-nwell-buys-yacht-company-oceanco-jeff-bezos-2025-8",
    "summary": "Billionaire Gabe Newell acquired Oceanco, the superyacht company behind Jeff Bezos' iconic boat.",
    "fullContent": "Billionaire Gabe Newell acquired Oceanco, the superyacht company behind Jeff Bezos' iconic boat.",
    "publishedAt": "2025-08-05T20:28:22.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "c70b68e"
  },
  {
    "id": "bloomberg-business-youtube-5b3134b8",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Axon Soars, MercadoLibre Profits Miss | Bloomberg Businessweek Daily 8/5/2025",
    "url": "https://www.youtube.com/watch?v=WTsBFBrZJxI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T20:28:12.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5b3134b8"
  },
  {
    "id": "techmeme-e9a352",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Snap Q2: revenue up 9% YoY to $1.34B, vs. $1.35B est., 469M global DAUs, vs. 467M est., and global ARPU of $2.87, vs. $2.90 est.; SNAP drops ~15% after hours (Jonathan Vanian/CNBC)",
    "url": "http://www.techmeme.com/250805/p39#a250805p39",
    "summary": "$1.35B est., 469M global DAUs, vs. 467M est., and global ARPU of $2.87, vs. $2.90 est.; SNAP drops ~15% after hours — Snap shares tanked 15% Tuesday when it reported second-quarter earnings in which global average revenue per user missed expectations.",
    "fullContent": "Jonathan Vanian / CNBC: Snap Q2: revenue up 9% YoY to $1.34B, vs. $1.35B est., 469M global DAUs, vs. 467M est., and global ARPU of $2.87, vs. $2.90 est.; SNAP drops ~15% after hours — Snap shares tanked 15% Tuesday when it reported second-quarter earnings in which global average revenue per user missed expectations.",
    "publishedAt": "2025-08-05T20:28:07.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "e9a352"
  },
  {
    "id": "bloomberg-politics-6b6f9559",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Carney Says He’ll Look at Opportunities to Remove Tariffs on US",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/canada-will-look-at-opportunities-to-remove-tariffs-carney-says",
    "summary": "Prime Minister Mark Carney said Canada will look at whether to remove some counter-tariffs against the US, despite winning an election in which he pledged to fight back against President Donald Trump’s trade war.",
    "fullContent": "Prime Minister Mark Carney said Canada will look at whether to remove some counter-tariffs against the US, despite winning an election in which he pledged to fight back against President Donald Trump’s trade war.",
    "publishedAt": "2025-08-05T20:24:36.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6b6f9559"
  },
  {
    "id": "nyt-business-6559cf93",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "‘Clash of Trades’ Reality Show Aims to Boost Prestige of US Manufacturing",
    "url": "https://www.nytimes.com/2025/08/04/business/clash-of-trades-manufacturing.html",
    "summary": "This reality show is short on scandal, betrayal and tears, and has an unusual aim: elevating U.S. manufacturing.",
    "fullContent": "This reality show is short on scandal, betrayal and tears, and has an unusual aim: elevating U.S. manufacturing.",
    "publishedAt": "2025-08-05T20:22:50.000Z",
    "fetchedAt": "2025-08-06T02:38:36.304Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6559cf93"
  },
  {
    "id": "cnbc-markets-7d3abb81",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Prediction markets see Hassett and Warsh as Fed chair front-runners as Trump talks up the 'Kevins'",
    "url": "https://www.cnbc.com/2025/08/05/prediction-markets-see-hassett-and-warsh-as-fed-chair-frontrunners-as-trump-talks-up-the-kevins.html",
    "summary": "In a wide-ranging interview on CNBC's \"Squawk Box,\" Trump spoke highly of Hassett and Warsh as potential candidates to replace Powell.",
    "fullContent": "In a wide-ranging interview on CNBC's \"Squawk Box,\" Trump spoke highly of Hassett and Warsh as potential candidates to replace Powell.",
    "publishedAt": "2025-08-05T20:21:59.000Z",
    "fetchedAt": "2025-08-06T02:38:35.708Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d3abb81"
  },
  {
    "id": "zerohedge-210f043",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Taibbi: No Doubt Left... Russiagate Was A Cover-Up",
    "url": "https://www.zerohedge.com/political/taibbi-no-doubt-left-russiagate-was-cover",
    "summary": "Taibbi: No Doubt Left... Russiagate Was A Cover-Up div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-summary fi.",
    "fullContent": "Taibbi: No Doubt Left... Russiagate Was A Cover-Up Authored by Matt Taibbi via Racket News, The most infuriatingly complex scandal of all time has just been reduced to a page or two, thanks to another declassified release... It was a cover-up. The Russiagate scandal has long been one of the most convoluted, hard-to-follow news stories of all time. It even has multiple names thanks to its peculiar chronology. From 2016 until April 2019 — while Democrats still held out hope of “presidency-wrecking” revelations that would topple Donald Trump — it was generally known as the Trump-Russia scandal. After Special Counsel Robert Mueller broke the hearts of MSNBC audiences by issuing a report without new indictments, attention began to be cast on the scandal’s fraudulent construction, how it was propped up by political spying, illegal leaks, and WMD-style intelligence fakery. Trump and others began to call it Spygate or the Russia hoax, but the name that stuck was Russiagate. Those of us who covered the story from the start had a difficult time explaining to audiences what it was, as we ourselves didn’t know. Now we do, after a month of disclosures, capped yesterday by the release of an explosive (and inexplicably long-classified) annex to the report of Special Counsel John Durham. Finally, it seems, we can explain how the idea that Donald Trump was “gaffing his way toward treason” through a secret love affair (really!) with Vladimir Putin and extensive “ties” or “links” with Russia suddenly became The Biggest Story in the World in the summer of 2016. “THE KISS”: Media outlets were promoting the “love story” as early as March 2016 It wasn’t the start of a corruption story about Trump, but the cover-up of a still-unresolved Hillary Clinton scandal. This is purely a Clinton corruption story, probably the last in a long line, as neither Bill nor Hillary will have careers when it’s finished, if they stay out of jail. Characteristically, the most powerful political family since the Kennedys won’t just bring many individuals down with them, but whole institutions, as the FBI, the CIA, the presidency of Barack Obama, and a dozen or so of the most celebrated brands in commercial media will see their names blackened forever through association with this idiotic caper. A fair number of those media companies should (and likely will) go out of business. Now, we know. With the help of the declassified Durham material, we can explain the whole affair in three brushstrokes. One, Hillary Clinton and her team apparently hoped to deflect from her email scandal and other problems via a campaign tying Trump to Putin. Two, American security services learned of these plans. Three — and this is the most important part — instead of outing them, authorities used state resources to massively expand and amplify her scheme. The last stage required the enthusiastic cooperation and canine incuriosity of the entire commercial news business, which cheered as conspirators made an enforcement target of Trump, actually an irrelevant bystander. I’ve tiptoed for years around what I believed to be true about this case, worrying some mitigating fact might emerge. Now, there’s no doubt. Hillary Clinton got in a jam, and the FBI, CIA, and the Obama White House got her out of it by setting Trump up. That’s it. It was a cover-up, plain and simple... ... These people just can’t stop lying. The whole thing is one endless lie, the reason for which is now clear. Hillary Clinton got in trouble being dumb, tried to save herself by doing something dumber, and all of American officialdom backed the play. That’s it. A last period of denials awaits, but they’ll fizzle like the rest, after which not much will be left but blunt truth — and hopefully, consequences. Subscribers can read Matt's full, and brilliant, note here... Tyler Durden Tue, 08/05/2025 - 16:20",
    "publishedAt": "2025-08-05T20:20:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.529Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "210f043"
  },
  {
    "id": "experimental-history-2d622892",
    "sourceId": "experimental-history",
    "sourceName": "Experimental History",
    "title": "Bag of words, have mercy on us",
    "url": "https://www.experimental-history.com/p/bag-of-words-have-mercy-on-us",
    "summary": "",
    "fullContent": "OR: Claude will you go to prom with me?",
    "publishedAt": "2025-08-05T20:06:09.000Z",
    "fetchedAt": "2025-08-06T02:40:39.539Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "2d622892"
  },
  {
    "id": "bloomberg-business-youtube-7ba1f336",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump says Tariffs on Chips and Pharma Could Come Soon",
    "url": "https://www.youtube.com/watch?v=vfxDsgmEd7I",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T20:05:05.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7ba1f336"
  },
  {
    "id": "cnbc-markets-1a1728ae",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Axon jumps 16% after TASER maker tops results and boosts outlook on security needs",
    "url": "https://www.cnbc.com/2025/08/05/axon-enterprise-stock-q2-earnings-2025.html",
    "summary": "Axon Enterprise's stock popped 16% after the TASER maker topped Wall Street's estimates and boosted its outlook due to robust demand for its security solutions.",
    "fullContent": "Axon Enterprise's stock popped 16% after the TASER maker topped Wall Street's estimates and boosted its outlook due to robust demand for its security solutions.",
    "publishedAt": "2025-08-05T20:03:50.000Z",
    "fetchedAt": "2025-08-06T02:38:35.708Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1a1728ae"
  },
  {
    "id": "cnbc-markets-2128a0b",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Palantir stock pops 8% after blowout quarter driven by AI, efficiency demand",
    "url": "https://www.cnbc.com/2025/08/05/palantir-stock-earnings-ai-karp.html",
    "summary": "Palantir shares popped more than 8% after the software analytics provider lifted its full-year outlook, benefitting from ongoing AI tailwinds.",
    "fullContent": "Palantir shares popped more than 8% after the software analytics provider lifted its full-year outlook, benefitting from ongoing AI tailwinds.",
    "publishedAt": "2025-08-05T20:03:35.000Z",
    "fetchedAt": "2025-08-06T02:38:35.708Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2128a0b"
  },
  {
    "id": "cnbc-markets-1b4f8b95",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Coinbase shares slide Tuesday as crypto play takes double-digit fall from July record",
    "url": "https://www.cnbc.com/2025/08/05/coinbase-shares-slide-tuesday-as-crypto-play-takes-double-digit-fall-from-july-record.html",
    "summary": "Shares of the cryptocurrency trading platform have collapsed since notching a record on July 18.",
    "fullContent": "Shares of the cryptocurrency trading platform have collapsed since notching a record on July 18.",
    "publishedAt": "2025-08-05T20:01:44.000Z",
    "fetchedAt": "2025-08-06T02:38:35.708Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1b4f8b95"
  },
  {
    "id": "oil-price-409d3686",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Crude Faces Uncertainty as Trump Mulls Sanctions on Russia’s Hidden Fleet",
    "url": "https://oilprice.com/Energy/Oil-Prices/Crude-Faces-Uncertainty-as-Trump-Mulls-Sanctions-on-Russias-Hidden-Fleet.html",
    "summary": "Oil prices remain jittery today as the market digests yet another sanctions-threat targeting Russia. President Trump is said to be mulling new sanctions on Russia’s so-called \"shadow fleet\" of oil tankers if Moscow doesn&#039;t commit to a peace agreement with Ukraine by Friday.",
    "fullContent": "Oil prices remain jittery today as the market digests yet another sanctions-threat targeting Russia. President Trump is said to be mulling new sanctions on Russia’s so-called \"shadow fleet\" of oil tankers if Moscow doesn&#039;t commit to a peace agreement with Ukraine by Friday. Despite many threats, the Trump White House has yet to impose new sanctions on Russia since he took office. Already the Russian economy is incredibly isolated in the West&#039;s eyes, while a growing Kremlin reliance on leading BRICS countries such as China and…",
    "publishedAt": "2025-08-05T20:00:00.000Z",
    "fetchedAt": "2025-08-06T06:59:54.472Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "409d3686"
  },
  {
    "id": "bloomberg-business-youtube-3458e44c",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "US Considers Location Trackers in AI Chips, Officials Say",
    "url": "https://www.youtube.com/watch?v=rMKVFk9S-J4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:58:01.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3458e44c"
  },
  {
    "id": "cnbc-markets-2c1abe71",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Yum Brands is cooking up more than fast food. It's preparing the industry's next CEOs",
    "url": "https://www.cnbc.com/2025/08/05/yum-brands-ceo-training-ground-restaurant-industry.html",
    "summary": "CEOs like Brian Niccol, Kevin Hochman and Julie Felss Masino spent years at Yum Brands before leaving to lead other restaurant companies.",
    "fullContent": "CEOs like Brian Niccol, Kevin Hochman and Julie Felss Masino spent years at Yum Brands before leaving to lead other restaurant companies.",
    "publishedAt": "2025-08-05T19:56:18.000Z",
    "fetchedAt": "2025-08-06T02:38:35.707Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2c1abe71"
  },
  {
    "id": "cnbc-business-2c1abe71",
    "sourceId": "cnbc-business",
    "sourceName": "CNBC Business",
    "title": "Yum Brands is cooking up more than fast food. It's preparing the industry's next CEOs",
    "url": "https://www.cnbc.com/2025/08/05/yum-brands-ceo-training-ground-restaurant-industry.html",
    "summary": "CEOs like Brian Niccol, Kevin Hochman and Julie Felss Masino spent years at Yum Brands before leaving to lead other restaurant companies.",
    "fullContent": "CEOs like Brian Niccol, Kevin Hochman and Julie Felss Masino spent years at Yum Brands before leaving to lead other restaurant companies.",
    "publishedAt": "2025-08-05T19:56:18.000Z",
    "fetchedAt": "2025-08-06T02:38:37.270Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2c1abe71"
  },
  {
    "id": "techmeme-66acc464",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Coinbase adds Embedded Wallets to its mobile SDK, allowing devs to integrate wallets into their apps with minimal code, with support for on-ramps and swaps (Vishal Chawla/The Block)",
    "url": "http://www.techmeme.com/250805/p38#a250805p38",
    "summary": "Vishal Chawla / The Block: Coinbase adds Embedded Wallets to its mobile SDK, allowing devs to integrate wallets into their apps with minimal code, with support for on-ramps and swaps — - Coinbase's developer platform has launched Embedded Wallets, allowing developers to...",
    "fullContent": "Vishal Chawla / The Block: Coinbase adds Embedded Wallets to its mobile SDK, allowing devs to integrate wallets into their apps with minimal code, with support for on-ramps and swaps — - Coinbase's developer platform has launched Embedded Wallets, allowing developers to integrate self-custodial wallets into apps with minimal coding.",
    "publishedAt": "2025-08-05T19:45:01.000Z",
    "fetchedAt": "2025-08-06T02:38:39.211Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "66acc464"
  },
  {
    "id": "the-verge-44566f7d",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Here are the best streaming service deals available right now",
    "url": "https://www.theverge.com/23353629/streaming-deals-netflix-hulu-disney-plus-amazon-prime-video-hbo-max-best-deal-sale",
    "summary": "So far, 2025 has been a great year for watching new, must-see TV shows and movies on subscription services. But if you, like many of us, have more concurrent subscriptions than you care to admit, you’ll agree that keeping up with the latest stuff every month can get expensive.",
    "fullContent": "So far, 2025 has been a great year for watching new, must-see TV shows and movies on subscription services. But if you, like many of us, have more concurrent subscriptions than you care to admit, you’ll agree that keeping up with the latest stuff every month can get expensive. They may not cost as much [&#8230;]",
    "publishedAt": "2025-08-05T19:44:34.000Z",
    "fetchedAt": "2025-08-06T02:38:39.025Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "44566f7d"
  },
  {
    "id": "business-insider-52f61c57",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Andreessen Horowitz fled Delaware and moved to Nevada. It's more about vibes than substance.",
    "url": "https://www.businessinsider.com/a16z-dexit-nevada-llc-corporate-law-differences-2025-8",
    "summary": "Andreessen Horowitz moved its main business entities to Nevada — but the Delaware laws that a16z critiqued didn't really apply to it.",
    "fullContent": "Andreessen Horowitz moved its main business entities to Nevada — but the Delaware laws that a16z critiqued didn't really apply to it.",
    "publishedAt": "2025-08-05T19:41:02.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "52f61c57"
  },
  {
    "id": "business-insider-6bbca1ff",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Sam Altman launches GPT-oss, OpenAI's first open-weight AI language model in over 5 years",
    "url": "https://www.businessinsider.com/openai-gpt-oss-open-weight-llm-ai-model-2025-8",
    "summary": "Sam Altman said that OpenAI's new GPT-oss, comprising a 120b and 20b version, is the &#34;best and most usable open model in the world.&#34;",
    "fullContent": "Sam Altman said that OpenAI's new GPT-oss, comprising a 120b and 20b version, is the &#34;best and most usable open model in the world.&#34;",
    "publishedAt": "2025-08-05T19:40:53.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6bbca1ff"
  },
  {
    "id": "zerohedge-bf6a765",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Waste Of The Day: Senate Furniture Is Missing",
    "url": "https://www.zerohedge.com/political/waste-day-senate-furniture-missing",
    "summary": "Waste Of The Day: Senate Furniture Is Missing div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-summary field--",
    "fullContent": "Waste Of The Day: Senate Furniture Is Missing Authored by Jeremy Portnoy via RealClearInvestigations, Topline: Over the last decade, more than half the Senate office furniture purchased have some unanswered question attached to them - including where the furniture is located. The Architect of the Capitol’s Senate Furniture Program “needs significant improvements,” and its “processes for acquiring, safeguarding, transferring, and disposing of furniture are inefficient and ineffective,” according to a new audit from the Architect of the Capitol’s inspector general. Key facts: The Architect is responsible for maintaining the buildings and grounds on Capitol Hill, but it typically only buys furniture for Senate office buildings. The office bought 29,603 pieces of furniture from 2014 to 2024, costing taxpayers $22.6 million. “A minimum” of 13,159 pieces of furniture (51%) have \"erroneous information,” according to the audit. Some mistakes are minor — an incorrect tag number or description — but others are much larger, including that no one knows where the furniture is, how much it cost, or both. First, auditors randomly selected a piece of furniture listed in the Architect’s computer catalog, but staffers were unable to locate it. The only clue showing the furniture’s location was a handwritten note from 2012, but the furniture was not actually at that location. Next, the auditors randomly selected another piece of furniture. Architect staffers were able to find this one, but not any documents showing its cost — they had been lost in a flood. Finally, auditors allowed Architect staffers to choose the piece of furniture that would be reviewed by the inspector general. Still, auditors found five issues with the hand-selected piece of furniture, including forms with missing signatures and conflicting dollar costs on different documents. Overall, auditors reviewed 138 pieces of furniture but were unable to locate 71 of them. The Architect leases building space to store extra furniture, but the buildings are poorly maintained and are sometimes unusable, according to the audit. The Architect is also buying too many items. There are “several dozen” microwaves in storage to eventually replace the current microwaves, but the extras may be “obsolete” before they are needed. Staffers have also been leaving furniture unattended in hallways, which will make it harder to prevent theft, according to the audit. Search all federal, state and local salaries and vendor spending with the world’s largest government spending database at OpenTheBooks.com. Summary: After the federal government’s $3.3 billion spending spree on furniture during the Covid-19 pandemic, it’s no wonder officials are having trouble keeping track of it all. The #WasteOfTheDay is brought to you by the forensic auditors at OpenTheBooks.com Tyler Durden Tue, 08/05/2025 - 15:40",
    "publishedAt": "2025-08-05T19:40:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.529Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "bf6a765"
  },
  {
    "id": "cnbc-markets-3b6248e",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump’s ‘big beautiful bill’ slashes this tax break for high earners in 2026",
    "url": "https://www.cnbc.com/2025/08/05/trump-big-beautiful-bill-charitable-deduction.html",
    "summary": "President Donald Trump's \"big beautiful bill\" could reduce the deduction on charitable donations for higher earners in 2026. Here's what to know.",
    "fullContent": "President Donald Trump's \"big beautiful bill\" could reduce the deduction on charitable donations for higher earners in 2026. Here's what to know.",
    "publishedAt": "2025-08-05T19:39:13.000Z",
    "fetchedAt": "2025-08-06T02:38:35.707Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b6248e"
  },
  {
    "id": "business-insider-4c9902fa",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "The big question inside Disney: What's going to happen to Hulu?",
    "url": "https://www.businessinsider.com/disney-hulu-future-streaming-employees-ad-revenue-growth-espn-2025-8",
    "summary": "Disney's quest to make Disney+ a streaming superpower raises questions about Hulu. &#34;Internally, the Hulu brand isn't a priority,&#34; an employee said.",
    "fullContent": "Disney's quest to make Disney+ a streaming superpower raises questions about Hulu. &#34;Internally, the Hulu brand isn't a priority,&#34; an employee said.",
    "publishedAt": "2025-08-05T19:35:31.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c9902fa"
  },
  {
    "id": "business-insider-72247cb2",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "AIM-120 missile demand is surging. The Pentagon just signed a $3.5 billion deal to keep up.",
    "url": "https://www.businessinsider.com/pentagon-award-air-to-air-missiles-surging-demand-thin-stockpiles-2025-8",
    "summary": "With demand spiking from Ukraine to the Pacific, the US is racing to ramp up production.",
    "fullContent": "With demand spiking from Ukraine to the Pacific, the US is racing to ramp up production.",
    "publishedAt": "2025-08-05T19:35:29.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "72247cb2"
  },
  {
    "id": "ndtv-profit-youtube-11dd0807",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Israel Gaza War | 'I Pretended To Be Dead': Hamas Attack Survivor On NDTV",
    "url": "https://www.youtube.com/watch?v=xaKSmMbr_3s",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:29:18.000Z",
    "fetchedAt": "2025-08-06T02:38:46.477Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "11dd0807"
  },
  {
    "id": "ndtv-profit-youtube-541ebc20",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "'Scars On Walls, Echoes Of Fear': Former IDF Spokesperson On NDTV",
    "url": "https://www.youtube.com/watch?v=7nD1hizPz8Q",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:28:04.000Z",
    "fetchedAt": "2025-08-06T02:38:46.477Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "541ebc20"
  },
  {
    "id": "nyt-technology-5141c9c8",
    "sourceId": "nyt-technology",
    "sourceName": "NYT Technology",
    "title": "OpenAI to Open-Source Some of the A.I. Systems Behind ChatGPT",
    "url": "https://www.nytimes.com/2025/08/05/technology/openai-artificial-intelligence-chatgpt.html",
    "summary": "In a major shift, the company is “open sourcing” two A.I. systems, freely sharing the technology with outside researchers and businesses.",
    "fullContent": "In a major shift, the company is “open sourcing” two A.I. systems, freely sharing the technology with outside researchers and businesses.",
    "publishedAt": "2025-08-05T19:27:50.000Z",
    "fetchedAt": "2025-08-06T02:38:36.312Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5141c9c8"
  },
  {
    "id": "ndtv-profit-youtube-3f186ea0",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Israel Gaza War | Israel's 'Occupy Gaza' Plan?: NDTV On The Frontline",
    "url": "https://www.youtube.com/watch?v=ljws87CQ2gA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:24:22.000Z",
    "fetchedAt": "2025-08-06T02:38:46.477Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3f186ea0"
  },
  {
    "id": "bloomberg-politics-190b89d4",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Family-Advised SPAC Drops Mention of Seeking Government Perks",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/spac-advised-by-trump-s-sons-snips-mention-of-federal-incentives",
    "summary": "Donald Trump Jr. and Eric Trump will advise a new company that’s looking to take over a US-based manufacturer, the latest in a string of such positions for President Donald Trump’s eldest sons.",
    "fullContent": "Donald Trump Jr. and Eric Trump will advise a new company that’s looking to take over a US-based manufacturer, the latest in a string of such positions for President Donald Trump’s eldest sons.",
    "publishedAt": "2025-08-05T19:23:49.000Z",
    "fetchedAt": "2025-08-06T02:38:36.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "190b89d4"
  },
  {
    "id": "bloomberg-business-youtube-4a89957c",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "AI Fuels Palantir’s Unstoppable Rally | Open Interest 8/5/2025",
    "url": "https://www.youtube.com/watch?v=9OKpdO7_V1o",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:23:37.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4a89957c"
  },
  {
    "id": "bloomberg-business-youtube-19c3eb29",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Says Pharma, Chips Tariffs Coming | Balance of Power: Early Edition 8/5/2025",
    "url": "https://www.youtube.com/watch?v=ipDVv-paYZg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:20:52.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "19c3eb29"
  },
  {
    "id": "cnbc-markets-54f2b9a1",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "We're upgrading Eaton as shares of the industrial AI winner fall on earnings",
    "url": "https://www.cnbc.com/2025/08/05/were-upgrading-eaton-as-shares-of-the-industrial-ai-winner-fall-on-earnings.html",
    "summary": "",
    "fullContent": "The stock's sell-off on Thursday is excessive.",
    "publishedAt": "2025-08-05T19:20:03.000Z",
    "fetchedAt": "2025-08-06T02:38:35.708Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "54f2b9a1"
  },
  {
    "id": "zerohedge-2759687",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Crude Jittery As Trump Mulls New Sanctions On Russia's 'Shadow Fleet'",
    "url": "https://www.zerohedge.com/energy/oil-prices-jump-trumps-mulling-new-sanctions-russias-shadow-fleet",
    "summary": "Crude Jittery As Trump Mulls New Sanctions On Russia's 'Shadow Fleet' div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-t.",
    "fullContent": "Crude Jittery As Trump Mulls New Sanctions On Russia's 'Shadow Fleet' Oil prices remain jittery today as the market digests yet another sanctions-threat targeting Russia. President Trump is said to be mulling new sanctions on Russia’s so-called \"shadow fleet\" of oil tankers if Moscow doesn't commit to a peace agreement with Ukraine by Friday. Despite many threats, the Trump White House has yet to impose new sanctions on Russia since he took office. Already the Russian economy is incredibly isolated in the West's eyes, while a growing Kremlin reliance on leading BRICS countries such as China and India has emerged. Postimees/Scanpix Baltics via Reuters Connect: On November 4, 2025, Estonian authorities detained an oil tanker that formed part of Russia's \"shadow fleet\" and that had been sailing through Estonian waters in the Gulf of Finland. Both of these countries have said they don't plant to change course on Russian energy, even in the face of secondary sanctions which are being dangled by Washington. Financial Times describes that oil sales from this 'shadow fleet' has been a key source of funding for the Kremlin's war machine: The “shadow fleet” consists of ships with obscure ownership structures that avoid Western services like insurance and logistics, making it difficult to penalize the owners directly. However, recent efforts to sanction the ships themselves have shown some success. According to two individuals familiar with White House discussions, sanctions on the shadow fleet are viewed as a relatively straightforward way to increase pressure on Russia. A third source close to the administration confirmed that broader sanctions options, including targeting the fleet, are under review. There are existing Biden era sanctions on over 200 named Russian crude, chemical, and product tankers. Trump has reportedly held back on expanding these sanctions on hopes of achieving ceasefire in Ukraine. Russia has until Friday, sources cited in the FT say. \"If enacted, additional U.S. measures would reinforce similar efforts by the European Union. Last month, the EU added over 100 ships to its sanctions list, raising the total to 415.\" This has done nothing to deter Putin's 'Special Military Operation' in Ukraine. In many ways the West is out of 'solutions' as it has sanctioned Russia to unprecedented levels - and yet this has done little. The ultimate answer from Moscow's point of view remains significant territorial concessions by Kiev and a clear binding pledge to never join NATO. And yet the Zelensky government has refused. Tyler Durden Tue, 08/05/2025 - 15:20",
    "publishedAt": "2025-08-05T19:20:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.529Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2759687"
  },
  {
    "id": "aswath-damodaran-youtube-3520b2c9",
    "sourceId": "aswath-damodaran-youtube",
    "sourceName": "Aswath Damodaran YouTube",
    "title": "The Imitation Game: Defending against AI's Dark Side!",
    "url": "https://www.youtube.com/watch?v=OEQ7Bpi01cA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:20:00.000Z",
    "fetchedAt": "2025-08-06T02:38:52.947Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3520b2c9"
  },
  {
    "id": "ndtv-profit-youtube-5ba3af94",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Fireworks Display Goes Wrong In Japan As Pyrotechnics Set Fire To Launch Barges",
    "url": "https://www.youtube.com/shorts/jG8QAtIi7Pg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:14:38.000Z",
    "fetchedAt": "2025-08-06T02:38:46.477Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5ba3af94"
  },
  {
    "id": "ft-markets-258cbde7",
    "sourceId": "ft-markets",
    "sourceName": "Financial Times Markets",
    "title": "FCA fines Neil Woodford and his company £46mn for management failures",
    "url": "https://www.ft.com/content/e9372527-1c88-4905-86f4-3b8978fd2baa",
    "summary": "UK regulator bans former star manager but it is unclear how his company would pay its £40mn penalty.",
    "fullContent": "UK regulator bans former star manager but it is unclear how his company would pay its £40mn penalty",
    "publishedAt": "2025-08-05T19:13:22.000Z",
    "fetchedAt": "2025-08-06T02:38:36.427Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "258cbde7"
  },
  {
    "id": "cnbc-markets-4426c5a9",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump says JPMorgan Chase, Bank of America rejected him as a customer",
    "url": "https://www.cnbc.com/2025/08/05/trump-jpmorgan-chase-bank-of-america-rejected-bank-customer.html",
    "summary": "President Donald Trump said Tuesday that the two largest U.S. banks rejected him as a bank customer, reviving claims of debanking against conservatives.",
    "fullContent": "President Donald Trump said Tuesday that the two largest U.S. banks rejected him as a bank customer, reviving claims of debanking against conservatives.",
    "publishedAt": "2025-08-05T19:12:51.000Z",
    "fetchedAt": "2025-08-06T02:38:35.708Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4426c5a9"
  },
  {
    "id": "business-insider-bf577bb",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Why ESPN and Fox don't want their new streamers to be massive hits",
    "url": "https://www.businessinsider.com/espn-fox-new-streaming-service-cost-cable-why-2025-8",
    "summary": "Fox and ESPN were holdouts in the streaming wars. They'll both launch their own services this month. But they're trying to temper expectations.",
    "fullContent": "Fox and ESPN were holdouts in the streaming wars. They'll both launch their own services this month. But they're trying to temper expectations.",
    "publishedAt": "2025-08-05T19:11:33.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "bf577bb"
  },
  {
    "id": "zerohedge-60eb058b",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "White House Order To Punish Banks That Discriminate Against Conservatives, Crypto Companies",
    "url": "https://www.zerohedge.com/political/white-house-order-punish-banks-discriminate-against-conservatives-crypto-companies",
    "summary": "White House Order To Punish Banks That Discriminate Against Conservatives, Crypto Companies div property=\"schema:text\" class=\"clearfix text-formatted field field--n.",
    "fullContent": "White House Order To Punish Banks That Discriminate Against Conservatives, Crypto Companies The White House is about to unveil a new executive order that would punish big banks who discriminate against conservatives and crypto companies. A draft of the order seen by the WSJ directs bank regulators to investigate whether any financial institutions may have violated the Equal Credit Opportunity Act, antitrust laws, or consumer financial protection laws - with violators facing monetary penalties, consent decrees or other disciplinary measures, according to the draft. People familiar with the EO told the Journal that it could be signed as soon as this week, though the order could become delayed or the administration's plans may change. The draft order doesn’t name any specific banks but appears to refer to an instance where Bank of America was accused of shutting down the accounts of a Christian organization operating in Uganda based on the organization’s religious beliefs. The bank has said it shut down the accounts because it doesn’t serve small businesses operating outside the U.S. The draft order also criticizes the role that some banks played in an investigation into the Jan. 6, 2021, riots at the U.S. Capitol. -WSJ As Cointelegraph notes, conservatives have also claimed that banks have denied them services based on political beliefs. The banking industry calls the practice “derisking,” and financial institutions have broad discretion to close accounts, whether the account holder poses a legal, financial or reputational risk to the firm. The Federal Reserve said in June that it would stop examining for reputational risk following similar moves made by the Office of the Comptroller of the Currency and the FDIC. Crypto, meanwhile, was long in the crosshairs of the Biden administration - in what industry executives have alleged was an effort to cut crypto off from the financial system by using regulators to pressure banks into backing away from clients involved in digital assets. As the outlet reports further, the reported draft order directs bank regulators to scrap any of their policies that may have contributed to banks dropping some customers, such as crypto firms. It also directs the US government’s Small Business Administration to review banking practices that guarantee the loans made by the agency to small businesses. The order asks regulators to refer some of the potential violations to the attorney general for the Department of Justice to follow up. The Journal reported in June that the White House was planning for Trump to sign a similar order aiming at stopping banks from cutting off services to industries such as crypto. “Operation Choke Point 2.0” claims Crypto executives have claimed that former President Joe Biden began to cut off their industry from banking in late 2022 after the collapse of FTX, with the crypto exchange being revealed as a massive fraud. Coinbase chief legal officer Paul Grewal testified at a Congressional hearing in February that the Biden-era Federal Deposit Insurance Corporation (FDIC) “bludgeoned the banks” with examinations and questions around crypto and stablecoins until they “relented under the pressure.” A Coinbase-supported Freedom of Information Act lawsuit against the FDIC showed the agency asked certain financial institutions to pause crypto banking activities, which Grewal said showed the industry’s claim “wasn’t just some crypto conspiracy theory.” Crypto venture capitalist Nic Carter coined the term “Operation Choke Point 2.0” in February 2023 to describe the perceived debanking phenomenon, taking inspiration from the Justice Department’s “Operation Choke Point” against banks and payday lenders in the 2010s. Tyler Durden Tue, 08/05/2025 - 15:11",
    "publishedAt": "2025-08-05T19:11:00.000Z",
    "fetchedAt": "2025-08-06T02:38:37.530Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "60eb058b"
  },
  {
    "id": "bloomberg-business-youtube-a9690a1",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "AI is helping more deals get done, says Goldman's Mehrotra",
    "url": "https://www.youtube.com/shorts/OCOwIFQRj-o",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-05T19:10:12.000Z",
    "fetchedAt": "2025-08-06T02:38:49.704Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "a9690a1"
  },
  {
    "id": "marginal-revolution-25e3e664",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "Peter Temin, RIP…",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/peter-temin-rip.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=peter-temin-rip",
    "summary": "Alas…one of the greats in economic history… The post Peter Temin, RIP… appeared first on Marginal REVOLUTION.",
    "fullContent": "Alas…one of the greats in economic history… The post Peter Temin, RIP… appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-05T19:07:31.000Z",
    "fetchedAt": "2025-08-06T02:38:37.553Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "25e3e664"
  },
  {
    "id": "business-insider-25928868",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "A sports dietitian shares 6 meals and snacks she eats for stronger muscles and more energy",
    "url": "https://www.businessinsider.com/sports-dietitian-diet-muscle-growth-energy-recovery-protein-fiber-2025-8",
    "summary": "Roxana Ehsani, a sports dietitian, gets protein and fiber from sheet pan dinners and chia seed pudding.",
    "fullContent": "Roxana Ehsani, a sports dietitian, gets protein and fiber from sheet pan dinners and chia seed pudding.",
    "publishedAt": "2025-08-05T19:05:57.000Z",
    "fetchedAt": "2025-08-06T02:38:35.929Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "25928868"
  }
]