[
  {
    "id": "jacobin-magazine-68f2a28b",
    "sourceId": "jacobin-magazine",
    "sourceName": "Jacobin Magazine",
    "title": "Who Gets a “Right of Return”?",
    "url": "https://jacobin.com/2025/08/right-of-return-arkansas-zionism/",
    "summary": "The Forward has been running a series of articles about a group in northern Arkansas that owns adjacent tracts of land that Jews and non-whites are forbidden to purchase or live on. On Thursday, the attorney general of Arkansas said this was legal.",
    "fullContent": "The Forward has been running a series of articles about a group in northern Arkansas that owns adjacent tracts of land that Jews and non-whites are forbidden to purchase or live on. On Thursday, the attorney general of Arkansas said this was legal. The details are complicated — mostly focused on the fact that there’s [&hellip;]",
    "publishedAt": "2025-08-04T19:01:06.000Z",
    "fetchedAt": "2025-08-05T02:44:49.692Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "68f2a28b"
  },
  {
    "id": "bloomberg-business-youtube-1c51d633",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Is #Trump playing 4D chess? A grandmaster explains #politics #shorts",
    "url": "https://www.youtube.com/shorts/ufi9bQrVq18",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T19:00:57.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1c51d633"
  },
  {
    "id": "ndtv-profit-rss-4274e8fe",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Women In Leadership: Why We Need More Female Speakers In Industry Conferences",
    "url": "https://www.ndtvprofit.com/opinion/women-in-leadership-why-we-need-more-female-speakers-in-industry-conferences",
    "summary": "Over the years, whether attending conferences or speaking at them, I’ve noticed how often the leadership narrative is visually and vocally dominated by men.",
    "fullContent": "Over the years, whether attending conferences or speaking at them, I’ve noticed how often the leadership narrative is visually and vocally dominated by men.",
    "publishedAt": "2025-08-04T19:00:33.717Z",
    "fetchedAt": "2025-08-05T02:40:14.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4274e8fe"
  },
  {
    "id": "oil-price-1bdfc0d1",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Strikes on Iran Force Tashkent to Bet on Risky Afghan Corridor",
    "url": "https://oilprice.com/Geopolitics/Asia/Strikes-on-Iran-Force-Tashkent-to-Bet-on-Risky-Afghan-Corridor.html",
    "summary": "The American and Israeli attacks on Iran to “obliterate” its nuclear program have hit another target: Central Asia’s opportunity to use Iran’s transport links to trade with the wider world. The American and Israeli attacks made an impression in Central Asia as immediately...",
    "fullContent": "The American and Israeli attacks on Iran to “obliterate” its nuclear program have hit another target: Central Asia’s opportunity to use Iran’s transport links to trade with the wider world. The American and Israeli attacks made an impression in Central Asia as immediately afterwards Uzbekistan’s President Shavkat Mirziyoyev “ordered a review of foreign trade and transport routes, emphasizing the need to redirect cargo flows to safer ports amid instability in the Middle East,” changes that could raise logistics…",
    "publishedAt": "2025-08-04T19:00:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.976Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "1bdfc0d1"
  },
  {
    "id": "yahoo-finance-574d86c5",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Crypto Company Bullish to Raise Up to $629M in IPO",
    "url": "https://finance.yahoo.com/news/crypto-company-bullish-raise-629m-185748750.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:57:48.000Z",
    "fetchedAt": "2025-08-06T06:59:52.110Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "574d86c5"
  },
  {
    "id": "cnbc-markets-3d916d4b",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Tesla awards Musk $29 billion in shares with prior pay package in limbo",
    "url": "https://www.cnbc.com/2025/08/04/tesla-stock-musk-pay.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:56:11.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3d916d4b"
  },
  {
    "id": "cnbc-markets-4880e57b",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Tesla awards Musk $29 billion in shares with prior pay package in limbo",
    "url": "https://www.cnbc.com/2025/08/04/tesla-stock-musk-pay.html",
    "summary": "The legal battle over Musk's $56 billion 2018 pay package is before the Delaware Supreme Court.",
    "fullContent": "The legal battle over Musk's $56 billion 2018 pay package is before the Delaware Supreme Court.",
    "publishedAt": "2025-08-04T18:56:11.000Z",
    "fetchedAt": "2025-08-05T11:27:53.401Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4880e57b"
  },
  {
    "id": "yahoo-finance-6b9ab701",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Tyson Foods hasn't seen 'material' impact from Trump tariffs as consumer protein push lifts results",
    "url": "https://finance.yahoo.com/news/tyson-foods-hasnt-seen-material-impact-from-trump-tariffs-as-consumer-protein-push-lifts-results-185332266.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:53:32.000Z",
    "fetchedAt": "2025-08-06T06:59:52.110Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6b9ab701"
  },
  {
    "id": "marginal-revolution-1df475fb",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "What is superintelligence?",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/what-is-superintelligence.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-is-superintelligence",
    "summary": "The Free Press ran a symposium on that topic, I was a contributor. Here is the closing part of mine: &#8220;I asked o3 pro, a leading AI model from OpenAI, “What is superintelligence?” Here is the opening to a much longer answer: Superintelligence is a term most commonly used in...",
    "fullContent": "The Free Press ran a symposium on that topic, I was a contributor. Here is the closing part of mine: &#8220;I asked o3 pro, a leading AI model from OpenAI, “What is superintelligence?” Here is the opening to a much longer answer: Superintelligence is a term most commonly used in artificial intelligence (AI) studies and [&#8230;] The post What is superintelligence? appeared first on Marginal REVOLUTION. ]]",
    "publishedAt": "2025-08-04T18:49:01.000Z",
    "fetchedAt": "2025-08-05T02:40:13.413Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "1df475fb"
  },
  {
    "id": "marginal-revolution-3c0f53b1",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "What is superintelligence?",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/what-is-superintelligence.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-is-superintelligence",
    "summary": "The Free Press ran a symposium on that topic, I was a contributor. Here is the closing part of mine: &#8220;I asked o3 pro, a leading AI model from OpenAI, “What is superintelligence?” Here is the opening to a much longer answer: Superintelligence is a term most commonly used in...",
    "fullContent": "The Free Press ran a symposium on that topic, I was a contributor. Here is the closing part of mine: &#8220;I asked o3 pro, a leading AI model from OpenAI, “What is superintelligence?” Here is the opening to a much longer answer: Superintelligence is a term most commonly used in artificial intelligence (AI) studies and [&#8230;] The post What is superintelligence? appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-04T18:49:01.000Z",
    "fetchedAt": "2025-08-05T11:27:54.388Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "3c0f53b1"
  },
  {
    "id": "et-markets-9eaf3c9",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-approves-rajiv-anand-as-md-ceo-of-indusind-bank/articleshow/123106120.cms",
    "summary": "![CDATA[The Reserve Bank of India has approved Rajiv Anand's appointment as MD & CEO of IndusInd Bank, effective August 25, for a three-year term. Anand, formerly Deputy Managing Director at Axis Bank, brings over 35 years of financial services experience.",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:48:56.000Z",
    "fetchedAt": "2025-08-05T02:40:11.853Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "9eaf3c9"
  },
  {
    "id": "cnbc-markets-4735bdcc",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "OpenAI’s ChatGPT to hit 700 million weekly users, up 4x from last year",
    "url": "https://www.cnbc.com/2025/08/04/openai-chatgpt-700-million-users.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:46:48.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4735bdcc"
  },
  {
    "id": "cnbc-markets-3de56c72",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "OpenAI’s ChatGPT to hit 700 million weekly users, up 4x from last year",
    "url": "https://www.cnbc.com/2025/08/04/openai-chatgpt-700-million-users.html",
    "summary": "The milestone follows a $8.3 billion raise from top investors, including Dragoneer Investment Group, Andreessen Horowitz and Sequoia Capital.",
    "fullContent": "The milestone follows a $8.3 billion raise from top investors, including Dragoneer Investment Group, Andreessen Horowitz and Sequoia Capital.",
    "publishedAt": "2025-08-04T18:46:48.000Z",
    "fetchedAt": "2025-08-05T11:27:53.401Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3de56c72"
  },
  {
    "id": "business-insider-38335a5d",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "As a plant-based nutritionist, I swear by these healthy meals to prep my son's school lunches and dinners",
    "url": "https://www.businessinsider.com/nutritionist-backed-easy-lunches-dinners-for-back-to-school-2025-8",
    "summary": "Dana Ellis Hunnes says simplifying her family's food choices and batch cooking on weekends reduces stress during the hectic back-to-school season.",
    "fullContent": "Dana Ellis Hunnes says simplifying her family's food choices and batch cooking on weekends reduces stress during the hectic back-to-school season.",
    "publishedAt": "2025-08-04T18:45:27.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "38335a5d"
  },
  {
    "id": "zerohedge-e3580cc",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Don't Overlook Hillary Clinton",
    "url": "https://www.zerohedge.com/political/dont-overlook-hillary-clinton",
    "summary": "Don't Overlook Hillary Clinton div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-summary field--label-hidden fi.",
    "fullContent": "Don't Overlook Hillary Clinton Authored by Kenin Spivak via RealClearPolitics, Before Barack Obama’s CIA Director John Brennan and 50 other intelligence analysts deceived Americans in the run-up to the 2020 election by warning that Hunter Biden’s laptop had “all the earmarks of a classic Russian information operation” – and before Obama, Brennan, Obama’s FBI Director James Comey, and National Intelligence Director James Clapper falsified an Intelligence Community Assessment in December 2016 to destabilize Donald Trump’s first term – there was Hillary Clinton. The media’s focus these days is on President Trump’s possible cameo in the so-called “Epstein files” and Obama’s role in advancing the Russia collusion hoax. These stories crossed when DNI Tulsi Gabbard and CIA Director John Ratcliffe released compelling evidence that six weeks before his term concluded, Obama pressed the intelligence community to ignore its previous assessments and instead rely on the sham Steele dossier and an ambiguous and unverifiable sentence fragment to smear Trump and undermine his presidency before it began. But let’s not forget the Clinton campaign’s role in this kabuki dance. Clinton, not Obama, was Trump’s opponent in the 2016 election. As we learned last week from the declassification of reports issued by Gabbard and Senate Judiciary Committee Chairman Chuck Grassley, the weight of the heretofore concealed evidence is that if Putin had a preference, it was most likely Clinton – not the wildcard first-time officeholder who surprised the world by winning. According to the now declassified September 2020 majority staff report of the House Permanent Select Committee on Intelligence, Putin’s principal goal was to undermine faith in the U.S. democratic process, not help any particular candidate. Thus, he chose not to leak the most compromising allegations about Clinton, presumably so that he could later use them to weaken her expected presidency. If Russia really wanted to help Trump, the purported information – whether true or not – would have been released during the campaign. The intelligence community and media, which did have a clear favorite in 2016, carefully hid the compromising accusations, including secret meetings in which State Department representatives are alleged to have unlawfully offered assistance to religious groups in exchange for their support in the 2016 election, along with emails from Democratic National Committee officials describing Clinton’s “psycho-emotional problems,” including “uncontrolled fits of anger, aggression, and cheerfulness.” Clinton was said by these sources to be on a daily regimen of “heavy tranquilizers.” Recently declassified intelligence files show that Clinton authorized the bogus Steele dossier during the 2016 campaign to deflect attention from her use of a private email server while serving as secretary of state, and to discredit Trump. Obama, his senior intelligence team and Democratic leadership used the dossier to push the dishonest Russia narrative, Trump’s first impeachment, and a largely successful effort to block his first-term agenda. Just a year earlier, a bombshell New York Times report disclosed that Clinton breached core security protocols by exclusively using a private email server during her tenure as secretary of state. She may have done so to shield emails about improper Clinton Foundation fundraising efforts, her hiring of private consultants, and other political conflicts. In a highly inappropriate press conference before the 2016 election, Jim Comey took it upon himself to excuse Clinton’s security lapses, curiously asserting that “no reasonable prosecutor” would bring a criminal case. An investigation led by Chairman Grassley found that Comey intended to exonerate Clinton even before the FBI interviewed her. On July 21, 2025, Grassley released a long buried June 2018 FBI Inspector General report that concluded the FBI never fully investigated Clinton’s use of the private server. Further, contrary to sound investigative protocols, witnesses were permitted to attend each other’s depositions, and no action was taken when Clinton’s lawyers accessed confidential information, or when her aides used hammers to destroy BlackBerry phones and BleachBit software to erase the emails. According to Grassley, then-DNC chairman Debbie Wasserman Schultz confirmed that Obama scuttled the investigation to protect Clinton’s candidacy. When Clinton served as Obama’s secretary of state, foreign governments and corporations donated hundreds of millions of dollars to the Clinton Foundation and paid Bill Clinton premium prices for speeches, including governments that obtained substantial State Department assistance. Clinton personally attended meetings with foundation donors and sought favors for them, a practice begun when she was New York’s junior senator. Bill Clinton’s White House run was rocked by allegations over investments Bill and Hillary made in the Whitewater Development Corporation. Despite the disappearance of key documents from the White House private quarters, evidence of Hillary’s questionable activities, and the conviction of one of their business partners, neither Clinton faced prosecution. In 1978 and 1979, while first lady of Arkansas, Clinton invested $1,000 in cattle futures, generating almost $100,000 in profit in less than a year. Despite suspicions suggesting that the profits were disguised pay-offs from Tyson Foods and the improbability of such returns, there was no official investigation. While Hillary Clinton’s time on the national stage may be sunsetting, she remains the epitome of the disparate standards to which Republicans and Democrats are held by American elites. Kenin M. Spivak is founder and chairman of SMI Group LLC, an international consulting firm and investment bank. He is the author of fiction and non-fiction books and a frequent speaker and contributor to media, including RealClearPolitics, The American Mind, National Review, television, radio, and podcasts. Tyler Durden Mon, 08/04/2025 - 14:45",
    "publishedAt": "2025-08-04T18:45:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.183Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "e3580cc"
  },
  {
    "id": "nyt-business-999f5f5",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Tesla Grants Musk $29 Billion in Stock to Keep ‘Elon’s Energies Focused’",
    "url": "https://www.nytimes.com/2025/08/04/business/tesla-elon-musk-29-billion.html",
    "summary": "The “interim” package announced on Monday was intended to help retain Elon Musk, whose previous pay plan was invalidated by a judge.",
    "fullContent": "The “interim” package announced on Monday was intended to help retain Elon Musk, whose previous pay plan was invalidated by a judge.",
    "publishedAt": "2025-08-04T18:44:55.000Z",
    "fetchedAt": "2025-08-05T02:40:12.740Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "999f5f5"
  },
  {
    "id": "ndtv-profit-rss-6ed1755",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "FSIB Suggests 11 Chief General Managers For Posts Of Executive Directors In State-Owned Banks",
    "url": "https://www.ndtvprofit.com/economy-finance/fsib-suggests-11-chief-general-managers-for-posts-of-executive-directors-in-state-owned-banks",
    "summary": "Keeping in view their performance in the interface, their overall experience and the extant parameters, the Bureau recommended 11 names for the panel of EDs for year 2025-26, FSIB said in a statement.",
    "fullContent": "Keeping in view their performance in the interface, their overall experience and the extant parameters, the Bureau recommended 11 names for the panel of EDs for year 2025-26, FSIB said in a statement.",
    "publishedAt": "2025-08-04T18:44:20.322Z",
    "fetchedAt": "2025-08-05T02:40:14.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6ed1755"
  },
  {
    "id": "yahoo-finance-76330d7e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "AMD to report Q2 earnings as Wall Street looks to AI, PC sales growth",
    "url": "https://finance.yahoo.com/news/amd-to-report-q2-earnings-as-wall-street-looks-to-ai-pc-sales-growth-184349343.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:43:49.000Z",
    "fetchedAt": "2025-08-05T09:18:57.587Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "76330d7e"
  },
  {
    "id": "ndtv-profit-rss-4df20118",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Challenges To PMLA: CJI To Speak With Justice Surya Kant On Listing Of Review, Other Pleas",
    "url": "https://www.ndtvprofit.com/law-and-policy/challenges-to-pmla-cji-to-speak-with-justice-surya-kant-on-listing-of-review-other-pleas",
    "summary": "In 2022, the top court in Vijay Madanlal Choudhary case upheld the key provisions of the Prevention of Money Laundering Act.",
    "fullContent": "In 2022, the top court in Vijay Madanlal Choudhary case upheld the key provisions of the Prevention of Money Laundering Act.",
    "publishedAt": "2025-08-04T18:43:13.021Z",
    "fetchedAt": "2025-08-05T02:40:14.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4df20118"
  },
  {
    "id": "ndtv-profit-rss-350bf8d7",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "AgustaWestland: CBI, ED Oppose Christian Michel’s Plea For Release",
    "url": "https://www.ndtvprofit.com/law-and-policy/agustawestland-cbi-ed-oppose-christian-michels-plea-for-release",
    "summary": "Special public prosecutor and senior advocate D P Singh submitted that James could not be released on the ground as the term undergone in custody couldn't be considered complete at the present stage.",
    "fullContent": "Special public prosecutor and senior advocate D P Singh submitted that James could not be released on the ground as the term undergone in custody couldn't be considered complete at the present stage.",
    "publishedAt": "2025-08-04T18:42:12.631Z",
    "fetchedAt": "2025-08-05T02:40:14.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "350bf8d7"
  },
  {
    "id": "ndtv-profit-rss-534d947e",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Supreme Court Order Paves Way For Holding Local Body Polls With 27% OBC Quota: Fadnavis",
    "url": "https://www.ndtvprofit.com/law-and-policy/supreme-court-order-paves-way-for-holding-local-body-polls-with-27-obc-quota-fadnavis",
    "summary": "He further said the 2022 law of ward delimitation has been scrapped.",
    "fullContent": "He further said the 2022 law of ward delimitation has been scrapped.",
    "publishedAt": "2025-08-04T18:41:20.318Z",
    "fetchedAt": "2025-08-05T02:40:14.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "534d947e"
  },
  {
    "id": "wsj-youtube-6d3cae6",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Texas Democrats Leave State to Block Republican Redistricting Plan | WSJ News",
    "url": "https://www.youtube.com/watch?v=nK8BMoBTcZ8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:37:19.000Z",
    "fetchedAt": "2025-08-05T02:40:43.755Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6d3cae6"
  },
  {
    "id": "cnbc-markets-48444d48",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Firefly Aerospace lifts IPO range that would value company at more than $6 billion",
    "url": "https://www.cnbc.com/2025/08/04/firefly-aerospace-ipo-range-space.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:36:27.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "48444d48"
  },
  {
    "id": "cnbc-markets-3e7d0e84",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Firefly Aerospace lifts IPO range that would value company at more than $6 billion",
    "url": "https://www.cnbc.com/2025/08/04/firefly-aerospace-ipo-range-space.html",
    "summary": "Firefly Aerospace lifted the share price range for its upcoming IPO, in a move that would value the space technology company at more than $6 billion.",
    "fullContent": "Firefly Aerospace lifted the share price range for its upcoming IPO, in a move that would value the space technology company at more than $6 billion.",
    "publishedAt": "2025-08-04T18:36:27.000Z",
    "fetchedAt": "2025-08-05T11:27:53.400Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3e7d0e84"
  },
  {
    "id": "ndtv-profit-youtube-3fc31088",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Japan News | 80 Years After Hiroshima Atomic Bombing, Search Still On For Missing In Ninoshima",
    "url": "https://www.youtube.com/watch?v=5bz-2Gxsbt0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:31:44.000Z",
    "fetchedAt": "2025-08-05T02:40:21.770Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3fc31088"
  },
  {
    "id": "cnbc-markets-62191922",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "What a September rate cut would mean for stocks, plus a bullish call on AI spending",
    "url": "https://www.cnbc.com/2025/08/04/what-a-rate-cut-means-for-stocks-plus-a-bullish-call-on-ai-spending.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:56.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62191922"
  },
  {
    "id": "cnbc-markets-64287526",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "What a September rate cut would mean for stocks, plus a bullish call on AI spending",
    "url": "https://www.cnbc.com/2025/08/04/what-a-rate-cut-means-for-stocks-plus-a-bullish-call-on-ai-spending.html",
    "summary": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "fullContent": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "publishedAt": "2025-08-04T18:30:56.000Z",
    "fetchedAt": "2025-08-05T11:27:53.400Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "64287526"
  },
  {
    "id": "ndtv-profit-youtube-217c3388",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Bangladesh News | Year After Uprising, Bangladesh Struggles With Instability As Hasina Faces Trial",
    "url": "https://www.youtube.com/watch?v=qlyqg3EoqT8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:20.000Z",
    "fetchedAt": "2025-08-05T02:40:21.770Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "217c3388"
  },
  {
    "id": "oil-price-781c18b",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Naphtha Cushions China’s Q2 Oil Demand Decline",
    "url": "https://oilprice.com/Latest-Energy-News/World-News/Naphtha-Cushions-Chinas-Q2-Oil-Demand-Decline.html",
    "summary": "China’s oil demand declined year-on-year in the second quarter of 2025, but strong naphtha consumption helped limit the drop, according to a new report by Energy Intelligence, which estimates that apparent oil demand fell by 450,000 barrels per day from Q2 2024, primarily due to...",
    "fullContent": "China’s oil demand declined year-on-year in the second quarter of 2025, but strong naphtha consumption helped limit the drop, according to a new report by Energy Intelligence, which estimates that apparent oil demand fell by 450,000 barrels per day from Q2 2024, primarily due to weak diesel and gasoline margins. In contrast, naphtha demand remained steady as petrochemical producers maintained feedstock purchases amid steady cracker utilization rates. The International Energy Agency (IEA) forecasts that China’s naphtha demand will grow…",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.976Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "781c18b"
  },
  {
    "id": "nse-circulars-6bd4086d",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of Equity Shares of M & B Engineering Limited (IPO)",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69488.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T07:05:59.356Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "6bd4086d"
  },
  {
    "id": "nse-circulars-311a5e31",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of Equity Shares of Sri Lotus Developers and Realty Limited (IPO)",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69487.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T07:05:59.356Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "311a5e31"
  },
  {
    "id": "nse-circulars-689734b3",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Total surrender of membership of TM- ASSET ALLIANCE SECURITIES PVT. LTD. and PENTAGON STOCK BROKERS PRIVATE LIMITED",
    "url": "https://nsearchives.nseindia.com/content/circulars/COMP69476.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T07:05:59.356Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "689734b3"
  },
  {
    "id": "nse-circulars-894527",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Connectivity - Addition of POP.",
    "url": "https://nsearchives.nseindia.com/content/circulars/MSD69496.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T09:28:46.971Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "894527"
  },
  {
    "id": "nse-circulars-298deccb",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Connectivity - POP network changes.",
    "url": "https://nsearchives.nseindia.com/content/circulars/MSD69495.zip",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T09:28:46.971Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "298deccb"
  },
  {
    "id": "nse-circulars-236305d7",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of privately placed securities on capital market segment",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69498.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T09:59:10.037Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "236305d7"
  },
  {
    "id": "nse-circulars-6989b379",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Trade for Trade - Kaytex Fabrics Limited (SME IPO)",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69489.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T10:34:34.468Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "6989b379"
  },
  {
    "id": "nse-circulars-28c7a58c",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "SLBS - Settlement Calendar for Sep 2025",
    "url": "https://nsearchives.nseindia.com/content/circulars/CMPT69501.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T11:20:13.948Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "28c7a58c"
  },
  {
    "id": "nse-circulars-60781528",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Face Value Split - Mos Utility Limited (MOS)",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69499.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T11:20:13.949Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "60781528"
  },
  {
    "id": "nse-circulars-573b03f0",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of further issues of Party Cruisers Limited",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69512.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.803Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "573b03f0"
  },
  {
    "id": "nse-circulars-3bfeab1f",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of privately placed securities on the debt market segment of the exchange",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69510.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "3bfeab1f"
  },
  {
    "id": "nse-circulars-74e17904",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of further issues of securities",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69509.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "74e17904"
  },
  {
    "id": "nse-circulars-50b979e5",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "SPLIT: Adjustment of Market Lot for Security MOS in SME Platform",
    "url": "https://nsearchives.nseindia.com/content/circulars/CMTR69508.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "50b979e5"
  },
  {
    "id": "nse-circulars-690b767a",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Applicability of Enhanced Surveillance Measure (ESM)",
    "url": "https://nsearchives.nseindia.com/content/circulars/SURV69505.zip",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "690b767a"
  },
  {
    "id": "nse-circulars-276eece1",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of Equity Shares of M & B Engineering Limited (IPO)",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69504.zip",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "276eece1"
  },
  {
    "id": "nse-circulars-417631d6",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Applicability of Short-Term Additional Surveillance Measure (ST-ASM)",
    "url": "https://nsearchives.nseindia.com/content/circulars/SURV69503.zip",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "417631d6"
  },
  {
    "id": "nse-circulars-670141b6",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Applicability of Additional Surveillance Measure (ASM)",
    "url": "https://nsearchives.nseindia.com/content/circulars/SURV69502.zip",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "670141b6"
  },
  {
    "id": "nse-circulars-7c0a73a2",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Suspension of trading in Non-Convertible Debenture (Privately Placed)",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69500.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "7c0a73a2"
  },
  {
    "id": "nse-circulars-5d726010",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Trading of Rights Entitlements pursuant to Rights Issue of Praxis Home Retail Limited",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69497.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-05T13:31:09.804Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "5d726010"
  },
  {
    "id": "nse-circulars-12546eeb",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Availability of Weekly Payout of Income Distribution cum capital withdrawal option of Invesco India Liquid Fund on NSE MF Invest Platform",
    "url": "https://nsearchives.nseindia.com/content/circulars/NMF69513.zip",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "12546eeb"
  },
  {
    "id": "nse-circulars-20b78ff7",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of further issue of Grasim Industries Limited",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69511.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "20b78ff7"
  },
  {
    "id": "nse-circulars-474dd346",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Listing of Equity Shares of Sri Lotus Developers and Realty Limited (IPO)",
    "url": "https://nsearchives.nseindia.com/content/circulars/CML69506.zip",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "474dd346"
  },
  {
    "id": "nse-circulars-41b8d9c2",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Availability of Capitalmind Flexi Cap Fund for ongoing transactions on NSE MF Invest Platform",
    "url": "https://nsearchives.nseindia.com/content/circulars/NMF69494.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "41b8d9c2"
  },
  {
    "id": "nse-circulars-265ff357",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Launch of Groww Nifty Next 50 Index Fund NFO on NSE MF Invest Platform",
    "url": "https://nsearchives.nseindia.com/content/circulars/NMF69493.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "265ff357"
  },
  {
    "id": "nse-circulars-1b9fa8ce",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Launch of Groww Nifty Next 50 ETF NFO on NSE MF Invest Platform",
    "url": "https://nsearchives.nseindia.com/content/circulars/NMF69492.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "1b9fa8ce"
  },
  {
    "id": "nse-circulars-3855f499",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Launch of Nippon India Nifty India Manufacturing Index Fund NFO on NSE MF Invest Platform",
    "url": "https://nsearchives.nseindia.com/content/circulars/NMF69491.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "3855f499"
  },
  {
    "id": "nse-circulars-a91535e",
    "sourceId": "nse-circulars",
    "sourceName": "NSE Circulars",
    "title": "Launch of Nippon India Nifty India Manufacturing ETF NFO on NSE MF Invest Platform",
    "url": "https://nsearchives.nseindia.com/content/circulars/NMF69490.pdf",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:30:00.000Z",
    "fetchedAt": "2025-08-06T02:47:06.895Z",
    "category": "regulation",
    "tags": [
      "regulation"
    ],
    "priority": "normal",
    "contentHash": "a91535e"
  },
  {
    "id": "economist-finance-1091ecec",
    "sourceId": "economist-finance",
    "sourceName": "Economist Finance",
    "title": "",
    "url": "https://www.economist.com/finance-and-economics/2025/08/04/buy-now-pay-later-is-taking-over-the-world-good",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:28:21.000Z",
    "fetchedAt": "2025-08-05T02:40:12.946Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "1091ecec"
  },
  {
    "id": "economist-finance-2f110d74",
    "sourceId": "economist-finance",
    "sourceName": "Economist Finance",
    "title": "Buy now, pay later is taking over the world. Good",
    "url": "https://www.economist.com/finance-and-economics/2025/08/04/buy-now-pay-later-is-taking-over-the-world-good",
    "summary": "",
    "fullContent": "Buy that burrito, and don’t let anyone judge you",
    "publishedAt": "2025-08-04T18:28:21.000Z",
    "fetchedAt": "2025-08-05T11:27:53.665Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "2f110d74"
  },
  {
    "id": "cnbc-markets-544fc3b",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "3 things student loan borrowers can expect if they stay in the SAVE payment pause — and what they should do instead",
    "url": "https://www.cnbc.com/2025/08/04/student-loan-borrowers-who-stay-in-save-forbearance.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:27:16.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "544fc3b"
  },
  {
    "id": "cnbc-markets-63b187a1",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "3 things student loan borrowers can expect if they stay in the SAVE payment pause — and what they should do instead",
    "url": "https://www.cnbc.com/2025/08/04/student-loan-borrowers-who-stay-in-save-forbearance.html",
    "summary": "Student loan borrowers who don't leave the so-called SAVE payment pause could see their debt grow from interest and find their progress to loan relief stalled.",
    "fullContent": "Student loan borrowers who don't leave the so-called SAVE payment pause could see their debt grow from interest and find their progress to loan relief stalled.",
    "publishedAt": "2025-08-04T18:27:16.000Z",
    "fetchedAt": "2025-08-05T11:27:53.400Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "63b187a1"
  },
  {
    "id": "ndtv-profit-youtube-3954216d",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Russia Volcano Video | Volcano In Russia’s Far East Continues Eruption, The First In Centuries",
    "url": "https://www.youtube.com/watch?v=bvZpOPsKdFA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:26:50.000Z",
    "fetchedAt": "2025-08-05T02:40:21.770Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3954216d"
  },
  {
    "id": "ndtv-profit-youtube-f9503e4",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Tariff News | \"Indulging In Trade With Russia Themselves\": India Counters US Tariff Threat",
    "url": "https://www.youtube.com/watch?v=ipVGBMQjumw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:26:11.000Z",
    "fetchedAt": "2025-08-05T02:40:21.770Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "f9503e4"
  },
  {
    "id": "zerohedge-1efa3091",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Kremlin Urges 'Careful Use Of Nuclear Rhetoric' As Medvedev Pivots To Saying Trump Blackmailed By Mossad",
    "url": "https://www.zerohedge.com/geopolitical/kremlin-urges-careful-use-nuclear-rhetoric-medvedev-pivots-saying-trump-blackmailed",
    "summary": "Kremlin Urges 'Careful Use Of Nuclear Rhetoric' As Medvedev Pivots To Saying Trump Blackmailed By Mossad div property=\"schema:text\" class=\"clearfix text-formatted f.",
    "fullContent": "Kremlin Urges 'Careful Use Of Nuclear Rhetoric' As Medvedev Pivots To Saying Trump Blackmailed By Mossad The Kremlin has issued a fresh statement urging caution in making public statements involving nuclear weapons, after last week President Trump ordered two US nuclear submarines to deploy \"closer to Russia\". Seeking to downplay tensions, Putin spokesman Dmitry Peskov stated of the ultra-provocative American sub deployment, \"in this case, it is obvious that American submarines are already on combat patrol. This is a constant process.\" He stressed that Moscow would prefer not to engage in such discourse or \"get involved in such a controversy in any way,\" according to state media. AFP via Getty Images \"We are very careful about any statements related to nuclear issues\" given that \"Russia takes a responsible position\" and is \"very attentive to the topic of nuclear non-proliferation,\" he added. He said that on the nuclear issue, \"the main thing, of course, is the position of President Putin\" - suggesting that he is the final, responsible decision-maker on use of strategic doctrine. \"We believe that everyone should be very, very careful with nuclear rhetoric,\" Peskov then emphasized further. Interestingly it was Trump himself who last week accused former Russian president Dmitry Medvedev of throwing around nuclear threats lightly. Medvedev - who currently serves deputy chair of the country's Security Council - made reference to atomic apocalypse in written social media remarks about the Ukraine war and standoff with Washington. \"Well, a former president of Russia who's now in charge of one of the most important councils, Medvedev, said some things that were very bad, talking about nuclear,\" Trump had said in a follow-up interview about the matter. Trump continued, \"And when you mention the word 'nuclear,' you know, my eyes light up and I say, 'We better be careful,' because it's the ultimate threat.\" So now it appears at least both rivals are on the same page - with Moscow and Washington simultaneously calling for the dialing back of all nuclear rhetoric. But this doesn't mean that Medvedev is done going after Trump in this latest tit-for-tat social media public war or words. He put the following out Monday on Telegram: “Trump should not think that the video archive of his past immoralities is only in the hands of Mossad.” This is to apparently suggest strongly that Trump's foreign policy actions are directed by Israel, in connection with Epstein-related blackmail, and is among the more bizarre and aggressive theories thrown out there by Medvedev of late. 🚨 Medvedev: “Trump shouldn’t think the video archive of his past immoralities is only in Mossad’s hands.” 🇷🇺⚠️🇺🇸 pic.twitter.com/4MPSuCldSk — Daily Iran News (@DailyIranNews) August 3, 2025 For all of this to cool down, it will probably take Trump not responding to this latest provocative statement and insult by Medvedev. Given he's long sought to ignore and bat down the Epstein case, there's a good chance that Trump will let this statement pass without firing back. Tyler Durden Mon, 08/04/2025 - 14:25",
    "publishedAt": "2025-08-04T18:25:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.183Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1efa3091"
  },
  {
    "id": "ndtv-profit-youtube-40e2b9ae",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "India Vs England Winning Moment | India Beat England In Oval By Six Runs | India VS England",
    "url": "https://www.youtube.com/watch?v=R6LhsaqhLoU",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:24:44.000Z",
    "fetchedAt": "2025-08-05T02:40:21.770Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "40e2b9ae"
  },
  {
    "id": "techmeme-7042e558",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "OpenAI says ChatGPT now offers \"gentle reminders\" to take breaks during long sessions, and it is building tools to better detect signs of emotional distress (Ian Carlos Campbell/Engadget)",
    "url": "http://www.techmeme.com/250804/p27#a250804p27",
    "summary": "Ian Carlos Campbell / Engadget: OpenAI says ChatGPT now offers \"gentle reminders\" to take breaks during long sessions, and it is building tools to better detect signs of emotional distress — OpenAI has announced that ChatGPT will now remind users to take breaks if they're in a...",
    "fullContent": "Ian Carlos Campbell / Engadget: OpenAI says ChatGPT now offers \"gentle reminders\" to take breaks during long sessions, and it is building tools to better detect signs of emotional distress — OpenAI has announced that ChatGPT will now remind users to take breaks if they're in a particularly long chat with AI. ]]",
    "publishedAt": "2025-08-04T18:20:01.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7042e558"
  },
  {
    "id": "business-insider-155ccdaf",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Adtech company OpenX sues Google, accusing it of anticompetitive tactics that 'crippled' its growth",
    "url": "https://www.businessinsider.com/adtech-company-openx-sues-google-antitrust-digital-advertising-market-2025-8",
    "summary": "OpenX's 88-page lawsuit, filed in a Virginia federal court, said Google's anticompetitive tactics &#34;crippled competitors like OpenX at every turn.&#34;",
    "fullContent": "OpenX's 88-page lawsuit, filed in a Virginia federal court, said Google's anticompetitive tactics &#34;crippled competitors like OpenX at every turn.&#34;",
    "publishedAt": "2025-08-04T18:19:33.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "155ccdaf"
  },
  {
    "id": "business-insider-3aa0b30f",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "AI could be the US's secret weapon in the race to mine more minerals — if it can prove itself",
    "url": "https://www.businessinsider.com/critical-minerals-mining-us-ai-exploration-supply-chain-import-reliance-2025-8",
    "summary": "In the US push for mineral independence, AI could support faster discovery and supply chain security, but skepticism in the mining industry remains.",
    "fullContent": "In the US push for mineral independence, AI could support faster discovery and supply chain security, but skepticism in the mining industry remains.",
    "publishedAt": "2025-08-04T18:18:11.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3aa0b30f"
  },
  {
    "id": "matt-levine-27f55887",
    "sourceId": "matt-levine",
    "sourceName": "Matt Levine",
    "title": "",
    "url": "https://www.bloomberg.com/opinion/newsletters/2025-08-04/tesla-gives-musk-some-stock",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:16:15.000Z",
    "fetchedAt": "2025-08-05T02:40:13.231Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "27f55887"
  },
  {
    "id": "matt-levine-151311a7",
    "sourceId": "matt-levine",
    "sourceName": "Matt Levine",
    "title": "Tesla Gives Musk Some Stock",
    "url": "https://www.bloomberg.com/opinion/newsletters/2025-08-04/tesla-gives-musk-some-stock",
    "summary": "Also trend following, a Trump SPAC and a mortgage settlement.",
    "fullContent": "Also trend following, a Trump SPAC and a mortgage settlement.",
    "publishedAt": "2025-08-04T18:16:15.000Z",
    "fetchedAt": "2025-08-05T11:27:54.242Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "151311a7"
  },
  {
    "id": "bloomberg-business-youtube-78003a43",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump to 'Substantially' Raise Tariffs on India",
    "url": "https://www.youtube.com/watch?v=vZF6vO5Q_vY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:14:41.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "78003a43"
  },
  {
    "id": "cnbc-markets-7138a776",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Insider report: The stocks with the biggest recent sales by executives include United Airlines, Charles Schwab and NXP Semiconductors",
    "url": "https://www.cnbc.com/2025/08/04/insider-report-the-stocks-with-the-biggest-recent-sales-by-executives-include-ual-schw.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:12:11.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7138a776"
  },
  {
    "id": "cnbc-markets-4fed0d8c",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Insider report: The stocks with the biggest recent sales by executives include United Airlines, Charles Schwab and NXP Semiconductors",
    "url": "https://www.cnbc.com/2025/08/04/insider-report-the-stocks-with-the-biggest-recent-sales-by-executives-include-ual-schw.html",
    "summary": "Investors may follow moves by company executives or officers to gauge what may be happening within the businesses.",
    "fullContent": "Investors may follow moves by company executives or officers to gauge what may be happening within the businesses.",
    "publishedAt": "2025-08-04T18:12:11.000Z",
    "fetchedAt": "2025-08-05T11:27:53.401Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4fed0d8c"
  },
  {
    "id": "wsj-world-news-34e5dba3",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Israeli Government Votes to Oust Attorney General",
    "url": "https://www.wsj.com/world/middle-east/israeli-government-votes-to-oust-attorney-general-941cb137",
    "summary": "The attorney general, who is overseeing Prime Minister Benjamin Netanyahu&#x2019;s corruption trial, was fired as part of a broader effort to overhaul the judiciary and give more control to the governing coalition.",
    "fullContent": "The attorney general, who is overseeing Prime Minister Benjamin Netanyahu&#x2019;s corruption trial, was fired as part of a broader effort to overhaul the judiciary and give more control to the governing coalition.",
    "publishedAt": "2025-08-04T18:09:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.898Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "34e5dba3"
  },
  {
    "id": "zerohedge-44727844",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Elon Musk Unveils Grok Update After Controversial Posts By The AI Chatbot",
    "url": "https://www.zerohedge.com/political/elon-musk-unveils-grok-update-after-controversial-posts-ai-chatbot",
    "summary": "Elon Musk Unveils Grok Update After Controversial Posts By The AI Chatbot div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--ty.",
    "fullContent": "Elon Musk Unveils Grok Update After Controversial Posts By The AI Chatbot Authored by Jack Phillips via The Epoch Times (emphasis ours), Tech billionaire Elon Musk on Wednesday unveiled a new update to his Grok AI chatbot, a day after it posted controversial content across social media platform X. Elon Musk looks on during a news conference in the Oval Office of the White House on May 30, 2025. Allison Robbert/AFP via Getty Images Earlier this week, Grok 3 made allegedly anti-Semitic comments, cited what appeared to be false information about an X user in connection with the recent deadly floods in Texas, made statements praising Adolf Hitler, and at one point, described itself as “MechaHitler,” causing the term to trend on X on Tuesday. Musk’s xAI company, which develops the chatbot, released a statement Tuesday on the Grok account, saying it is “actively working to remove the inappropriate posts” and has “taken action to ban hate speech before Grok posts on X.” “Grok 4 is the first time, in my experience, that an AI has been able to solve difficult, real-world engineering questions where the answers cannot be found anywhere on the Internet or in books. And it will get much better,” Musk wrote in a post on Thursday. In a livestreamed event, Musk also touted the capabilities of the latest Grok update, calling Grok 4 “the smartest AI in the world.” “It really is remarkable to see the advancement of artificial intelligence, how quickly it is evolving,” he said. “I would expect Grok to discover new technologies that are actually useful no later than next year, and maybe end of this year. And it might discover new physics next year.” Responding to the controversy over the recent posts, Musk said that the comments posted by Grok 3 earlier in the week were because the chatbot was “too compliant to user prompts. Too eager to please and be manipulated.” “That is being addressed,” Musk wrote in a July 9 post on X. Musk last month promised to upgrade Grok, suggesting there was “far too much garbage in any foundation model trained on uncorrected data.” The announcement from Musk follows high-profile AI advancements that were released by Google, OpenAI, and other tech companies in recent months. Big tech companies have been spending heavily on AI as they view the new technology as a major growth engine, while slashing costs elsewhere to safeguard profits. Some current and former employees at OpenAI and Google warned in an open letter that “serious risks” could be posed by AI and called for greater protections. The letter warned that AI could lead to “the further entrenchment of existing inequalities, to manipulation and misinformation, to the loss of control of autonomous AI systems potentially resulting in human extinction.” During the Grok 4 launch, Musk briefly referred to AI safety and said that he wants Grok to be “maximally truth-seeking.” On Wednesday, X CEO Linda Yaccarino stepped down from the company, though there was no known connection between her decision and the content posted by Grok. She did not refer to the Grok controversy in her farewell statement, posted to her account. “I’m incredibly proud of the X team - the historic business turn around we have accomplished together has been nothing short of remarkable,” she wrote. Reuters contributed to this report. Tyler Durden Mon, 08/04/2025 - 14:05",
    "publishedAt": "2025-08-04T18:05:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.183Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "44727844"
  },
  {
    "id": "the-verge-1566d49d",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/21539047/best-amazon-kindle-deals",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T18:01:19.000Z",
    "fetchedAt": "2025-08-05T02:40:13.908Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1566d49d"
  },
  {
    "id": "oil-price-4dd1670",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Trump’s Copper TACO Move To Trigger Huge Market Revamp",
    "url": "https://oilprice.com/Metals/Commodities/Trumps-Copper-TACO-Move-To-Trigger-Huge-Market-Revamp.html",
    "summary": "Since the start of 2025, US copper prices have surged to unprecedented highs, fueled by the market anticipation of the 50% tariff on imported copper goods under President Trump’s administration trade agenda.",
    "fullContent": "Since the start of 2025, US copper prices have surged to unprecedented highs, fueled by the market anticipation of the 50% tariff on imported copper goods under President Trump’s administration trade agenda. The market rally was largely triggered by the fears of possible supply disruptions and increased costs of copper raw materials for the US manufacturers after the tariffs would come into force starting August 1. However, the current US administration&#039;s erratic trade policy has once again put the markets into a state of bewilderment: the…",
    "publishedAt": "2025-08-04T18:00:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.976Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "4dd1670"
  },
  {
    "id": "bloomberg-business-youtube-1a2e8cca",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Texas Democrats Flee to Chicago to Stop GOP Measure",
    "url": "https://www.youtube.com/watch?v=VgoZNVdaAGs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:52:44.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1a2e8cca"
  },
  {
    "id": "bloomberg-politics-7d8fdaeb",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/dutch-to-supply-ukraine-with-500-million-in-arms-from-us-stocks",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:52:42.000Z",
    "fetchedAt": "2025-08-05T02:40:13.150Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "7d8fdaeb"
  },
  {
    "id": "bloomberg-politics-6c46b5c7",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Dutch to Supply Ukraine With €500 Million in Arms From US Reserves",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/dutch-to-supply-ukraine-with-500-million-in-arms-from-us-stocks",
    "summary": "The Netherlands will contribute €500 million ($579 million) to Ukraine’s defense as part of a US initiative, making it the first NATO country to donate funds through the new program.",
    "fullContent": "The Netherlands will contribute €500 million ($579 million) to Ukraine’s defense as part of a US initiative, making it the first NATO country to donate funds through the new program.",
    "publishedAt": "2025-08-04T17:52:42.000Z",
    "fetchedAt": "2025-08-05T11:27:53.474Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6c46b5c7"
  },
  {
    "id": "ft-technology-62d9f5a",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "",
    "url": "https://www.ft.com/content/905179cc-52ee-4cd6-81bd-dfdaa6a8fe88",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:48:49.000Z",
    "fetchedAt": "2025-08-05T02:40:13.269Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "62d9f5a"
  },
  {
    "id": "ft-technology-2b877a16",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "Meta’s high-spending hunt for AI talent",
    "url": "https://www.ft.com/content/905179cc-52ee-4cd6-81bd-dfdaa6a8fe88",
    "summary": "From football to stock analysis, too many stars make it hard to run a team.",
    "fullContent": "From football to stock analysis, too many stars make it hard to run a team",
    "publishedAt": "2025-08-04T17:48:49.000Z",
    "fetchedAt": "2025-08-05T11:27:54.303Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "2b877a16"
  },
  {
    "id": "yahoo-finance-549dfea6",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "What is a credit card spending limit — and what to know",
    "url": "https://finance.yahoo.com/personal-finance/credit-cards/article/credit-card-spending-limit-174632379.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:46:32.000Z",
    "fetchedAt": "2025-08-06T09:51:25.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "549dfea6"
  },
  {
    "id": "zerohedge-1ff539ca",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Tom Lee's BitMine Holdings Top $3 Billion In Largest Global Ethereum Treasury Strategy",
    "url": "https://www.zerohedge.com/crypto/tom-lees-bitmine-holdings-top-3-billion-largest-global-ethereum-treasury-strategy",
    "summary": "Tom Lee's BitMine Holdings Top $3 Billion In Largest Global Ethereum Treasury Strategy div property=\"schema:text\" class=\"clearfix text-formatted field field--name-b.",
    "fullContent": "Tom Lee's BitMine Holdings Top $3 Billion In Largest Global Ethereum Treasury Strategy Aside from Friday's sudden net outflow, the month of Ethereum's tenth anniversary was celebrated by an almost unstoppable wave of net inflows into ETFs... And, perhaps even more notably, an ongoing demand from Altcoin Treasury Strategy companies is also gaining momentum with Ethereum treasury firm BitMine Immersion Technologies (BMNR) said its ether holdings have climbed to about 833,000 tokens currently worth more than $2.9 billion, making the Tom Lee–backed company the world’s largest public holder of ETH. Source: The Block Fundstrat co-founder Tom Lee, who is now the Chairman of BitMine’s board of directors, says the firm is pushing to acquire 5% of the circulating supply of Ethereum, which would be about 6,035,480 ETH. “BitMine moved with lightning speed in its pursuit of the ‘alchemy of 5%’ of ETH growing our ETH holdings to over 833,000 from zero 35 days ago. We have separated ourselves among crypto treasury peers by both the velocity of raising crypto NAV per share and by the high liquidity of our stock.” Ethereum is surging higher this morning on the heels of this news... Continuing its recent strong outperformance trend over bitcoin... As a reminder, Standard Chartered forecasts Ethereum Treasury holdings to top 10% of supply: For ETH this is likely to happen more quickly, as the broader concept of corporate holdings of digital assets is already accepted. Publicly listed Bitcoin mining company, BitMine Immersion Tech (BMNR), is currently the largest Ether treasury firm, holding 0.5% of the circulating ETH supply. If BMNR can achieve its goal of increasing its ETH holdings to 5% of the total in circulation, then it is fair to assume that ETH treasury companies as a whole will end up holding more than 10% of all ETH in circulation. This would be a 10x increase from today’s corporate treasury holdings. Ether-focused treasury firms have more growth potential compared to Bitcoin treasury firms from a “regulatory arbitrage perspective,” according to Standard Chartered. \"...this buying of digital assets by corporates makes sense due to inefficiencies in financial markets, mostly stemming from regulation. Specifically, restrictions on investor access to the asset class, which remain significant in a large number of jurisdictions, mean that investors seek alternative vehicles (in this case publicly listed companies) through which to gain exposure to the underlying asset. As a result, these companies’ market cap tends to trade above the net asset value (NAV) of the assets held, at a so-called positive NAV multiple.\" Ether treasury firms can “capture both staking rewards and decentralised finance (DeFi) leverage opportunities, which US Ethereum ETFs currently cannot.” In terms of next potential catalysts, we will be looking at the upcoming Fusaka protocol upgrade in Q4’25. Tyler Durden Mon, 08/04/2025 - 13:45",
    "publishedAt": "2025-08-04T17:45:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.184Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1ff539ca"
  },
  {
    "id": "bloomberg-politics-156b99e4",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/netanyahu-s-cabinet-fires-attorney-general-citing-lack-of-trust",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:44:13.000Z",
    "fetchedAt": "2025-08-05T02:40:13.150Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "156b99e4"
  },
  {
    "id": "bloomberg-politics-411d87fb",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/netanyahu-s-cabinet-fires-attorney-general-citing-lack-of-trust",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:44:13.000Z",
    "fetchedAt": "2025-08-05T04:57:57.465Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "411d87fb"
  },
  {
    "id": "bloomberg-politics-7105e1a5",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Netanyahu’s Cabinet Fires Attorney General Citing Lack of Trust",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/netanyahu-s-cabinet-fires-attorney-general-citing-lack-of-trust",
    "summary": "Israel’s cabinet voted to terminate the country’s attorney general, who it has been trying to oust for months, but the Supreme Court quickly issued an injunction to block the move pending a review of its legality.",
    "fullContent": "Israel’s cabinet voted to terminate the country’s attorney general, who it has been trying to oust for months, but the Supreme Court quickly issued an injunction to block the move pending a review of its legality.",
    "publishedAt": "2025-08-04T17:44:13.000Z",
    "fetchedAt": "2025-08-05T11:27:53.474Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "7105e1a5"
  },
  {
    "id": "et-markets-d13298a",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/tata-capital-files-for-ipo-marks-next-big-move-by-tata-group/articleshow/123101544.cms",
    "summary": "![CDATA[Tata Capital, the Tata Group's NBFC, has filed for an IPO to raise funds and meet RBI's listing requirements for upper-layer NBFCs by September 2025. The IPO includes a fresh issue of 210 million shares and an offer for sale of 265.",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:39:13.000Z",
    "fetchedAt": "2025-08-05T02:40:11.854Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d13298a"
  },
  {
    "id": "et-markets-6b0bc3de",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/knowledge-realty-trust-reit-raises-rs-2820-crore-from-anchor-and-institutional-investors/articleshow/123101429.cms",
    "summary": "![CDATA[Knowledge Realty Trust REIT's IPO will open on August 5, 2025. The company has already secured Rs 1,620 crore from anchor investors. A strategic allocation of Rs 1,200 crore is also completed. LIC and Tata Group are among the key participants.",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:37:09.000Z",
    "fetchedAt": "2025-08-05T02:40:11.854Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6b0bc3de"
  },
  {
    "id": "yahoo-finance-6815a39a",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Cotton Posting Monday Pop Higher",
    "url": "https://finance.yahoo.com/news/cotton-posting-monday-pop-higher-173632949.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:36:32.000Z",
    "fetchedAt": "2025-08-06T04:55:20.428Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6815a39a"
  },
  {
    "id": "yahoo-finance-2c270c32",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Corn Losses Leaking into Monday",
    "url": "https://finance.yahoo.com/news/corn-losses-leaking-monday-173632184.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:36:32.000Z",
    "fetchedAt": "2025-08-06T04:55:20.428Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2c270c32"
  },
  {
    "id": "yahoo-finance-286c5090",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Grab Holdings Limited (GRAB): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/grab-holdings-limited-grab-bull-173441621.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:34:41.000Z",
    "fetchedAt": "2025-08-06T04:55:20.428Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "286c5090"
  },
  {
    "id": "et-cfo-topstories-1eb50e29",
    "sourceId": "et-cfo-topstories",
    "sourceName": "Economic Times CFO Top Stories",
    "title": "",
    "url": "https://cfo.economictimes.indiatimes.com/news/leadership/p-b-balaji-to-become-first-indian-ceo-of-jaguar-land-rover-in-2025/123101310",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:34:30.000Z",
    "fetchedAt": "2025-08-05T10:26:07.722Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "1eb50e29"
  },
  {
    "id": "et-cfo-topstories-64895881",
    "sourceId": "et-cfo-topstories",
    "sourceName": "Economic Times CFO Top Stories",
    "title": "Tata Motors CFO P B Balaji to take over as CEO of Jaguar Land Rover in November 2025",
    "url": "https://cfo.economictimes.indiatimes.com/news/leadership/p-b-balaji-to-become-first-indian-ceo-of-jaguar-land-rover-in-2025/123101310",
    "summary": "P B Balaji, an Indian finance leader and Tata Motors’ Group CFO, has been appointed CEO of Jaguar Land Rover, marking the first time an Indian will lead the British luxury carmaker. He will take charge in November 2025, succeeding outgoing chief Adrian Mardell.",
    "fullContent": "P B Balaji, an Indian finance leader and Tata Motors’ Group CFO, has been appointed CEO of Jaguar Land Rover, marking the first time an Indian will lead the British luxury carmaker. He will take charge in November 2025, succeeding outgoing chief Adrian Mardell.",
    "publishedAt": "2025-08-04T17:34:30.000Z",
    "fetchedAt": "2025-08-05T11:27:53.229Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "64895881"
  },
  {
    "id": "yahoo-finance-6ebf4b4e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "IES Holdings, Inc. (IESC): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/ies-holdings-inc-iesc-bull-173425146.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:34:25.000Z",
    "fetchedAt": "2025-08-06T04:55:20.428Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6ebf4b4e"
  },
  {
    "id": "yahoo-finance-78cbd4e4",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "JPMorgan Chase & Co. (JPM): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/jpmorgan-chase-co-jpm-bull-173410297.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:34:10.000Z",
    "fetchedAt": "2025-08-06T04:55:20.428Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "78cbd4e4"
  },
  {
    "id": "yahoo-finance-5c02fec3",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Joint Stock Company Kaspi.kz (KSPI): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/joint-stock-company-kaspi-kz-173357592.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:33:57.000Z",
    "fetchedAt": "2025-08-06T04:55:20.427Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5c02fec3"
  },
  {
    "id": "yahoo-finance-4d0f0528",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Philip Morris International Inc. (PM): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/philip-morris-international-inc-pm-173312524.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:33:12.000Z",
    "fetchedAt": "2025-08-06T04:55:20.427Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4d0f0528"
  },
  {
    "id": "yahoo-finance-6efe949f",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "QuidelOrtho Corporation (QDEL): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/quidelortho-corporation-qdel-bull-case-173253467.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:32:53.000Z",
    "fetchedAt": "2025-08-06T04:55:20.427Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6efe949f"
  },
  {
    "id": "yahoo-finance-73e4a216",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Sibanye Stillwater Limited (SBSW): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/sibanye-stillwater-limited-sbsw-bull-173240031.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:32:40.000Z",
    "fetchedAt": "2025-08-06T04:55:20.427Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "73e4a216"
  },
  {
    "id": "yahoo-finance-27e656db",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Biogen Inc. (BIIB): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/biogen-inc-biib-bull-case-173225709.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T17:32:25.000Z",
    "fetchedAt": "2025-08-06T04:55:20.427Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "27e656db"
  }
]