[
  {
    "id": "zerohedge-7cd6b224",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Chaotic NYC 'Safe' Injection-Sites Put On Notice By Trump",
    "url": "https://www.zerohedge.com/political/chaotic-nyc-safe-injection-sites-put-notice-trump",
    "summary": "Chaotic NYC 'Safe' Injection-Sites Put On Notice By Trump Democrats fully own the crime and chaos plaguing major cities, after decades of failed progressive experiments that have only backfired spectacularly, transforming some parts of America's largest metropolitan areas into...",
    "fullContent": "Chaotic NYC 'Safe' Injection-Sites Put On Notice By Trump Democrats fully own the crime and chaos plaguing major cities, after decades of failed progressive experiments that have only backfired spectacularly, transforming some parts of America's largest metropolitan areas into lawless, crime-ridden no-go zones. There's an urgent need for course correction and to restore law and order in major cities run by rogue Democratic leaders whose failed social justice policies (influenced by leftist billionaires and their NGOs), like defunding the police and \"safe\" injection sites, have only fueled more crime, chaos, and disorder on the streets. President Trump's \"Ending Crime and Disorder on America's Streets\" executive order, issued late last month, has put these taxpayer-funded safe injection sites on notice. Safe injection sites, such as those run by nonprofit OnPoint NYC in East Harlem and Washington Heights, supervise illegal drug use under the guise of harm reduction. A clear legal precedent was set in 2019 under President Trump's first term via the Department of Justice that successfully blocked a proposed safe injection site in Philadelphia under the Controlled Substances Act. The Third Circuit upheld the decision, and the Supreme Court let it stand. That ruling could now be used against NYC's injection sites if the Manhattan U.S. Attorney chooses to follow Philadelphia's lead. Trump's new order calls on the Substance Abuse and Mental Health Services Administration to ensure that none of its \"discretionary grants\" indirectly fund such sites, which have been causing significant problems at the local level. Passed out people line the streets near the safe injection site in East Harlem. Source: NYPOST J.C. Rice The New York Post released a new report that shows the chaos, madness, and violence outside OnPoint's East Harlem headquarters on a typical afternoon. This scene unfolded around 4:30pm on a recent Wednesday afternoon on East 126th, by the OnPoint center. Source: NYPOST J.C. Rice Some argue that safe injection sites in NYC don't address the root problem of addiction and continue exacerbating the drug crisis. Neighbors say they’ve repeatedly called 311 and 911 about the situation. Source: NYPOST J.C. Rice \"They're just delaying overdose deaths because they don't address the underlying pathological behavior, which is really injecting yourself with poison,\" said Charles Lehman, a fellow at the Manhattan Institute Neighbors say the drug use spills outside the walls of the East 126th center and onto the street. Source: NYPOST J.C. Rice \"Americans deserve to feel safe in their cities and towns. President Trump is providing decisive leadership to protect public safety and end the surrender of our great cities to disorder, homelessness, and crime,\" said White House spokesperson Harrison Fields. The nation has come a long way from this. This is what Albany and Binghamton, New York looked like in the mid 1960s (on Pearl and Endicott Street, respectively). Why don't you take a stroll through there, today? See how that goes. https://t.co/E6sF7m8Hzh pic.twitter.com/1VmBOpX2ti — ib (@Indian_Bronson) January 24, 2024 NYC. 1950s vs 2020s. pic.twitter.com/dPAf1nt1cU — End Wokeness (@EndWokeness) March 30, 2024 Many inner-city communities continue to face hardships after decades of failed progressive policies that are now coming home to roost in a new era of accountability. The White House is moving forward with course-correction measures to address the decay and failed policies put forth by activist Democrats in cities. Tyler Durden Sat, 08/09/2025 - 19:15",
    "publishedAt": "2025-08-09T23:15:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.703Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7cd6b224"
  },
  {
    "id": "oil-price-7987263",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "New Shipbuilding Rules Could Derail U.S. LNG Export Boom",
    "url": "https://oilprice.com/Energy/Natural-Gas/New-Shipbuilding-Rules-Could-Derail-US-LNG-Export-Boom.html",
    "summary": "The U.S. LNG export boom, strongly supported by the Trump Administration, could be undermined by separate trade rules proposed by the very same administration, which looks to revive America’s shipbuilding to counter China’s dominance. Under new mandates proposed by the U.S.",
    "fullContent": "The U.S. LNG export boom, strongly supported by the Trump Administration, could be undermined by separate trade rules proposed by the very same administration, which looks to revive America’s shipbuilding to counter China’s dominance. Under new mandates proposed by the U.S. Trade Representative (USTR), beginning in 2028, a total of 1% of America’s LNG exports must be carried via U.S.-flagged vessels. From 2029 onwards, 1% of U.S. LNG exports should be shipped on U.S.-flagged and U.S.-built vessels. This number will gradually rise…",
    "publishedAt": "2025-08-09T23:00:00.000Z",
    "fetchedAt": "2025-08-10T02:52:49.752Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "7987263"
  },
  {
    "id": "techmeme-5329a203",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Hands-on with Alexa+: fun to talk to and good at handling multistep requests, but it is buggy, unreliable, and worse at some basic tasks than the original Alexa (Kevin Roose/New York Times)",
    "url": "http://www.techmeme.com/250809/p12#a250809p12",
    "summary": "Kevin Roose / New York Times: Hands-on with Alexa+: fun to talk to and good at handling multistep requests, but it is buggy, unreliable, and worse at some basic tasks than the original Alexa — Alexa+ processes language in a more fluid way.",
    "fullContent": "Kevin Roose / New York Times: Hands-on with Alexa+: fun to talk to and good at handling multistep requests, but it is buggy, unreliable, and worse at some basic tasks than the original Alexa — Alexa+ processes language in a more fluid way. Users can speak to it as they would to a human.Graham Dickie/The New York Times",
    "publishedAt": "2025-08-09T22:55:51.000Z",
    "fetchedAt": "2025-08-10T02:52:49.962Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5329a203"
  },
  {
    "id": "yahoo-finance-2bac47e6",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Palantir Technologies Inc. (PLTR)’s CEO Is A “Sweetheart,” Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/palantir-technologies-inc-pltr-ceo-224758027.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T22:47:58.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2bac47e6"
  },
  {
    "id": "yahoo-finance-f1d79fc",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Sudden Fed Resignation Surprised Colleagues and Gave Opening for Trump",
    "url": "https://www.wsj.com/economy/central-banking/sudden-fed-resignation-surprised-colleagues-and-gave-opening-for-trump-3c6a84e9?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T22:47:00.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "f1d79fc"
  },
  {
    "id": "yahoo-finance-239e5939",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "DraftKings Inc. (DKNG) Will Benefit From The Football Season, Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/draftkings-inc-dkng-benefit-football-224542661.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T22:45:42.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "239e5939"
  },
  {
    "id": "yahoo-finance-727d2c83",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Planet Fitness, Inc. (PLNT)’s “Numbers Are Just Incredible,” Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/planet-fitness-inc-plnt-numbers-224203508.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T22:42:03.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "727d2c83"
  },
  {
    "id": "zerohedge-74c067fe",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "China's Baidu To Deploy Its Self-Driving Taxis Globally Through Deals With Lyft, Uber",
    "url": "https://www.zerohedge.com/technology/chinas-baidu-deploy-its-self-driving-taxis-globally-through-deals-lyft-uber",
    "summary": "China's Baidu To Deploy Its Self-Driving Taxis Globally Through Deals With Lyft, Uber Authored by Alex Wu via The Epoch Times (emphasis ours), The “Google of China,” Baidu, and U.S. ride-hailing company Lyft announced on Aug.",
    "fullContent": "China's Baidu To Deploy Its Self-Driving Taxis Globally Through Deals With Lyft, Uber Authored by Alex Wu via The Epoch Times (emphasis ours), The “Google of China,” Baidu, and U.S. ride-hailing company Lyft announced on Aug. 4 that they have reached a deal to deploy self-driving taxis in Europe next year. A taxi driver operating his car on a road alongside a self-driving robotaxi developed as part of tech giant Baidu's Apollo Go self-driving project, in Wuhan, Hubei Province, China, on Aug. 2, 2024. Pedro PARDO/AFP The plan, which is still pending regulatory approval, is to use Baidu’s electric RT6 robotaxis to operate on Lyft’s platform. The service will first launch in the UK and Germany. The two companies aim to deploy thousands of China-made vehicles across Europe in the coming years. Lyft has access to operations in nine countries and more than 180 cities in Europe, after its recent acquisition of European mobility app FreeNow. The deal with Lyft comes just weeks after Baidu signed a similar agreement with Uber. On July 15, the owners of China’s largest search engine and Uber reached a deal to deploy Baidu’s Apollo Go autonomous vehicles across Uber’s multiple global markets outside of the United States and mainland China, where Uber cannot operate after it agreed to hand over some of its intellectual property to China-based rival DiDi. “The first deployments are expected in Asia and the Middle East later this year,” Uber said in a statement. By partnering with Uber, Baidu has found a widely used platform that operates in 15,000 cities globally. “As the world’s largest platform of its kind, spanning mobility, delivery, and freight, Uber is uniquely positioned to help [autonomous vehicle] leaders like Baidu bring their autonomous technology to the world,” Uber CEO Dara Khosrowshahi said in the statement. Since 2021, Baidu has been operating its own self-driving taxi service, Apollo Go, in major Chinese cities, including Beijing. Users can hail a ride through its app. A man riding his scooter is followed by a driverless robotaxi autonomous vehicle developed as part of tech giant Baidu's Apollo Go self-driving project, in Wuhan, Hubei Province, China, on Aug. 1, 2024. Pedro Pardo/AFP Baidu has been expanding into overseas markets rapidly this year. In May, it announced a partnership with the Roads and Transport Authority of Dubai, United Arab Emirates, to launch autonomous driving services in the city. Baidu will first deploy 100 Apollo Go autonomous vehicles to the United Arab Emirates by the end of 2025—its first international deployment. It aims to expand to 1,000 vehicles by 2028. Baidu’s partnership with Lyft and Uber “aims to enhance its global brand influence and to seize opportunities to expand in the international smart mobility market to compete with American giants like Waymo and Cruise, and South Korea’s Pony.ai,” Sun Kuo-hsiang, professor of international affairs and business at Nanhua University in Taiwan, told The Epoch Times on Aug. 5. However, the entry of China-made self-driving car fleets into Europe is likely to spark political and security controversy amid the ongoing tech and trade disputes between China and Europe, and between China and the United States, Sun said. According to him, as Europe and the United States take up de-risking policies in relation to the national security risks posed by the Chinese Communist Party, “regulators in the European Union and the UK are generally cautious about Chinese companies’ involvement in data and transportation infrastructure.” “Such deployments will be subject to strict scrutiny, creating significant uncertainty regarding approval,” he said. Safety and Security Risks Baidu’s electric self-driving cars use cloud remote control, which allows for remote monitoring and direction, Sun said. “This type of functionality is considered highly risky and is not recommended in the European and American self-driving car industry, as remote intervention can pose significant risks due to network latency or exploitation,” he said. A screen showing a road map for Baidu's Apollo Go autonomous taxi in Beijing, on Nov. 25, 2021. Jade Gao/AFP via Getty Images In addition, the Chinese-made self-driving vehicles are equipped with various data collection features, including facial recognition, driving history, and user app management. Sun said this has raised concerns over Beijing’s potential access to collected data. “There are concerns that personal and behavioral data may be collected by the Chinese government as required by Chinese security laws,“ Sun said. ”Chinese authorities could demand that Chinese companies hand over user data, posing a threat to personal privacy.” U.S.-based China affairs observer Wang He warned of another type of risk posed by Baidu’s electric self-driving cars. Autonomous vehicles have many sensors and “automatically capture a large number of terrain images for the unmanned driving,” he said, which may include images of sensitive areas and sensitive data in other countries. These may be transmitted back to China. Luo Ya and Reuters contributed to this report. Tyler Durden Sat, 08/09/2025 - 18:40",
    "publishedAt": "2025-08-09T22:40:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.703Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "74c067fe"
  },
  {
    "id": "yahoo-finance-15418949",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Astera Labs, Inc. (ALAB) Is Up Due To The NVIDIA Deal, Days Jim Cramer",
    "url": "https://finance.yahoo.com/news/astera-labs-inc-alab-due-223904191.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T22:39:04.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15418949"
  },
  {
    "id": "yahoo-finance-692109e5",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Moderna, Inc. (MRNA)’s “Got The Double Whammy,” Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/moderna-inc-mrna-got-double-223544539.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T22:35:44.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "692109e5"
  },
  {
    "id": "bloomberg-politics-50188d2c",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "White House Crypto Adviser Bo Hines to Return to Private Sector",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/white-house-crypto-adviser-bo-hines-to-return-to-private-sector",
    "summary": "Bo Hines, the head of the White House Presidential Council of Advisers for Digital Assets, said he was stepping down and returning to the private sector.",
    "fullContent": "Bo Hines, the head of the White House Presidential Council of Advisers for Digital Assets, said he was stepping down and returning to the private sector.",
    "publishedAt": "2025-08-09T22:31:28.000Z",
    "fetchedAt": "2025-08-10T02:52:48.088Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "50188d2c"
  },
  {
    "id": "yahoo-finance-67e4e9d8",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Arista Networks Inc (ANET) Is So Good Even Its Competitors Are Impressed, Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/arista-networks-inc-anet-good-222943789.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T22:29:43.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "67e4e9d8"
  },
  {
    "id": "zerohedge-2e8b3845",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Nuclear Weapons Spending Is On The Rise",
    "url": "https://www.zerohedge.com/energy/nuclear-weapons-spending-rise",
    "summary": "Nuclear Weapons Spending Is On The Rise Global spending on nuclear weapons increased by 11 percent in 2024 compared to the year before, surpassing $100 billion, or $190,151 every minute. As Statista's Anna Fleck reports, this is according to the latest report by the...",
    "fullContent": "Nuclear Weapons Spending Is On The Rise Global spending on nuclear weapons increased by 11 percent in 2024 compared to the year before, surpassing $100 billion, or $190,151 every minute. As Statista's Anna Fleck reports, this is according to the latest report by the International Campaign to Abolish Nuclear Weapons (ICAN). More than half of this was by the United States, which spent $56.8 billion. China was the second biggest spender, accounting for $12.5 billion, followed by the United Kingdom with $10.4 billion. As Fleck shows in the following chart, the countries to have seen the biggest relative increases were the United Kingdom at 26 percent, Pakistan at 18 percent and France at 13 percent. You will find more infographics at Statista According to ICAN, a cumulative $415.9 billion was spent by the nine countries that have developed nuclear weapons on their arsenals over the five years between 2020 and 2024. Spending has been increasing over the years, having already risen 34 percent between 2019 and 2023. Tyler Durden Sat, 08/09/2025 - 18:05",
    "publishedAt": "2025-08-09T22:05:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.703Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2e8b3845"
  },
  {
    "id": "yahoo-finance-1527c0a9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Alphabet Inc. (GOOGL): “The Waymo Deal’s Good,’ Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/alphabet-inc-googl-waymo-deal-214758066.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:47:58.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1527c0a9"
  },
  {
    "id": "zerohedge-19941bc2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Appeals Court Nukes Boasberg's Contempt Order In Trump Admin Deportations Case",
    "url": "https://www.zerohedge.com/political/appeals-court-nukes-boasbergs-contempt-order-trump-admin-deportations-case",
    "summary": "Appeals Court Nukes Boasberg's Contempt Order In Trump Admin Deportations Case Activist judge James Boasberg has just been slapped down, after an appeals court removed an order which could have resulted in the Trump administration being found in contempt as part of a tense...",
    "fullContent": "Appeals Court Nukes Boasberg's Contempt Order In Trump Admin Deportations Case Activist judge James Boasberg has just been slapped down, after an appeals court removed an order which could have resulted in the Trump administration being found in contempt as part of a tense confrontation with the US District Judge. Earlier this year, Boasberg said he found probable cause to hold the administration in contempt because it purportedly violated his orders to halt deportations under the Alien Enemies Act. However in a 2–1 decision on Friday, the U.S. Court of Appeals for the District of Columbia Circuit indicated that Boasberg went too far. Judge Gregory Katsas said that one of Boasberg’s orders could have been read in different ways. Pundits have used this case to accuse the administration of not following the law. Now will they recant? Just this week the New York Times published multiple articles using the contempt proceeding as evidence that President Trump isn't following court orders. Correction time? — Eric W. (@EWess92) August 8, 2025 \"The district court here was placed in an enormously difficult position,\" wrote Judge Gregory Katsas. \"Faced with an emergency situation, it had to digest and rule upon novel and complex issues within a matter of hours. In that context, the court quite understandably issued a written order that contained some ambiguity.\" Katsas noted that the appellate court ruling doesn't center around the lawfulness of Trump's Alien Enemies Act removals in March, when the administration invoked the 1798 immigration law to send over 250 Venezuelan nationals to CEDOT, El Salvador's maximum-security prison. \"Nor may we decide whether the government’s aggressive implementation of the presidential proclamation warrants praise or criticism as a policy matter,\" he added. \"Perhaps it should warrant more careful judicial scrutiny in the future. Perhaps it already has.\" \"Regardless, the government’s initial implementation of the proclamation clearly and indisputably was not criminal.\" As the Epoch Times notes further, Judge Neomi Rao described Boasberg’s decision as an “egregious” abuse of the court’s contempt power and said Boasberg had lost the authority to try and “coerce compliance” with his original order. That’s because his initial halts on the deportations had been vacated by the Supreme Court in another decision from April. One of the judges, Judge Cornelia Pillard, defended Boasberg and said the Trump administration appeared to have disobeyed his directions. “Our system of courts cannot long endure if disappointed litigants defy court orders with impunity rather than legally challenge them,” Pillard said. “This is why willful disobedience of a court order is punishable as criminal contempt.” Tyler Durden Sat, 08/09/2025 - 17:45",
    "publishedAt": "2025-08-09T21:45:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.704Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19941bc2"
  },
  {
    "id": "yahoo-finance-3b5efa7e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Uber Technologies, Inc. (UBER) “Is Just A Steady Good Story,” Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/uber-technologies-inc-uber-just-214350086.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:43:50.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b5efa7e"
  },
  {
    "id": "fortune-2775ae1",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Ousted vaccine regulator Vinay Prasad to return to FDA",
    "url": "https://fortune.com/2025/08/09/vinay-prasad-fda-return-vaccine-regulator-laura-loomer/",
    "summary": "Laura Loomer, an ally of Donald Trump, had said Prasad was not aligned with the president’s agenda and has aggressively lobbied against his return.",
    "fullContent": "Laura Loomer, an ally of Donald Trump, had said Prasad was not aligned with the president’s agenda and has aggressively lobbied against his return.",
    "publishedAt": "2025-08-09T21:42:54.000Z",
    "fetchedAt": "2025-08-10T02:52:49.908Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2775ae1"
  },
  {
    "id": "yahoo-finance-5ebe65ba",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Shake Shack Inc. (SHAK) Is Struggling Due To Inflation, Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/shake-shack-inc-shak-struggling-214117264.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:41:17.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5ebe65ba"
  },
  {
    "id": "yahoo-finance-4bc1212c",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Shopify Inc. (SHOP) Is Just Crushing Everyone, Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/shopify-inc-shop-just-crushing-213901923.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:39:01.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4bc1212c"
  },
  {
    "id": "summer-of-protocols-4acb8f52",
    "sourceId": "summer-of-protocols",
    "sourceName": "Summer of Protocols",
    "title": "The Double-key",
    "url": "https://protocolized.summerofprotocols.com/p/the-double-key",
    "summary": "Issue #42: How To Do Words With Things",
    "fullContent": "Issue #42: How To Do Words With Things",
    "publishedAt": "2025-08-09T21:30:52.000Z",
    "fetchedAt": "2025-08-10T02:55:40.564Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "4acb8f52"
  },
  {
    "id": "fortune-3492de40",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Masked thieves stole all the Labubu dolls from a Los Angeles-area store. &#8216;We are still in shock&#8217;",
    "url": "https://fortune.com/2025/08/09/labubu-doll-theft-7000-dollars-los-angeles-area-masked-thieves/",
    "summary": "The incident took place early Wednesday morning, and about $7,000 worth of Labubu dolls were stolen.",
    "fullContent": "The incident took place early Wednesday morning, and about $7,000 worth of Labubu dolls were stolen.",
    "publishedAt": "2025-08-09T21:28:20.000Z",
    "fetchedAt": "2025-08-10T02:52:49.908Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3492de40"
  },
  {
    "id": "yahoo-finance-597102e7",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "SoundHound AI (SOUN) Wins Big Contracts, DA Davidson Boosts Price Target to $15",
    "url": "https://finance.yahoo.com/news/soundhound-ai-soun-wins-big-212845128.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:26:47.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "597102e7"
  },
  {
    "id": "business-insider-26d8c7a8",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Here's a look inside Disney Adventure, the company's largest cruise ship ever",
    "url": "https://www.businessinsider.com/disney-adventure-photos-largest-disney-cruise-ship-singapore-2025-8",
    "summary": "Disney's largest cruise ship yet, Disney Adventure, will sail from Singapore this December. CEO Bob Iger described the ship as a floating ambassador.",
    "fullContent": "Disney's largest cruise ship yet, Disney Adventure, will sail from Singapore this December. CEO Bob Iger described the ship as a floating ambassador.",
    "publishedAt": "2025-08-09T21:22:12.000Z",
    "fetchedAt": "2025-08-10T02:52:47.981Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "26d8c7a8"
  },
  {
    "id": "yahoo-finance-5af5f52e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Alphabet (GOOGL) Commits $1B to AI Training and Tools for Higher Education",
    "url": "https://finance.yahoo.com/news/alphabet-googl-commits-1b-ai-212041107.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:20:41.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5af5f52e"
  },
  {
    "id": "yahoo-finance-69f30a4c",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "No Guidance, No Call: Guggenheim Downgrades Informatica (INFA) Post–Q2 Results",
    "url": "https://finance.yahoo.com/news/no-guidance-no-call-guggenheim-211848059.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:18:48.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "69f30a4c"
  },
  {
    "id": "fortune-6cbc2df",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Fed Governor Bowman says weak jobs report backs her view for 3 rate cuts this year",
    "url": "https://fortune.com/2025/08/09/fed-rate-cuts-outlook-michelle-bowman-jobs-report-inflation-tariffs/",
    "summary": "Bowman said she is getting more confident that Trump's tariffs “will not present a persistent shock to inflation” and sees it moving closer to 2%.",
    "fullContent": "Bowman said she is getting more confident that Trump's tariffs “will not present a persistent shock to inflation” and sees it moving closer to 2%.",
    "publishedAt": "2025-08-09T21:16:25.000Z",
    "fetchedAt": "2025-08-10T02:52:49.908Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6cbc2df"
  },
  {
    "id": "yahoo-finance-5c791b3f",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Mizuho Cuts Atlassian (TEAM) Price Target to $235 but Sees Strong Multi-Year Growth Ahead",
    "url": "https://finance.yahoo.com/news/mizuho-cuts-atlassian-team-price-211123203.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:11:23.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5c791b3f"
  },
  {
    "id": "yahoo-finance-26f3d68a",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "DA Davidson Initiates Neutral Rating on Appian (APPN) After Earnings Beat",
    "url": "https://finance.yahoo.com/news/da-davidson-initiates-neutral-rating-210546931.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:05:46.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "26f3d68a"
  },
  {
    "id": "yahoo-finance-101792b5",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Goldman Sachs Reiterates Buy on NVIDIA (NVDA) With $200 PT Ahead of Earnings",
    "url": "https://finance.yahoo.com/news/goldman-sachs-reiterates-buy-nvidia-210256580.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T21:02:56.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "101792b5"
  },
  {
    "id": "oil-price-c5ca956",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "How Dirt Batteries Could Power the Energy Transition",
    "url": "https://oilprice.com/Energy/Energy-General/How-Dirt-Batteries-Could-Power-the-Energy-Transition.html",
    "summary": "The Trump administration is attempting to breathe new life into the nation’s declining coal industry, but greater market forces indicate that the dirtiest fossil fuel will likely continue its terminal decline.",
    "fullContent": "The Trump administration is attempting to breathe new life into the nation’s declining coal industry, but greater market forces indicate that the dirtiest fossil fuel will likely continue its terminal decline. Though the sitting president has signed an executive order aimed at “Reinvigorating America’s Beautiful Clean Coal Industry,“ there are zero new coal plants under construction as utilities “continue to prioritize adding renewables, batteries, gas and nuclear power ahead of new coal-fired capacity based on the…",
    "publishedAt": "2025-08-09T21:00:00.000Z",
    "fetchedAt": "2025-08-10T02:52:49.752Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "c5ca956"
  },
  {
    "id": "yahoo-finance-36703ea9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Fortinet (FTNT) Price Target Cut to $90 as UBS Warns of Low Double-Digit Growth Ahead",
    "url": "https://finance.yahoo.com/news/fortinet-ftnt-price-target-cut-205510107.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:55:10.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "36703ea9"
  },
  {
    "id": "fortune-bf421c1",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "A new bull market has begun and is still in the early stages, so buy the dips, top Wall Street analyst says",
    "url": "https://fortune.com/2025/08/09/new-bull-market-buy-the-dips-stock-outlook-sp500/",
    "summary": "Wilson's view is part of an increased sense of optimism on Wall Street as fears over tariffs ease with the signing of several trade deals.",
    "fullContent": "Wilson's view is part of an increased sense of optimism on Wall Street as fears over tariffs ease with the signing of several trade deals.",
    "publishedAt": "2025-08-09T20:55:03.000Z",
    "fetchedAt": "2025-08-10T02:52:49.908Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "bf421c1"
  },
  {
    "id": "zerohedge-3c573fe4",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "NeoCon Bolton: Alaska Summit A Gift To Moscow",
    "url": "https://www.zerohedge.com/geopolitical/neocon-bolton-alaska-summit-gift-moscow",
    "summary": "NeoCon Bolton: Alaska Summit A Gift To Moscow Somewhat to be expected, among the first to mount a full-on attack of President Trump's planned Alaska summit with Russia's President Putin set for next Friday is none other than former National Security Adviser John Bolton, who...",
    "fullContent": "NeoCon Bolton: Alaska Summit A Gift To Moscow Somewhat to be expected, among the first to mount a full-on attack of President Trump's planned Alaska summit with Russia's President Putin set for next Friday is none other than former National Security Adviser John Bolton, who served in the first Trump admin. Also to be expected is that he railed against the summit toward finding peace in Ukraine as playing into the Kremlin's hands. He told CNN's Kailtin Collins on \"The Source\" in a Friday interview: \"Well, it's very gracious of Putin to come to former Russian America for this summit. This is not quite as bad as Trump inviting the Taliban to Camp David to talk about the peace negotiations in Afghanistan, but it certainly reminds one of that.\" \"The only better place for Putin than Alaska would be if the summit were being held in Moscow,\" Bolton said. \"So, the initial setup, I think, is a great victory for Putin.\" AFP/Getty Images And of course, ultra-hawk Bolton invoked axis of evil type language in destribing Putin: \"He's a rogue leader of a pariah state, and he's going to be welcomed into the United States,\" Bolton added. \"I don't think anybody would have objected, frankly,\" the former adviser said. \"I have a feeling this is sliding very quickly in Russia's direction\" - he described of Putin's seeking to \"take advantage\" of Trump. \"We're not quite back at February the 28th, in the Oval Office, when Trump told [Ukrainian President Volodymyr] Zelenskyy, 'You don't have any cards.' But what's happening is that Russia and the United States are discussing what terms they're going to present to Zelenskyy, and it may well be that Zelenskyy has no choice here,\" he also said. \"Surrendering is always one way to get a peace deal.\" So there it is... the two leaders are still nearly a week out from their history-setting Alaska meeting and the narrative from both Republican and Democrat hawks is going to be 'appeasement!'. This is the same old playbook and talking-point. But the reality remains is that Washington will have to bring the pressure on Zelensky to cede territory in Eastern Ukraine (and certainly give up Crimea, for starters) if real progress toward a final settlement is to be made. Bolton dutifully gives CNN the type of simplisitc never Trump commentary its audience wants to here... Bolton: This is not quite as bad, as Trump inviting the Taliban to Camp David to talk about the peace negotiations in Afghanistan, but it certainly reminds one of that. The only better place for Putin than Alaska would be if the summit were being held in Moscow. So the initial… pic.twitter.com/yUSn8Fyj5v — Acyn (@Acyn) August 9, 2025 Yet this is the very thing Zelensky is vowing to never do. He said in a Saturday video address that \"Ukrainians will not gift their land to the occupier.\" \"Any decisions made against us, any decisions made without Ukraine, are at the same time decisions against peace.\" He then clarified Ukriane's position further, \"They will bring nothing. These are dead decisions; they will never work.\" Current and former officials like Bolton will now seek to highlight Zelensky's words, and rush to his defense amid Trump pressure to make serious compromises. Tyler Durden Sat, 08/09/2025 - 16:55",
    "publishedAt": "2025-08-09T20:55:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.704Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c573fe4"
  },
  {
    "id": "yahoo-finance-40b9400a",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "A Dave Ramsey Caller Wants To Evict His Own Mother. She's Not Paying Rent And Has Already Filed Bankruptcy 3 Times",
    "url": "https://finance.yahoo.com/news/dave-ramsey-caller-wants-evict-204812977.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:48:12.000Z",
    "fetchedAt": "2025-08-11T06:58:22.000Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "40b9400a"
  },
  {
    "id": "wsj-world-news-1567cba7",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Ukraine and Europe Counter Putin&#x2019;s Cease-Fire Proposal",
    "url": "https://www.wsj.com/world/ukraine-and-europe-counter-putins-cease-fire-proposal-6a16133c",
    "summary": "The alternative blueprint to end the war comes after Russia demanded major territorial concessions and President Trump said he would meet with Vladimir Putin next week.",
    "fullContent": "The alternative blueprint to end the war comes after Russia demanded major territorial concessions and President Trump said he would meet with Vladimir Putin next week.",
    "publishedAt": "2025-08-09T20:48:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.525Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "1567cba7"
  },
  {
    "id": "yahoo-finance-1cbaeb28",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "As Shopify Shares Soar, Is It Too Late to Buy the Stock?",
    "url": "https://finance.yahoo.com/news/shopify-shares-soar-too-buy-204100254.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:41:00.000Z",
    "fetchedAt": "2025-08-11T06:58:21.999Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1cbaeb28"
  },
  {
    "id": "yahoo-finance-7ec3c497",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "2 Stocks Down 83% and 23% to Buy Right Now",
    "url": "https://finance.yahoo.com/news/2-stocks-down-83-23-203200859.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:32:00.000Z",
    "fetchedAt": "2025-08-11T06:58:21.999Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7ec3c497"
  },
  {
    "id": "business-insider-5213207a",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "GPT-5 is meant for the casual user, not the advanced user. Here's why that's an upgrade.",
    "url": "https://www.businessinsider.com/gpt-5-model-switching-best-for-average-user-2025-8",
    "summary": "With GPT-5, OpenAI addresses the question: What's the point of a model being so intelligent if humans don't understand how to use it?",
    "fullContent": "With GPT-5, OpenAI addresses the question: What's the point of a model being so intelligent if humans don't understand how to use it?",
    "publishedAt": "2025-08-09T20:20:18.000Z",
    "fetchedAt": "2025-08-10T02:52:47.981Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5213207a"
  },
  {
    "id": "zerohedge-1e186199",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Record US Honey Bee Losses And What 'Mite' Be Behind Them",
    "url": "https://www.zerohedge.com/food/record-us-honey-bee-losses-and-what-mite-be-behind-them",
    "summary": "Record US Honey Bee Losses And What 'Mite' Be Behind Them Authored by Darlene McCormick Sanchez via The Epoch Times (emphasis ours), In arid South Texas, home to mesquite and cacti, it hasn’t been uncommon for commercial beekeeper Robert Wheeler to lose half his bees every year.",
    "fullContent": "Record US Honey Bee Losses And What 'Mite' Be Behind Them Authored by Darlene McCormick Sanchez via The Epoch Times (emphasis ours), In arid South Texas, home to mesquite and cacti, it hasn’t been uncommon for commercial beekeeper Robert Wheeler to lose half his bees every year. Bees belonging to Marin and Rodica Tomulet, owners of Joyful Bee Farms, make honey in Dickinson, N.D., on July 27, 2025. Samira Bouaou/The Epoch Times But this year has been far worse. His family-owned Frio Country Farms lost 2,000 of its 3,000 bee hives this year, many of which would have been pollinating crops such as watermelon and almonds had they lived. And he is not alone. America’s bees are dying at an alarming rate as scientists try to figure out why. The main suspect is the deadly Varroa mite, a vampiric parasite that carries viruses and has become immune to Amitraz, the primary pesticide used to kill it. Wheeler, a commercial beekeeper since 2019, said he is one of many in his trade who relied on Amitraz to keep his colonies healthy. “Some big beekeepers are hurting pretty bad right now because it takes a lot of money to run a big bee operation, and you can’t have a mistake because it'll cost too much,” Wheeler told The Epoch Times. “It is a pretty big deal what’s going on,” he said. “I mean, everything we eat is pollinated.” Bee Crisis Viruses spread by the Varroa mite, a devastating parasite that pierces the bodies of bees to drink their blood and nutrients, are the chief suspects, according to a U.S. Department of Agriculture (USDA) press release issued in June. Scientists examined mites from collapsed colonies across western states in February and discovered signs of resistance to Amitraz, a critical miticide widely used by beekeepers. “This miticide resistance was found in virtually all collected Varroa, underscoring the need for new parasitic treatment strategies,” according to the agency. The agency stated commercial beekeepers lost 1.7 million colonies, amounting to more than a 60 percent loss from summer 2024 through January. The economic impact was estimated at $600 million. Some beekeepers reported 80 percent or more hive losses, according to bee surveys. A survey carried out by the Apiary Inspectors of America noted “staggering” colony losses of more than 55 percent in a 12-month period ending April 1. The survey report said the losses were the highest reported since the annual survey first began tracking them in 2010–2011. “Experts warn that without immediate intervention, the ripple effects could drive up costs for farmers, disrupt food production, and shutter many commercial beekeeping operations,” according to a joint press release from the Honey Bee Health Coalition, released this spring in reaction to the losses. “In January 2025, beekeepers across the country began reporting unexpected large-scale honey bee losses—we now know the largest ever recorded in the U.S.,” Danielle Downey, executive director of Project Apis m., stated in the same release. Beekeepers Marin and Rodica Tomulet, owners of Joyful Bee Farms in Quinlan, Texas, stand beside their hives in Dickinson, N.D., on July 27, 2025. In July, USDA Secretary Brooke Rollins announced a reorganization plan that includes the relocation of the Beltsville Agricultural Research Center in Maryland. The center holds the country’s bee lab, a frontline research facility studying Varroa mites. The Epoch Times did not receive a response from the USDA concerning the details of how the relocation might affect bee research. Impact on Beekeepers In Texas, beekeeping has undergone a renaissance thanks to a 2012 law that grants property tax breaks to landowners who keep bees on at least five acres. A conservative estimate puts the number of Texas beekeepers at 6,000, including backyard beekeepers, “sideliners,” or medium-sized beekeepers with small businesses, and commercial bee operators. In the state, however, the average loss stands at 61 percent over the past year, according to preliminary survey results from the Apiary Inspectors of America. That rate has typically been more than 40 percent in recent years, far above the expected loss of about 25 percent, according to Garett Slater, an entomologist researching bees at the Texas A&M AgriLife Research and Extension Center at Overton, Texas. “They’re relying on Amitraz, and it’s not working,” Slater told The Epoch Times. “Their mite levels are exploding.” The consequences could be far-reaching since crops such as carrots, onions, blueberries, apples, cucumbers, melons, and almonds depend on bees for pollination. Slater said about a third of food crops rely on bees for pollination. “If you ever go to your grocery store … those shelves would look pretty bare if we can’t have bees for pollination,” Slater said. Commercial beekeepers—generally those with more than 300 colonies—have been hit particularly hard, making it difficult to provide bees for California almond crops, where operators can make $250 per hive. About 80 percent of the world’s almonds are produced in California, which require 80 billion insects, or 1.7 million hives, for pollination. “These losses are more widespread than ever before,” Slater said. “They’re experiencing probably the highest loss we’ve ever received for the commercial beekeepers.” Entomologist Garett Slater explains how queen bees can be artificially inseminated at the Texas A&M AgriLife Research and Extension Center in Overton, Texas. The leading cause of mass bee deaths is believed to be the Varroa mite, a vampiric parasite that spreads viruses and has developed resistance to Amitraz, the primary pesticide used to kill it. Slater’s goal is to breed queens that produce bees that destroy Varroa mites within a colony. Darlene Sanchez/The Epoch Times Researchers are just now getting the data they need to assess the impact on almond pollination, he said. Some beekeepers may be unable to stay in business if they sustain high bee losses year after year, though many split their hives to rebuild numbers. “But 80 percent losses—it’s really hard to take that 20 percent to make up for that 80 percent loss,” Slater said. Slater’s job, which was created at the university last year, will support beekeepers and promote good practices across the state. He is also starting Texas’s first bee breeding center—one of a handful in the country, he told The Epoch Times. The goal is to breed queens that produce bees that destroy Varroa mites within a colony. However, nationwide bee losses can’t be entirely explained by the unchecked spread of pesticide-resistant Varroa mites. Some believe pesticides and herbicides weaken the bees, along with poor nutrition, making them more susceptible to viruses. Corneliu Prelipceanu, a commercial beekeeper in California’s Bay Area, does not use Amitraz, and still suffered high losses. He uses organic pesticides such as formic acid and oxalic acid to kill the mites. Prelipceanu experienced his worst year since 2010, when he started his company, Elsi Bees. This past year, he lost 50 percent of his hives, significantly higher than the normal 20 to 30 percent loss, he said. Beekeeper Corneliu Prelipceanu, owner of Elsi Bees, in Antelope, N.D., on July 29, 2025. This past year marked Prelipceanu’s worst year since founding the business in 2010, with 50 percent of his hives lost. Samira Bouaou/The Epoch Times Blood-thirsty Mites Of all the threats that bees face, the Varroa mite has proven to be one of the most lethal since arriving in the United States in 1987. They feed on the body fat and blood of bees, and also spread the deadly deformed wing virus, according to a study published by the National Institutes of Health. “Mites are basically like having a plate-sized parasite on your chest if you’re a bee,” Slater said. Beekeepers began using insecticides such as coumaphos to kill the mites, but they became immune to the treatments around 2005, he said. They eventually switched to the insecticide Amitraz to kill the mites, which they’ve continued to use over the past 20 years. It’s a popular, widely used insecticide used in agriculture and veterinary medicine to control fleas and ticks. While there are alternatives to Amitraz, they pose problems for some beekeepers. Beekeepers can use organic pesticides such as oxalic acid, formic acid, and thymol, Slater said. But it can be a problem in warm southern states because formic acid and thymol can’t be used once the temperature rises above 85 degrees Fahrenheit. As for oxalic acid, it won’t kill the mites that hatch inside the cells where they begin to feed on bee larvae and pupae. Read the rest here... Tyler Durden Sat, 08/09/2025 - 16:20",
    "publishedAt": "2025-08-09T20:20:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.704Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e186199"
  },
  {
    "id": "yahoo-finance-1c6fe8aa",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Tesla Stumbles, but Elon Musk Gets a Massive Payday",
    "url": "https://finance.yahoo.com/news/tesla-stumbles-elon-musk-gets-201400658.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:14:00.000Z",
    "fetchedAt": "2025-08-11T06:58:21.999Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1c6fe8aa"
  },
  {
    "id": "yahoo-finance-78250a46",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Baird Sees Strong AI Potential in monday.com (MNDY), Raises PT to $310",
    "url": "https://finance.yahoo.com/news/baird-sees-strong-ai-potential-201119072.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:11:19.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "78250a46"
  },
  {
    "id": "yahoo-finance-57485311",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Veteran analyst warns top meme stock is worth less than zero",
    "url": "https://finance.yahoo.com/news/analyst-says-popular-meme-stock-200700020.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:07:00.000Z",
    "fetchedAt": "2025-08-11T06:58:21.999Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "57485311"
  },
  {
    "id": "yahoo-finance-7760386f",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Twilio (TWLO) PT Lifted to $144 on Strong Q2, Voice AI Demand",
    "url": "https://finance.yahoo.com/news/twilio-twlo-pt-lifted-144-200511064.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:05:11.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7760386f"
  },
  {
    "id": "yahoo-finance-7263bf0f",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Flying Cars Aren't Just Science Fiction Anymore. This Company Is Leading the Charge in eVTOLs -- and Yes, It's Publicly Traded.",
    "url": "https://finance.yahoo.com/news/flying-cars-arent-just-science-200500113.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:05:00.000Z",
    "fetchedAt": "2025-08-11T06:58:21.999Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7263bf0f"
  },
  {
    "id": "yahoo-finance-7b760fe2",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Barclays Bullish on Arista Networks (ANET) After AI Networking Revenue Surge",
    "url": "https://finance.yahoo.com/news/barclays-bullish-arista-networks-anet-200321224.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:01:14.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7b760fe2"
  },
  {
    "id": "yahoo-finance-4c6ef9b0",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "How 0% Interest Deals Can Wreck Your Finances, Even If You Never Miss A Payment",
    "url": "https://finance.yahoo.com/news/0-interest-deals-wreck-finances-200111859.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T20:01:11.000Z",
    "fetchedAt": "2025-08-11T06:58:21.999Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c6ef9b0"
  },
  {
    "id": "bloomberg-markets-25b0680f",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Inflation to Rise as Higher Tariffs Feed Through",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/us-inflation-to-rise-as-higher-tariffs-feed-through",
    "summary": "US consumers probably experienced a slight pickup in underlying inflation in July as retailers gradually raised prices on a variety of items subject to higher import duties.",
    "fullContent": "US consumers probably experienced a slight pickup in underlying inflation in July as retailers gradually raised prices on a variety of items subject to higher import duties.",
    "publishedAt": "2025-08-09T20:00:00.000Z",
    "fetchedAt": "2025-08-10T02:52:47.425Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "25b0680f"
  },
  {
    "id": "bloomberg-economics-25b0680f",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "US Inflation to Rise as Higher Tariffs Feed Through",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/us-inflation-to-rise-as-higher-tariffs-feed-through",
    "summary": "US consumers probably experienced a slight pickup in underlying inflation in July as retailers gradually raised prices on a variety of items subject to higher import duties.",
    "fullContent": "US consumers probably experienced a slight pickup in underlying inflation in July as retailers gradually raised prices on a variety of items subject to higher import duties.",
    "publishedAt": "2025-08-09T20:00:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.093Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "25b0680f"
  },
  {
    "id": "yahoo-finance-2367f246",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Palo Alto Networks (PANW) Price Target Trimmed to $204 Despite Positive CyberArk Outlook",
    "url": "https://finance.yahoo.com/news/palo-alto-networks-panw-price-195812439.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:58:12.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2367f246"
  },
  {
    "id": "techmeme-458ac9bc",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A look at Changpeng Zhao's efforts to get a pardon from Trump for his money-laundering charges, including via lobbying and a business deal with the Trump family (New York Times)",
    "url": "http://www.techmeme.com/250809/p11#a250809p11",
    "summary": "New York Times: A look at Changpeng Zhao's efforts to get a pardon from Trump for his money-laundering charges, including via lobbying and a business deal with the Trump family — A sophisticated operation is pushing President Trump to forgive Changpeng Zhao, which would boost...",
    "fullContent": "New York Times: A look at Changpeng Zhao's efforts to get a pardon from Trump for his money-laundering charges, including via lobbying and a business deal with the Trump family — A sophisticated operation is pushing President Trump to forgive Changpeng Zhao, which would boost the chances for his company, Binance, to break into the U.S. market.",
    "publishedAt": "2025-08-09T19:55:48.000Z",
    "fetchedAt": "2025-08-10T02:52:49.962Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "458ac9bc"
  },
  {
    "id": "yahoo-finance-4a2e45cc",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Datadog (DDOG) PT Lifted to $170 on AI-Driven Usage Growth",
    "url": "https://finance.yahoo.com/news/datadog-ddog-pt-lifted-170-195311189.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:53:11.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4a2e45cc"
  },
  {
    "id": "yahoo-finance-63c0ba7a",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "UBS Reiterates Buy on AppLovin (APP) With $540 PT After Q2 Beat",
    "url": "https://finance.yahoo.com/news/ubs-reiterates-buy-applovin-app-195118357.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:51:07.000Z",
    "fetchedAt": "2025-08-11T02:36:53.433Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "63c0ba7a"
  },
  {
    "id": "yahoo-finance-54e74d23",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "BofA Maintains Neutral on Tesla (TSLA) as Chip Tariffs Loom",
    "url": "https://finance.yahoo.com/news/bofa-maintains-neutral-tesla-tsla-194732591.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:47:32.000Z",
    "fetchedAt": "2025-08-11T02:36:53.432Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "54e74d23"
  },
  {
    "id": "yahoo-finance-64495f2f",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Marjorie Taylor Greene's Palantir Bet Has Skyrocketed 142% Since She Bought It",
    "url": "https://finance.yahoo.com/news/marjorie-taylor-greenes-palantir-bet-194647386.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:46:47.000Z",
    "fetchedAt": "2025-08-11T06:58:21.999Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "64495f2f"
  },
  {
    "id": "yahoo-finance-d49b019",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Wells Fargo Stays Bullish on Apple (AAPL) Amid $100B U.S. Expansion Plan",
    "url": "https://finance.yahoo.com/news/wells-fargo-stays-bullish-apple-194439036.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:44:39.000Z",
    "fetchedAt": "2025-08-11T02:36:53.432Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d49b019"
  },
  {
    "id": "bloomberg-markets-6c538d43",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Mexico Sets Tomato Export Prices to Ease US Trade Spat",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/mexico-sets-tomato-export-prices-to-ease-trade-spat-with-trump",
    "summary": "Mexico set minimum prices for fresh tomato exports to the US, seeking to regain full access to the market after the Trump administration imposed an anti-dumping duty.",
    "fullContent": "Mexico set minimum prices for fresh tomato exports to the US, seeking to regain full access to the market after the Trump administration imposed an anti-dumping duty.",
    "publishedAt": "2025-08-09T19:36:48.000Z",
    "fetchedAt": "2025-08-10T02:52:47.425Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6c538d43"
  },
  {
    "id": "bloomberg-economics-6c538d43",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Mexico Sets Tomato Export Prices to Ease US Trade Spat",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/mexico-sets-tomato-export-prices-to-ease-trade-spat-with-trump",
    "summary": "Mexico set minimum prices for fresh tomato exports to the US, seeking to regain full access to the market after the Trump administration imposed an anti-dumping duty.",
    "fullContent": "Mexico set minimum prices for fresh tomato exports to the US, seeking to regain full access to the market after the Trump administration imposed an anti-dumping duty.",
    "publishedAt": "2025-08-09T19:36:48.000Z",
    "fetchedAt": "2025-08-10T02:52:48.093Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "6c538d43"
  },
  {
    "id": "bloomberg-politics-6c538d43",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Mexico Sets Tomato Export Prices to Ease US Trade Spat",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/mexico-sets-tomato-export-prices-to-ease-trade-spat-with-trump",
    "summary": "Mexico set minimum prices for fresh tomato exports to the US, seeking to regain full access to the market after the Trump administration imposed an anti-dumping duty.",
    "fullContent": "Mexico set minimum prices for fresh tomato exports to the US, seeking to regain full access to the market after the Trump administration imposed an anti-dumping duty.",
    "publishedAt": "2025-08-09T19:36:48.000Z",
    "fetchedAt": "2025-08-10T02:52:48.088Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6c538d43"
  },
  {
    "id": "marketwatch-4a3f694",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x2018;Things are getting tougher&#x2019;: I&#x2019;m struggling with $145,000 in debt. Should I refinance my 3.5% mortgage?",
    "url": "https://www.marketwatch.com/story/things-are-getting-tougher-im-struggling-with-145-000-in-debt-should-i-refinance-my-3-5-mortgage-6a7962c9?mod=mw_rss_topstories",
    "summary": "&#x201c;I&#x2019;m in my upper 40s and have $300,000 in my 401(k).&#x201d;",
    "fullContent": "&#x201c;I&#x2019;m in my upper 40s and have $300,000 in my 401(k).&#x201d;",
    "publishedAt": "2025-08-09T19:28:00.000Z",
    "fetchedAt": "2025-08-10T02:52:49.884Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4a3f694"
  },
  {
    "id": "yahoo-finance-7beafdcf",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Couple making $180K say they're one mistake away 'from losing everything' — Ramit Sethi says their problem is 'not math'",
    "url": "https://finance.yahoo.com/news/couple-making-180k-theyre-one-191500200.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:15:00.000Z",
    "fetchedAt": "2025-08-11T02:36:53.432Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7beafdcf"
  },
  {
    "id": "ndtv-profit-rss-a866c02",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "SEBI Proposes Lower Entry Threshold For Large-Value AIFs At Rs 25 Crore",
    "url": "https://www.ndtvprofit.com/markets/sebi-proposes-lower-entry-threshold-for-large-value-aifs-at-rs-25-crore",
    "summary": "The proposals follow recommendations from Sebi's Alternative Investment Policy Advisory Committee and the Ease of Doing Business Working Group.",
    "fullContent": "The proposals follow recommendations from Sebi's Alternative Investment Policy Advisory Committee and the Ease of Doing Business Working Group.",
    "publishedAt": "2025-08-09T19:13:43.284Z",
    "fetchedAt": "2025-08-10T02:52:49.773Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a866c02"
  },
  {
    "id": "yahoo-finance-3f584a3c",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Surprising AI chip stock is up 90% in 30 days (and still climbing)",
    "url": "https://finance.yahoo.com/news/surprising-ai-chip-stock-90-191300411.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:13:00.000Z",
    "fetchedAt": "2025-08-11T04:56:35.413Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3f584a3c"
  },
  {
    "id": "zerohedge-49b4ad76",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Waste Of The Day: Hospital CEO Paid Herself, Colleagues Before Resigning",
    "url": "https://www.zerohedge.com/political/waste-day-hospital-ceo-paid-herself-colleagues-resigning",
    "summary": "Waste Of The Day: Hospital CEO Paid Herself, Colleagues Before Resigning Authored by Jeremy Portnoy via RealClearInvestigations, Topline: Megan C. Ryan, former CEO of the public Nassau University Medical Center on Long Island, New York, authorized a $3.",
    "fullContent": "Waste Of The Day: Hospital CEO Paid Herself, Colleagues Before Resigning Authored by Jeremy Portnoy via RealClearInvestigations, Topline: Megan C. Ryan, former CEO of the public Nassau University Medical Center on Long Island, New York, authorized a $3.5 million payout of taxpayer funds to herself and 12 colleagues days after announcing her resignation, Newsday first reported. Key facts: On May 31, Gov. Kathy Hochul announced what is essentially a state takeover of the hospital, with new oversight laws and four state officials added to the hospital’s Board of Directors. Days before, Ryan announced she would resign as CEO effective July 20. Her exit was quickly expedited — the new Board voted to fire Ryan for cause on June 18. A letter the Board sent to Ryan claims the $3.5 million payout Ryan authorized contains “at least $1 million” of excess funds that do not have a “valid business purpose” and that Ryan and her colleagues were never entitled to, Newsday reported. Ryan does not dispute approving the $3.5 million payment but says she and the other employees who resigned along with her were owed the full amount for salary and unused vacation and sick time. She says the allegations are a “political hit-job” and plans to sue the Board of Directors to clear her name. The Board told Newsday they stand behind the accusations. A spokesperson for Ryan told OpenTheBooks, “Unlike previous CEOs, who racked up hundreds of thousands in inappropriate expenses, Ms. Ryan, during her short tenure, personally paid thousands of dollars for initiatives that were not reimbursed, including food for employees, transportation, and supplies for community events. Any suggestion that she did anything improper or was reimbursed inappropriately is just another effort to distract from the State’s Medicaid corruption, now under investigation by Congress, the millions in illegal no-bid contracts approved by Hochul’s new appointees and [the hospital’s] violation of Ms. Ryan’s employment contract.” Regardless of whether the payments were legal, they are a huge expense for a hospital that has teetered on the edge of bankruptcy for years. NUMC is the only public hospital in Nassau County, and relies on federal, state and local funds. It has posted a $700 million deficit over the last decade, prompting the state takeover. Nassau County Legislator Siela Bynoe said in 2024 that there was a “real possibility” of the hospital closing its doors. Despite the budget troubles, NUMC doctors are among the highest-paid public employees in New York. OpenTheBooks previously reported that four doctors each earned over $2 million from 2017 to 2023 from salary and pensions. The hospital spent $241.7 million on payroll in 2024, with 3,083 people earning between $200,000 and $667,000. Ryan earned $250,000 in salary last year, according to payroll records. OpenTheBooks has filed an open records request to see what additional compensation Ryan earned last year, if any. Search all federal, state and local salaries and vendor spending with the world’s largest government spending database at OpenTheBooks.com. Summary: Public officials around the country often bill taxpayers for unused vacation time and other perks, but it’s especially hard to justify at a hospital that barely has enough money to function. The #WasteOfTheDay is brought to you by the forensic auditors at OpenTheBooks.com Tyler Durden Sat, 08/09/2025 - 15:10",
    "publishedAt": "2025-08-09T19:10:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.705Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49b4ad76"
  },
  {
    "id": "ndtv-profit-youtube-664ad1a1",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "India Shot Down 6 Pakistani Aircraft During Sindoor: Air Chief | CTRL ALT Defence Ep 15",
    "url": "https://www.youtube.com/watch?v=0V2dWjtWJ5Q",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:01:57.000Z",
    "fetchedAt": "2025-08-10T02:52:56.500Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "664ad1a1"
  },
  {
    "id": "bloomberg-business-youtube-69ba0e9",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "How much does it cost to fire a CEO?",
    "url": "https://www.youtube.com/shorts/9WMU57rLbrc",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T19:00:09.000Z",
    "fetchedAt": "2025-08-10T02:52:59.607Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "69ba0e9"
  },
  {
    "id": "wired-432018ae",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "A Special Diamond Is the Key to a Fully Open Source Quantum Sensor",
    "url": "https://www.wired.com/story/fully-open-source-quantum-sensor-uncut-gem/",
    "summary": "Quantum sensors can be used in medical technologies, navigation systems, and more, but they’re too expensive for most people. That's where the Uncut Gem open source project comes in.",
    "fullContent": "Quantum sensors can be used in medical technologies, navigation systems, and more, but they’re too expensive for most people. That's where the Uncut Gem open source project comes in.",
    "publishedAt": "2025-08-09T18:40:47.000Z",
    "fetchedAt": "2025-08-10T02:52:49.559Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "432018ae"
  },
  {
    "id": "fortune-10112506",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Putin will meet Trump as a &#8216;fiscal crunch&#8217; is about to hit Russia&#8217;s war machine",
    "url": "https://fortune.com/2025/08/09/russia-economy-fiscal-deficit-trump-putin-meeting-alaska-ukraine-war/",
    "summary": "\"Though that may not be enough to compel Putin to seek peace, it does suggest that the walls are closing in on him.\"",
    "fullContent": "\"Though that may not be enough to compel Putin to seek peace, it does suggest that the walls are closing in on him.\"",
    "publishedAt": "2025-08-09T18:40:13.000Z",
    "fetchedAt": "2025-08-10T02:52:49.908Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "10112506"
  },
  {
    "id": "business-insider-674f3f45",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "A stranger came to help me out when I was stranded on the side of the road. He had a profound impact on my life.",
    "url": "https://www.businessinsider.com/stranger-helped-stranded-on-road-changed-my-life-2025-8",
    "summary": "I didn't know how to change a flat tire and it was getting dark. A stranger stopped to help me and left before I could thank me. It changed my life.",
    "fullContent": "I didn't know how to change a flat tire and it was getting dark. A stranger stopped to help me and left before I could thank me. It changed my life.",
    "publishedAt": "2025-08-09T18:38:01.000Z",
    "fetchedAt": "2025-08-10T02:52:47.981Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "674f3f45"
  },
  {
    "id": "ndtv-profit-youtube-396ed7f7",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Donald Trump's $1 Trillion Tariff Windfall? Where The Money Really Goes? | Washington Watch",
    "url": "https://www.youtube.com/watch?v=cbB4HeVOrYA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T18:37:02.000Z",
    "fetchedAt": "2025-08-10T02:52:56.500Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "396ed7f7"
  },
  {
    "id": "zerohedge-4ae3c849",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Dark Side Of 'The Next AI Trade': Welcome To The People's Revolt",
    "url": "https://www.zerohedge.com/ai/dark-side-next-ai-trade-welcome-peoples-revolt",
    "summary": "Dark Side Of 'The Next AI Trade': Welcome To The People's Revolt A public backlash is brewing against \"The Next AI Trade\" as power bills surge nationwide, especially in the Mid-Atlantic and Northeast areas, where the Mag 7's massive CapEx boom is carpeting the region with data...",
    "fullContent": "Dark Side Of 'The Next AI Trade': Welcome To The People's Revolt A public backlash is brewing against \"The Next AI Trade\" as power bills surge nationwide, especially in the Mid-Atlantic and Northeast areas, where the Mag 7's massive CapEx boom is carpeting the region with data centers lined with rows of energy-hungry GPUs running chatbots and all things AI. What we know so far is that we're likely in the early innings of the revolt against the data center buildout supercharged by President Trump's AI Stargate project, as alarming internet search trends show more and more Americans in these regions Googling about the surge in power costs over just a few short years, with some even resorting to apps like \"Deferit\" to split their power bills into four interest-free installments. The epicenter of the people's revolt against the massive expansion of AI data centers, gobbling up local resources like power, land, and water, began in Central Maryland, where residents first pushed back in summer of 2024 against the risk of losing their properties to make way for new transmission lines needed to power data centers in Northern Virginia. We first identified the 'dark side' of 'The Next AI Trade' one year ago: Dark Side Of 'The Next AI Trade': Seizing Private Property For Transmission Lines Next, the power bill crisis in Maryland: According to local news station WBAL, over 264,000 in Central Maryland are behind on their power bills, which represents roughly one-fifth of all Baltimore Gas and Electric customers. Power bills are spiraling out of control in counties just north of Washington, DC, because far-left Governor Wes Moore and crazed progressive lawmakers in Annapolis prioritized failed 'green' policies in the age of increasing baseload power demand from data centers, EVs, and other electrification trends. The power crunch sparked by Democrats in Maryland is a \"manufactured crisis\" that has sent electric bills skyrocketing and crushed the pocketbooks of mom-and-pop businesses and working poor households the hardest. But it's not just Maryland residents burned by soaring power costs and data centers gobbling up local resources... It's happening in the Mid-Atlantic, Northeast, and other parts of the nation. 🚨 THREAD: The Maryland Freedom Caucus Was Right For months, we warned that Maryland’s rush to shut down reliable power plants would lead to blackouts, rate hikes, and federal intervention. Now PJM is confirming every word. 🧵 pic.twitter.com/kc1YzN1i4V — Maryland Freedom Caucus (@MDFreedomCaucus) July 24, 2025 One of the main forces driving the nationwide data center boom is the AI arms race with China. What U.S. Energy Secretary Chris Wright has dubbed America's \"next Manhattan Project\" is aimed at keeping the U.S. ahead of China ahead of the 2030s. U.S. hyperscalers are unleashing an ungodly amount of new capital towards the buildout of AI infrastructure nationwide. More power-intensive GPUs are coming online in the years ahead, as per a UBS note. The timing of this buildout, as explained to us by one Blue Owl Capital executive, will remain in \"sprint\" mode through the end of the decade. Recall that Blue Owl is financing the massive AI data center in Abilene, Texas, the first Stargate project. The rapid expansion of data centers has sparked local growing resistance, with 142 grassroots groups across 28 states now organized to block construction and expansion efforts. So far, these local groups have managed to block $18 billion worth of proposed data centers and delay another $46 billion. New local resistance has also emerged in Arizona, with Tucson's City Council recently voting unanimously to end all discussions with Beale Infrastructure regarding Project Blue, a proposed Amazon Web Services (AWS) data center complex. Tucson's City Council nuked Project Blue after weeks of intense public backlash, with residents protesting concerns over water use, environmental impact, and corporate secrecy. Here is the summary of what happened: Unanimous Rejection: The 7–0 vote terminated the annexation process required to provide city water to the site and nullified a related land sale agreement with Pima County. Public Outcry: Thousands attended three public meetings opposing the $3.6 billion project. Concerns included transparency, AI surveillance, low job creation, and high water and energy consumption. Water Use Concerns: Documents revealed the two Tucson-area data centers would consume more water than four golf courses—up to 2,000 acre-feet annually, making them the city's largest water customer. Job Promises Scrutinized: Developers touted 3,000 temporary construction jobs and 180 permanent roles, but were only contractually obligated to hire 75. Amazon Confirmed as Client: While cloaked in NDAs, Councilmember Rocque Perez confirmed AWS as the end user during the meeting. Regulation Path Forward: Mayor Regina Romero proposed developing data center-specific regulations aligned with Tucson's 2045 carbon neutrality goals. The Council agreed. Larger Themes: Councilmembers criticized corporate influence, \"tech bro\" culture, and federal preemption over AI regulation. Some questioned the role of data centers in government surveillance and predictive policing. Activism Victory: The No Desert Data Center Coalition hailed the vote as a win for environmental justice and community activism, vowing to remain vigilant against future attempts by Amazon or its partners. Developers' Next Steps: Beale Infrastructure hinted it may pursue similar projects in neighboring jurisdictions like Marana or Sahuarita. What's notable about Tucson is that it's among the first cities to reject a major AWS data center during the Stargate data center boom, with residents choosing to prioritize water conservation and other local resources. But Tucson is just one spoke in the wheel of nationwide local resistance gaining momentum. Add to that the Baltimore-area residents burned by soaring power bills and land grab threats, along with many others across the country who will eventually realize that their rising power costs stem from a combination of new data centers coming online and failed green energy policies. The lawmakers asleep at the wheel over a 'climate crisis' hoax should've prioritized nuclear a decade ago for clean, reliable baseload capacity, not solar and wind, plus retiring reliable fossil fuel power generation was an epic mistake. Tyler Durden Sat, 08/09/2025 - 14:35",
    "publishedAt": "2025-08-09T18:35:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.705Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ae3c849"
  },
  {
    "id": "marketwatch-7b23eddd",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "A voice breaking from the Fed ranks just heightened her push for cutting interest rates fast",
    "url": "https://www.marketwatch.com/story/a-voice-breaking-from-the-fed-ranks-just-heightened-her-push-for-cutting-interest-rates-fast-4bd935a9?mod=mw_rss_topstories",
    "summary": "Fed Gov. Michelle Bowman is doubling down on her call to cut interest rates, urging the central bank to move faster to protect what she sees as a weakening jobs market.",
    "fullContent": "Fed Gov. Michelle Bowman is doubling down on her call to cut interest rates, urging the central bank to move faster to protect what she sees as a weakening jobs market.",
    "publishedAt": "2025-08-09T18:31:00.000Z",
    "fetchedAt": "2025-08-10T02:52:49.884Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7b23eddd"
  },
  {
    "id": "ndtv-profit-rss-4dc8f1f4",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Delhi Records Coldest August Day In 14 Years After Heavy Rains",
    "url": "https://www.ndtvprofit.com/nation/delhi-records-coldest-august-day-in-14-years-after-heavy-rains",
    "summary": "IMD data showed that Delhi's primary weather station, Safdarjung, received 78.7 mm of rainfall in the 24 hours ending at 8:30 am on Saturday.",
    "fullContent": "IMD data showed that Delhi's primary weather station, Safdarjung, received 78.7 mm of rainfall in the 24 hours ending at 8:30 am on Saturday.",
    "publishedAt": "2025-08-09T18:21:29.097Z",
    "fetchedAt": "2025-08-10T02:52:49.773Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4dc8f1f4"
  },
  {
    "id": "nyt-business-316b92d2",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Morton Meyerson, Texas Businessman and Perot Lieutenant, Dies at 87",
    "url": "https://www.nytimes.com/2025/08/09/business/morton-meyerson-dead.html",
    "summary": "He helped build H. Ross Perot’s company Electronic Data Systems into a leading data processing firm. He later played a crucial role in Mr. Perot’s 1992 presidential campaign.",
    "fullContent": "He helped build H. Ross Perot’s company Electronic Data Systems into a leading data processing firm. He later played a crucial role in Mr. Perot’s 1992 presidential campaign.",
    "publishedAt": "2025-08-09T18:14:42.000Z",
    "fetchedAt": "2025-08-10T02:52:48.265Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "316b92d2"
  },
  {
    "id": "marketwatch-687b14df",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Stock buybacks are surging. Here&#x2019;s why it matters to your portfolio.",
    "url": "https://www.marketwatch.com/story/dividends-rise-when-companies-have-confidence-about-earnings-but-this-is-happening-instead-c5ef7d9e?mod=mw_rss_topstories",
    "summary": "This year&#x2019;s record-setting pace of share buybacks is bearish.",
    "fullContent": "This year&#x2019;s record-setting pace of share buybacks is bearish.",
    "publishedAt": "2025-08-09T18:13:00.000Z",
    "fetchedAt": "2025-08-10T02:52:49.884Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "687b14df"
  },
  {
    "id": "ndtv-profit-rss-2773b26f",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "MTAR Technologies Banks On 'Strong Order Book' To Achieve 21% Ebitda Margin In FY26",
    "url": "https://www.ndtvprofit.com/business/mtar-technologies-banks-on-strong-order-book-to-achieve-21-ebitda-margin-in-fy26",
    "summary": "MTAR Technologies plans to execute approx Rs 800 crore out of its order book in FY26. The company expects orders worth over Rs 1,000 crore from its nuclear business in six months.",
    "fullContent": "MTAR Technologies plans to execute approx Rs 800 crore out of its order book in FY26. The company expects orders worth over Rs 1,000 crore from its nuclear business in six months.",
    "publishedAt": "2025-08-09T18:11:47.728Z",
    "fetchedAt": "2025-08-10T02:52:49.773Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2773b26f"
  },
  {
    "id": "ndtv-profit-rss-7e8153c",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Nifty In Technical Charts: A Bit Of A Slip",
    "url": "https://www.ndtvprofit.com/opinion/stock-market-nse-nifty-50-in-technical-charts",
    "summary": "Nifty In Technical Charts: In the last 10 years, India seems to have lost its mojo as far as the foreign investor is concerned.",
    "fullContent": "Nifty In Technical Charts: In the last 10 years, India seems to have lost its mojo as far as the foreign investor is concerned.",
    "publishedAt": "2025-08-09T18:08:55.792Z",
    "fetchedAt": "2025-08-10T02:52:49.774Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7e8153c"
  },
  {
    "id": "yahoo-finance-32ef45f2",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "8 Key Signs You Should Switch Financial Advisors in Current Economic Landscape",
    "url": "https://finance.yahoo.com/news/8-key-signs-switch-financial-180440592.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T18:04:40.000Z",
    "fetchedAt": "2025-08-11T04:56:35.413Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "32ef45f2"
  },
  {
    "id": "ndtv-profit-rss-67b74bb6",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Banking Should Be For All: Jay Kotak Slams ICICI's MAB Hike —'90% Of India Makes Less Than...'",
    "url": "https://www.ndtvprofit.com/trending/jay-kotak-slams-icicis-mab-hike-banking-should-be-for-all-90-of-india-makes-less-than",
    "summary": "Jay Kotak, son of Uday Kotak, slammed ICICI Bank's MAB hike to Rs 50,000, highlighting the plight of several middle-class employees, who still earn Rs 25,000 per month.",
    "fullContent": "Jay Kotak, son of Uday Kotak, slammed ICICI Bank's MAB hike to Rs 50,000, highlighting the plight of several middle-class employees, who still earn Rs 25,000 per month.",
    "publishedAt": "2025-08-09T18:04:37.150Z",
    "fetchedAt": "2025-08-10T02:52:49.774Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "67b74bb6"
  },
  {
    "id": "bloomberg-business-youtube-2ce4d878",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Why More Americans Are Choosing to Rent a Home #house #realestate #shorts",
    "url": "https://www.youtube.com/shorts/euXsID1aie8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T18:00:37.000Z",
    "fetchedAt": "2025-08-10T02:52:59.607Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2ce4d878"
  },
  {
    "id": "yahoo-finance-22b6c0d9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Why Clean Energy Fuels Stock Raced Nearly 13% Higher Today",
    "url": "https://finance.yahoo.com/news/why-clean-energy-fuels-stock-175739055.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:57:39.000Z",
    "fetchedAt": "2025-08-11T04:56:35.412Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "22b6c0d9"
  },
  {
    "id": "techmeme-4dbcbcb6",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A steady stream of large conventions in China showcasing homegrown humanoid robots is stirring investor excitement, even though sales are far from taking off (Wataru Suzuki/Nikkei Asia)",
    "url": "http://www.techmeme.com/250809/p10#a250809p10",
    "summary": "Wataru Suzuki / Nikkei Asia: A steady stream of large conventions in China showcasing homegrown humanoid robots is stirring investor excitement, even though sales are far from taking off — BEIJING — China is holding a steady stream of large-scale conventions showcasing its...",
    "fullContent": "Wataru Suzuki / Nikkei Asia: A steady stream of large conventions in China showcasing homegrown humanoid robots is stirring investor excitement, even though sales are far from taking off — BEIJING — China is holding a steady stream of large-scale conventions showcasing its homegrown humanoid robots &hellip;",
    "publishedAt": "2025-08-09T17:55:45.000Z",
    "fetchedAt": "2025-08-10T02:52:49.962Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4dbcbcb6"
  },
  {
    "id": "marketwatch-6945c20a",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Is booze making a comeback? The sober craze may have run its course.",
    "url": "https://www.marketwatch.com/story/is-gen-z-really-drinking-less-alcohol-or-just-being-choosier-about-when-they-indulge-i-love-a-good-mojito-388ae920?mod=mw_rss_topstories",
    "summary": "There&#x2019;s evidence to suggest the challenges facing alcohol brands &#x2014; especially with Gen Z &#x2014; could be more a temporary blip than a permanent shift in drinking culture.",
    "fullContent": "There&#x2019;s evidence to suggest the challenges facing alcohol brands &#x2014; especially with Gen Z &#x2014; could be more a temporary blip than a permanent shift in drinking culture",
    "publishedAt": "2025-08-09T17:54:00.000Z",
    "fetchedAt": "2025-08-10T02:52:49.884Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6945c20a"
  },
  {
    "id": "yahoo-finance-25dea07c",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Here's Why Joby Aviation Stock Flew Higher in July",
    "url": "https://finance.yahoo.com/news/heres-why-joby-aviation-stock-175100443.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:51:00.000Z",
    "fetchedAt": "2025-08-11T04:56:35.412Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "25dea07c"
  },
  {
    "id": "bloomberg-politics-1715a95e",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Lula, Putin Discuss Stronger Brazil-Russia Ties in Phone Call",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/lula-putin-discuss-stronger-brazil-russia-ties-in-phone-call",
    "summary": "Russian President Vladimir Putin called Brazilian counterpart Luiz Inácio Lula da Silva to discuss cooperation among so-called BRICS countries, whose loose alliance has been energized by US tariff policy.",
    "fullContent": "Russian President Vladimir Putin called Brazilian counterpart Luiz Inácio Lula da Silva to discuss cooperation among so-called BRICS countries, whose loose alliance has been energized by US tariff policy.",
    "publishedAt": "2025-08-09T17:44:56.000Z",
    "fetchedAt": "2025-08-10T02:52:48.089Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1715a95e"
  },
  {
    "id": "bloomberg-markets-4f930790",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Everything’s Expensive. There’s Nowhere to Hide: Credit Weekly",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/everything-s-expensive-there-s-nowhere-to-hide-credit-weekly",
    "summary": "Credit market bargain shoppers are having the hardest time finding deals in at least a generation.",
    "fullContent": "Credit market bargain shoppers are having the hardest time finding deals in at least a generation.",
    "publishedAt": "2025-08-09T17:43:22.000Z",
    "fetchedAt": "2025-08-10T02:52:47.425Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4f930790"
  },
  {
    "id": "yahoo-finance-4b7342ad",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Everything’s Expensive. There’s Nowhere to Hide: Credit Weekly",
    "url": "https://finance.yahoo.com/news/everything-expensive-nowhere-hide-credit-174322190.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:43:22.000Z",
    "fetchedAt": "2025-08-11T04:56:35.412Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4b7342ad"
  },
  {
    "id": "yahoo-finance-419816aa",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "‘I’m tired of corporate America’: My wife and I have $1.65 million. I’m 61. Can I retire already?",
    "url": "https://finance.yahoo.com/news/m-tired-corporate-america-wife-185100992.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:31:00.000Z",
    "fetchedAt": "2025-08-11T04:56:35.412Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "419816aa"
  },
  {
    "id": "yahoo-finance-6f8369dc",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Building Growth Lanes That Work in Any Market",
    "url": "https://finance.yahoo.com/news/building-growth-lanes-market-173000678.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:30:00.000Z",
    "fetchedAt": "2025-08-11T02:36:53.432Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6f8369dc"
  },
  {
    "id": "zerohedge-212a89a0",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Rosie O'Donnell Claims ABC \"Gonna Cancel\" The View",
    "url": "https://www.zerohedge.com/political/rosie-odonnell-claims-abc-gonna-cancel-view",
    "summary": "Rosie O'Donnell Claims ABC \"Gonna Cancel\" The View The liberal media matrix that spent years saturating the minds of Americans with Biden-Harris regime and Deep State propaganda, toxic woke ideology, discredited Russia-collusion stories, and a censorship-driven leftist agenda...",
    "fullContent": "Rosie O'Donnell Claims ABC \"Gonna Cancel\" The View The liberal media matrix that spent years saturating the minds of Americans with Biden-Harris regime and Deep State propaganda, toxic woke ideology, discredited Russia-collusion stories, and a censorship-driven leftist agenda is now accelerating its collapse in real time, freeing the minds of tens of millions. The next domino to potentially fall could be \"The View\" on ABC. Unfunny and unhinged leftist comedian Rosie O'Donnell posted a lengthy message on TikTok about the show's imminent demise, which features a panel of leftist women hosts who spend their days screeching anti-Trump rhetoric. Here's what O'Donnell wrote You know what I just read today? ABC is \"reviewing the liberal bias\" on The View. The VIEW. The show with five women speaking the own opinions – That's the threat now. They say they're not canceling it—they're just \"reviewing the bias.\" Which is code for – we're gonna cancel it we're just trying to soften you up first. \"The View is a leftist echo chamber through and through,\" media watchdog group Media Research Center recently wrote on X. The View is a leftist echo chamber through and through pic.twitter.com/KXpzuHMJK3 — MRC NewsBusters (@newsbusters) August 2, 2025 O'Donnell claimed, \"This isn't about bias - This is about obedience. This is about removing any program that doesn't align with Trumpism — soft fascism in full lashes with commercial breaks.\" Yet the women on The View are noting more than useful idiots - or puppets - who promoted an endless amount of misinformation and disinformation from the Obama-Clinton regime. Remember: Russia! Trump! Russia! Trump! Donald Trump wanted Flynn to contact Russia so they could work together to destroy ISIS. This is @TheView's reaction to this. This video will not age well. pic.twitter.com/8r7K64pYco — Liberal 'Logic' 🇺🇸 (@LiberalLogic123) December 2, 2017 .@MeghanMcCain calls Trump's Putin comments \"extremely dangerous\" and \"un-American\": \"Our president acted like a pathetic puppy who was completely neutered around a former KGB agent, [a] murderous dictator who has caused some of the worst atrocities.\" pic.twitter.com/8YqZ1ZjkCC — The View (@TheView) July 21, 2018 The View has to be getting government kickbacks. No way people actually watch this show: Sunny Hostin: Why is Trump so enthralled with Russia? Joy Behar: Maybe Trump owes something to Putin. pic.twitter.com/7LDNzO4Tm8 — Derrick Evans (@DerrickEvans4WV) February 28, 2025 And then this: Defenders of Fauci and experimental vaccines. \"Listen to what we say. We tell the truth,\" host Joy Behar told the audience. NEW - The View Hosts Say You Should Listen to Them When It Comes to COVID Vaccines \"I have been boosted and boosted and boosted. So I got it, COVID. It does not prevent you from getting COVID but you don't die from it...People need to check their sources. Only listen to what we… pic.twitter.com/Rg3nWi1cMu — Chief Nerd (@TheChiefNerd) January 5, 2024 O'Donnell might be correct about The View's fate, but she's entirely wrong about the platform being the guardian of \"truth\"; instead, these liberal women were defenders of the Deep State agenda and their corporate billionaire allies. This rumor comes after: Stephen Colbert's \"Late Show\" Cancelled By CBS Corporation For Public Broadcasting Begins \"Winding Down\" As Taxpayer-Funded Propaganda Machine Crumbles Howard Stern's SiriusXM Show In Dire Straits As $500M Contract Nears End There will be more... The music could soon stop for the broken-record hosts of The View, as the leftist propaganda network implodes around these elitists in real time. Tyler Durden Sat, 08/09/2025 - 13:25",
    "publishedAt": "2025-08-09T17:25:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.705Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "212a89a0"
  },
  {
    "id": "bloomberg-business-youtube-2ebcaa9f",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Summer Box Office Ends On ‘Edgy’ August: Dergarabedian",
    "url": "https://www.youtube.com/watch?v=D_elJWaVskY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:16:31.000Z",
    "fetchedAt": "2025-08-10T02:52:59.607Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2ebcaa9f"
  },
  {
    "id": "yahoo-finance-cd2b782",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Retreats, coaching, and therapy: Inside the $1 billion cottage industry cashing in on the retail-trading phenomenon",
    "url": "https://finance.yahoo.com/news/retreats-coaching-therapy-inside-1-171502796.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:15:02.000Z",
    "fetchedAt": "2025-08-11T04:56:35.413Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "cd2b782"
  },
  {
    "id": "yahoo-finance-341d2bab",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "'This bull market in equities has a serious problem': Strategist warns a crucial AI-stock index is sending a potential bubble signal",
    "url": "https://finance.yahoo.com/news/bull-market-equities-serious-problem-171501973.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:15:01.000Z",
    "fetchedAt": "2025-08-11T04:56:35.413Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "341d2bab"
  },
  {
    "id": "yahoo-finance-47aa4824",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "I'm 50 and have just $60K for retirement because I burned through my 401(k) to care for my parents. Am I too far behind?",
    "url": "https://finance.yahoo.com/news/im-50-just-60k-retirement-171500863.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:15:00.000Z",
    "fetchedAt": "2025-08-11T02:36:53.432Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "47aa4824"
  },
  {
    "id": "ndtv-profit-rss-35229c68",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Lloyds Enterprises Fixes Aug 14 As Record Date For Rs 992 Crore Rights Issue",
    "url": "https://www.ndtvprofit.com/markets/lloyds-enterprises-fixes-aug-14-as-record-date-for-rs-992-crore-rights-issue",
    "summary": "Lloyds Enterprises Rights Issue: According to the exchange filing, the company will issue 25.4 crore of equity shares in a partly paid-up format.",
    "fullContent": "Lloyds Enterprises Rights Issue: According to the exchange filing, the company will issue 25.4 crore of equity shares in a partly paid-up format.",
    "publishedAt": "2025-08-09T17:09:16.468Z",
    "fetchedAt": "2025-08-10T02:52:49.774Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "35229c68"
  },
  {
    "id": "bloomberg-business-youtube-6802b4a7",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "The challenge towns face in powering AI and data centers#shorts #datacenters #ai",
    "url": "https://www.youtube.com/shorts/2PgS-cwqubg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:00:06.000Z",
    "fetchedAt": "2025-08-10T02:52:59.607Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6802b4a7"
  },
  {
    "id": "oil-price-7223d425",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Ukraine’s Drone Revolution Has Exposed a U.S. Military Vulnerability",
    "url": "https://oilprice.com/Energy/Energy-General/Ukraines-Drone-Revolution-Has-Exposed-a-US-Military-Vulnerability.html",
    "summary": "US officials keep expressing enthusiasm for expanding trade in critical minerals with Central Asian states. But while Washington talks, China is taking substantive action to expand its hold over Central Asia’s abundant resources.",
    "fullContent": "US officials keep expressing enthusiasm for expanding trade in critical minerals with Central Asian states. But while Washington talks, China is taking substantive action to expand its hold over Central Asia’s abundant resources. During her recent Senate confirmation hearing, Julie Stufft, the Trump administration’s nominee to be US envoy to Kazakhstan, reaffirmed US interest in developing Central Asia’s critical minerals sector. “Almost half of the minerals recognized by the [US Geological Survey] as critical…",
    "publishedAt": "2025-08-09T17:00:00.000Z",
    "fetchedAt": "2025-08-10T02:52:49.752Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "7223d425"
  },
  {
    "id": "yahoo-finance-759c36e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Apple's AI Momentum Is Building -- Here's What It Means for Investors",
    "url": "https://finance.yahoo.com/news/apples-ai-momentum-building-heres-170000869.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T17:00:00.000Z",
    "fetchedAt": "2025-08-11T04:56:35.413Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "759c36e"
  },
  {
    "id": "zerohedge-2bcd0a23",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Whistleblower Ties Clinton Campaign To Fake Russia Hack: Sperry",
    "url": "https://www.zerohedge.com/political/whistleblower-ties-clinton-campaign-fake-russia-hack-sperry",
    "summary": "Whistleblower Ties Clinton Campaign To Fake Russia Hack: Sperry Authored by Paul Sperry via RealClearInvestigations, A whistleblower report declassified last week suggests that Hillary Clinton’s campaign efforts to manufacture evidence tying Donald Trump to alleged Russian...",
    "fullContent": "Whistleblower Ties Clinton Campaign To Fake Russia Hack: Sperry Authored by Paul Sperry via RealClearInvestigations, A whistleblower report declassified last week suggests that Hillary Clinton’s campaign efforts to manufacture evidence tying Donald Trump to alleged Russian hacking in 2016 were deeper than previously known – as were Obama administration efforts to conceal them. According to the report, a former senior U.S. intelligence analyst who investigated alleged Russian attempts to breach state voting systems during the 2016 election suspected the breaches may have been \"related to activities\" of the computer contractors involved in the Alfa Bank hoax, who were accused of manipulating Internet traffic data. In that well-publicized case, a Clinton campaign lawyer worked with federal computer contractors and the FBI to create suspicions that Russia was communicating with Donald Trump through a secret server shared by Alfa Bank of Russia and Trump Tower in Manhattan. The anonymous whistleblower – who served as the deputy national intelligence officer for cyber issues in the Office of the Director of National Intelligence from 2015 to 2020 – told Special Counsel John Durham he stumbled onto \"enigmatic\" data while leading the investigation of alleged Russian cyber activity for the Intelligence Community Assessment on Russian meddling in the 2016 election. He said that his discovery took place in December 2016 when President Obama ordered the ICA. After examining state-reported breaches of election networks, the whistleblower said, \"It seemed only brief interaction was occurring – in some cases, no unauthorized access, or even attempted access, was detected on 'victim' systems.\" Though the suspicious activity initially was attributed to Russian actors, further analysis raised doubts. But when he brought his findings to his boss, ODNI's national intelligence officer for cyber issues, he was ordered to stop investigating and not include his findings in the final ICA draft. \"After being directed to conduct analysis of Russian-attributed cyber activity for the ICA, I had been abruptly directed to abandon further investigation,\" the whistleblower analyst said. He added that his boss, whose name was blacked out in the whistleblower statement, \"directed me to abandon analysis of these events, stating reports of Russia-attributed cyber activity were 'something else.'\" While the names of the whistleblower and his boss are blacked out in the report, a RealClearInvestigations search of federal records shows Vinh Nguyen was the national intelligence officer for cyber issues at the time. The whistleblower would have been Nguyen's deputy. Nguyen did not respond to RCI’s request for comment. Pressured To Change View The whistleblower’s 2023 complaint, declassified last week by Director of National Intelligence Tulsi Gabbard, also seems to contradict the recent claims of Obama’s director of national intelligence, James Clapper, and his CIA Director, John Brennan, among others that the ICA was a neutral document prepared according to the highest standards whose conclusions were widely supported by the intelligence community. The whistleblower said his supervisor also \"pressured me to accept the ICA's judgment of a decisive Russian preference for then President-elect Trump, and stated to me that he sought my concurrence as means to sway the position of\" another intelligence agency. \"I was pressured to alter my views on the key judgment,\" he said. But, he added, \"I could not concur in good conscience based on information available, and my professional analytic judgment.\" What's more, he said his boss \"intentionally deceived and excluded me from things I was cleared for and had need to know\" during the ICA's drafting. This included the fact that Clinton campaign opposition research – the now-debunked Steele dossier – was used as supporting evidence in the highly restricted, classified version of the ICA. \"I had been led to believe that Clapper viewed the 'Steele dossier' material as untrustworthy, and I had believed it played no role in the ICA,\" he said. His boss told him there was other evidence that supported the key Trump-Russia judgment, which he was \"not allowed to see,\" but \"if you saw it, you would agree.\" Pressed to share the alleged additional evidence, his superior said, \"You need to TRUST ME on this.\" (Emphasis in original.) \"I need you to agree with these judgments,\" he said his boss demanded. The whistleblower alleged his superior committed \"potential malfeasance\" during the crafting of the ICA, which was used as the foundation for several investigations of Trump and his advisers during his first term in office. Still, the whistleblower said that back in 2016, he did not view the omission of the suspicious Internet data from the ICA report as \"nefarious.\" “However, I later began to consider it possible that some of the reporting might reflect Domain Name Service (DNS) record manipulation by parties other than Russian,” he said. After conducting further research, \"I came to view some of the reported cyber activity as possibly related to activities of USPERSONS under federal investigation\" by special prosecutor Durham, who was probing the Alfa Bank hoax. Suspected Manipulation He said he subsequently provided a data report detailing his suspicions of \"manipulation\" to Durham's investigators, which remains classified. But they never interviewed him, even though \"I likely had information relevant to ongoing criminal investigations.\" (Durham’s final report makes no mention of the incident and does not even focus on the ICA. The whistleblower report is separate from the Durham report. Attempts to reach the now-retired special prosecutor were unsuccessful.) The whistleblower’s reference to U.S. individuals under investigation ostensibly refers to computer scientists led by tech executive and FBI informant Rodney Joffe, who collaborated with Clinton campaign lawyer Michael Sussmann to create documents and data files tying Trump to the Russian-based Alfa Bank in the summer of 2016. Sussmann, in turn, gave the materials to a friend at the FBI to investigate. By September 2016, Sussmann had convinced the FBI to open an investigation into an alleged secret backchannel between Trump and Putin based on Domain Name Server records that Durham suspected had been manipulated by the contractors. DNS records are numeric addresses that computers, smartphones, and other devices use to communicate with websites and email servers. After Joffe and his contractors obtained DNS Internet data related to Trump Tower, emails cited by Durham reveal they created an \"inference\" of Russian contacts and even suggested \"faking\" DNS traffic to show communications that didn't actually exist. According to an Aug. 20, 2016, email prosecutors uncovered, one contractor offered, \"I could fill out a sales form on two websites, faking the other company's email address in each form, and cause them to appear to communicate with each other in DNS. (And other ways I can think of).\" Joffe replied that the ability to \"provide evidence of *anything* that shows an attempt to behave badly\" [by Trump] would make \"the VIPs ... happy.\" According to Joffe, the Clinton campaign \"VIPs\" were looking for a \"true story that could be used as the basis for a closer examination\" by the FBI, and any interactions between Trump and Alfa Bank \"would be jackpot.\" But in an Aug. 22, 2016, email, one of the researchers expressed skepticism the scheme would \"fly,\" complaining to Joffe that: \"Lets [sic] for a moment think of the best case scenario, where we are able to show (somehow) that DNS communication exists between Trump and R[ussia]. How do we plan to defend against the criticism that this is not spoofed traffic we are observing? There is no answer to that. Lets [sic] assume again that they are not smart enough to refute our \"best case\" scenario. Rodney, you do realize that we will have to expose every trick we have in our bag to even make a very weak association? Lets [sic] all reflect upon that for a moment. [S]orry folks, but unless we get combine netflow and DNS traffic collected at critical points between suspect organizations, we cannot technically make any claims that would fly public scrutiny. … Sorry to say this, we are nowhere close coming [sic] with a plan to attack this problem that will fly in the public domain. The only thing that drive [sic] us at this point is that we just do not like [Trump].\" Nevertheless, in materials they provided the FBI, Joffe’s group contended \"odd\" Internet traffic on the server reflected hidden communications between the Trump Organization and Alfa Bank. Durham found the Clinton associates conspired to gin up an FBI investigation into Trump based on knowingly false information. He also suggested they manipulated that Internet data. Alfa Bank, which also operates in the U.S., commissioned two studies that found the DNS data compiled by Joffe and his computer operatives was formatted differently than the bank server’s DNS logs, and one study posited that the DNS activity may have been “artificially created.” In his 2023 affidavit, the ODNI whistleblower implied that anti-Trump computer contractors working with the Clinton campaign may have been involved in a similar false flag operation targeting state election networks. He suspected they may have been the source of suspicious connection attempts using \"IP [address] ranges historically used by Russian state cyber actors.\" These \"concerns\" did not make it into the ICA, he said, because his supervisor excluded them, among other intelligence that did not conform with the narrative he pushed. McCain Connection Although the supervisor’s name is redacted from the whistleblower’s report, records show that the national intelligence officer (NIO) for cyber issues at the time was Vinh Nguyen. He was new to the job in 2016 but received DNI's Exceptional Accomplishment Award the following year. Before the 2016 election, Nguyen worked with Democratic National Committee cybersecurity contractor CrowdStrike to gather intelligence on the alleged Russian hacking of the DNC computer system. Even though the company had publicly blamed Russia during the heated presidential campaign for stealing and then sharing the emails, many of which were published by WikiLeaks, its president, Shawn Henry, later testified in a closed-door congressional hearing that there was no proof that Russian intelligence had exfiltrated emails from the DNC. Nguyen is said to have also overseen election security analysis for the 2018 mid-term elections and 2020 presidential election. He is now the top AI officer at the National Security Agency. Federal Election Commission records show that Nguyen has contributed at least $500 to the late GOP Sen. John McCain, his only political donations. Nguyen made the donations while serving as “senior national advance representative” for McCain's 2008 presidential campaign. He is listed as a member of the McCain Alumni Club, according to the McCain Institute. In 2020, Nguyen was listed among 100 McCain Alumni who endorsed Joe Biden for president. McCain and Biden served in the Senate together and maintained a friendship despite being from different political parties. Following Trump's surprise victory in 2016, McCain played a role in the attempts to link Trump with Russia. On directions from McCain, one of his top staffers from the McCain Institute sought out Christopher Steele and FusionGPS and began working directly with them to distribute their Clinton-funded dossier. The Clinton campaign had hired FusionGPS, which in turn hired Steele to produce the dossier. The now-debunked collection of hearsay and inventions was used by the FBI to obtain a wiretap to spy on the Trump campaign, and later by Clapper and CIA chief John Brennan to buttress the findings of the ICA. On Dec. 9, 2016, the same day Obama convened a meeting to refocus the ICA on Trump, McCain personally provided 16 Steele reports to then-FBI Director James Comey, including five that Steele had not given the agency previously. Then on Dec. 17, Comey discussed the new dossier material with Nguyen's boss, Clapper, over the phone. A few weeks later, in early January 2017, the same McCain Institute aide, David Kramer, gave copies of all of the Steele reports to Buzzfeed, which published them in full under the headline, \"These Reports Allege Trump Has Deep Ties to Russia.\" On Jan. 5, 2017, McCain, as chairman of the Senate Armed Services Committee, held hearings with Clapper as his lead witness and forcefully reaffirmed the findings of the ICA. The following month, despite the FBI debunking the Alfa Bank hoax and closing its case, the Senate Armed Services Committee \"leadership\" commissioned a report on the alleged links to Trump. The report was written by Daniel Jones, a FusionGPS and Steele crony, who said the committee put him in touch with Sussmann and Joffe, who provided him with a \"dataset of DNS look-ups.\" Joffe knew McCain from his days working in Arizona. Jones' 687-page report concluded \"there was likely human interaction and coordination between personnel working on behalf of Alfa Bank and the Trump Organization,\" even though his own research team \"found no evidence of a secret channel of communications.\" Turns out the Trump Organization had no access to the email server or any of the systems involved, according to the Durham report. Paul Sperry is an investigative reporter for RealClearInvestigations. He is also a longtime media fellow at Stanford’s Hoover Institution. Sperry was previously the Washington bureau chief for Investor’s Business Daily, and his work has appeared in the New York Post, Wall Street Journal, New York Times, and Houston Chronicle, among other major publications. Tyler Durden Sat, 08/09/2025 - 12:50",
    "publishedAt": "2025-08-09T16:50:00.000Z",
    "fetchedAt": "2025-08-10T02:52:48.706Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2bcd0a23"
  },
  {
    "id": "fortune-11757ba4",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump&#8217;s pick for the Fed &#8216;fuels an existential threat&#8217; as central bank independence is targeted, JPMorgan says",
    "url": "https://fortune.com/2025/08/09/trump-fed-pick-stephen-miran-existential-threat-central-bank-independence/",
    "summary": "\"The main threat to the Fed independence is not politically motivated turnover shifting the outcome of votes.\"",
    "fullContent": "\"The main threat to the Fed independence is not politically motivated turnover shifting the outcome of votes.\"",
    "publishedAt": "2025-08-09T16:36:02.000Z",
    "fetchedAt": "2025-08-10T02:52:49.908Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "11757ba4"
  },
  {
    "id": "nyt-business-2bcb3b08",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "What to Know About Instagram Map, Location Sharing and Privacy Concerns",
    "url": "https://www.nytimes.com/2025/08/09/us/instagram-map-location-meta.html",
    "summary": "The service rolled out this week, prompting confusion and safety concerns. Meta, which owns Instagram, said the feature was turned off unless users activated it.",
    "fullContent": "The service rolled out this week, prompting confusion and safety concerns. Meta, which owns Instagram, said the feature was turned off unless users activated it.",
    "publishedAt": "2025-08-09T16:33:54.000Z",
    "fetchedAt": "2025-08-10T02:52:48.265Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2bcb3b08"
  }
]