[
  {
    "id": "yahoo-finance-6d669d91",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Airbnb, Inc. (ABNB): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/airbnb-inc-abnb-bull-case-023405459.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:34:05.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6d669d91"
  },
  {
    "id": "cnbc-tv18-youtube-6e861945",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Shubhanshu Shukla: शुभांशु शुक्ला की पत्नी से मिलीं CM रेखा गुप्ता | #rekhagupta #shorts",
    "url": "https://www.youtube.com/shorts/ePVuxbc-Sik",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:31:14.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6e861945"
  },
  {
    "id": "cnbc-tv18-youtube-210e9d77",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Shubhanshu Shukla: अंतरिक्ष फतह के बाद दिल्ली लौटे शुभांशु शुक्ला | #shorts",
    "url": "https://www.youtube.com/shorts/6ShNowmafos",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:30:35.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "210e9d77"
  },
  {
    "id": "cnbc-tv18-youtube-16026bc8",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Kishtwar Cloud Burst | Weather Update | Election Commission Press Conference | Rahul Gandhi | Sir",
    "url": "https://www.youtube.com/watch?v=HQoQEpRgVpk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:30:13.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "16026bc8"
  },
  {
    "id": "cnbc-tv18-youtube-8e711f0",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Aar Paar With Amish Devgan LIVE: Congress | Rahul Gandhi | Partition | BJP | Akhilesh Yadav | Mamata",
    "url": "https://www.youtube.com/watch?v=Jfb6GNOHPgM",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:30:11.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "8e711f0"
  },
  {
    "id": "cnbc-tv18-youtube-b9053a0",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Kishtwar Cloudburst News Live: किश्तवाड़ में तबाही का तांडव, हादसे का Live Video आया सामने | Weather",
    "url": "https://www.youtube.com/watch?v=Rpiqli6EwC8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:30:07.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "b9053a0"
  },
  {
    "id": "thehindubusinessline-4cc28373",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Online gaming likely to be categorised with sin goods for 40% GST levy",
    "url": "https://www.thehindubusinessline.com/economy/online-gaming-likely-to-be-categorised-with-sin-goods-for-40-gst-levy/article69940516.ece",
    "summary": "Final picture on new rate structure will emerge by October.",
    "fullContent": "Final picture on new rate structure will emerge by October",
    "publishedAt": "2025-08-17T02:30:00.000Z",
    "fetchedAt": "2025-08-17T09:41:13.223Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4cc28373"
  },
  {
    "id": "yahoo-finance-2d4310ae",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "American Eagle Outfitters, Inc. (AEO): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/american-eagle-outfitters-inc-aeo-022749909.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:27:49.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2d4310ae"
  },
  {
    "id": "yahoo-finance-b2c4308",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Comstock Resources, Inc. (CRK): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/comstock-resources-inc-crk-bull-022723722.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:27:23.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "b2c4308"
  },
  {
    "id": "yahoo-finance-74e8464d",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Fortinet, Inc. (FTNT): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/fortinet-inc-ftnt-bull-case-022640714.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:26:40.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "74e8464d"
  },
  {
    "id": "cnbc-tv18-youtube-660563bc",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Bhaiyaji Kahin With Prateek Trivedi LIVE: Rahul Gandhi | Tejashwi Yadav | Bihar Elections | SIR | EC",
    "url": "https://www.youtube.com/watch?v=3falOgS3dU4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:26:33.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "660563bc"
  },
  {
    "id": "yahoo-finance-26e41aab",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Stride, Inc. (LRN): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/stride-inc-lrn-bull-case-022507734.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:25:07.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "26e41aab"
  },
  {
    "id": "yahoo-finance-33e7e785",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "The Trade Desk, Inc. (TTD): A Bull Case Theory",
    "url": "https://finance.yahoo.com/news/trade-desk-inc-ttd-bull-022448610.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:24:48.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "33e7e785"
  },
  {
    "id": "scmp-business-3222b9e2",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "No 1 typhoon signal in Hong Kong to remain in force until noon on Sunday",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3322112/no-1-typhoon-signal-hong-kong-remain-force-until-noon-sunday?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. The No 1 typhoon signal will remain in force in Hong Kong at least until noon on Sunday, while the weather forecaster will assess the need to upgrade it to No 3 in the afternoon. The Hong Kong Observatory said the tropical depression would remain at least 600 kilometres (373 miles) from the...",
    "publishedAt": "2025-08-17T02:24:40.000Z",
    "fetchedAt": "2025-08-17T02:34:45.367Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3222b9e2"
  },
  {
    "id": "scmp-business-779c4818",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "No 1 typhoon signal in Hong Kong to remain in force until 8pm on Sunday",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3322112/no-1-typhoon-signal-hong-kong-remain-force-until-noon-sunday?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. The No 1 typhoon signal will remain in force in Hong Kong at least until 8pm on Sunday, while some classes were suspended in neighbouring Macau due to a tropical cyclone. The Hong Kong Observatory said the tropical depression would remain at least 600km (373 miles) from the city on Sunday...",
    "publishedAt": "2025-08-17T02:24:40.000Z",
    "fetchedAt": "2025-08-17T09:41:14.544Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "779c4818"
  },
  {
    "id": "scmp-business-214d9b0a",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong cancels No 1 typhoon signal 22 hours after issuing warning",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3322112/no-1-typhoon-signal-hong-kong-remain-force-until-noon-sunday?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. The Hong Kong Observatory cancelled the No 1 typhoon signal on Sunday evening, nearly 22 hours after the warning was first issued. The tropical depression will skirt the southwestern coast of Hainan Island in the next few hours and continue to move away from Hong Kong, according to the...",
    "publishedAt": "2025-08-17T02:24:40.000Z",
    "fetchedAt": "2025-08-18T02:33:35.646Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "214d9b0a"
  },
  {
    "id": "cnbc-tv18-youtube-9db6f79",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Bihar Election 2025: Rahul Gandhi की आज से Bihar SIR के खिलाफ Voter Adhikar Yatra | Tejashwi Yadav",
    "url": "https://www.youtube.com/watch?v=COw52wfOSfs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:16:07.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "9db6f79"
  },
  {
    "id": "cnbc-tv18-youtube-6a47efee",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "आज Dwarka Expressway और UER-II का उद्घाटन करेंगे PM Modi | Delhi Airport | Gurugram | Noida",
    "url": "https://www.youtube.com/watch?v=tOoSqyMeaPs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:10:47.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6a47efee"
  },
  {
    "id": "zerohedge-268559c0",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Assuming The Worst",
    "url": "https://www.zerohedge.com/personal-finance/assuming-worst",
    "summary": "Assuming The Worst Authored by Todd Hayen via Off-Guardian.org, I used to think that people were pretty smart. Meaning if I were walking down the street, or through a crowded mall, I could be pretty certain that most people I ran into were at a certain level of intelligence.",
    "fullContent": "Assuming The Worst Authored by Todd Hayen via Off-Guardian.org, I used to think that people were pretty smart. Meaning if I were walking down the street, or through a crowded mall, I could be pretty certain that most people I ran into were at a certain level of intelligence. What do they say? That the average IQ is 100? And when you start getting really low in IQ, the number of people who have that lower IQ gets smaller and fewer in number. It is like the classic bell curve. The middle of the bell curve is the number of people with an IQ of 100; outliers on either side get lower or higher. That’s what I used to think. For whatever reason, it felt safer knowing that most people you “saw” were not utter morons. Even if you had interactions with people in stores, or per chance bumping into someone and exchanging words, it was not like you were on some distant planet trying to have a conversation with a humanoid alien (or lizardman) who had zero experience communicating with a real human. Don’t get me wrong. I use the phrase “utter moron” not out of disrespect for humans with low IQs. There was a time that psychologists actually used the terms “moron, imbecile, and idiot” officially to denote IQ levels. (Those with an IQ of 0 to 25, were called idiots, 26 to 50 were called imbeciles and 51 to 70 were called morons.) Of course, today these terms are considered offensive, so no longer used (except by insensitive dickwhacks like me). So, I don’t mean it offensively (well, maybe in the context of this article it is meant offensively). Something I didn’t realize back then as well, is that what I was observing had little to do with IQ or intelligence. It was more about “common sense.” Sure, there are times where the degree of “common sense” is directly related to IQ or intelligence, but feeling safer around people with higher IQs really has never been a logical assumption. It was the “common sense factor”…CSF, rather than IQ, that made me feel more comfortable—an assumption, which back then was a plausible assumption, that most people had at least an average CSF. So, life went on this way. Living among other humans, more or less the same as me. Ha. I have no way to know, however, if my assumption was accurate, but I think it was more accurate then than it is today. In fact, now there is no assumption that all of the people I run across in a casual way—in the mall, on the street, in a crowded theatre, etc.—have an average CSF. Actually, it is rather obvious they do not. And even if it is not visually or behaviourally obvious, I can be relatively certain most people I run across are below average on the CSF scale. This conclusion I’ve come to I’ve based on the results of a concentrated effort I’ve made over the years (since 2019) to assess people and their actions and lack of understanding regarding Covid, vaccines, politics, world events, the New World Order efforts, etc. I am very sad to say my assessment has not come out very well. Sure, I have no way to know if suddenly the human race has been affected by some space ray they all have been exposed to (ala the meteor shower in the Sci-Fi thriller of the ‘60s The Day of the Triffids) or if EMF, or 5G, or fluoride, or poisonous water, or vaccines, or drugs in general, or food, or whatever, has poisoned the minds of so many people. Or if this is a recent phenomenon, like DNA manipulation or spike protein affectation of the brain (however, if something that recent is the culprit, it would not explain why people took the Covid jab in the first place). If people have indeed been affected for decades, then I was under a false illusion back when I was younger, assuming these crowds of people I routinely came into contact with were “safe”—more than likely they never were. However, TV, films, and whatnot always gave the impression (or at least most of them did) that average every day people were all relatively the same—they all had the same fears, the same desires, the same fallacies, and most importantly, the same level of common sense. Just for yucks, let’s assume this reality—that most people are below an acceptable CSF—is rather recent. This assumption makes grappling with all this a little easier. It is then easier to realize the agenda’s hand in it all. Although the agenda has been working its black magic for decades, if not centuries (if not since Mr. Snake coerced Eve to eat his apple), let’s assume for a magic moment that most of this meddling is recent, meaning within the last 150 years, starting its major campaigns of manipulation during the first World War, and continuing in earnest throughout the 20th Century and now into the 21st. (As I write this, I realize it goes back, for certain, earlier than this, but bear with me). So maybe, just maybe, the agenda’s influence on the average every day person has upped in magnitude during the last 30 years or so (that wasn’t that long ago), and it is an exponential “up”—meaning it has doubled in the last 10 years. So, the masses in my childhood were more “normal” than the masses now. Then there is more reason to “assume the worst” while walking down the street on a nice sunny day, and running into people who do not appear to be a problem, but could be completely inept if a problem came up. So what? Well, if this is true, it means we have to be more on our toes than we think we need to be. We have to always have a plan if things go wrong, because more than likely the person next to you on the street or in the mall will not be able to help you. Is this a bad thing? Not necessarily. The agenda has been trying for years to convince us that we are not in danger as long as they are there to assist us. No one needs to carry a gun, or have a weapon handy, because the criminals who are possibly around the corner will be quelled by the government’s efforts (police or whatnot). There is no need to take responsibility for the safety of oneself or family because the government has that covered. There is no need to take care of your own health, because the government-run healthcare system knows how to take care of us with more pills, more chemicals in the water and the air, etc. You are safe, because the agenda makes you safe through its control over you and the environment. In reality, you are not safe. Not at all. You need to be aware, be responsible, and think. Tyler Durden Sat, 08/16/2025 - 22:10",
    "publishedAt": "2025-08-17T02:10:00.000Z",
    "fetchedAt": "2025-08-17T09:41:13.410Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "268559c0"
  },
  {
    "id": "cnbc-tv18-youtube-26407b",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Shubhanshu Shukla: लोकसभा में शुभांश शुक्ला पर होगी विशेष चर्चा | Lok Sabha | #shorts",
    "url": "https://www.youtube.com/shorts/m42QCzjgD_k",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:08:48.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "26407b"
  },
  {
    "id": "cnbc-tv18-youtube-37069bcb",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Breaking News: अंतरिक्ष फतह के बाद देश लौटे Shubhanshu Shukla | Axiom 4 Mission | NASA | Delhi News",
    "url": "https://www.youtube.com/watch?v=RuGPkvTtp-c",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T02:06:02.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "37069bcb"
  },
  {
    "id": "business-insider-2ecb25b1",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Inside BYD's plan to rule the waves",
    "url": "https://www.businessinsider.com/see-byds-fleet-car-carrying-cargo-ships-tesla-2025-8",
    "summary": "BYD has overtaken Tesla and shaken up the global auto industry. Now it has a new target; deep ocean shipping.",
    "fullContent": "BYD has overtaken Tesla and shaken up the global auto industry. Now it has a new target; deep ocean shipping.",
    "publishedAt": "2025-08-17T02:00:02.000Z",
    "fetchedAt": "2025-08-17T02:34:42.451Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2ecb25b1"
  },
  {
    "id": "cnbc-tv18-youtube-32558000",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Live : PM MOdi आज अर्बन एक्सटेंशन और Dwarka Expressway के दिल्ली भाग का करेंगे उद्घाटन | Top News",
    "url": "https://www.youtube.com/watch?v=aptdcxmFtWM",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T01:59:07.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "32558000"
  },
  {
    "id": "cnbc-tv18-youtube-2ea690a3",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Bhaiyaji Kahin With Prateek Trivedi LIVE: Rahul Gandhi | Tejashwi Yadav | Bihar Elections | SIR | EC",
    "url": "https://www.youtube.com/watch?v=hEgz-QawDOI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T01:46:54.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2ea690a3"
  },
  {
    "id": "cnbc-tv18-youtube-7159c7eb",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Aaj Ki Taaza Khabar LIVE: Janmashtami | Trump - Putin Meeting | PM Modi | Russia Ukraine War | Bihar",
    "url": "https://www.youtube.com/watch?v=ZCLED6OHY70",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T01:39:33.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7159c7eb"
  },
  {
    "id": "cnbc-markets-3a15748a",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "I’m a couples therapist — here are 5 reasons why people risk everything for an affair",
    "url": "https://www.cnbc.com/2025/08/17/heres-why-people-risk-everything-for-an-affair-couples-therapist.html",
    "summary": "There are five surprisingly common psychological pitfalls that can make someone risk everything for an affair, according to a couples therapist.",
    "fullContent": "There are five surprisingly common psychological pitfalls that can make someone risk everything for an affair, according to a couples therapist.",
    "publishedAt": "2025-08-17T01:35:41.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3a15748a"
  },
  {
    "id": "zerohedge-543fa258",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "These Are The Best US Colleges For High-Paying Finance Jobs",
    "url": "https://www.zerohedge.com/personal-finance/these-are-best-us-colleges-high-paying-finance-jobs",
    "summary": "These Are The Best US Colleges For High-Paying Finance Jobs AI is disrupting the job market, especially for new college grads. Yet if you’re a finance grad from a prestigious college, you could have a greater edge.",
    "fullContent": "These Are The Best US Colleges For High-Paying Finance Jobs AI is disrupting the job market, especially for new college grads. Yet if you’re a finance grad from a prestigious college, you could have a greater edge. Not only that, certain schools have shown to produce significantly higher wage premiums in the long run thanks to the quality of their program, exposure to industry professionals, among other factors—if you’re lucky enough to attend them. This graphic, via Visual Capitalist's Dorothy Neufeld, shows the private colleges with the highest rate of return in the finance industry, based on data from the Burning Glass Institute. Which Colleges Produce the Most Lucrative Finance Jobs? Below, we show the average wage premiums of finance grads across the top 20 highest-returning private colleges. These figures show how much more the average 2013 college grad made across the first decade of their career compared to the median finance grad. At the end of the period, the median finance grad had an average annual salary of $101,831. While MIT is most commonly known for its tech and engineering programs, its business program is also world class. MIT finance grads earn about $10,000 per year more than Harvard grads, where the cost of attending college is more than double that of MIT. For those who enroll in the MIT MBA program, the most common employers for grads include McKinsey, the Boston Consulting Group, and Amazon. As we can see, Princeton follows closely behind Harvard, with a $62,000 wage premium. Meanwhile, Dartmouth College stands in fifth, with the priciest tuition fees across the top 20 private colleges. When it comes to the best public institutions for producing high-paying finance grads, the University of Michigan-Ann Arbor ranks first overall, with an average annual salary of $140,022. To learn more about this topic from a tech perspective, check out this graphic on the top colleges for high-paying tech jobs. Tyler Durden Sat, 08/16/2025 - 21:35",
    "publishedAt": "2025-08-17T01:35:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.140Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "543fa258"
  },
  {
    "id": "scmp-business-1e7965a4",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Southeast Asian ‘smart money’ fishing for ‘trophy assets’ in Hong Kong",
    "url": "https://www.scmp.com/business/article/3322075/hong-kong-luxury-property-southeast-asian-smart-money-fishing-trophy-assets?utm_source=rss_feed",
    "summary": "Mainland Chinese buyers and “smart money” from Southeast Asia will continue “bottom-fishing for trophy assets” in Hong Kong’s luxury property market as prices remain depressed through 2025, according to the director and head of residential sales at Savills.",
    "fullContent": "Mainland Chinese buyers and “smart money” from Southeast Asia will continue “bottom-fishing for trophy assets” in Hong Kong’s luxury property market as prices remain depressed through 2025, according to the director and head of residential sales at Savills. Capital from Singapore had been flowing to Hong Kong because the Singaporean market had not declined, Thomas See said. “Some smart money has noticed that prices of real estate in Hong Kong have already fallen by 30 to 40 per cent,” he said,...",
    "publishedAt": "2025-08-17T01:30:16.000Z",
    "fetchedAt": "2025-08-17T02:34:45.367Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e7965a4"
  },
  {
    "id": "cnbc-tv18-youtube-7bf776fd",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Rahul Gandhi Bihar Yatra Live Updates : राहुल गांधी की मतदाता अधिकार यात्रा आज से शुरू | EC | RJD",
    "url": "https://www.youtube.com/watch?v=sf0sDJDYim8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T01:30:02.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7bf776fd"
  },
  {
    "id": "nse-online-announcements-63a0cf9c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Dixon Technologies (India) Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/REG30_Restructuring_1514081_17082025012547_WEB.xml",
    "summary": "Dixon Technologies (India) Limited has informed the Exchange regarding Sale or disposal of unit(s)/division(s)/subsidiary |SUBJECT: Sale or disposal-XBRL.",
    "fullContent": "Dixon Technologies (India) Limited has informed the Exchange regarding Sale or disposal of unit(s)/division(s)/subsidiary |SUBJECT: Sale or disposal-XBRL",
    "publishedAt": "2025-08-17T01:25:47.000Z",
    "fetchedAt": "2025-08-17T02:43:32.469Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "63a0cf9c"
  },
  {
    "id": "nse-online-announcements-57f80df",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Dixon Technologies (India) Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/ANN_AGREEMENT_1514080_17082025012121_WEB.xml",
    "summary": "Dixon Technologies (India) Limited has informed the Exchange regarding Joint venture agreements |SUBJECT: Agreements,Contracts,Arrangements,MOU-XBRL.",
    "fullContent": "Dixon Technologies (India) Limited has informed the Exchange regarding Joint venture agreements |SUBJECT: Agreements,Contracts,Arrangements,MOU-XBRL",
    "publishedAt": "2025-08-17T01:21:22.000Z",
    "fetchedAt": "2025-08-17T02:43:32.469Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "57f80df"
  },
  {
    "id": "techmeme-36367bf7",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A look at the problems at Uber Freight, which has posted operating losses every year since it was founded in 2017, except for 2022, and just appointed a new CEO (Thomas Black/Bloomberg)",
    "url": "http://www.techmeme.com/250816/p18#a250816p18",
    "summary": "Thomas Black / Bloomberg: A look at the problems at Uber Freight, which has posted operating losses every year since it was founded in 2017, except for 2022, and just appointed a new CEO — The unprofitable unit doesn't fit the company's model and has little to no synergies...",
    "fullContent": "Thomas Black / Bloomberg: A look at the problems at Uber Freight, which has posted operating losses every year since it was founded in 2017, except for 2022, and just appointed a new CEO — The unprofitable unit doesn't fit the company's model and has little to no synergies with its main ride-hailing and delivery businesses.",
    "publishedAt": "2025-08-17T01:20:01.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "36367bf7"
  },
  {
    "id": "business-insider-40a40cc3",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "OpenAI's chief research scientist shares the book that inspired him when he was unsure about his career path",
    "url": "https://www.businessinsider.com/openai-chief-research-scientist-jakub-pachocki-paul-graham-book-inspired-2025-8",
    "summary": "OpenAI chief research scientist Jakub Pachocki said Paul Graham's &#34;Hackers and Painters&#34; inspired him when he was 15.",
    "fullContent": "OpenAI chief research scientist Jakub Pachocki said Paul Graham's &#34;Hackers and Painters&#34; inspired him when he was 15.",
    "publishedAt": "2025-08-17T01:12:40.000Z",
    "fetchedAt": "2025-08-17T02:34:42.451Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "40a40cc3"
  },
  {
    "id": "cnbc-tv18-youtube-e38a36e",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Lapete Me Netaji with Kishore Ajwani LIVE : Bihar Voter List | Rahul Gandhi | EC | SIR | Tejashwi",
    "url": "https://www.youtube.com/watch?v=JTKW6Vc0WYg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T01:05:46.000Z",
    "fetchedAt": "2025-08-17T02:34:48.872Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "e38a36e"
  },
  {
    "id": "scmp-business-67344dbd",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Taxi drivers encouraged to embrace e-payments with Hong Kong start-up Dash system",
    "url": "https://www.scmp.com/news/hong-kong/transport/article/3322103/taxi-drivers-encouraged-embrace-e-payments-hong-kong-start-dash-system?utm_source=rss_feed",
    "summary": "A Hong Kong start-up has sought to overcome taxi drivers’ long-standing reluctance to embrace digital payments by launching an e-payment system offering various fare settlement options alongside a ride-hailing app. Jason Ma Siu-cheong, 37, founded the start-up Dash in 2021.",
    "fullContent": "A Hong Kong start-up has sought to overcome taxi drivers’ long-standing reluctance to embrace digital payments by launching an e-payment system offering various fare settlement options alongside a ride-hailing app. Jason Ma Siu-cheong, 37, founded the start-up Dash in 2021. It is the latest company aiming to persuade Hong Kong’s taxi drivers to abandon their entrenched cash-only habits and catch up with counterparts in other places, such as mainland China. Pressure is increasing on the city’s...",
    "publishedAt": "2025-08-17T01:00:23.000Z",
    "fetchedAt": "2025-08-17T02:34:45.367Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "67344dbd"
  },
  {
    "id": "scmp-business-354e9513",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Taxi drivers encouraged to embrace e-payments with Hong Kong start-up Dash system",
    "url": "https://www.scmp.com/news/hong-kong/transport/article/3322103/taxi-drivers-encouraged-embrace-e-payments-hong-kong-start-dash-system?utm_source=rss_feed",
    "summary": "A Hong Kong start-up has sought to overcome taxi drivers’ long-standing reluctance to embrace digital payments by launching an e-payment system offering various fare settlement options alongside a ride-hailing app. Jason Ma Siu-cheong, 37, founded the start-up Dash in 2021.",
    "fullContent": "A Hong Kong start-up has sought to overcome taxi drivers’ long-standing reluctance to embrace digital payments by launching an e-payment system offering various fare settlement options alongside a ride-hailing app. Jason Ma Siu-cheong, 37, founded the start-up Dash in 2021. It is the latest company aiming to persuade Hong Kong’s taxi drivers to abandon their entrenched cash-only habits and catch up with counterparts in other places, such as mainland China. Pressure is mounting on the city’s...",
    "publishedAt": "2025-08-17T01:00:23.000Z",
    "fetchedAt": "2025-08-18T02:33:35.646Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "354e9513"
  },
  {
    "id": "bloomberg-markets-47f9fc9e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Thawing India-China Ties Drive Hunt for Potential Stock Winners",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/warming-xi-modi-ties-make-stock-winners-in-trailing-india-market",
    "summary": "India’s stocks are trailing most of their global peers this year but one set of companies may be about to see a resurgence: those with links to China.",
    "fullContent": "India’s stocks are trailing most of their global peers this year but one set of companies may be about to see a resurgence: those with links to China.",
    "publishedAt": "2025-08-17T01:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.000Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "47f9fc9e"
  },
  {
    "id": "wsj-markets-main-45d04012",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Big Tech Is Eating Itself in Talent War",
    "url": "https://www.wsj.com/tech/ai/ai-researchers-hiring-spree-big-tech-5ad03ebd?mod=rss_markets_main",
    "summary": "The scramble by tech companies for top AI talent is using unorthodox methods that imperil Silicon Valley&#x2019;s startup culture.",
    "fullContent": "The scramble by tech companies for top AI talent is using unorthodox methods that imperil Silicon Valley&#x2019;s startup culture.",
    "publishedAt": "2025-08-17T01:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.435Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45d04012"
  },
  {
    "id": "wsj-world-news-36cbc852",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Blackwater&#x2019;s Erik Prince Muscles Back Into the Mercenary Business",
    "url": "https://www.wsj.com/world/americas/erik-prince-mercenaries-vectus-global-5a166dca",
    "summary": "Prince has a new guns-for-hire firm to take overseas security jobs the White House doesn&#x2019;t want to pay for.",
    "fullContent": "Prince has a new guns-for-hire firm to take overseas security jobs the White House doesn&#x2019;t want to pay for.",
    "publishedAt": "2025-08-17T01:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.967Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "36cbc852"
  },
  {
    "id": "wsj-world-news-a0b6700",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "How Will the War in Ukraine End? Two Scenarios",
    "url": "https://www.wsj.com/world/how-will-the-war-in-ukraine-end-two-scenarios-2bcc0d99",
    "summary": "Russian President Vladimir Putin&#x2019;s goals go beyond a land grab and aim at Ukraine&#x2019;s capitulation. Kyiv and the West hope to draw a line.",
    "fullContent": "Russian President Vladimir Putin&#x2019;s goals go beyond a land grab and aim at Ukraine&#x2019;s capitulation. Kyiv and the West hope to draw a line.",
    "publishedAt": "2025-08-17T01:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.967Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "a0b6700"
  },
  {
    "id": "zerohedge-3c7febb",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "How To Think About Bitcoin Treasury Companies: A Bitcoiner's Dilemma In The Age Of Rampant Speculation",
    "url": "https://www.zerohedge.com/crypto/how-think-about-bitcoin-treasury-companies-bitcoiners-dilemma-age-rampant-speculation",
    "summary": "How To Think About Bitcoin Treasury Companies: A Bitcoiner's Dilemma In The Age Of Rampant Speculation Authored by Joakim Book via BitcoinMagazine.com, With bitcoin treasury companies bringing Wall Street into hype mode and new Saylor contenders launching weekly, what's a...",
    "fullContent": "How To Think About Bitcoin Treasury Companies: A Bitcoiner's Dilemma In The Age Of Rampant Speculation Authored by Joakim Book via BitcoinMagazine.com, With bitcoin treasury companies bringing Wall Street into hype mode and new Saylor contenders launching weekly, what's a Bitcoiner supposed to do? At this, our fiat end times, mNAVs games and regulatory arbitrage are either a recipe for disaster or the blueprint for unbelievable wealth. Strategy, Michael Saylor and MSTR have taken over Wall Street. To many people’s chagrin, the suitcoiners and corporates are here: Bitcoin held by corporations in the form of bitcoin treasury companies is hypnotic to look at. It has captured more or less everyone’s mind — mine, included. It’s the latest fad on the world’s capital markets, celebrated by a narrow sway of financially savvy Bitcoiners and insiders, yet hated by tradfi people who can’t for the love of humanity understand why anybody, let alone a company, would want bitcoin at all. Every odd Bitcoin podcaster has joined one or more bitcoin treasury companies as investors or advisors… or, to put their role more bluntly: as glorified marketers posing as retail-delivery systems. Over the last few months, I’ve spent hundreds of hours investigating bitcoin treasury companies. I’ve read reports and explainers, bull-ish puff pieces and in-the-weeds descriptions. I’ve thought deeply about the financial-market logic behind them. I’ve edited excellent articles pushing the rationale for treasury companies, and overseen equally superb arguments against them. In some small ways, I’ve even fallen prey to them; I’m not as aggressively opposed to them as I gave voice to in the June 2025 article (“Are Bitcoin Treasury Companies Ponzi Schemes?”) that was, incidentally, shoved before Michael Saylor on Fox Business last week. Beautiful, @FoxBusiness @saylor @Strategy pic.twitter.com/GnhLt6gWF2 — Joakim Book (@joakimbook) August 4, 2025 Here’s what I’ve learned from all of this. What’s a Sane, Normal, Regular Bitcoiner To Do? The easiest way to go about bitcoin treasuries and financialized bitcoin is to simply ignore everything. Before Enlightenment: chop wood, hodl self-custody bitcoin; after Enlightenment: chop wood, hodl self-custody bitcoin. Only time will tell if these financial vehicles, loaded with corporate-wrapped bitcoin and soft-spoken CEOs, will succeed or spectacularly blow up. But in topics of money and finance (and economics more broadly), there is usually no nice, neutral choice, no non-action; my money and savings must go somewhere, my attention and labor be focused on something. New bitcoin treasury companies are launched weekly; aggressive fund raises or purchases are announced daily. Being in this space, having an opinion becomes inevitable; having a good, well-informed one seems almost a moral imperative. Having spent years diving into the weeds of monetary economics, financial history and now the wild financial frontier of Bitcoin, the intellectual path to tread here is quite narrow. One side promises a fast-track to the hyperbitcoinized future we all envision, with corporate charters merely amplifying my sats on the way; the other, a cesspool of financial engineering and a hive of speculative mania quickly lining up Bitcoiners to have their fiat contributions repurposed as bitcoin yield. $MSTR trades at a premium to Bitcoin NAV due to Credit Amplification, an Options Advantage, Passive Flows, and superior Institutional Access that equity and credit instruments provide compared to commodities. pic.twitter.com/AYQlytS4ID — Michael Saylor (@saylor) August 13, 2025 Why Would a Bitcoiner Get Involved with These Companies? One reason is leverage. As a typical millennial, I don’t have a house and thus no easy access to cheap debt (basically the only reason to own a home). I can collateralize my coins via e.g., Firefish (at 6-9% APR), or draw on my credit cards (11% and 19%, respectively). Those terms aren’t great; they come with a hefty price tag, a pretty small capital pool and they’re not cheap. Even if bitcoin CAGRs at 30-60%, that’s over longer time periods — not monthly or annually, which is the cadence at which I have to service these types of debt. In contrast, Strategy and MARA issue convertible debt at 0%. Those liabilities come due in a half-dozen years, and they’re in the nine-figure range. Said Pierre Rochard in debating Jim Chanos last month: “The ability to access the terms that Saylor has… is not accessible to individuals holding Bitcoin in cold storage.” For most Bitcoiners, getting in on this action is proving too juicy to resist… even if you need to fork over control and ownership, and additionally pay a hefty premium over their current bitcoin stash for the privilege of owning some of these shares. As a leverage mechanism, Saylor’s turn into preferred shares seems much more expensive — paying 8-10% interest is approaching my own borrowing abilities — but they’re way safer. The prefs safeguard the company itself, since they remove the risk of margin calls or debt-fuelled bankruptcy concerns, and give the company unprecedented flexibility. Preferred shares provide a release valve, since Strategy can opt not to pay the dividends for e.g., STRD; doing the same for STRF “only” costs them a 1% penalty going forward. In a pinch, and without much implication for the company itself, Strategy can even withhold payment for the others (at the risk of zeroing out the bondholder bagholder, and making plenty of people plenty angry). $MSTR is basically unbreakable. As long as BTC grows faster than the preferred yield (10%), Strategy can keep stacking and issuing more preferreds. If BTC hits 30% ARR like Saylor predicts, $MSTR will become one of the biggest companies in the world. If BTC slows to 15%… — BTCoptioneer (@BTCoptioneer) August 6, 2025 Here’s the paradox: While this is financial leverage for Strategy, which gets more and more of other people’s money to plunge into bitcoin and top up their stash, it isn’t leverage for (new) shareholders of MSTR. To invoke Jim Chanos’ answer to Rochard in that debate: the point of leverage is to have more than $1 of exposure. If I buy MSTR at mNAV 1.5, and Strategy itself has a leverage ratio of about 20%, I’m not levering up! (1/1.5 x 1.2 = 0.8). Thus, for every $1 I plunge into MSTR, I’m getting about 80 cents of bitcoin exposure. And the corporation, of which that share is a portion, still needs to pay about what I pay my financiers for the pleasure of using someone else’s money. The calculations for most of the other treasury companies get even worse, mostly because of their excessive mNAV. You are the yield that the bitcoin treasury companies are chasing. When we invest in these companies, we play fiat games. And we play them directly in proportion to how expensive the mNAV is. I’ve asked many times: “How can a bitcoin, wrapped in a corporate charter, suddenly be worth double, triple, or ten times the most liquid, observable and obviously indisputable price on the planet?” Indeed, “What extreme value-added transformation does our orange coin undergo the moment you take it under your financially leveraged wings and promise to issue debt, preferred stock, and equity against it — in “waves of credit bubbles,” we hear the ghost of Satoshi faintly whisper.“ Strategy’s great discovery — which everyone is now head-over-heels copying — is that wrapping a bitcoin in a corporate shell, smashing some leverage on top of it, and selling it on Wall Street somehow makes that same bitcoin worth multiples of its actual market price. Much of the conversation ends there, with tradfi journalists busy dismissing this as a fad or a bubble; per the efficient market hypothesis, or just common sense, nothing should trade above the price of the only thing it holds. Not enough. Let’s tally some quite sound reasons for why corporate stocks doing nothing but acquiring bitcoin ought to be worth more than the bitcoin they hold: Storage. Self custody is easier than you think, but plenty of people still shy away from it (see: ETFs). An additional weird reason is the high-profile wrench-attacks on Bitcoiners across the world; it’d be reasonable to pay some sort of premium for letting someone else store your coins. Can’t wrench-attack my MSTR shares. Saylor seems to know what he’s doing (though custodying with Coinbase has raised some eyebrows), so let’s “store” our bitcoin with his company. 10%. Futures. Future bitcoin is worth more than present bitcoin. At any given time, there are unannounced treasury company purchases accruing to shareholders but that aren’t yet public information. Whenever you purchase shares you’re only aware of the deals or acquisitions not yet made public… but we all know, and can predict, that shares should trade a little higher than they currently do: You’re always trading shares on present information, knowing full well that there are things behind the scenes resulting in more. That’s presumably worthy of some premium, so: 5% for e.g., Strategy; plenty more for the small and aggressive ones. Regulatory arbitrage. Look, says the bulls, there is all this money out there, desperate to buy bitcoin but just aren’t allowed to. I don’t quite believe that: Not that many people or institutions are keen on orange, and even if they were, whatever premium we wish to attach to this taxation-mandate-401(k)–regulatory hurdle, it’ll decay with time and adoption. The same financial incentives and laws of gravity that justify bitcoin treasury companies working at all also work to undermine the very regulatory obstacles that give them value in the first place. 20%. (For some, such as Metaplanet in Japan, where bitcoin investors face excessive capital gains taxes, that arbitrage premium is worth more than that.) Catch-all. I’m probably missing some additional reason — some of these companies have residual, real-world businesses too — for why a bag of bitcoin ought to be worth more than the bitcoin inside the bag… so let’s just add another 20% here. Sum: 10+5+20+20 is 55… and conveniently about where MSTR traded when I first handwaved together these premium justifications. At a bitcoin price of $122,500, the 628,791 BTC on Strategy’s balance sheet is worth about $77 billion, but the market capitalization of the firm is $110 billion (~45% premium). $MSTR trades at a premium to Bitcoin NAV due to Credit Amplification, an Options Advantage, Passive Flows, and superior Institutional Access that equity and credit instruments provide compared to commodities. pic.twitter.com/AYQlytS4ID — Michael Saylor (@saylor) August 13, 2025 Strategy is a Bank: The Economic Vision Not the kind that takes (bitcoin) deposits and issues (bitcoin) mortgages, but another, more deeply economic kind. You can think of banking as one of society’s risk-sharing mechanism. Society advances loans to some risky ventures, and capital markets — of which the banking system is one part — distribute the levels of risk stemming from them. (A financial “Who Gets What and Why,” basically.) A bank, economically speaking, is an institution that takes on that risk having some non-public information about the entities involved; it distributes a small, guaranteed return to the lender, while it, itself, gains from any successful venture — though not by as much as the equity owner themselves. If the bank does this successfully, i.e., it on average picks successful ventures and earns more in interest on credit-worthy loans than it pays on interest to depositors, it makes profits for itself. This is what Strategy is doing, using the undiscovered zone between the bitcoin world and the fiat world. Tradfi institutions, pension funds or retirees are the bank-financing component of the structure. They “deposit” money in Strategy, with returns and terms determined by the specific tranche they choose (STRK, STRD, STRF, STRC, or residual claimant in common stock, MSTR). The bank invests these funds in assets: Strategy sits in the middle, guaranteeing the payouts to these economic entities by predicting that the assets will pay off more than the stated interest on the “bank deposits.” Rather than a bank lending on mortgages and credit cards and to small businesses, Strategy’s “lending” side consists of a single client: the world’s best-performing asset. What Strategy is doing is making the (very sensible) gamble that bitcoin will increase in dollar terms faster than the 8-10% it has to pay tradfi fiat institutions for the privilege of using their money. Any middle-schooler with a calculator can figure out that infinite riches await if you’re borrowing at 10% per year to hold an asset that appreciates by 40% a year. Naturally, bitcoin doesn’t do nice, comfy, 40%-a-year. If that were the case, per Michael Saylor’s own words, Warren Buffett would have snatched up aaaaall the bitcoinz long ago: “If bitcoin was not volatile, people with more money than you, more power than you, would outbid you for the bitcoin; you couldn’t have it… At the point that it becomes completely predictable, Warren Buffet will say ‘oh yeah; we get it; we just bought all the bitcoin’… and your opportunity is gone.” All that Strategy need to ensure is that the financing won’t bankrupt it; that the issuance is well under its control and discretion; that dividend payments are conservatively enough compared to the net capital it holds (i.e., bitcoin); and, most importantly, that the liabilities aren’t callable such that they’d force the company company to sell bitcoin at inopportune moments. Basically, Saylor created a vehicle exceedingly suited to make his way through extreme downturns. Even 80% falls in bitcoin — the worst of its kind, and it’s certainly questionable whether those will ever happen again, given the size and public availability of the asset — won’t stifle the company. The key to a successful Ponzi is that the money must keep rolling in. More precisely, Strategy is conservatively Ponzi-like in its financing (unlike classic — fraudulent — Ponzis schemes, Saylor isn’t running a fraud; the optics just overlap, and nobody is defrauded… unwillingly, anyway). What neither tradfi journalists nor treasury company-skeptic Bitcoiners have formulated well is how exactly these schemes fall apart. For “Economic Forces,” economist Josh Hendrickson outlines precisely the relevant stumbling blocks: “If markets are segmented and there is an expectation that the price will continue to experience rapid appreciation, this makes the present discounted value of a future liquidation could exceed the current liquidation value. If the stock is selling at its current liquidation value, it is underpriced.” And: “what MicroStrategy has done is turn itself into a bitcoin bank by issuing dollar-denominated liabilities and purchasing bitcoin. The company is explicitly engaged in financial engineering to exploit regulatory arbitrage.” Strategy’s model, but more so the other copy-cats given their respective jurisdictional moats, can thus break if: Investors are wrong about the future trajectory of bitcoin Whatever mandates, tax rules and legal obstacles that currently prevent investors from buying bitcoin directly loosen up The flywheel effect, so imaginatively dubbed by the Twitteratis of the Bitcoin world, is the ability to exploit regulatory arbitrage, which, in turn, “is contingent upon investors maintaining this expectation that bitcoin is going to be worth considerably more in the future,” in Hendrickson’s very academic, economistic words. Shareholders and buyers of the preferreds won’t be happy in the event of nonpayment of the dividend. Shareholders of MSTR itself will be unhappy if they’re diluted merely to satisfy bondholders (or worse, and Ponzi-like) pay the interest to preferreds. But so what? It doesn’t break Strategy. What will break the model is the disappearance of these tradfi-to-bitcoin obstacles. It’s the regulatory hurdles that propelled so many of these companies forward; turned them to financial bridges between the new world and the old; made them vacuum up unproductive, low-yielding capital from all over the world and suck it into bitcoin. If fund managers or treasury departments or family offices routinely stack bitcoin instead of various Strategy products (or securities of Strategy copy-cats, as the case may be in different parts of the world), the primary reason for bitcoin treasury companies go away. The existence of bitcoin treasury companies, in short, hinges on the inertia of the present system. It depends, crucially, on family funds and pension funds, sovereign wealth funds and traditional investors not doing the hard work of figuring out actual bitcoin exposure (plus some safe, conservative leverage). If they don’t do that, and instead prefer to overpay 50% for the privilege, then… yes, the bitcoin treasury companies’ business models are forever sustainable. What Else Can Go Wrong? There’s a custodian risk for Strategy, certainly, with its coins with various custodians, and in solutions that are purposefully kept pretty opaque. What happens to Strategy’s business if e.g., Coinbase goes bankrupt? Or worse, new political winds bring in confiscation and/or aggressive taxation metrics? Fair enough, these are tail risks but risks nonetheless. And — it’s almost trivial to point this out — if Bitcoin somehow fails, obviously Strategy fails with it. If bitcoin stays a $118,000 stablecoin forever, most of Strategy’s opportunistic use of plentiful financial capital becomes almost moot, and it’ll trade like the pot of bitcoin most journalists and many analysts think it is, its extraordiary growth (mostly) evaporated. And I think that’s what trips up so many journalists and analysts when looking at this treasury company phenomenon: If you can’t see how or why bitcoin would ever have value or use, let alone a place in the future of money and finance, then obviously a corporation devoted to acquiring as much bitcoina as it can makes no sense at all. If you do see a use and future for bitcoin, its price ever-growing against an ever-declining fiat, a corporate vehicle dedicated to acquiring more by wielding capital markets money flows becomes a whole other proposition. The Hedge and The FOMO: What If I’m Wrong? Intellectual humility forces us to realize that maybe, just maybe, we got something wrong. Diamond hands are continually forged… and mine remain pretty weak. It usually really troubles me when the bitcoin price drops precipitously. (It’s the sudden extreme of it, I believe, that’s a big deal… and I find it hard to account for it even in hindsight). I act recklessly, lash out — and not infrequently YOLO into lows with rent money or other pools of spare cash that really shouldn’t go into bitcoin. In bull markets, that kind of behavior usually works to my benefit… but one day it won’t. Morgen Rochard, on one of these endless appearances on the Bitcoin podcast circuit, hammered home this point. (I sometimes say that Morgen has, paradoxically, convinced me to hold less bitcoin than I do… sleep calmly at night, be stoic in the face of price moves, etc, etc.) The more I learn about Strategy, the more I’m warming up to its many specially catered products. It makes some semblance of sense for me to own e.g., STRC for short-term cash and STRK for muted bitcoin exposure with cash flow. STRK, financially speaking, is like holding bitcoin twice financially removed; short-term movements in short-term price would be much less extreme and it would pay me a bit of additional fiat side income. Given that my net worth and professional engagements are mostly tied to bitcoin and correlated to bitcoin price, having slightly less of my net worth in this one-stop-shop area makes sense. Why Not Just Hold Cash in a High-Yield Savings Account? Good question. Two reasons: they don’t yield very much… checks notes… 4.05% on my “high-yield” dollar account. Saylor’s equivalent product, STRC, targets a rate hundreds of basis points above that; and STRK, which in the medium term approximates bitcoin itself, discounted or amplified by changes in MSTR’s mNAV (since at MSTR = $1,000, ten STRK converts), currently yields over 7%. Second, knowing myself, I’m pretty sure I’ll just plunge cash balances held in a fiat bank account into bitcoin at the first sign of a significant price dump; holding STRC or STRK in a brokerage account would at least raise the barriers to that sort of imprudent behavior. You only really need to own two assets now. Bitcoin and $STRC. Financial planning got a whole lot easier. — James Van Straten (@btcjvs) August 9, 2025 Hedges… Hedges Everywhere Since I’m already structurally short fiat — per the original Speculative Attack, I hold debt and bitcoin, so I’m leveraged long — it makes sense to… deep breath… diversify, just a little bit! I already routinely max out the pension contribution that my jurisdiction local mafia already forces me to pay into. The funds inside that permissioned wrapper invest broadly in stocks and bonds (roughly 75:25 proportion); compared to any sort of bitcoin comparison, these of course perform awfully, but in case I’m somehow — for some unimaginable reason — wrong about this whole money-printing, central banking-end-of-an-era thing, at least I won’t starve in old age: I think of that contribution as 1) tax minimisation (I hate the gov profoundly, suffer enormous displeasure at every cent forked over) 2) A form of hedge in case I'm big-time wrong on this orange revolution (my work, employment,and net worth is already heavily dominated by BTC) — Joakim Book (@joakimbook) June 28, 2025 Second, contributing to it comes with massive tax perks: Maxing out the contribution gives me some 1.5x the money right off the bat. While those additional funds will be outgrown by bitcoin’s routine ~40% CAGR in less than two years, they also come with tax-free mortgage perks; should I want to get myself a house real-world shitcoin someday, I can use this pot of money for the occasion. The bitcoin-opportunity cost is real, and over time quite debilitating, but this isn’t a matter of conviction. Real-world practicalities rule: It makes a world of difference for how you live your life if hyperbitcoinization happens in a week or in a hundred years. What has any of this got to do with bitcoin treasury companies?! Plenty: because the hedging mentality of “what if I’m wrong about this” prevails here as well. For all the fluff and fancy verbiage, all the new metrics and futuristic moon dreams, I still can’t get past why a bitcoin when wrapped in a corporate charter should be worth more than a bitcoin. Yes, yes, net-present-value of future growth, yield, capital arbitrage, speculative attack, and bet on hyperbitcoinized banking but… really?! OK, so what if I’m wrong? Plenty of people I trust in the Bitcoin space vouch for these things — more by the minute, it feels like — and there is some logic to them. Cheap leverage, speculative attack, tapping into (read: tricking) fiat pools of money to flow into bitcoin. …so I FOMO’d into two treasury companies recently: Two Strategy products (MSTR and STRK) and the Swedish small newcomer H100. It’s Nice to Have Stocks Again… A decade or more ago, I used to hold plenty of stocks — large, well-diversified portfolios, meticulously tracked. For years now, and for obvious reasons, I haven’t held any. I decided on Strategy’s stuff because they are the least financially insane in this space; the second one because I had easy access via my old-time Nordic bank accounts — and I wasn’t going to bother with finding a convenient brokerage, sign papers and transfer funds, in order to maybe play with a few hundred bucks of bitcoin treasury funds. There’s enough ridiculous paperwork in the world. On the off chance that these things amount to anything, Strategy will be there, running the show: MSTR is “amplified bitcoin,” as their marketing says. Since most of my savings are orange-clad and my professional life is deep orange, once more, that sort of diversification makes sense. (Plus, the mNAV for MSTR is quickly approaching one… 1.42 as I’m writing this.) With Emil Sandstedt’s words ring in my ears — I understand that I am the BTC yield they’re after — but at 25%-ish BTC yield and 20% (safe) leverage via the prefs and convertibles, I’ll be back at even exposure about this time next year: My ~150 dollars’ worth of MSTR shares currently provide about 120 dollars’ worth of bitcoin exposure; I’m happy to throw in the extra $30 bucks for the financial empire Mr. Saylor is erecting (and the potential growth in bitcoin-per-share). Second, H100. The mNAV here was also pretty acceptable for a small, nimbly, fast-moving and uniquely jurisdictionally dominant player — at 2.73, ugh — but its low days-to-cover rate makes me feel that I won’t get too shafted. My first realization after buying some: I’d forgotten how much fun it is! Suddenly, I’m tracking several different asset prices instead of just one. Suddenly, I’m financially in cahoots with real companies doing real things (…ish, anyway), rather than just the most portable, global and easily accessible money there ever was. Psychologically, I felt part of something — vested in the venture, the speculative attack and bitcoin yield-curve construction project that is treasury companies. How exciting! Second realization: Bitcoin has messed with clarified the meaning of ownership. None of these instruments are mine; they’re wrapped in layers of permissioned custody. I can sell them at the press of a button (from nine to five, Mondays through Fridays…), but I only ever see any of that value if a) the brokerage cooperates b) the bank that receives the payout cooperates, and c) the government doesn’t block the transactions. It is one step worse than what Knut Svanholm elegantly remarks on in Bitcoin: The Inverse of Clown World: “A bank is akin to a 2-of-3 multi-sig wallet where you, the bank, and the government hold one key each. In other words, money in the bank is not really yours. Nor is it really money at all.” …Or Not So Nice to Have Stonks I quickly got myself a few reminders of the intransparent, altogether ridiculous and bureaucratic nightmare stock “ownership” is. After I had transferred funds to the brokerage last month, found STRK and pressed “buy,” I received an error message: “This security is not available to you.” Turns out I wasn’t eligible to own American securities through that brokerage. Tradfi assets are so intransparent and so darn permissioned. And the reminders of this obsolete value-technology kept coming. Obviously, it took a day or two for that “investment” to go -11%, reminding me that I still know nothing about fair valuation or timing the market. (Then again, bitcoin puked off 5% from its then 2-week 118,000 stablecoin pattern, so the opportunity cost was somewhat muted.) It got worse when trudging through the lower-level sludge of bitcoin treasury companies: the two Swedish penny stocks that have made noise (H100, and K33; I had to buy something with the money intended for STRK) instantly fell 10% and 20% respectively — basically from the moment I touched them. Some experiment. To paraphrase an old Wall Street adage, an idiot and his sats are soon separated… and the present idiot doesn’t even have any new, shiny things to show for it because — newsflash! — stocks are custodial and immaterial! They reside in a brokerage firm’s database, and by extension, a company ledger somewhere. They’re not physical… and they’re not even really mine! I can’t spend them, move them, back them up or recover them to a different wallet. They’re stuck where they are, dead stock in Adam Smith’s famous phrasing regarding money. Instead, I set aside some other fiat funds in my regular banking app and impulse-bought MARA (MSTR is available there, but no other Strategy instruments); while MARA is issuing stocks and convertible debt to stack sats like yet another treasury company, at least it’s an underlying operating business (mining) — and their mNAV is around 1, so I don’t pay a premium for their financial-market, cost-of-capital arbitrage-ish play. How, Just HOW, will Bitcoin Treasury Companies Fail? “There’s a real possibility we have, like, a dot-com style boom-and-bust cycle in this public equity world.” Danny Knowles, May 28, “What Bitcoin Did” Strategy is bulletproof. As Lyn Alden’s question in the Strategy Q2 earnings call illustrated, even in an 80% bitcoin drawdown, Strategy will be fine. The company was in a much worse position during the 2022 bear market when its bitcoin was directly tied to margin loans and collateral for bank debt. That’s not the case in 2025 when preferreds run the show. Looking past the occasional tradfi analyst or journalist obsession with mNAV, or why a company should be valued above the bitcoin it holds, and the pearl-clutching, inside and outside Bitcoin over using debt for acquiring more bitcoin, Strategy is unbelievably conservatively financed. The company holds bitcoin worth some $77 billion; the convertible debt amounts to about $5 billion ($8 billion, really, but some of them are deep in the money and trade as equity, not debt, at this point). There’s a little over $6 billion of preferred stock outstanding across STRK, STRD, STRF and STRC. (That makes the company about 15% levered, meaning bitcoin would have to drop by over 85% for the company to have any sort of solvency problems.) Another avenue for problems is if tradfi money market capital dries up. Strategy’s ability to overperform bitcoin by generating increasing bitcoin per share depends on some combination of lower/safer cost of capital (or better terms on its debt) or tapping the above-1 mNAV (instantly accretive since it lets Saylor buy bitcoin at discount). In the absence of that — say, nobody buys the treasury company issuances, and financial capital flows somewhere else; money printing stops; interest rates on (safer?) government securities shoot up, etc — I don’t see how Strategy’s mNAV doesn’t just collapse back down to 1. Lastly, there’s a custodian risk for Strategy specifically. Being the biggest player around, with some 3% of the total supply, honey-pot risks abound. (This probably won’t be an issue for the smaller ones, distributed across very different jurisdictions.) Strategy keeps its gigantic pile of coins with Coinbase custody — in solutions that are purposefully kept pretty opaque. What happens to Strategy’s business if Coinbase goes bankrupt? Or worse, new political winds bring in confiscation and/or aggressive taxation metrics? These are good questions, but very out-there tail risks nonetheless. Do we really have to worry that much about them? Whether bitcoin treasury companies are here to bring bitcoin to the center of global capital markets, or whether this all ends in disaster, we have yet to see. Closing Thoughts: Sell-Out? Ponzi Got to Your Head? Have I intellectually sold out? Am I a corporate slave? Has David Bailey’s musings — and the fact that Nakamoto, loosely affiliated with Bitcoin Magazine via shared ownership and marketing services — rubbed off on me, now that NAKA is merging with KindlyMD and can unleash its flywheel/“Ponzi” scheming in full? First, it would be a deep betrayal of journalistic integrity and — tells me our in-house legal counsel — illegal to use a media platform to pump securities owned by its owner. (Though in the age of Trump, who can tell?). But I certainly wouldn’t be doing my job if I weren’t seriously investigating the pros and cons of these entities mushrooming up everywhere. Second, and as an illustration of my very low conviction in all of this: I hold about as much in treasury company stocks as I do in custodial Lightning wallets for zapping and convenience spending — ergo, not much. Third, for full transparency (again, on advice of counsel), here’s the experience detailed to date (note: calculated at prices before Treasury Secretary Scott Bessent’s comments yesterday shoved all these prices downward): A few things stand out. Choose your bitcoin treasury companies carefully: H100 and Sander Andersen seem pretty dedicated to the stacking effort, and the company keeps moving up the bitcoin treasuries list. For now, financial markets reward such companies for their efforts. In contrast, the K33 team moves much slower, and their share price experience since their first bitcoin launch months ago has been classic, short-term pump before gradually declining back to where the stock started. MARA and Strategy are hovering around where they have been for months. My amazing ~5% excess return over bitcoin is too meagre to bother with — and one-off lucky. Over longer time periods, this might change… but honestly, just don’t bother. I will probably get tired of this latest fiat financial engineering fad soon enough. It’s only so much fun to hold permissioned, brokerage-limited, old school assets. Come hell or high water, celebration or disaster, glory or tears… it seems much easier to just keep chopping wood and stacking sats into cold storage than to bother with any of these bitcoin securities. Treasury fever is running high on Wall Street and among hyped-up Bitcoiners. Maybe the financialization of bitcoin is upon us… but honestly, I think I’ll mostly just sit this one out. Views expressed in this article are opinions of the author and do not necessarily reflect the views of ZeroHedge. Tyler Durden Sat, 08/16/2025 - 21:00",
    "publishedAt": "2025-08-17T01:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.142Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c7febb"
  },
  {
    "id": "yahoo-finance-77ec1e12",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Big Tech Is Eating Itself in Talent War",
    "url": "https://www.wsj.com/tech/ai/ai-researchers-hiring-spree-big-tech-5ad03ebd?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T01:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "77ec1e12"
  },
  {
    "id": "zerohedge-5848e20",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Indians Are The Most Positive On AI; Americans The Most Negative",
    "url": "https://www.zerohedge.com/ai/indians-are-most-positive-ai-americans-most-negative",
    "summary": "Indians Are The Most Positive On AI; Americans The Most Negative Artificial Intelligence (AI) is reshaping industries, governments, and societies—but how do people around the world actually feel about that?",
    "fullContent": "Indians Are The Most Positive On AI; Americans The Most Negative Artificial Intelligence (AI) is reshaping industries, governments, and societies—but how do people around the world actually feel about that? In this visualization, Visual Capitalist's Marcus Lu shows public attitudes towards artificial intelligence across 21 countries, based on a global AI survey of over 1,000 people in each country. Respondents were asked to rate their overall opinion on AI, ranging from “very positive” to “very negative”. The data for this visualization comes from the Global Public Opinion on Artificial Intelligence (GPO-AI), published by the Schwartz Resiman Institute for Technology and Society. Emerging Economies Lead in AI Optimism India topped the global AI survey with 43% of respondents expressing a “very positive” opinion of AI. Kenya (29%) and Brazil (27%) followed closely behind. These results suggest that populations in emerging economies are more enthusiastic about the potential benefits of AI—perhaps due to expectations for job creation, economic development, or improvements in public services. Neutral Sentiment in Advanced Economies In contrast, a majority in developed countries held neutral views. In Japan, 44% of people said they felt neutral about AI, followed by Germany (40%) and Poland (40%). This more cautious stance could reflect greater exposure to discussions on AI ethics, job displacement, and regulation. Negative Views Strongest in the West The U.S., France, and Australia reported the highest shares of negative sentiment. For instance, 34% of U.S. respondents had either a “fairly” or “very negative” view of AI. Such skepticism might be tied to political divides, concerns about misinformation, or fears of job loss in white-collar industries. If you enjoyed today’s post, check out Capital Expenditure by Hyperscalers on Voronoi, the new app from Visual Capitalist. Tyler Durden Sat, 08/16/2025 - 20:25",
    "publishedAt": "2025-08-17T00:25:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.142Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5848e20"
  },
  {
    "id": "bbc-business-5e8abb9b",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Yellow stickers and fridge hacks: How to feed children for less in the holidays",
    "url": "https://www.bbc.com/news/articles/c4glpdp90w4o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Parents share their tips for cooking up extra meals without overspending at the supermarket.",
    "fullContent": "Parents share their tips for cooking up extra meals without overspending at the supermarket.",
    "publishedAt": "2025-08-17T00:18:34.000Z",
    "fetchedAt": "2025-08-17T02:34:45.043Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5e8abb9b"
  },
  {
    "id": "bloomberg-markets-4694aad4",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "China’s $11 Trillion Stock Market Is a Headache for Both Xi and Trump",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/china-s-11-trillion-stock-market-is-a-headache-for-both-xi-and-trump",
    "summary": "The poor long-term performance of the nation’s equities has hampered consumer spending.",
    "fullContent": "The poor long-term performance of the nation’s equities has hampered consumer spending.",
    "publishedAt": "2025-08-17T00:00:30.000Z",
    "fetchedAt": "2025-08-17T02:34:42.000Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4694aad4"
  },
  {
    "id": "yahoo-finance-1518c767",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Americans Pull Back From an Epic Credit-Card Binge",
    "url": "https://www.wsj.com/personal-finance/credit/americans-pull-back-from-an-epic-credit-card-binge-ebf33c42?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T00:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1518c767"
  },
  {
    "id": "zerohedge-539420ad",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "What's Standing In The Way Of A Grand Compromise On Ukraine?",
    "url": "https://www.zerohedge.com/geopolitical/whats-standing-way-grand-compromise-ukraine",
    "summary": "What's Standing In The Way Of A Grand Compromise On Ukraine? Authored by Andrew Korybko via Substack, The onus is now on Zelensky to reciprocate Putin’s widely perceived willingness to compromise for peace.",
    "fullContent": "What's Standing In The Way Of A Grand Compromise On Ukraine? Authored by Andrew Korybko via Substack, The onus is now on Zelensky to reciprocate Putin’s widely perceived willingness to compromise for peace. Putin and Trump publicly confirmed that they found a lot of common ground during their three-hour-long talks in Anchorage, but no grand compromise on Ukraine was reached due to “a couple of big [points]…One is probably the most significant” that remain unresolved according to Trump. Putin’s reaffirmation of the need to “eliminate the primary causes of the conflict” and Trump mentioning how Zelensky will “have to agree” with what the US achieved so far strongly hints at what these could be. As a reminder, Russia’s official goals in the conflict are to: demilitarize Ukraine; denazify it; restore the country’s constitutional neutrality; and obtain recognition of the on-the-ground reality. Putin suggested that he’s become more flexible as of late, which was likely responsible at least in part for why he and Trump just met as well as for Trump’s positive assessment of their talks, so he could hypothetically compromise on one, some, or all of these goals. This places the onus on Zelensky to reciprocate. In the order that Putin’s goals were mentioned, Trump therefore likely expects Zelensky to either agree to: curtail the size of his armed forces after the conflict ends; get the Rada to criminalize the glorification of WWII-era Ukrainian Nazi collaborators and/or rescind anti-Russian legislation; have them remove the 2019 constitutional amendment about seeking NATO membership; and/or amend the constitution to more easily cede land without first having to hold a successful All-Ukrainian referendum on this issue. Trump also said that he’ll “call up NATO”, likely referring to the leaders of key NATO countries, who he seemingly expects to facilitate a grand compromise by correspondingly: agreeing not to deploy troops to Ukraine and/or agreeing to curtail arms exports to it; “creatively encouraging” the Rada to pass the aforesaid socio-political, neutrality, and/or territorial cession reforms (e.g. threatening to curtail aid if they don’t); and/or explicitly declaring that they’ll no longer approve Ukraine’s NATO membership bid. They might not do so willing, however, so it’s possible that Trump could: greatly reduce or even abandon the scale of mid-July’s scheme to sell new US arms to NATO for passing along to Ukraine; threaten to cut off all military ties with any country that deploys troops to Ukraine; threaten to impose more tariffs on countries that don’t “creatively encourage” the Rada to pass the aforesaid reforms; and/or threaten to reduce the US’ role in NATO if members don’t explicitly declare their opposition to Ukraine joining. If Trump and his NATO subordinates convince Zelensky to agree to some of these compromises, then Putin might agree to: Ukraine retaining a larger military than what was agreed to in spring 2022’s draft peace treaty; not pursue full-fledged denazification (e.g. tacitly accepting that traces of this ideology will remain in Ukrainian society); not object to Ukraine’s limited bilateral cooperation with NATO members; and/or indefinitely freeze Russia’s territorial claims (i.e. still retain but not actively pursue them). This pathway towards a grand compromise could be derailed by: a Ukrainian false-flag provocation against civilians that turns Trump against Russia; a false-flag provocation elsewhere like in the Baltic Sea to the same end; and/or any serious expansion of Russia’s ground campaign beyond the disputed regions. Trump might not be misled by any false flags while Putin might limit the scope of the special operation as a “goodwill gesture”, however, so peace is possible if Zelensky finally agrees to compromise. Tyler Durden Sat, 08/16/2025 - 19:50",
    "publishedAt": "2025-08-16T23:50:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.143Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "539420ad"
  },
  {
    "id": "marginal-revolution-57e85ebf",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "Model this?",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/model-this-8.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=model-this-8",
    "summary": "The gap between US companies’ borrowing costs and US Treasury yields has shrunk to its smallest since 1998, after a red-hot rally in global credit markets that investors warn is underplaying threats to the world economy.",
    "fullContent": "The gap between US companies’ borrowing costs and US Treasury yields has shrunk to its smallest since 1998, after a red-hot rally in global credit markets that investors warn is underplaying threats to the world economy. The cost of borrowing for investment-grade companies in US and Eurozone credit markets is 0.75 and 0.76 percentage points [&#8230;] The post Model this? appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-16T23:43:49.000Z",
    "fetchedAt": "2025-08-17T02:34:43.409Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "57e85ebf"
  },
  {
    "id": "ndtv-profit-youtube-2ee07acf",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump-Putin Meet & Greet: Disappointing Or Hopeful?",
    "url": "https://www.youtube.com/watch?v=L52yzlbL6cQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T23:27:37.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2ee07acf"
  },
  {
    "id": "bbc-business-4587b00a",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Nerd glasses and friendship necklaces: Claire's was heaven until Shein came along",
    "url": "https://www.bbc.com/news/articles/c23pek275p5o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "As the future of the chain hangs in the balance, what made tweenagers fall in love with its quirky charm?",
    "fullContent": "As the future of the chain hangs in the balance, what made tweenagers fall in love with its quirky charm?",
    "publishedAt": "2025-08-16T23:21:53.000Z",
    "fetchedAt": "2025-08-17T09:41:14.421Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4587b00a"
  },
  {
    "id": "techmeme-6ecd2001",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Barbour ABI: the UK's data center count, currently 477, is set to jump by ~100 over the next five years, with more than half in London and neighboring counties (BBC)",
    "url": "http://www.techmeme.com/250816/p17#a250816p17",
    "summary": "BBC: Barbour ABI: the UK's data center count, currently 477, is set to jump by ~100 over the next five years, with more than half in London and neighboring counties — The number of data centres in the UK is set to increase by almost a fifth, according to figures shared with...",
    "fullContent": "BBC: Barbour ABI: the UK's data center count, currently 477, is set to jump by ~100 over the next five years, with more than half in London and neighboring counties — The number of data centres in the UK is set to increase by almost a fifth, according to figures shared with BBC News.",
    "publishedAt": "2025-08-16T23:20:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6ecd2001"
  },
  {
    "id": "fortune-2e535f2",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Government forces Air Canada and flight attendants back to work and into arbitration, after strike strands over 100,000 travelers",
    "url": "https://fortune.com/2025/08/16/air-canada-strike-flight-attendants-cancelations-operations-travel-sesason/",
    "summary": "A complete shutdown will impact about 130,000 people a day, and some 25,000 Canadians may be stranded abroad daily. Air Canada operates around 700 flights per day.",
    "fullContent": "A complete shutdown will impact about 130,000 people a day, and some 25,000 Canadians may be stranded abroad daily. Air Canada operates around 700 flights per day.",
    "publishedAt": "2025-08-16T23:17:03.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2e535f2"
  },
  {
    "id": "zerohedge-122ddacc",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Visualizing How America's Workforce Has Changed Over The Past 25 Years",
    "url": "https://www.zerohedge.com/personal-finance/visualizing-how-americas-workforce-has-changed-over-past-25-years",
    "summary": "Visualizing How America's Workforce Has Changed Over The Past 25 Years Two decades ago, nearly one in five American workers answered phones, filed paperwork, or managed calendars. Today, that figure has fallen sharply.",
    "fullContent": "Visualizing How America's Workforce Has Changed Over The Past 25 Years Two decades ago, nearly one in five American workers answered phones, filed paperwork, or managed calendars. Today, that figure has fallen sharply. The visualization, via Visual Capitalist's Pallavi Rao, compares how 100 hypothetical workers were distributed across occupations in 2002 versus 2024. It revealing which fields lost—or gained—share during a period marked by globalization, new technology, and a pandemic. The data for this visualization comes from the U.S. Bureau of Labor Statistics’ Occupational Employment and Wage Statistics, which track headcounts across more than 800 detailed job categories. Those categories are grouped into 21 broad buckets, visualized here, to spotlight long-term structural shifts in U.S. jobs. ℹ️ BLS does not collect data on the agriculture sector, except for a few support categories. Office Work is Still the Most Common U.S. Job Back-office roles were once the backbone of white-collar employment. But widespread adoption of enterprise software—from automated invoicing to cloud-based scheduling—has pared back demand. Rank 2002 2002 Workforce as 100 People 2024 2024 Workforce as 100 People 1 🧑‍💼 Office & Admin 18 🧑‍💼 Office & Admin 12 2 📈 Sales 10 🚚 Transport & Logistics 9 3 🏭 Manufacturing 8 🍽️ Food 9 4 🍽️ Food 8 📈 Sales 9 5 🚚 Transport & Logistics 7 👔 Management 7 6 🎓 Education 6 💹 Business and Financial 7 7 👔 Management 6 🩺 Doctors, Nurses, Technicians 6 8 🩺 Doctors, Nurses, Technicians 5 🎓 Education 6 9 🏗️ Construction & Extraction 5 🏭 Manufacturing 6 10 🔧 Installation & Repair 4 🧑‍⚕️ Health Assistants & Aides 5 11 💹 Business & Financial 4 🏗️ Construction & Extraction 4 12 🧹 Custodial 3 🔧 Installation & Repair 4 13 🧑‍⚕️ Health Assistants & Aides 2 💻 Data & Tech 3 14 🛡️ Protection 2 🧹 Custodial 3 15 🏨 Hospitality 2 🛡️ Protection 2 16 💻 Data & Tech 2 🏨 Hospitality 2 17 📐 Architecture & Engineering 2 🤝 Community & Social Service 2 18 🤝 Community & Social Services 1 📐 Architecture & Engineering 2 19 🎭 Arts, Media, Sport 1 🎭 Arts, Media, Sport 1 20 🔬 Science 1 🔬 Science 1 21 ⚖️ Legal 1 ⚖️ Legal 1 22 🌾 Farming, Fishing, and Forestry 0 🌾 Farming, Fishing, and Forestry 0 N/A 🌐 All Occupations 100 🌐 All Occupations 100 Note: Figures are rounded. Between 2002 and 2024, Office & Administrative workers went from 18% of the employed workforce to 12%. Even with the rise of hybrid work, clerical duties are increasingly handled by self-service portals and AI chatbots, leaving fewer traditional desk jobs. The decline underscores how routine cognitive tasks are nearly as vulnerable to automation as factory work. Despite this, Office & Administrative jobs are still the largest category by number of workers (12 per 100), even in 2024. Services Surge in Transport, Food, and Healthcare While clerical and manufacturing roles receded, service-oriented fields expanded. Transport & Logistics now has nine workers per 100, compared to seven in 2002, buoyed by e-commerce that multiplies parcel volumes and warehouse positions. Food Service has also climbed, reflecting a consumer shift toward dining out and delivery. Healthcare saw twin gains: Doctors/Nurses/Technicians held steady at six workers per 100, while Health Assistants & aides rose from two to five workers as an aging population demands more support staff. Together, these categories illustrate how in-person, non-routine work remains resilient. High-Skill Roles Grow—but So Do Inequalities Both Management and Data & Tech occupations added roughly one worker per 100 since 2002, mirroring a broader pivot toward knowledge work. Overall, the workforce is more diversified, with less concentration in a few dominant sectors. The shift reflects structural change: technology is reducing clerical jobs while demographic and digital trends are fueling growth in healthcare and tech. If you enjoyed today’s post, check out The Most Common Job in Each U.S. State in 2024 on Voronoi, the new app from Visual Capitalist. Tyler Durden Sat, 08/16/2025 - 19:15",
    "publishedAt": "2025-08-16T23:15:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "122ddacc"
  },
  {
    "id": "fortune-1a264d59",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "OpenAI staffers to sell $6 billion in stock to SoftBank, other investors",
    "url": "https://fortune.com/2025/08/16/openai-staffers-6-billion-secondary-stock-sale-softbank-thrive-capital-dragoneer/",
    "summary": "The secondary share sale will give OpenAI employees a chance to get cash-rich amid a high-stakes talent war in the AI industry.",
    "fullContent": "The secondary share sale will give OpenAI employees a chance to get cash-rich amid a high-stakes talent war in the AI industry.",
    "publishedAt": "2025-08-16T23:11:55.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1a264d59"
  },
  {
    "id": "wsj-world-news-6bf69828",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Putin Returns to Moscow With Air of Triumph After Summit",
    "url": "https://www.wsj.com/world/putin-returns-to-moscow-with-air-of-triumph-after-summit-4e6bf35e",
    "summary": "The meeting with Trump helped give the Kremlin leader much of what he wanted, including putting Russia on an equal footing with the U.S.",
    "fullContent": "The meeting with Trump helped give the Kremlin leader much of what he wanted, including putting Russia on an equal footing with the U.S.",
    "publishedAt": "2025-08-16T23:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.967Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "6bf69828"
  },
  {
    "id": "oil-price-c3cbb25",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Natural Gas Could Be Angola’s Next Big Money Maker",
    "url": "https://oilprice.com/Energy/Natural-Gas/Natural-Gas-Could-Be-Angolas-Next-Big-Money-Maker.html",
    "summary": "Angola is betting big on natural gas developments as a short-term increase in oil production is not expected to last despite the West African country leaving OPEC over capped production. Companies operating in Angola have recently started up two oil projects, but they have...",
    "fullContent": "Angola is betting big on natural gas developments as a short-term increase in oil production is not expected to last despite the West African country leaving OPEC over capped production. Companies operating in Angola have recently started up two oil projects, but they have also begun to target non-associated offshore gas plays, hoping that a massive gas resource could be waiting to be tapped. Despite the recent oil project startups, Angola’s oil production is expected to drop to about 1 million barrels per day (bpd) in 2027,…",
    "publishedAt": "2025-08-16T23:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.066Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "c3cbb25"
  },
  {
    "id": "wired-3ef2226e",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "AI Is Designing Bizarre New Physics Experiments That Actually Work",
    "url": "https://www.wired.com/story/ai-comes-up-with-bizarre-physics-experiments-but-they-work/",
    "summary": "Artificial intelligence software is designing novel experimental protocols that improve upon the work of human physicists, although the humans are still “doing a lot of baby-sitting.”",
    "fullContent": "Artificial intelligence software is designing novel experimental protocols that improve upon the work of human physicists, although the humans are still “doing a lot of baby-sitting.”",
    "publishedAt": "2025-08-16T23:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:34.950Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3ef2226e"
  },
  {
    "id": "fortune-7b64680f",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump&#8217;s reciprocal tariffs could be struck down as soon as this month — and the administration is warning of economic apocalypse",
    "url": "https://fortune.com/2025/08/16/trump-tariffs-appeals-court-case-ieepa-authority-reciprocal-duties/",
    "summary": "\"In short, the economic consequences would be ruinous, instead of unprecedented success.\"",
    "fullContent": "\"In short, the economic consequences would be ruinous, instead of unprecedented success.\"",
    "publishedAt": "2025-08-16T22:46:00.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7b64680f"
  },
  {
    "id": "zerohedge-12473306",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Average American To Receive $3,752 Tax Cut In 2026 Due To OBBBA",
    "url": "https://www.zerohedge.com/personal-finance/average-american-receive-3752-tax-cut-2026-due-obbba",
    "summary": "Average American To Receive $3,752 Tax Cut In 2026 Due To OBBBA Authored by Thérèse Boudreaux via The Center Square, The White House is touting a new economic analysis that estimates taxpayers will see an average $3,752 tax cut in 2026, due to provisions in the One Big...",
    "fullContent": "Average American To Receive $3,752 Tax Cut In 2026 Due To OBBBA Authored by Thérèse Boudreaux via The Center Square, The White House is touting a new economic analysis that estimates taxpayers will see an average $3,752 tax cut in 2026, due to provisions in the One Big Beautiful Bill Act. According to the nonpartisan Tax Foundation report, taxpayers in every state will see reduced federal taxes next year and though there is “considerable geographic variation” in tax benefits. “President Trump’s One Big Beautiful Bill is the largest, most consequential tax cut on the middle class ever,” White House Deputy Press Secretary Anna Kelly said Friday. “Between lower inflation, massive investments, and historic tax cuts, all Americans are reaping the benefits of the Trump Economy – and the Golden Age has just begun.” Republicans’ multitrillion-dollar OBBBA, among other things, made permanent the expiring 2017 Tax Cuts and Jobs Act’s across-the-board reduced tax rates; $15,000 standard deduction; $2,000 Child Tax Credit; 20% QBI deduction for small businesses; and $750,000 home mortgage interest deduction cap. Three key business tax credits were made permanent as well – full reimbursement for new capital investments like machinery and equipment, an expanded deduction for corporation’s interest on debt, and immediate deductions for companies’ research costs. The OBBBA also implemented a host of temporary tax provisions set to expire in 2030, including a quadrupling of the $10,000 state and local tax (SALT) deduction cap; a $6,000 deduction for seniors; and temporary tax deductions for tips and overtime pay, capped for single filers at $25,000 and $12,500, respectively. Taken together, the Tax Foundation analysis estimates that the OBBBA’s tax provisions will lower individuals’ taxes in every state and create 938,000 full-time jobs in the long run. Individuals in Wyoming, Washington, and Massachusetts will see the largest average tax cuts in 2026 – hovering around $5,100 – while residents of West Virginia and Mississippi will see the smallest average tax cuts that year, around $2,400. On a more local level, taxpayers in mountain resort towns will receive the highest average tax benefits while taxpayers in rural counties will receive the lowest tax benefits. Once the temporary tax provisions expire, however, the average tax cut will fall to $2,505 in 2030, then climb to $3,301 by 2035 due to inflation. Although individual households will benefit from the tax cuts, the country’s fiscal health likely won’t, according to budget watchdogs like the Congressional Budget Office. CBO estimates that the trillions in lost federal revenue will add an extra $4.1 trillion to the national debt by 2034. The U.S. national debt just topped $37 trillion, as The Center Square reported. Tyler Durden Sat, 08/16/2025 - 18:40",
    "publishedAt": "2025-08-16T22:40:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "12473306"
  },
  {
    "id": "zerohedge-9292cc0",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "California Democrats Unveil Proposed Congressional Map To Counter Texas Redistricting",
    "url": "https://www.zerohedge.com/political/california-democrats-unveil-proposed-congressional-map-counter-texas-redistricting",
    "summary": "California Democrats Unveil Proposed Congressional Map To Counter Texas Redistricting California Democratic lawmakers unveiled on Friday a proposed redrawn state congressional map they intend to place on the November ballot amid a redistricting battle with Texas.",
    "fullContent": "California Democrats Unveil Proposed Congressional Map To Counter Texas Redistricting California Democratic lawmakers unveiled on Friday a proposed redrawn state congressional map they intend to place on the November ballot amid a redistricting battle with Texas. The proposed congressional map is expected to give Democrats five additional seats in the U.S. House of Representatives in the 2026 election, which Democratic lawmakers said was a response to Texas Republicans’ redistricting plan. As Aldgra Fredly reports for The Epoch Times, the Democratic Congressional Campaign Committee (DCCC) said in a statement that the proposed map is consistent with guidelines laid out by the independent California Citizens Redistricting Commission. “It allows for more compact districts than in the current Commission-drawn map, keeps more communities and neighborhoods together, splits fewer cities, and makes minimal disruptions to the Commission-drawn map so as to impact as few residents as possible,” DCCC Executive Director Julie Merz stated in a letter accompanying the proposed map. California Gov. Gavin Newsom said they would introduce a legislative package next week aimed at allowing state voters to decide on whether to adopt the proposed constitutional amendment without going through the state’s independent redistricting commission. The package also includes a bill enabling the new congressional map to take effect if other states redraw districts, and another bill authorizing reimbursement of costs to administer the election. The governor accused President Donald Trump and Republicans of undermining democracy with a plan to redraw the congressional map in Texas. “This moment calls for urgency and action—that is what we are putting before voters this November, a chance to fight back against his anti-American ways,” Newsom said. California’s First Congressional District is currently anchored in the state’s conservative far northeast corner and is represented by Republican Rep. Doug LaMalfa. The district has a nearly 18-point GOP registration edge. Under the proposal, Democrats would end up with a 10-point registration advantage there after drastic reshaping to include parts of heavily Democratic Sonoma County near the Pacific Coast. LaMalfa has criticized the proposed congressional map. “How on earth does Modoc County, on the Nevada and Oregon border, have any common interest with Marin County and the Golden Gate Bridge? Voters took this power from Sacramento for just this reason,” he stated. “This is naked politics at its worst.” The move came as Texas Republicans proposed a new congressional map after the U.S. Department of Justice suggested that several districts in Texas are likely unconstitutionally created by grouping minorities to form a majority. The redistricting proposal, which would flip five Democratic seats in the 2026 election, prompted more than 50 Texas Democratic lawmakers to leave the state in early August and break quorum in a bid to block the plan from moving forward. They mostly sought refuge in Illinois, where Gov. JB Pritzker vowed to protect them from extradition or other legal threats leveled by Texas Gov. Greg Abbott and Texas Attorney General Ken Paxton. Others fled to New York and California, both led by Democrats. Abbott has accused Democrats of gerrymandering in the past and said his state could go further than California when it comes to redistricting. “Look at the map of Illinois. Look at the map they gerrymandered a long time ago. They got nothing left with regard to what they can do,” he said on CNN on Aug. 11. “And know this: If California tries to gerrymander, find more districts, listen, Texas has the ability to eliminate 10 Democrats in our state.” Tyler Durden Sat, 08/16/2025 - 18:05",
    "publishedAt": "2025-08-16T22:05:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "9292cc0"
  },
  {
    "id": "yahoo-finance-7c888ad9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Cathie Wood buys $12 million of tumbling AI stock",
    "url": "https://finance.yahoo.com/news/cathie-wood-buys-12-million-220025270.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T22:00:25.000Z",
    "fetchedAt": "2025-08-18T06:57:17.062Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7c888ad9"
  },
  {
    "id": "yahoo-finance-700f19bf",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "2 Artificial Intelligence (AI) Stocks the U.S. Government Is Actively Backing in 2025",
    "url": "https://finance.yahoo.com/news/2-artificial-intelligence-ai-stocks-220000213.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T22:00:00.000Z",
    "fetchedAt": "2025-08-18T06:57:17.062Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "700f19bf"
  },
  {
    "id": "yahoo-finance-7094b0dd",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Kevin O'Leary Says If You're Single and Child-Free, Don't Buy a House — 'Are You Married? If the Answer Is No, Rent'",
    "url": "https://finance.yahoo.com/news/kevin-oleary-says-youre-single-183103018.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T21:35:21.000Z",
    "fetchedAt": "2025-08-18T06:57:17.062Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7094b0dd"
  },
  {
    "id": "zerohedge-7f1784bc",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Child Gender Clinics Are Shutting Down Across US",
    "url": "https://www.zerohedge.com/medical/child-gender-clinics-are-shutting-down-across-us",
    "summary": "Child Gender Clinics Are Shutting Down Across US Authored by Kurt Miceli via RealClearWire, Here’s some good news you may not have heard. From coast to coast, child gender clinics are shutting down, thanks to the leadership of the Trump administration.",
    "fullContent": "Child Gender Clinics Are Shutting Down Across US Authored by Kurt Miceli via RealClearWire, Here’s some good news you may not have heard. From coast to coast, child gender clinics are shutting down, thanks to the leadership of the Trump administration. Children are safer because of these closures—protected from radical transgender ideology and the sex changes that threaten their bodies, minds, and futures. The latest gender clinic to announce its closure is at Connecticut Children’s Medical Center, which confirmed this news on July 23. Just one day earlier, the gender clinic at the Children’s Hospital in Los Angeles closed. The L.A. clinic was one of the first and largest in the country, subjecting hundreds of children to invasive and irreversible transgender treatments, including hormones and surgeries. Do No Harm, where I work, has documented nearly 20 gender clinics and programs either pausing child sex changes or shutting down since the start of the year. This progress is the direct result of the Trump administration’s January executive order, which directed federal agencies to prohibit hospitals from getting federal funding if they provide so-called “gender-affirming care” to minors. In reality, such care is neither caring nor gender-affirming. It forces confused children to become something they’re not, because, as studies show, the vast majority of these kids wouldn’t try to change genders if they simply waited. Yet once they’re pushed down the sex-change road, they very often can’t fully go back, and they very often have lifelong physical and mental health complications. Taxpayers should never be forced to support this medical and moral nightmare. Children should be able to develop naturally, especially those who are confused. They don’t need a dangerous cocktail of off-label chemicals or sex-change surgeries. Yet that’s what activists have long demanded, and medical associations and many providers largely gave into their demands instead of putting children’s health first. To this day, the medical establishment is dominated by those activists, and they’re loudly lamenting the closure of these clinics. But they’re very clearly ignoring the evidence. Look no further than the recently shuttered clinic at the Children’s Hospital at Los Angeles. The clinic’s leader, the famous transgender activist Dr. Johanna Olson-Kennedy, became infamous last year when she refused to release the findings of her own taxpayer-funded study on gender-confused kids. She finally relented under pressure in May, and lo and behold, it turns out that puberty blockers aren’t associated with improvement in kids’ mental health. Dr. Olson-Kennedy’s own research undercuts the entire argument for child sex changes—that it will help them become healthier and happier with who they are. The evidence is mounting that child sex changes are built on a foundation of lies—and incredibly dangerous to those who receive them. In June, a new study found that boys taking feminizing hormones are far more likely to have strokes and develop various cancers. In fact, they’re up to 40 times more likely to develop breast cancer. Other studies show that girls taking testosterone are in for a world of physical pain, as well. The Trump administration has grounded its actions in this medical research, whereas the medical establishment has largely put radical ideology ahead of real evidence. That fact was on full display earlier this year, after the Department of Health and Human Services released its groundbreaking analysis of the state of medical research on sex changes for kids. The report concluded that there’s “very weak evidence of benefit” to kids, but there are “significant risks,” including irreversible harms like infertility. Rather than acknowledge reality, medical groups and hospitals rushed to condemn the report and defend their desire to continue endangering children’s health and well-being. Thankfully, that danger is beginning to fade, now that child gender clinics are shutting down. But there’s more work to do when it comes to protecting children. The clinics and programs that have closed only account for about 13 percent of the child sex change treatments that Do No Harm has documented from 2019 to 2023 alone. Another 28 percent of children who suffered from this ideology lived in states that have since banned child sex changes. But that leaves a lot of states and hospitals that are still putting a majority of America’s children at risk. The Trump administration shouldn’t rest until everyone who’s endangering children is held accountable—and every child in America is safe. Tyler Durden Sat, 08/16/2025 - 17:30",
    "publishedAt": "2025-08-16T21:30:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7f1784bc"
  },
  {
    "id": "bloomberg-politics-3ee62fe",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Ivorian Opposition Rallies Against President’s Fourth-Term Bid",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/ivorian-opposition-rallies-against-president-s-fourth-term-bid",
    "summary": "Thousands of Ivorians rallied against incumbent leader Alassane Ouattara’s bid for a fourth term on Saturday — the second such demonstration in a single week.",
    "fullContent": "Thousands of Ivorians rallied against incumbent leader Alassane Ouattara’s bid for a fourth term on Saturday — the second such demonstration in a single week.",
    "publishedAt": "2025-08-16T21:27:45.000Z",
    "fetchedAt": "2025-08-17T02:34:42.475Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "3ee62fe"
  },
  {
    "id": "techmeme-251cacd0",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A new Artificial Analysis benchmark, focusing on OpenAI's gpt-oss-120b, shows how open-weight LLMs exhibit inconsistent performance across hosting providers (Simon Willison/Simon Willison's Weblog)",
    "url": "http://www.techmeme.com/250816/p16#a250816p16",
    "summary": "Simon Willison / Simon Willison's Weblog: A new Artificial Analysis benchmark, focusing on OpenAI's gpt-oss-120b, shows how open-weight LLMs exhibit inconsistent performance across hosting providers — Artificial Analysis published a new benchmark the other day, this time...",
    "fullContent": "Simon Willison / Simon Willison's Weblog: A new Artificial Analysis benchmark, focusing on OpenAI's gpt-oss-120b, shows how open-weight LLMs exhibit inconsistent performance across hosting providers — Artificial Analysis published a new benchmark the other day, this time focusing on how an individual model - OpenAI's gpt-oss-120b - performs across different hosted providers.",
    "publishedAt": "2025-08-16T21:20:01.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "251cacd0"
  },
  {
    "id": "yahoo-finance-776d0fdd",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Crypto analyst eyes XRP breaking out to new all-time high",
    "url": "https://finance.yahoo.com/news/crypto-analyst-eyes-xrp-breaking-210912297.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T21:09:12.000Z",
    "fetchedAt": "2025-08-18T06:57:17.062Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "776d0fdd"
  },
  {
    "id": "oil-price-61d0a193",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Global Nuclear Power Hits Record High as Asia Surges Ahead",
    "url": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Global-Nuclear-Power-Hits-Record-High-as-Asia-Surges-Ahead.html",
    "summary": "Nuclear power has always been a paradox. It can produce massive amounts of low-carbon electricity, yet it must constantly battle the headwinds of politics and public perception. The latest Statistical Review of World Energy shows that while nuclear generation is growing...",
    "fullContent": "Nuclear power has always been a paradox. It can produce massive amounts of low-carbon electricity, yet it must constantly battle the headwinds of politics and public perception. The latest Statistical Review of World Energy shows that while nuclear generation is growing globally—setting a new record high in 2024—the trend is anything but uniform. Some countries are charging ahead, while others are stepping back. Global Output: Modest Growth, Unevenly Shared In 2024, global nuclear generation reached 2,817 terawatt-hours, a modest…",
    "publishedAt": "2025-08-16T21:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.066Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "61d0a193"
  },
  {
    "id": "zerohedge-188f67a4",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Escobar: Putin-Trump Summit Went Much Better Than Expected",
    "url": "https://www.zerohedge.com/geopolitical/escobar-putin-trump-summit-went-much-better-expected",
    "summary": "Escobar: Putin-Trump Summit Went Much Better Than Expected There are few details about what exactly was discussed in the meeting, but Russian officials have made it clear that they’re pleased with how it went, says veteran geopolitical analyst, Pepe Escobar.",
    "fullContent": "Escobar: Putin-Trump Summit Went Much Better Than Expected There are few details about what exactly was discussed in the meeting, but Russian officials have made it clear that they’re pleased with how it went, says veteran geopolitical analyst, Pepe Escobar. There were even some indications that a serious US-Russia reset could be on the horizon. \"Even according to President Trump himself, they came to agreement on several important points and only a few are left. So this implies, serious discussions not only about Ukraine, a possible resolution in Ukraine, and of course we we have no idea about the terms and the parameters, but a reset, a serious reset of US-Russia relations.\" Tyler Durden Sat, 08/16/2025 - 16:55",
    "publishedAt": "2025-08-16T20:55:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "188f67a4"
  },
  {
    "id": "cnbc-markets-4adf6253",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Samsung taking market share from Apple in U.S. as foldable phones gain momentum",
    "url": "https://www.cnbc.com/2025/08/16/samsungs-us-market-share-apple-rivalry-foldable-phones.html",
    "summary": "Samsung introduced two folding phones in July that are garnering praise on social media and putting pressure on Apple to deliver new types of iPhones.",
    "fullContent": "Samsung introduced two folding phones in July that are garnering praise on social media and putting pressure on Apple to deliver new types of iPhones",
    "publishedAt": "2025-08-16T20:50:56.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4adf6253"
  },
  {
    "id": "business-insider-1e548f1b",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Growing up, I spent nearly every weekend with my grandmother. She made me see that I am smart and powerful.",
    "url": "https://www.businessinsider.com/spent-weekends-with-grandmother-she-made-me-understand-my-worth-2025-8",
    "summary": "Growing up, I viewed my grandmother as my best friend. Now, years after her death, the lessons she taught me still guide my life.",
    "fullContent": "Growing up, I viewed my grandmother as my best friend. Now, years after her death, the lessons she taught me still guide my life.",
    "publishedAt": "2025-08-16T20:40:02.000Z",
    "fetchedAt": "2025-08-17T02:34:42.451Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e548f1b"
  },
  {
    "id": "yahoo-finance-8debd98",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Green Hydrogen Production Group Closes on Major Investment",
    "url": "https://finance.yahoo.com/news/green-hydrogen-production-group-closes-203536150.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T20:35:36.000Z",
    "fetchedAt": "2025-08-18T02:33:32.409Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "8debd98"
  },
  {
    "id": "summer-of-protocols-4729c4ef",
    "sourceId": "summer-of-protocols",
    "sourceName": "Summer of Protocols",
    "title": "A Very Short Introduction to Memory and Technology",
    "url": "https://protocolized.summerofprotocols.com/p/a-very-short-introduction-to-memory",
    "summary": "Issue #44: From the Memory Research Group",
    "fullContent": "Issue #44: From the Memory Research Group",
    "publishedAt": "2025-08-16T20:27:38.000Z",
    "fetchedAt": "2025-08-17T02:37:35.968Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "4729c4ef"
  },
  {
    "id": "zerohedge-3d59f35",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Two Charts Of Extremely Perverse Incentives",
    "url": "https://www.zerohedge.com/political/two-charts-extremely-perverse-incentives",
    "summary": "Two Charts Of Extremely Perverse Incentives Authored by Charles Hugh Smith via OfTwoMinds blog, As a thought experiment, consider these changes to our economy's incentive structure. Warren Buffett's partner Charlie Munger had a maxim: Show me the incentives, and I'll show you...",
    "fullContent": "Two Charts Of Extremely Perverse Incentives Authored by Charles Hugh Smith via OfTwoMinds blog, As a thought experiment, consider these changes to our economy's incentive structure. Warren Buffett's partner Charlie Munger had a maxim: Show me the incentives, and I'll show you the outcome. With that in mind, let's look at two charts. The first is a chart depicting the use of ChatGPT. (Source: OpenAI Usage Plummets in the Summer, When Students Aren't Cheating on Homework.) Usage fell by 2/3 once classes ended, and the dips in use during the Spring align with weekends. There are any number of conclusions we can draw, but let's start with another of Munger's maxims: why? The reason is obvious: students are required to do homework as part of the learning process, and are incentivized to complete their homework so they pass the class. So they use generative AI tools to either help them complete their homework or do their homework for them. We can't tell which option they selected without testing their knowledge without any digital devices within reach to help them. Note the incentives are to complete the homework, not to master the material. That's a big difference, and it's the foundation of our entire system of education: pass the class, accumulate credits, and you will be issued a credential / diploma certifying that you passed X number of classes. This incentive leads to students learning very little despite spending a fortune and four years attending college courses. Consider the study Academically Adrift: Limited Learning on College Campuses which concluded that \"American higher education is characterized by limited or no learning for a large proportion of students.\" The institutions of education are incentivized to issue credentials that cost a lot of money and time. The causal link between learning and doing homework is now weak, as generative AI can do their homework for them. The obvious solution is to issue educational credentials only for passing exams given in real time without any digital devices allowed. In other words, test the students' actual learning / knowledge, rather than tote up homework completed and classes passed. In other words, accredit the student, not the institution. This was a key suggestion in my book The Nearly Free University. The testing would have to be lengthy and clever enough to demand real mastery rather than superficial recall / memory, and it would have to be closely guarded and the component exams would have to be issued semi-randomly to each student at the moment the testing began, to minimize gaming the test or cheating. In this incentive system, if a well-educated 17-year old passed the entire battery of university accreditation tests, they would be issued a university diploma without attending a single class because the system accredits the student, not the institution. In my book Get a Job and Build a Real Career, I take this one step further, outlining a path to accredit yourself. What the existing system incentivizes is becoming dependent on generative AI while learning very little because there is little incentive for actual learning. There are also no incentives for those within the institutions to focus on students learning essential skills and knowledge. Imagine if the wildly unproductive belief that \"everyone has to go to college\" was replaced with a system that enabled students to choose to learn skills on a broad spectrum, from welding to calculus. Imagine if every employee in the school / university received minimum-wage paychecks if the students learned very little and received a bonus if the students passed rigorous tests documenting that they'd learned skills and knowledge that are useful in life and in the real economy. Imagine if every student who passed the tests was given a paid internship in their field of choice. Instead, we incentivize students in insert typos into their chatbot-composed papers to make it appear that they actually wrote the paper themselves. If we want a more productive outcome, we have to change the incentive structure of the entire education complex. Next up: stock buybacks, which were only legalized in 1982 at the start of America's great hollow out the real economy to benefit the few experiment, also known as Financialization. (Source: American Companies Are Buying Their Own Stocks at a Record Pace Buybacks are expected to top $1.1 trillion in 2025, led by big banks and tech firms (in other words, the usual suspects.) The approved narrative seems to be that Corporate America would be investing these trillions in new productivity, except for all this uncertainty about tariffs. But this explanation conveniently ignores the enormous annual buybacks that preceded the present tariff kerfuffle. The real issue is the incentives favor financialization, not investing in real-world productive assets. As a thought experiment, consider these changes to our economy's incentive structure: 1. Buybacks are taxed at a rate of 50%. If you want to buy back $1 of your company's shares, you pay $1 in tax. So Corporate America's $1.1 trillion in buybacks would generate $550 billion in taxes and a net $550 billion in shares purchased via buybacks. 2. Profits earned from domestic production are tax-free. Given the complexities of global supply chains, there has to be some wiggle room here, so if 80% of all components and labor are domestic, this qualifies for the zero tax rate. How would changing the incentives change Corporate America's decisions regarding where they invest their profits? If we want to change the outcome, we have to change the incentive structure. The problem, as we all know, is those with vested interests in maintaining the current perverse incentives hold all the power, and they have zero incentive to relinquish any of that power. * * * Check out my new book Ultra-Processed Life and my updated Books and Films. Become a $3/month patron of my work via patreon.com Subscribe to my Substack for free Tyler Durden Sat, 08/16/2025 - 16:20",
    "publishedAt": "2025-08-16T20:20:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3d59f35"
  },
  {
    "id": "yahoo-finance-4551867e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Canary CEO Predicts Bitcoin Will Hit $150K This Year—But Ethereum Surge Won't Last",
    "url": "https://finance.yahoo.com/news/canary-ceo-predicts-bitcoin-hit-201622868.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T20:16:22.000Z",
    "fetchedAt": "2025-08-18T06:57:17.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4551867e"
  },
  {
    "id": "yahoo-finance-28c7240d",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Dogecoin Investors Remain Bullish Despite Price Decline, Commit About $3.42 Billion to Derivatives Market",
    "url": "https://finance.yahoo.com/news/dogecoin-investors-remain-bullish-despite-201611741.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T20:16:11.000Z",
    "fetchedAt": "2025-08-18T06:57:17.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "28c7240d"
  },
  {
    "id": "yahoo-finance-20d0c208",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Along With $100 Billion U.S. Manufacturing Commitment, Apple's Tim Cook Gifted Trump A Glass 'Made In USA' Plaque On 24-Karat Gold",
    "url": "https://finance.yahoo.com/news/along-100-billion-u-manufacturing-200223924.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T20:02:23.000Z",
    "fetchedAt": "2025-08-18T06:57:17.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "20d0c208"
  },
  {
    "id": "bloomberg-markets-1b3fe80b",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Central Bankers Flock to Jackson Hole at Pivotal Moment",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/fed-rates-central-bankers-flock-to-jackson-hole-at-pivotal-moment",
    "summary": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "fullContent": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "publishedAt": "2025-08-16T20:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.000Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1b3fe80b"
  },
  {
    "id": "bloomberg-economics-1b3fe80b",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Central Bankers Flock to Jackson Hole at Pivotal Moment",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/fed-rates-central-bankers-flock-to-jackson-hole-at-pivotal-moment",
    "summary": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "fullContent": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "publishedAt": "2025-08-16T20:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.468Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "1b3fe80b"
  },
  {
    "id": "yahoo-finance-5ec2e8e1",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "AT&T's $17 Million Data Breach Settlement Offers Payouts Up To $7,500, Here's How To Claim",
    "url": "https://finance.yahoo.com/news/ts-17-million-data-breach-194605700.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:46:05.000Z",
    "fetchedAt": "2025-08-18T06:57:17.059Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5ec2e8e1"
  },
  {
    "id": "ndtv-profit-youtube-59cdc65f",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Meet | F-35 Jets Escort Putin’s ‘Flying Kremlin’ From Alaska After Trump Meeting",
    "url": "https://www.youtube.com/shorts/RG40KxQqVRg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:45:25.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "59cdc65f"
  },
  {
    "id": "zerohedge-984d2e2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Fleeing High-Cost Blue States? Here's Where Bills Are Lowest",
    "url": "https://www.zerohedge.com/personal-finance/fleeing-high-cost-blue-states-heres-where-bills-are-lowest",
    "summary": "Fleeing High-Cost Blue States? Here's Where Bills Are Lowest The U.S. consumer landscape remains mixed. Recent datapoints have painted a softer macroeconomic backdrop, with subpar jobs reports with downward revisions, a pullback in personal spending, two consecutive monthly...",
    "fullContent": "Fleeing High-Cost Blue States? Here's Where Bills Are Lowest The U.S. consumer landscape remains mixed. Recent datapoints have painted a softer macroeconomic backdrop, with subpar jobs reports with downward revisions, a pullback in personal spending, two consecutive monthly declines in credit card balances, a record jump in student loan delinquencies, and downward pressure in consumer discretionary stocks. However, July’s consumer report showed an unexpected surge in spending, suggesting resilience so far this summer despite economic headwinds. Against this complicated macroeconomic backdrop for consumers, new data from DoxoINSIGHTS’ 2025 State-by-State Bill Pay Market Report provides a granular view of household bill costs nationwide. The report ranks states by monthly expenses, highlighting the most and least expensive places to live. Doxo's unique aggregate bill pay dataset shows that consumers spend an average of $2,058 per month on bills, or about 31% of the $84,583 median household income. The analysis, covering 97% of ZIP codes and 45 bill categories, shows California, Hawaii, New Jersey, and Massachusetts as the priciest states, while West Virginia, Mississippi, Arkansas, and Oklahoma are the cheapest. Californians face a median monthly bill of $2,854, 39% above the national level, compared with $1,149 in West Virginia, 44% below. The report, based on median payments for 13 major household expenses including mortgages, rent, utilities, auto loans, insurance and telecoms, ranks all 50 states by bill cost. 10 Most Expensive States for Household Bills 10 Least Expensive States for Household Bills This state-level cost profile can help individuals and employers make more informed decisions when considering job relocations or moves to escape expensive blue states to affordable red states. * * * View the full report here: . . . Tyler Durden Sat, 08/16/2025 - 15:45",
    "publishedAt": "2025-08-16T19:45:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "984d2e2"
  },
  {
    "id": "fortune-6dc29ae7",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Airfares are surging again after a months-long slump as carriers trim flights to ease a capacity glut",
    "url": "https://fortune.com/2025/08/16/airfares-cheap-plane-tickets-flight-capacity-cuts-travel-demand/",
    "summary": "The latest consumer price index report showed airfares jumped 4% in July from June, marking the first monthly increase since January.",
    "fullContent": "The latest consumer price index report showed airfares jumped 4% in July from June, marking the first monthly increase since January.",
    "publishedAt": "2025-08-16T19:28:53.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6dc29ae7"
  },
  {
    "id": "ndtv-profit-youtube-4da24989",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump-Putin Alaska Summit Ends in Spectacle | Zelenskyy Heads to White House",
    "url": "https://www.youtube.com/watch?v=0XtcgtYCyp4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:25:48.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4da24989"
  },
  {
    "id": "techmeme-5adbbf82",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "GPT-5's underwhelming performance on benchmarks suggests that the current approach of scaling LLMs is starting to reach the limits of available resources (Financial Times)",
    "url": "http://www.techmeme.com/250816/p15#a250816p15",
    "summary": "Financial Times: GPT-5's underwhelming performance on benchmarks suggests that the current approach of scaling LLMs is starting to reach the limits of available resources — OpenAI's underwhelming new GPT-5 model suggests progress is slowing — and competition in the space is...",
    "fullContent": "Financial Times: GPT-5's underwhelming performance on benchmarks suggests that the current approach of scaling LLMs is starting to reach the limits of available resources — OpenAI's underwhelming new GPT-5 model suggests progress is slowing — and competition in the space is changing",
    "publishedAt": "2025-08-16T19:25:01.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5adbbf82"
  },
  {
    "id": "bloomberg-politics-51b768e4",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "West Virginia, Ohio Guard to Join Trump’s DC Crime Crackdown",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/west-virginia-guard-to-join-trump-s-crackdown-on-crime-in-dc",
    "summary": "West Virginia, South Carolina and Ohio are sending several hundred National Guard troops to Washington to bolster the federal deployment that President Donald Trump has ordered in his effort to reduce crime in the nation’s capital.",
    "fullContent": "West Virginia, South Carolina and Ohio are sending several hundred National Guard troops to Washington to bolster the federal deployment that President Donald Trump has ordered in his effort to reduce crime in the nation’s capital.",
    "publishedAt": "2025-08-16T19:22:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.475Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "51b768e4"
  },
  {
    "id": "zerohedge-3f758132",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Trump Says Xi Assured Him China Will Not Invade Taiwan During His Presidency",
    "url": "https://www.zerohedge.com/geopolitical/trump-says-xi-assured-him-china-will-not-invade-taiwan-during-his-presidency",
    "summary": "Trump Says Xi Assured Him China Will Not Invade Taiwan During His Presidency Authored by Travis Gillmore via The Epoch Times, President Donald Trump said Chinese leader Xi Jinping promised him that China will refrain from invading Taiwan for the next four years.",
    "fullContent": "Trump Says Xi Assured Him China Will Not Invade Taiwan During His Presidency Authored by Travis Gillmore via The Epoch Times, President Donald Trump said Chinese leader Xi Jinping promised him that China will refrain from invading Taiwan for the next four years. Trump made the remarks during a nearly 30-minute-long interview with Fox News’ Brett Baier which was filmed on Air Force One and aired while the president was in Alaska meeting with Russian President Vladimir Putin. “I will never do it as long as you’re president; President Xi told me that, and I said, well, I appreciate that,” Trump said. The guarantee does not extend to future administrations, the president noted. “But he also said, but I am very patient, and China is very patient,” Trump said. “Say, well, that’s up to you, but it better not happen now.” It remains unclear when Xi made the remarks. The White House did not respond to requests for comment before publication. Taiwan, a self-governing democratic island territory, is viewed by Beijing as a breakaway province. Its freedom remains a volatile point of contention in U.S.-China relations. The United States guarantees defensive arms to Taipei under the Taiwan Relations Act. Xi has vowed to achieve “reunification” with the island by any means necessary, and he’s ramped up military exercises in the waters around the island. Optimism that the president’s foreign policy agenda will deter China’s aggression is a recurring theme in the administration’s first 200 days. Treasury Secretary Scott Bessent told CNBC host Andrew Ross Sorkin in March that China will stay out of Taiwan. “I follow President Trump’s lead, and he is confident that President Xi will not make that move during his presidency,” Bessent said. U.S. Defense Secretary Pete Hegseth publicly declared at the Shangri-La Dialogue—an annual summit held in Singapore by the International Institute for Strategic Studies—in May that China is signaling a desire to be capable of attacking the island nation by 2027, with a buildup in nuclear weapons and military readiness. “Every day you see it. China’s military harasses Taiwan,” Hegseth said. “It has to be clear to all that Beijing is credibly preparing to potentially use military force to alter the balance of power in the Indo-Pacific.” He expressed confidence that the communist regime will wait until the current administration leaves office, but warned of the threat the Chinese Communist Party poses to world peace. “Again, to be clear: any attempt by communist China to conquer Taiwan by force would result in devastating consequences for the Indo-Pacific and the world,” Hegseth said. “There’s no reason to sugarcoat it. The threat China poses is real.” Tyler Durden Sat, 08/16/2025 - 15:10",
    "publishedAt": "2025-08-16T19:10:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3f758132"
  },
  {
    "id": "ndtv-profit-youtube-2a1d7851",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Meet | F-35 Jets Escort Putin’s ‘Flying Kremlin’ From Alaska After Trump Meeting",
    "url": "https://www.youtube.com/watch?v=eBLWi626koc",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:03:32.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2a1d7851"
  },
  {
    "id": "cnbc-markets-4ad89744",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Zelenskyy to meet with Trump after Putin talks end without a ceasefire",
    "url": "https://www.cnbc.com/2025/08/16/trump-putin-russia-ukraine-zelensky-.html",
    "summary": "Zelenskyy said he and Trump would meet Monday to \"discuss all of the details regarding ending the killing and the war.\"",
    "fullContent": "Zelenskyy said he and Trump would meet Monday to \"discuss all of the details regarding ending the killing and the war.\"",
    "publishedAt": "2025-08-16T19:02:47.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ad89744"
  },
  {
    "id": "marketwatch-a2bf88d",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "3 ways to make sure the &#x2018;great wealth transfer&#x2019; enriches your family",
    "url": "https://www.marketwatch.com/story/how-to-break-the-cycle-of-entitlement-so-your-heirs-value-their-privilege-and-your-money-2c8cd8ab?mod=mw_rss_topstories",
    "summary": "From &#x2018;affluenza&#x2019; to abundance: How to teach heirs to value their privilege &#x2014; and your money.",
    "fullContent": "From &#x2018;affluenza&#x2019; to abundance: How to teach heirs to value their privilege &#x2014; and your money",
    "publishedAt": "2025-08-16T19:02:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a2bf88d"
  },
  {
    "id": "yahoo-finance-6bfe19a9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Kevin O'Leary Says New Executives Get No Stock Options, No Benefits, And No Full-Time Title Until They Prove Themselves, Just Like The Swiss",
    "url": "https://finance.yahoo.com/news/kevin-oleary-says-executives-no-190126811.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:01:26.000Z",
    "fetchedAt": "2025-08-18T06:57:17.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6bfe19a9"
  },
  {
    "id": "oil-price-167ec5d6",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Trump Moves to Open 82% of Alaska’s Petroleum Reserve for Drilling",
    "url": "https://oilprice.com/Energy/Energy-General/Trump-Moves-to-Open-82-of-Alaskas-Petroleum-Reserve-for-Drilling.html",
    "summary": "Since coming into office, United States President Donald Trump has doubled down on his “Drill, baby, drill” statement by opening federal land for licensing and encouraging oil and gas companies to increase production.",
    "fullContent": "Since coming into office, United States President Donald Trump has doubled down on his “Drill, baby, drill” statement by opening federal land for licensing and encouraging oil and gas companies to increase production. One state Trump has set his sights on is Alaska, an area where oil operations have become increasingly more controversial in recent years due to concerns over environmental degradation. President Trump hopes to double the quantity of crude moving through Alaska’s pipelines, as well as construct a giant gas project,…",
    "publishedAt": "2025-08-16T19:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.066Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "167ec5d6"
  },
  {
    "id": "yahoo-finance-690a7032",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "4 Words From Palantir CEO Alex Karp That BigBear.ai Investors Can't Ignore",
    "url": "https://finance.yahoo.com/news/4-words-palantir-ceo-alex-190000586.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:00:00.000Z",
    "fetchedAt": "2025-08-18T04:52:20.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "690a7032"
  },
  {
    "id": "yahoo-finance-66c4e88e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Aecom (ACM) Is A Top Stock For US Manufacturing Reshoring, Says Jim Cramer",
    "url": "https://finance.yahoo.com/news/aecom-acm-top-stock-us-185908959.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T18:59:08.000Z",
    "fetchedAt": "2025-08-18T02:33:32.408Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "66c4e88e"
  },
  {
    "id": "marginal-revolution-4e0dd315",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "Scott Sumner is still the greatest movie critic in the world",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/scott-sumner-is-still-the-greatest-movie-critic-in-the-world.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=scott-sumner-is-still-the-greatest-movie-critic-in-the-world",
    "summary": "Here is the intro: Over time, I’ve noticed that an unusual number of important films came out in the late 1950s and early 1960s. In this post, I’ll argue that the period from 1958 to 1963 is the artistic peak of filmmaking. So what is the evidence for this claim?",
    "fullContent": "Here is the intro: Over time, I’ve noticed that an unusual number of important films came out in the late 1950s and early 1960s. In this post, I’ll argue that the period from 1958 to 1963 is the artistic peak of filmmaking. So what is the evidence for this claim? I certainly won’t argue that [&#8230;] The post Scott Sumner is still the greatest movie critic in the world appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-16T18:55:08.000Z",
    "fetchedAt": "2025-08-17T02:34:43.409Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e0dd315"
  },
  {
    "id": "cnbc-markets-156e3b2e",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump warned by top Senate Democrats to rethink advanced AI chip sales to China",
    "url": "https://www.cnbc.com/2025/08/16/senate-democrats-letter-trump-advanced-ai-chip-sales-china.html",
    "summary": "On Aug. 15, top Senate Democrats warned Trump about AI chip deal with China in an open letter.",
    "fullContent": "On Aug. 15, top Senate Democrats warned Trump about AI chip deal with China in an open letter",
    "publishedAt": "2025-08-16T18:39:59.000Z",
    "fetchedAt": "2025-08-17T02:34:42.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "156e3b2e"
  },
  {
    "id": "zerohedge-18fa5fa5",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Here's Where ChatGPT Is Currently Banned",
    "url": "https://www.zerohedge.com/ai/heres-where-chatgpt-currently-banned",
    "summary": "Here's Where ChatGPT Is Currently Banned Governments around the world are taking different stances on artificial intelligence tools like ChatGPT. While some embrace the technology, others have restricted or outright banned access due to political, cultural, or security concerns.",
    "fullContent": "Here's Where ChatGPT Is Currently Banned Governments around the world are taking different stances on artificial intelligence tools like ChatGPT. While some embrace the technology, others have restricted or outright banned access due to political, cultural, or security concerns. In 2025, ChatGPT remains unavailable in 20 countries. In this visualization, Visual Capitalist's Marcus Lu highlights where ChatGPT is banned, as well as places where OpenAI does not offer service. Data & Discussion The data for this visualization comes from a list compiled by Cybernews, which we referenced with an official OpenAI list of supported countries. Government-Imposed Bans Many of the bans are found in countries with strict internet control, such as China, North Korea, and Iran. These governments limit access to foreign digital platforms, often citing information control and political stability as reasons. In China, for example, users have access to several LLMs that were developed by domestic companies, including Alibaba’s Qwen, DeepSeek, Baichuan, and Tencent-backed Hunyuan. Meanwhile, in conflict zones like Syria, Afghanistan, and Yemen, bans are linked to both security concerns and limited infrastructure. Unsupported Regions Not all countries on the list have active bans. In places like Hong Kong and Belarus, the service is unavailable because OpenAI does not support accounts there. These exclusions are often due to business, regulatory, or legal complexities rather than explicit censorship. If you enjoyed today’s post, check out the AI “Big Bang” Study 2025 on Voronoi, the new app from Visual Capitalist. Tyler Durden Sat, 08/16/2025 - 14:35",
    "publishedAt": "2025-08-16T18:35:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18fa5fa5"
  },
  {
    "id": "marketwatch-334e712f",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x200b;Trump has perfected a tax on corporate America &#x2014; just don&#x2019;t call it a tax. Here&#x2019;s how it could affect stocks.",
    "url": "https://www.marketwatch.com/story/trumps-nvidia-deal-opens-a-pay-to-play-toll-road-to-do-business-in-america-investors-will-feel-every-bump-5601f2f7?mod=mw_rss_topstories",
    "summary": "The art of the steal: Trump&#x2019;s Nvidia deal opens a &#x2018;pay to play&#x2019; floodgate to do business. If you can&#x2019;t afford the toll, don&#x2019;t approach the booth.",
    "fullContent": "The art of the steal: Trump&#x2019;s Nvidia deal opens a &#x2018;pay to play&#x2019; floodgate to do business. If you can&#x2019;t afford the toll, don&#x2019;t approach the booth.",
    "publishedAt": "2025-08-16T18:34:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "334e712f"
  },
  {
    "id": "marketwatch-3cd3a37c",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Most boomers and Gen X-ers are terrified about running out of money in retirement &#x2014; even if they&#x2019;re already retired",
    "url": "https://www.marketwatch.com/story/most-boomers-and-gen-x-ers-are-terrified-about-running-out-of-money-in-retirement-even-if-theyre-already-retired-43d52ed0?mod=mw_rss_topstories",
    "summary": "Anxiety has been peaking for people in and approaching retirement &#x2014; how to manage it.",
    "fullContent": "Anxiety has been peaking for people in and approaching retirement &#x2014; how to manage it",
    "publishedAt": "2025-08-16T18:22:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3cd3a37c"
  },
  {
    "id": "wsj-world-news-2713c23b",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Trump Tells Europeans He Is Open to U.S. Security Guarantees in Ukraine",
    "url": "https://www.wsj.com/world/europe/trump-tells-europeans-he-is-open-to-u-s-security-guarantees-in-ukraine-347892f6",
    "summary": "Trump said that Putin accepted that any peace would need to include the presence of Western troops in Ukraine as a way of ensuring its durability.",
    "fullContent": "Trump said that Putin accepted that any peace would need to include the presence of Western troops in Ukraine as a way of ensuring its durability.",
    "publishedAt": "2025-08-16T18:09:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.967Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "2713c23b"
  }
]