[
  {
    "id": "ndtv-profit-youtube-7d462f83",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Reporter Asks About Civilian Killings, Watch How Putin Reacts",
    "url": "https://www.youtube.com/shorts/EIIB1T5i4ks",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T21:30:25.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7d462f83"
  },
  {
    "id": "nyt-business-59e6daf8",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Air Canada’s Flight Attendants Reject Call for Arbitration",
    "url": "https://www.nytimes.com/2025/08/15/world/canada/air-canada-flight-attendant-strike.html",
    "summary": "Their union says one of its core demands, to receive pay for groundwork, is unlikely to be introduced in arbitration. The airline began canceling flights ahead of the potential strike.",
    "fullContent": "Their union says one of its core demands, to receive pay for groundwork, is unlikely to be introduced in arbitration. The airline began canceling flights ahead of the potential strike.",
    "publishedAt": "2025-08-15T21:26:41.000Z",
    "fetchedAt": "2025-08-16T02:22:47.574Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "59e6daf8"
  },
  {
    "id": "techmeme-55c16774",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: Meta plans its fourth AI restructuring in six months, dividing its superintelligence lab into TBD Lab, a product team, an infrastructure team, and FAIR (Kalley Huang/The Information)",
    "url": "http://www.techmeme.com/250815/p19#a250815p19",
    "summary": "Kalley Huang / The Information: Sources: Meta plans its fourth AI restructuring in six months, dividing its superintelligence lab into TBD Lab, a product team, an infrastructure team, and FAIR — Meta Platforms is planning the fourth restructuring of its artificial intelligence...",
    "fullContent": "Kalley Huang / The Information: Sources: Meta plans its fourth AI restructuring in six months, dividing its superintelligence lab into TBD Lab, a product team, an infrastructure team, and FAIR — Meta Platforms is planning the fourth restructuring of its artificial intelligence efforts in six months, according to three people familiar with the matter.",
    "publishedAt": "2025-08-15T21:25:02.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "55c16774"
  },
  {
    "id": "marketwatch-3eb2111",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x2018;I&#x2019;ve been kept in poverty&#x2019;: Do I take a $70K job at 74 and lose my Section 8 housing allowance?",
    "url": "https://www.marketwatch.com/story/should-i-apply-for-a-70k-a-year-job-at-74-and-risk-losing-my-section-8-housing-allowance-9932217d?mod=mw_rss_topstories",
    "summary": "&#x201c;After the age of 50, I really only had sporadic contract work and I had to sell my house.&#x201d;",
    "fullContent": "&#x201c;After the age of 50, I really only had sporadic contract work and I had to sell my house.&#x201d;",
    "publishedAt": "2025-08-15T21:22:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3eb2111"
  },
  {
    "id": "marketwatch-55060b1e",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "This is how important Taylor Swift&#x2019;s &#x2018;The Life of a Showgirl&#x2019; is to an entire industry",
    "url": "https://www.marketwatch.com/story/this-is-how-important-taylor-swifts-the-life-of-a-showgirl-is-to-an-entire-industry-f5689ef3?mod=mw_rss_topstories",
    "summary": "Also: Bargain stocks, Warren Buffett&#x2019;s bottom-fishing with UnitedHealth and how you can grab a real-estate commission.",
    "fullContent": "Also: Bargain stocks, Warren Buffett&#x2019;s bottom-fishing with UnitedHealth and how you can grab a real-estate commission.",
    "publishedAt": "2025-08-15T21:22:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "55060b1e"
  },
  {
    "id": "wsj-opinion-fe283f8",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Notable & Quotable: Trump&#x2019;s Nobel Peace Prize",
    "url": "https://www.wsj.com/opinion/notable-quotable-trumps-nobel-peace-prize-norway-6bc8506c",
    "summary": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "fullContent": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "publishedAt": "2025-08-15T21:16:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "fe283f8"
  },
  {
    "id": "wsj-world-news-597a941a",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Notable & Quotable: Trump&#x2019;s Nobel Peace Prize",
    "url": "https://www.wsj.com/opinion/notable-quotable-trumps-nobel-peace-prize-norway-6bc8506c",
    "summary": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "fullContent": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "publishedAt": "2025-08-15T21:16:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "597a941a"
  },
  {
    "id": "ndtv-profit-youtube-7ff99494",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Putin Trump Meet | What To Expect From Trump-Putin Meeting?: Experts Decode",
    "url": "https://www.youtube.com/watch?v=6GrY2cSE6pI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T21:11:16.000Z",
    "fetchedAt": "2025-08-16T02:22:56.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7ff99494"
  },
  {
    "id": "marketwatch-46d8332c",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "In this economy, here&#x2019;s what it takes to get people to spend on summer fun",
    "url": "https://www.marketwatch.com/story/americans-who-make-over-100-000-are-still-propping-up-the-economy-but-how-long-can-they-keep-doing-it-b9535f3e?mod=mw_rss_topstories",
    "summary": "In an uncertain economic environment, at least one thing is clear: Six-figure earners are still spending money..",
    "fullContent": "In an uncertain economic environment, at least one thing is clear: Six-figure earners are still spending money..",
    "publishedAt": "2025-08-15T21:09:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "46d8332c"
  },
  {
    "id": "bloomberg-business-youtube-70fee507",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Stocks Slide as Trump Meets Putin | Closing Bell",
    "url": "https://www.youtube.com/watch?v=b-u5W7-CSaY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T21:04:51.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "70fee507"
  },
  {
    "id": "zerohedge-4c623836",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "MAHA Advocates Urge Trump To Block Immunity For Pesticide And Chemical Manufacturers",
    "url": "https://www.zerohedge.com/markets/maha-advocates-urge-trump-block-immunity-pesticide-and-chemical-manufacturers",
    "summary": "MAHA Advocates Urge Trump To Block Immunity For Pesticide And Chemical Manufacturers Authored by Jeff Louderbeck via The Epoch Times, As anticipation builds about the upcoming Make America Healthy Again (MAHA) Commission Report’s release, 241 MAHA advocates sent a letter to...",
    "fullContent": "MAHA Advocates Urge Trump To Block Immunity For Pesticide And Chemical Manufacturers Authored by Jeff Louderbeck via The Epoch Times, As anticipation builds about the upcoming Make America Healthy Again (MAHA) Commission Report’s release, 241 MAHA advocates sent a letter to President Donald Trump urging him to prevent the House of Representatives from limiting regulation for pesticides and “forever chemicals” in its environmental appropriations bill. “We ask you to take action to make sure any protections for pesticides are stricken from this Appropriations bill,” the letter says, or risk losing Republican backing. The letter also expressed opposition to liability shields for pesticide companies. Every year, more than 1.1 billion pounds of pesticides are used on U.S. farmland, including dozens of chemicals banned in other developed nations, the letter states. “These toxic substances are present in our food, air, soil, and water, and are increasingly in our children’s bodies, negatively impacting normal brain development and hormonal function,” the letter explains. “Extensive peer-reviewed research has linked glyphosate to infertility, increased reproductive risks, and 6 of the top 10 most common cancers in the [United States]. At the same time, atrazine is a known endocrine disruptor affecting sexual development, and paraquat has been linked to Parkinson’s and neurological and respiratory diseases.” Signers of the letter highlighted provisions in the Fiscal Year 2026 House Interior and Environment Appropriations Bill—Sections 453 and 507 —which they claim create broad product-liability protections for domestic and foreign pesticide and chemical manufacturers “by refusing to fund the critical, legally required scientific safety assessments needed to update labels across more than 57,000 synthetic chemicals.” “Numerous pesticides that fall under Section 453 are chemicals that are already banned in multiple other developed nations. Despite a massive outcry from citizens, the House Appropriations committee passed the spending bill last month with Section 453 and Section 507 intact,” the letter states. MAHA advocates also expressed concern about Section 507 because “it prohibits the EPA from finalizing risk assessments for PFOA and PFOS forever chemicals found in biosolids spread on farmer’s fields and eliminates funding for community health monitoring, new research, and the cleanup of more than 70 million acres of U.S. 2 farmland contaminated with PFAS from the application of biosolids.” “Mr. President, creating broad liability protections for pesticides is a losing issue for your party and your coalition, and may well cost you the House majority in the midterms,” the letter said. MAHA Action CEO Tony Lyons said in a July 24 X post that stopping Section 453 should be MAHA’s top priority right now. “There couldn’t be anything that is more important to MAHA than making sure that we don’t have pesticide liability protection for big corporations,” Lyons wrote. “Nobody should want their children to be exposed to them. Nobody should wanna be exposed to them themselves. What’s happening now looks a lot like what happened in 1986 with the vaccine liability protection for these big companies.” The letter stated that some Republicans “talk MAHA” on camera while silently advancing policies that undercut the movement. “Republicans must do more than ride the wave of MAHA’s high polling,” David Murphy, founder of United We Eat, a major fundraiser for Robert F. Kennedy Jr.’s presidential campaign, said in a press release. “President Trump must stand firm and follow through with real policy that protects American health, including opposing chemical liability shields and the Eats Act that put our children at risk and trample Americans’ constitutional right to sue,” Murphy added. The letter pointed to a 2024 poll of Iowa Republicans by Accountable Iowa that found efforts to pass cancer lawsuit liability bills “could significantly cost Republicans in state and federal elections in 2026.” The proposed legislation was not passed in Iowa. According to the poll, 87 percent of registered Republicans oppose giving chemical companies like Bayer-Monsanto immunity from lawsuits, while 94 percent agreed it is “very concerning” that the EPA relies on industry-funded data to administer safety studies. “If Republicans want to retain MAHA support long-term, they need to stop siding with agrochemical companies and take leadership on these issues,” Charles Eisenstein, who served as Kennedy’s chief speechwriter during the Health and Human Services Secretary’s presidential campaign, said. The Make America Healthy Again (MAHA) Commission “is on track to submit its Make Our Children Healthy Again Strategy report to the President on August 12th,” Kush Desai, a spokesman for the White House, told The Epoch Times in an email on Aug. 11. “The report will be unveiled to the public shortly thereafter as we coordinate the schedules of the President and the various cabinet members who are a part of the commission.” The MAHA Commission’s first report was released in May. It mostly details issues related to the health of Americans and attributes the rise of chronic diseases among children to a diet focused on ultraprocessed foods, exposure to chemicals, a lack of physical activity, and the over-prescription of medications. When Trump established the commission not long after beginning his second term, the panel was tasked to submit its first report to the president within 100 days and present him with a strategy on how to address chronic diseases, including obesity, within 180 days. That deadline was Aug. 12. The White House has not commented on the MAHA advocates’ letter as of this article’s publication time. Tyler Durden Fri, 08/15/2025 - 17:00",
    "publishedAt": "2025-08-15T21:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.089Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c623836"
  },
  {
    "id": "oil-price-698a2997",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Insurers Urged to Reassess Russian Oil Exposure",
    "url": "https://oilprice.com/Energy/Energy-General/Insurers-Urged-to-Reassess-Russian-Oil-Exposure.html",
    "summary": "An insurance association has urged its members to assess their exposure to Russian oil as the UK and EU prepare to update their oil price cap regimes. The oil price cap, introduced by the G7, EU, and Australia, aims to restrict Russia’s oil revenues by preventing Russian...",
    "fullContent": "An insurance association has urged its members to assess their exposure to Russian oil as the UK and EU prepare to update their oil price cap regimes. The oil price cap, introduced by the G7, EU, and Australia, aims to restrict Russia’s oil revenues by preventing Russian companies from selling oil above a specified threshold. In July, the UK and EU announced plans to lower the price cap to further limit Russia’s ability to fund its war in Ukraine. The new measures take effect on 2 September in the UK and 3 September in the EU. However,…",
    "publishedAt": "2025-08-15T21:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.543Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "698a2997"
  },
  {
    "id": "cnbc-markets-673fe134",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Student loan forgiveness program has a 72,730-person backlog. Here's what borrowers need to know",
    "url": "https://www.cnbc.com/2025/08/15/public-service-loan-forgiveness-buyback-has-a-72730-person-backlog.html",
    "summary": "Many student loan borrowers have likely heard about or experienced issues with the Public Service Loan Forgivness 'Buyback' program. Here's what to know.",
    "fullContent": "Many student loan borrowers have likely heard about or experienced issues with the Public Service Loan Forgivness 'Buyback' program. Here's what to know.",
    "publishedAt": "2025-08-15T20:59:33.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "673fe134"
  },
  {
    "id": "cnbc-markets-3066d8cf",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "46-year-old woman is weeks away from student loan forgiveness but stuck in Trump-era backlog",
    "url": "https://www.cnbc.com/2025/08/15/student-loan-forgiveness-trump-pslf-backlog.html",
    "summary": "Tens of thousands of student loan borrowers who are likely eligible for Public Service Loan Forgiveness are stuck in limbo. CNBC spoke to three of them.",
    "fullContent": "Tens of thousands of student loan borrowers who are likely eligible for Public Service Loan Forgiveness are stuck in limbo. CNBC spoke to three of them.",
    "publishedAt": "2025-08-15T20:59:05.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3066d8cf"
  },
  {
    "id": "wsj-markets-main-12568ec8",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Dow Industrials Hit First Intraday High of 2025, Powered by UnitedHealth Shares",
    "url": "https://www.wsj.com/finance/stocks/dow-industrials-hit-first-intraday-high-of-2025-powered-by-unitedhealth-shares-43af6339?mod=rss_markets_main",
    "summary": "A vote of confidence by Warren Buffett&#x2019;s Berkshire Hathaway delivered the Dow laggard its best day since 2020.",
    "fullContent": "A vote of confidence by Warren Buffett&#x2019;s Berkshire Hathaway delivered the Dow laggard its best day since 2020.",
    "publishedAt": "2025-08-15T20:57:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.037Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "12568ec8"
  },
  {
    "id": "techmeme-4c573027",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Some developers say GPT-5 excels at technical reasoning and planning coding tasks and is cost-effective, but Claude Opus and Sonnet still produce better code (Lauren Goode/Wired)",
    "url": "http://www.techmeme.com/250815/p18#a250815p18",
    "summary": "Lauren Goode / Wired: Some developers say GPT-5 excels at technical reasoning and planning coding tasks and is cost-effective, but Claude Opus and Sonnet still produce better code — Software engineers are finding that OpenAI's new GPT-5 model is helping them think through...",
    "fullContent": "Lauren Goode / Wired: Some developers say GPT-5 excels at technical reasoning and planning coding tasks and is cost-effective, but Claude Opus and Sonnet still produce better code — Software engineers are finding that OpenAI's new GPT-5 model is helping them think through coding problems—but isn't much better at actual coding.",
    "publishedAt": "2025-08-15T20:55:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4c573027"
  },
  {
    "id": "bloomberg-markets-35bb33b2",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Stocks Slide as Trump Meets Putin | Closing Bell",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/stocks-slide-as-trump-meets-putin-closing-bell-video",
    "summary": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Scarlet Fu, Vonnie Quinn, Carol Massar and Emily Graffeo. (Source: Bloomberg)",
    "fullContent": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Scarlet Fu, Vonnie Quinn, Carol Massar and Emily Graffeo. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:52:54.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "35bb33b2"
  },
  {
    "id": "cnbc-markets-6191a611",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "FBI Director Patel and foundation win defamation lawsuit against blogger, awarded $250,000",
    "url": "https://www.cnbc.com/2025/08/15/fbi-kash-patel-lawsuit-stewartson.html",
    "summary": "Blogger Jim Stewartson accused Kash Patel of being a \"Kremlin asset,\" of trying to overthrow the U.S. government, and of planning the Jan. 6, 2021, attack.",
    "fullContent": "Blogger Jim Stewartson accused Kash Patel of being a \"Kremlin asset,\" of trying to overthrow the U.S. government, and of planning the Jan. 6, 2021, attack.",
    "publishedAt": "2025-08-15T20:49:04.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6191a611"
  },
  {
    "id": "bloomberg-business-youtube-319d684d",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump, Putin Arrive for Alaska Summit | Bloomberg Businessweek Daily 8/15/2025",
    "url": "https://www.youtube.com/watch?v=vgR1-RnY0tw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:47:23.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "319d684d"
  },
  {
    "id": "cnbc-markets-2ec59af9",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Opendoor CEO resigns following investor pressure campaign",
    "url": "https://www.cnbc.com/2025/08/15/opendoor-stock-ceo-resignation.html",
    "summary": "Opendoor CEO Carrie Wheeler said on Friday that she's resigning following \"weeks of intense outside interest\" in the online real estate company.",
    "fullContent": "Opendoor CEO Carrie Wheeler said on Friday that she's resigning following \"weeks of intense outside interest\" in the online real estate company.",
    "publishedAt": "2025-08-15T20:45:24.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2ec59af9"
  },
  {
    "id": "nautilus-magazine-6d9b95cc",
    "sourceId": "nautilus-magazine",
    "sourceName": "Nautilus Magazine",
    "title": "Making Backpacks for Tiny Fish",
    "url": "https://nautil.us/making-backpacks-for-tiny-fish-1231478/",
    "summary": "A new generation of petite, submersible tracking tags offers a fresh look at the lives of little fishes The post Making Backpacks for Tiny Fish appeared first on Nautilus.",
    "fullContent": "A new generation of petite, submersible tracking tags offers a fresh look at the lives of little fishes The post Making Backpacks for Tiny Fish appeared first on Nautilus.",
    "publishedAt": "2025-08-15T20:43:56.000Z",
    "fetchedAt": "2025-08-16T02:25:52.987Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "6d9b95cc"
  },
  {
    "id": "wsj-youtube-16a9adc",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Ukrainian Community in New York Demands Peace as Trump, Putin Meet | WSJ News",
    "url": "https://www.youtube.com/watch?v=bevZ3c6Lhps",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:43:31.000Z",
    "fetchedAt": "2025-08-16T02:23:18.577Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "16a9adc"
  },
  {
    "id": "bloomberg-markets-1c00a516",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Wall Street Wrestles With Hedging Conundrum as Valuations Swell",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/wall-street-wrestles-with-hedging-conundrum-as-valuations-swell",
    "summary": "Nathan Thooft is no market bear. His team at Manulife Investment Management, which oversees $160 billion, still holds a modest overweight in stocks. But as US markets jump from record to record, he’s been trimming big winners, buying bonds and adding a layer of protection with...",
    "fullContent": "Nathan Thooft is no market bear. His team at Manulife Investment Management, which oversees $160 billion, still holds a modest overweight in stocks. But as US markets jump from record to record, he’s been trimming big winners, buying bonds and adding a layer of protection with longer-dated options.",
    "publishedAt": "2025-08-15T20:41:34.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1c00a516"
  },
  {
    "id": "bloomberg-markets-22d1087b",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Pandora CEO on Tariff Impact, European Market, Lab Grown Diamonds, Prices",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/pandora-ceo-on-tariff-impact-european-market-diamonds-video",
    "summary": "Danish jewelry company Pandora CEO Alexander Lacik discusses the impact of the tariffs imposed by President Trump. He speaks with Scarlet Fu on \"The Close\" about the European market, price increases, lab grown diamonds and the option of moving manufacturing to the US.",
    "fullContent": "Danish jewelry company Pandora CEO Alexander Lacik discusses the impact of the tariffs imposed by President Trump. He speaks with Scarlet Fu on \"The Close\" about the European market, price increases, lab grown diamonds and the option of moving manufacturing to the US. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:40:47.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "22d1087b"
  },
  {
    "id": "zerohedge-bf197b2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Power Bill Crisis Is Here To Stay \"For A Few Years\"",
    "url": "https://www.zerohedge.com/ai/power-bill-crisis-here-stay-few-years",
    "summary": "Power Bill Crisis Is Here To Stay \"For A Few Years\" To close out the week, we're getting a much clearer picture of the power bill crisis financially battering working-poor and middle-class households, as well as mom-and-pop businesses - and it's about to get a whole lot worse.",
    "fullContent": "Power Bill Crisis Is Here To Stay \"For A Few Years\" To close out the week, we're getting a much clearer picture of the power bill crisis financially battering working-poor and middle-class households, as well as mom-and-pop businesses - and it's about to get a whole lot worse. Monthly bills are set to spike even higher, and the political fallout could be brutal for Democrats who championed everything 'green' - retiring stable fossil fuel power generation in favor of unreliable wind and solar. This epic failure guarantees voters a monthly reminder of just how disastrous these policies have become across Maryland and New Jersey (soon, many other states) every time they open their power statement. On Thursday, Secretary of Energy Chris Wright joined conservative commentator Glenn Beck in a discussion about all things energy, especially the emerging power bill crisis that will soon become a national topic in the era of faltering green policies colliding with surging power demand from AI data centers. The takeaway from Beck and Wright's conversation is that the power bill crisis won't be solved this year and will only worsen. Here's the conversation: Beck: When should we see this actually starting to happen and how long before power prices come down? Wright: Oh, man. That is the big question that President Trump asked me that every single day, let's get oil prices down, let's get gas prices down, let's get electricity prices down. And it takes a while to build infrastructure. Fortunately quickly we can stop the closure of coal plants, but still have lots of lifetime left. We've already done that. That's why we don't have much worse blackouts already today. We do have new gas plants coming on this year, a lot more coming on next year. We'll have nuclear plants on later this term. We'll have a whole bunch of them under construction. But yet to turn the giant aircraft carrier that is the electricity grid, that's going to take a few years. But hopefully we can stop the huge rise in prices. We can build the capacity so the United States can keep our lead on artificial intelligence over China. We get behind China and they control AI, our national security is at risk. Beck: Yeah, I know. Wright: So the whole administration is seven days a week working on this effort. You will see dramatically fewer blackouts this summer than you would have had the election gone the other way. And I think we'll be in a little bit better situation next summer, somewhere in between there this winter. We're rapidly swimming the right way. I wish I could say power prices are going down twenty percent next year, but it's simply not possible to do that in twelve months. What I will tell you, President Trump is seven days a week doing everything he can towards that goal. .@SecretaryWright says President Trump asks him \"every single day\" when Americans will see lower energy bills: “I wish I could say power prices are going down 20% next year. But it’s simply not possible to do that in 12 months. But Trump is 7 days a week doing everything he can.” pic.twitter.com/BkYzvQoCHq — Glenn Beck (@glennbeck) August 14, 2025 To recap the week in all things power: The epicenter of America's power crisis appears to be on the PJM Interconnection grid, with the Mid-Atlantic area at ground zero. In Baltimore, Maryland, on Monday, a single substation outage pushed a grid serving a million people to the brink of collapse, with no spare capacity (thank the Democrats), as the local utility warned of widespread blackouts. The grid was ultimately fixed hours later, but the near collapse raised alarms at the local, state, and national levels over how fragile Maryland's grid has become after years of Democrats retiring fossil fuel power generation in favor of unstable solar and wind. \"Prepare Now\": Substation Failure Puts Baltimore At Risk Of \"Widespread\" Blackout https://t.co/pCbEvuXk7P — zerohedge (@zerohedge) August 11, 2025 Then by Tuesday, a new poll in Maryland showed that among the many things, if that's fisical crisis, taxes, illegal aliens, crime, and whatever else, as well as exploding power bills for millions, Maryland Governor Westley Watende Omari Moore, who is being positioned for the party's 2028 presidential run, experinced sliding poll numbers that have set the Democratic Party into a panic. Power Bill Crisis Sends Maryland Gov. Wes Moore's Approval Plummeting https://t.co/uQebt96XLa — zerohedge (@zerohedge) August 12, 2025 And later in the week, we identified that the power bill crisis had spread from Maryland to New Jersey. What state is next? Power-Bill Crisis Spreads From Maryland To New Jersey, May Doom Democrats As 'Green' Implodes https://t.co/yKULnafoT8 — zerohedge (@zerohedge) August 14, 2025 As well as citing a Goldman Sachs note about how America's power crisis is only getting started. Key chart from the report (read here). Ah yes, this. Mark our words. In one year, this will be the most popular chart on this site pic.twitter.com/h93gWXMoNL — zerohedge (@zerohedge) August 11, 2025 . . . Tyler Durden Fri, 08/15/2025 - 16:40",
    "publishedAt": "2025-08-15T20:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.090Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "bf197b2"
  },
  {
    "id": "bloomberg-markets-f5fcda3",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump Tempers Expectations for Putin Summit | Bloomberg Markets 8/15/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/bloomberg-markets-8-15-2025-video",
    "summary": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. SharpLink gaming CO-CEO Jospeh Chalom, Bloomberg's Joe Deaux, Yinqin Shen and Thomas Seal. (Source: Bloomberg)",
    "fullContent": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. SharpLink gaming CO-CEO Jospeh Chalom, Bloomberg's Joe Deaux, Yinqin Shen and Thomas Seal. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:37:29.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "f5fcda3"
  },
  {
    "id": "ndtv-profit-youtube-55a64413",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Donald Trump Receives Vladimir Putin In Alaska: Red Carpet, Smiles And Handshakes",
    "url": "https://www.youtube.com/watch?v=XbRHLKKNDqo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:35:38.000Z",
    "fetchedAt": "2025-08-16T02:22:56.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "55a64413"
  },
  {
    "id": "bloomberg-politics-5757790d",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump-Putin Summit Overwhelms Anchorage",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-15/trump-putin-summit-overwhelms-anchorage",
    "summary": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Today, White House correspondent Hadriana Lowenkron sets the scene for President Trump’s meeting with Russian leader Vladimir Putin. Sign up here and follow us at @bpolitics.",
    "fullContent": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Today, White House correspondent Hadriana Lowenkron sets the scene for President Trump’s meeting with Russian leader Vladimir Putin. Sign up here and follow us at @bpolitics. Email our editors here.",
    "publishedAt": "2025-08-15T20:30:38.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5757790d"
  },
  {
    "id": "bloomberg-politics-33c3cd09",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump-Putin Summit Began With Cozy Chat Alone in ‘The Beast’",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/trump-putin-summit-began-with-a-cosy-chat-alone-in-the-beast",
    "summary": "Donald Trump and Vladimir Putin’s summit in Alaska started with a very stage-managed opening — each leader descending from their respective airplanes, a visibly warm handshake on the tarmac. Pats on the arm. A military overfly.",
    "fullContent": "Donald Trump and Vladimir Putin’s summit in Alaska started with a very stage-managed opening — each leader descending from their respective airplanes, a visibly warm handshake on the tarmac. Pats on the arm. A military overfly.",
    "publishedAt": "2025-08-15T20:26:11.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "33c3cd09"
  },
  {
    "id": "bloomberg-business-youtube-1f0d33f8",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Debate Heats Up Over Fed's Next Move | Real Yield 8/15/2025",
    "url": "https://www.youtube.com/watch?v=51dNP878_q0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:23:52.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1f0d33f8"
  },
  {
    "id": "marginal-revolution-7617ecb3",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "&#8220;A bunch of economists&#8221;",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/a-bunch-of-economists.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-bunch-of-economists",
    "summary": "Here is the link. The post &#8220;A bunch of economists&#8221; appeared first on Marginal REVOLUTION.",
    "fullContent": "Here is the link. The post &#8220;A bunch of economists&#8221; appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-15T20:23:34.000Z",
    "fetchedAt": "2025-08-16T02:22:48.189Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "7617ecb3"
  },
  {
    "id": "cnbc-markets-319d49c6",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump meets Putin in Alaska for summit on Ukraine war",
    "url": "https://www.cnbc.com/2025/08/15/nothing-is-off-the-table-as-trump-and-putin-set-to-meet.html",
    "summary": "\"Trump wants to exhaust all options to have a peaceful end to war,\" the White House said in advance of his meeting with Vladimir Putin.",
    "fullContent": "\"Trump wants to exhaust all options to have a peaceful end to war,\" the White House said in advance of his meeting with Vladimir Putin.",
    "publishedAt": "2025-08-15T20:23:02.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "319d49c6"
  },
  {
    "id": "nyt-business-493c6048",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Frank Savage, 87, Business Leader Entangled in Enron Scandal, Is Dead",
    "url": "https://www.nytimes.com/2025/08/15/business/frank-savage-dead-at-87.html",
    "summary": "He was one of the relatively few Black Americans to reach the upper echelons of global finance. He was also a competitive sailor.",
    "fullContent": "He was one of the relatively few Black Americans to reach the upper echelons of global finance. He was also a competitive sailor.",
    "publishedAt": "2025-08-15T20:20:41.000Z",
    "fetchedAt": "2025-08-16T02:22:47.574Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "493c6048"
  },
  {
    "id": "bloomberg-markets-62e8694d",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Giuliano: Putin Winning 'War of Narratives'",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/giuliano-putin-winning-war-of-narratives-video",
    "summary": "Columbia University Senior Lecturer in Political Science Elise Giuliano previews the impending summit between President Donald Trump and Russian President Vladimir Putin in Alasaka, saying Putin has already achieved a victory just by having the summit without Ukraine.",
    "fullContent": "Columbia University Senior Lecturer in Political Science Elise Giuliano previews the impending summit between President Donald Trump and Russian President Vladimir Putin in Alasaka, saying Putin has already achieved a victory just by having the summit without Ukraine. Giuliano believes the US has leverage, and President Trump needs to exercise it as much as possible. She talks with Carol Massar and Emily Graffeo on Bloomberg's \"Businessweek Daily.\" (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:20:17.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62e8694d"
  },
  {
    "id": "zerohedge-3d8f3a96",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Stockman: America Don't Need No \"Independent\" Fed",
    "url": "https://www.zerohedge.com/political/stockman-america-dont-need-no-independent-fed",
    "summary": "Stockman: America Don't Need No \"Independent\" Fed Authored by David Stockman via InternationalMan.com, Talk about hiding in plain sight. Here is possibly the most important graph ever about the flagging state of the US economy and the utter failure of Washington’s constant...",
    "fullContent": "Stockman: America Don't Need No \"Independent\" Fed Authored by David Stockman via InternationalMan.com, Talk about hiding in plain sight. Here is possibly the most important graph ever about the flagging state of the US economy and the utter failure of Washington’s constant efforts during the last two decades to “stimulate” improved outcomes. To wit, the US industrial production index—which measures the sum of manufacturing, energy, mining, and utility output—marched straight uphill at a 3.3% annual rate between 1954 and 2007. Yet since then it has essentially plateaued, rising by just 0.10% per annum during the past 17 years. That’s right. The growth rate of America’s industrial foundation has plunged by 97% since the pre-crisis peak in Q4 2007. And yet June’s industrial production index, which was up a small tad, gets headlined as a sign of economic strength. In fact, the longer-term chart below screams the very opposite. After all, there is no logic that says an economy can remain healthy and prosperous that is increasingly based on educating a shrinking number of kids, feeding an expanding national waistline at fast food joints, and changing adult diapers among the soaring share of the population composed of octogenarians. At the end of the day, you actually have to make things in order for the population to pay for taking in each other’s laundry. As it has happened, however, during the 48 months since June 2021 the industrial production index has been negative or flat nearly half the time on a month-over-month basis. For all practical purposes, the US industrial economy is just playing “mother may I”, advancing one step forward and the next step backwards month after month. And if that’s “strong” or even a sign of anything except decaying performance, we’d suggest the English language has lost all meaning. As it happens, the disconnect becomes even more dramatic when you compare the production of goods since Q4 2007 with the constant dollar value of goods consumption (PCE) during the same period. That is to say, cumulative real consumption of goods (durable and non-durable) rose by 62% but domestic industrial output was up by only 1.4%! Obviously, the yawning gap got filled by imports. On the margin, therefore, the growth of goods consumption during the last 17 years was based on imports financed by massive current account deficits. Needless to say, the above disconnect was not due to a want of trying by means of Washington-based stimmies. The index lines for Federal Debt and the Fed’s balance sheet since 1954 show the opposite pattern to that embedded in the industrial index chart above. That is to say, growth was slow to moderate between 1954 and 2007, but then took off like a bat out of hell thereafter. Thus, between 1954 and 2007, US Treasury debt outstanding grew by 6.5% per annum, while the Fed’s balance sheet expanded by 5.6% per year. During the last 17 years, by contrast, the public debt rose by 10.7% per year, and the Fed’s balance sheet grew by 13.3% per year. To reprise, industrial production growth has essentially ground to a halt at 0.1% per year since 2007, notwithstanding a 13.3% per annum expansion of Fed credit. Self-evidently, all that high-powered central bank money was going somewhere, but clearly it was not into the production of goods on Main Street. There is no mystery, however, as to where it actually went. Since Q4 2007, the NASDAQ 100 index has risen by 86-fold. In turn, the net worth of the top 1% of US households has soared from $18.9 trillion to $49.4 trillion. Stated differently, industrial production went nowhere, even as the net worth of the top 1.35 million US households soared by nearly $31 trillion. And yet and yet. Bubble vision today was replete with Wall Street experts rebuking the Donald in the name of the Fed’s purportedly sacrosanct “independence” for his impending plan to fire Jay Powell. Then again, the Latin phrase “cui bono” immediately comes to mind. The answer to “who benefits” from the Fed’s so-called “independence” is surely not Main Street America. The fact is, the Fed is neither a democratically accountable arm of the state nor an agency of the free market. It was, is, and may always be a tool of the traders and gamblers who inhabit the canyons of Wall Street. To be sure, the Donald’s comprehension of monetary policy is about as wrong-headed as it gets, but his imminent frontal attack on the rogue institution domiciled in the Eccles Building may well be the only way to upend its destructive reign. * * * The data doesn’t lie—and neither do the consequences. As Washington’s debt-fueled “stimulus” regime enriches Wall Street while hollowing out Main Street, the illusion of prosperity continues to mask an industrial and monetary decay that cannot go on forever. The cracks are widening, and the next phase may bring seismic changes most Americans are unprepared for. That’s why we’ve put together a free special report: “Guide to Surviving and Thriving During an Economic Collapse.” If you want to understand what’s coming—and how to protect yourself, your assets, and your freedom—don’t wait until the crisis hits full force. Click here to claim your free copy now. You owe it to yourself to be informed—and ready. Tyler Durden Fri, 08/15/2025 - 16:20",
    "publishedAt": "2025-08-15T20:20:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.090Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3d8f3a96"
  },
  {
    "id": "ft-technology-5f83a1b0",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "Data of former UK ministers and Afghan refugees leaked after cyber attack",
    "url": "https://www.ft.com/content/d9b41de8-c287-4bd8-89cb-fa2d04905598",
    "summary": "Action against third-party contractor comes a month after revelations of breach related to resettlement scheme.",
    "fullContent": "Action against third-party contractor comes a month after revelations of breach related to resettlement scheme",
    "publishedAt": "2025-08-15T20:18:43.000Z",
    "fetchedAt": "2025-08-16T02:22:48.361Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5f83a1b0"
  },
  {
    "id": "business-insider-77b62861",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "A wedding therapist says you shouldn't get engaged if you haven't talked about these 5 things with your partner",
    "url": "https://www.businessinsider.com/conversations-to-have-with-partner-before-getting-engaged-wedding-therapist",
    "summary": "Some couples don't talk about money or kids until after they're engaged. A wedding therapist said delaying those conversations can be a mistake.",
    "fullContent": "Some couples don't talk about money or kids until after they're engaged. A wedding therapist said delaying those conversations can be a mistake.",
    "publishedAt": "2025-08-15T20:18:38.000Z",
    "fetchedAt": "2025-08-16T02:22:47.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "77b62861"
  },
  {
    "id": "bloomberg-markets-19506f02",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump, Putin Arrive for Alaska Summit | Bloomberg Businessweek Daily 8/15/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/bloomberg-businessweek-daily-8-15-2025-video",
    "summary": "On today's episode of Bloomberg Businessweek Daily, Carol Massar and Emily Graffeo discuss President Donald Trump and Russian President Vladimir Putin's arrival in Alaska for their highly anticipated summit, the first between the two leaders in seven years.",
    "fullContent": "On today's episode of Bloomberg Businessweek Daily, Carol Massar and Emily Graffeo discuss President Donald Trump and Russian President Vladimir Putin's arrival in Alaska for their highly anticipated summit, the first between the two leaders in seven years. Bloomberg's Annmarie Hordern joins to set the scene in Alaska, Columbia University Senior Lecturer in Political Science Elise Giuliano talks Trump and Putin's differing summit goals, and Telsey Advisory Group CEO Dana Telsey highlights the effects tariffs are having on Tapestry's profit outlook. Joe Mathieu joins the show to help preview the summit, as well as Bloomberg Senior Editor Derek Wallbank. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:13:32.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19506f02"
  },
  {
    "id": "techmeme-161abe64",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "CoreWeave investors sold more than $1B in shares as the IPO lockup ended; the stock held steady on Friday after dropping about 35% over the previous two days (Financial Times)",
    "url": "http://www.techmeme.com/250815/p17#a250815p17",
    "summary": "Financial Times: CoreWeave investors sold more than $1B in shares as the IPO lockup ended; the stock held steady on Friday after dropping about 35% over the previous two days — Director Jack Cogen offloads stake with an aggregate market value of about $300mn — Morgan Stanley,...",
    "fullContent": "Financial Times: CoreWeave investors sold more than $1B in shares as the IPO lockup ended; the stock held steady on Friday after dropping about 35% over the previous two days — Director Jack Cogen offloads stake with an aggregate market value of about $300mn — Morgan Stanley, JPMorgan Chase &hellip;",
    "publishedAt": "2025-08-15T20:10:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "161abe64"
  },
  {
    "id": "bloomberg-business-youtube-6f45853e",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump and Putin Travel Together in Solo Limo Ride",
    "url": "https://www.youtube.com/watch?v=Y3mkNvJZyMM",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:08:55.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6f45853e"
  },
  {
    "id": "cnbc-markets-71ccbdd1",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Government's Intel intervention is 'essential' for national security, tech analyst says",
    "url": "https://www.cnbc.com/2025/08/15/intel-trump-stake.html",
    "summary": "Luria said such a deal is needed to revive Intel and reduce the country's reliance on companies like Samsung and TSMC to manufacture chips.",
    "fullContent": "Luria said such a deal is needed to revive Intel and reduce the country's reliance on companies like Samsung and TSMC to manufacture chips.",
    "publishedAt": "2025-08-15T20:07:34.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "71ccbdd1"
  },
  {
    "id": "cnbc-markets-12c03c2d",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Applied Materials sinks 14% on weak guidance due to China demand",
    "url": "https://www.cnbc.com/2025/08/15/applied-materials-stock-china-demand-earnings.html",
    "summary": "Applied Materials cited weakness from leading edge customers and said China clients are easing spending after a period of rapid manufacturing.",
    "fullContent": "Applied Materials cited weakness from leading edge customers and said China clients are easing spending after a period of rapid manufacturing.",
    "publishedAt": "2025-08-15T20:01:10.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "12c03c2d"
  },
  {
    "id": "bloomberg-markets-432b07e2",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Foreign Holdings of Treasuries Climbed to a Record High in June",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/foreign-holdings-of-treasuries-climbed-to-a-record-high-in-june",
    "summary": "Foreign investor holdings of Treasuries climbed to a record high in June, showcasing sustained overseas demand for US government debt even as a slump in the dollar stoked concerns about sentiment toward American assets.",
    "fullContent": "Foreign investor holdings of Treasuries climbed to a record high in June, showcasing sustained overseas demand for US government debt even as a slump in the dollar stoked concerns about sentiment toward American assets.",
    "publishedAt": "2025-08-15T20:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "432b07e2"
  },
  {
    "id": "ndtv-profit-youtube-66afd86d",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Donald Trump Receives Vladimir Putin In Alaska: Red Carpet, Smiles And Handshakes",
    "url": "https://www.youtube.com/watch?v=hwaE98rvKjo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T19:59:33.000Z",
    "fetchedAt": "2025-08-16T02:22:56.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "66afd86d"
  },
  {
    "id": "wsj-opinion-6d7af940",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "How Russiagate Made Trump",
    "url": "https://www.wsj.com/opinion/how-russiagate-made-trump-politics-president-hoax-a255bf46",
    "summary": "The media might correct its false reporting, but that would mean recognizing its consequences.",
    "fullContent": "The media might correct its false reporting, but that would mean recognizing its consequences.",
    "publishedAt": "2025-08-15T19:56:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "6d7af940"
  },
  {
    "id": "wsj-world-news-6a531aa2",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | How Russiagate Made Trump",
    "url": "https://www.wsj.com/opinion/how-russiagate-made-trump-politics-president-hoax-a255bf46",
    "summary": "The media might correct its false reporting, but that would mean recognizing its consequences.",
    "fullContent": "The media might correct its false reporting, but that would mean recognizing its consequences.",
    "publishedAt": "2025-08-15T19:56:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "6a531aa2"
  },
  {
    "id": "fortune-21f526d4",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump&#8217;s Social Security tax cuts could hit future generations hard and propel the program&#8217;s insolvency by 2032, research warns",
    "url": "https://fortune.com/2025/08/15/social-security-tax-cuts-benefits-risks-future-insolvency-trump/",
    "summary": "Cutting federal taxes on Social Security benefits gives immediate relief to retirees—but experts warn it could trigger benefit cuts for future generations.",
    "fullContent": "Cutting federal taxes on Social Security benefits gives immediate relief to retirees—but experts warn it could trigger benefit cuts for future generations.",
    "publishedAt": "2025-08-15T19:55:15.000Z",
    "fetchedAt": "2025-08-16T02:22:49.894Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "21f526d4"
  },
  {
    "id": "business-insider-73aaef2d",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Elon Musk's DOGE threw government contracts into chaos. This startup is cashing in.",
    "url": "https://www.businessinsider.com/doge-boosted-legalist-government-contracts-receivables-loan-business-2025-8",
    "summary": "DOGE's slashing of the federal budget sent government contractors to gap financing startup Legalist, which has lent over $100 million this year alone.",
    "fullContent": "DOGE's slashing of the federal budget sent government contractors to gap financing startup Legalist, which has lent over $100 million this year alone.",
    "publishedAt": "2025-08-15T19:53:41.000Z",
    "fetchedAt": "2025-08-16T02:22:47.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "73aaef2d"
  },
  {
    "id": "nautilus-magazine-2f32756d",
    "sourceId": "nautilus-magazine",
    "sourceName": "Nautilus Magazine",
    "title": "A Beautiful Accident Etched in Crystal",
    "url": "https://nautil.us/a-beautiful-accident-etched-in-crystal-1231437/",
    "summary": "This microscopic garden was a miraculous failure The post A Beautiful Accident Etched in Crystal appeared first on Nautilus.",
    "fullContent": "This microscopic garden was a miraculous failure The post A Beautiful Accident Etched in Crystal appeared first on Nautilus.",
    "publishedAt": "2025-08-15T19:49:24.000Z",
    "fetchedAt": "2025-08-16T02:25:52.987Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "2f32756d"
  },
  {
    "id": "business-insider-a49c624",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "14 celebrities who moved to Texas on why it's the best place for them",
    "url": "https://www.businessinsider.com/celebrities-moved-to-texas-from-california-new-york-reasons-why-2024-8",
    "summary": "Famous people from Elon Musk to Glen Powell have moved to Texas recently, many from the comparatively more expensive state of California. Here's why.",
    "fullContent": "Famous people from Elon Musk to Glen Powell have moved to Texas recently, many from the comparatively more expensive state of California. Here's why.",
    "publishedAt": "2025-08-15T19:45:47.000Z",
    "fetchedAt": "2025-08-16T02:22:47.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a49c624"
  },
  {
    "id": "zerohedge-431068b9",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "HHS Reboots 'Task Force On Safer Childhood Vaccines'",
    "url": "https://www.zerohedge.com/medical/hhs-reboots-task-force-safer-childhood-vaccines",
    "summary": "HHS Reboots 'Task Force On Safer Childhood Vaccines' Authored by Jon Fleetwood, The U.S. Department of Health and Human Services (HHS) on Thursday announced the reinstatement of the Task Force on Safer Childhood Vaccines, a federal panel “created by Congress to improve the...",
    "fullContent": "HHS Reboots 'Task Force On Safer Childhood Vaccines' Authored by Jon Fleetwood, The U.S. Department of Health and Human Services (HHS) on Thursday announced the reinstatement of the Task Force on Safer Childhood Vaccines, a federal panel “created by Congress to improve the safety, quality, and oversight of vaccines administered to American children.” “[T]oday’s action reaffirms the Department’s commitment towards continuous improvement in childhood vaccine safety oversight,” the HHS press release reads. “HHS will transmit its first formal report to Congress within two years, with updates every two years thereafter.” The original Task Force had been disbanded in 1998. “By reinstating this Task Force, we are reaffirming our commitment to rigorous science, continuous improvement, and the trust of American families,” said National Institutes of Health (NIH) Director Dr. Jay Bhattacharya. “NIH is proud to lead this effort to advance vaccine safety and support innovation that protects children without compromise.” The Task Force is made up of senior leadership from NIH, FDA, and CDC. Director Bhattacharya will serve as Chairman of the Task Force, per the release. The Task Force will produce recommendations for: “The development, promotion, and refinement of childhood vaccines that result in fewer and less serious adverse reactions than those vaccines currently on the market.” “Improvements in vaccine development, production, distribution, and adverse reaction reporting — along with supporting research to make vaccines safer.” The Defender, a news outlet operated by Children’s Health Defense (founded by current HHS Secretary Robert F. Kennedy Jr.), noted that the announcement came just one day before the agency’s deadline to respond to a lawsuit alleging Kennedy violated federal law by failing to convene the task force after taking office. Filed in May by attorney Ray Flores and funded by CHD, the suit claims Kennedy has been in breach of the National Childhood Vaccine Injury Act of 1986, which mandates that the HHS secretary establish a vaccine safety task force and submit progress reports to Congress every two years. The Defender explained that the 1986 National Childhood Vaccine Injury Act requires HHS to form a task force made up of the health secretary, the FDA commissioner, and the directors of NIH and CDC, and to report to Congress every two years on vaccine safety improvements. Flores says no such reports have been filed in over 35 years. A 2018 lawsuit by Kennedy and Aaron Siri confirmed the absence of any reports, noting that the original task force, created in 1990, was disbanded in 1998. The law allows citizens to sue if these requirements aren’t met, which Flores cited in his case. Whether HHS’s sudden move is a genuine step toward long-overdue vaccine safety oversight—or simply a legal maneuver to head off a citizen-led lawsuit (or both)—remains to be seen. If the Task Force follows through on its mandate, it could finally bring long-absent transparency, accountability, and meaningful safety reforms to the nation’s childhood vaccine program. Tyler Durden Fri, 08/15/2025 - 15:45",
    "publishedAt": "2025-08-15T19:45:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.090Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "431068b9"
  },
  {
    "id": "bloomberg-markets-22ec6c32",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Air Canada'a Flight Attendants Plan to Strike",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/air-canada-a-flight-attendants-plan-to-strike-video",
    "summary": "Air Canada said it remains available to continue negotiations with flight attendants as it winds down operations ahead of a potential labor disruption. Bloomberg's Thomas Seal reports. (Source: Bloomberg)",
    "fullContent": "Air Canada said it remains available to continue negotiations with flight attendants as it winds down operations ahead of a potential labor disruption. Bloomberg's Thomas Seal reports. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T19:41:34.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "22ec6c32"
  },
  {
    "id": "bloomberg-markets-5786b2b5",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Intel Needs 'Customer Wins:' Creative Strategies’ Bajarin",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/intel-needs-customer-wins-ben-bajarin-video",
    "summary": "Creative Strategies CEO Ben Bajarin says it was inevitable that the US government would want to take a stake in Intel to support domestic chip production and national security. Bajarin joins Caroline Hyde and Ed Ludlow on “Bloomberg Tech.” (Source: Bloomberg)",
    "fullContent": "Creative Strategies CEO Ben Bajarin says it was inevitable that the US government would want to take a stake in Intel to support domestic chip production and national security. Bajarin joins Caroline Hyde and Ed Ludlow on “Bloomberg Tech.” (Source: Bloomberg)",
    "publishedAt": "2025-08-15T19:39:29.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5786b2b5"
  },
  {
    "id": "bloomberg-business-youtube-61be8bca",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Greets Putin on Tarmac in Alaska Ahead of Ukraine Summit",
    "url": "https://www.youtube.com/watch?v=Jf72PZ13-qE",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T19:39:16.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "61be8bca"
  },
  {
    "id": "bloomberg-markets-2968e79",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Michael Saylor Bets on A $100B Bitcoin 'Credit' Dream",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/michael-saylor-bets-on-a-100b-bitcoin-credit-dream-video",
    "summary": "Michael Saylor has built a career on testing how far conviction can bend markets — part financier, part preacher. Now the Strategy Inc. chairman is betting that same belief on what may be his riskiest financing experiment yet. Bloomberg's Yiqin Shen reports.",
    "fullContent": "Michael Saylor has built a career on testing how far conviction can bend markets — part financier, part preacher. Now the Strategy Inc. chairman is betting that same belief on what may be his riskiest financing experiment yet. Bloomberg's Yiqin Shen reports. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T19:38:17.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2968e79"
  },
  {
    "id": "business-insider-1f1eae1d",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Reese Witherspoon says she was 'deliriously tired' raising kids in Hollywood: 'I'd cry working 14 to 17 hours'",
    "url": "https://www.businessinsider.com/reese-witherspoon-parenting-kids-hollywood-made-her-cry-2025-8",
    "summary": "Reese Witherspoon explained the challenges of raising three children while being an actor in Hollywood.",
    "fullContent": "Reese Witherspoon explained the challenges of raising three children while being an actor in Hollywood.",
    "publishedAt": "2025-08-15T19:38:14.000Z",
    "fetchedAt": "2025-08-16T02:22:47.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1f1eae1d"
  },
  {
    "id": "ndtv-profit-youtube-566f6292",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump-Putin Meet | Moscow \"Killing People\" Hours Before Putin-Trump Summit, Says Zelensky",
    "url": "https://www.youtube.com/watch?v=qI91oaBSqDw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T19:37:32.000Z",
    "fetchedAt": "2025-08-16T02:22:56.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "566f6292"
  },
  {
    "id": "bloomberg-markets-6261b50a",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Meta’s Consumer AI App Struggles",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/meta-s-consumer-ai-app-struggles-video",
    "summary": "The Meta AI app has persistent flaws, months after the company launched it. Bloomberg’s Natalie Lung discusses the issues and users’ reactions to the app with Caroline Hyde and Ed Ludlow on “Bloomberg Tech.” (Source: Bloomberg)",
    "fullContent": "The Meta AI app has persistent flaws, months after the company launched it. Bloomberg’s Natalie Lung discusses the issues and users’ reactions to the app with Caroline Hyde and Ed Ludlow on “Bloomberg Tech.” (Source: Bloomberg)",
    "publishedAt": "2025-08-15T19:34:39.000Z",
    "fetchedAt": "2025-08-16T02:22:46.570Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6261b50a"
  },
  {
    "id": "wsj-markets-main-3deab910",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Regulators Fine Private-Equity Firm TZP Over Excess Fees",
    "url": "https://www.wsj.com/articles/regulators-fine-private-equity-firm-tzp-over-excess-fees-33a1fb73?mod=rss_markets_main",
    "summary": "The Securities and Exchange Commission said the buyout firm collected more than $500,000 from investors in miscalculated fees.",
    "fullContent": "The Securities and Exchange Commission said the buyout firm collected more than $500,000 from investors in miscalculated fees.",
    "publishedAt": "2025-08-15T19:30:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.037Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3deab910"
  },
  {
    "id": "nautilus-magazine-56501771",
    "sourceId": "nautilus-magazine",
    "sourceName": "Nautilus Magazine",
    "title": "This Muppet Is a Memory Device",
    "url": "https://nautil.us/this-muppet-is-a-memory-device-1231426/",
    "summary": "Developing a high-tech, brain-like memory device led to a “cute surprise” The post This Muppet Is a Memory Device appeared first on Nautilus.",
    "fullContent": "Developing a high-tech, brain-like memory device led to a “cute surprise” The post This Muppet Is a Memory Device appeared first on Nautilus.",
    "publishedAt": "2025-08-15T19:29:50.000Z",
    "fetchedAt": "2025-08-16T02:25:52.987Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "56501771"
  },
  {
    "id": "fortune-6bfa743a",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "DC&#8217;s attorney general says Trump&#8217;s police takeover is illegal and will &#8216;wreak operational havoc&#8217; in the capital",
    "url": "https://fortune.com/2025/08/15/dc-police-trump-federal-takeover-lawsuit-home-rule-national-guard/",
    "summary": "U.S. Attorney General Pam Bondi said DEA boss Terry Cole will assume the police chief's duties and approval authority for any orders issued to officers.",
    "fullContent": "U.S. Attorney General Pam Bondi said DEA boss Terry Cole will assume the police chief's duties and approval authority for any orders issued to officers.",
    "publishedAt": "2025-08-15T19:29:44.000Z",
    "fetchedAt": "2025-08-16T02:22:49.894Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6bfa743a"
  },
  {
    "id": "bloomberg-politics-4337a2df",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Canada Shares List of Pre-Carney Tax Measures It Plans to Keep",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/canada-shares-list-of-pre-carney-tax-measures-it-plans-to-keep",
    "summary": "Canada’s Department of Finance published a list of tax changes that the government is planning to implement, most of which were already announced during former Prime Minister Justin Trudeau’s time in power.",
    "fullContent": "Canada’s Department of Finance published a list of tax changes that the government is planning to implement, most of which were already announced during former Prime Minister Justin Trudeau’s time in power.",
    "publishedAt": "2025-08-15T19:28:54.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4337a2df"
  },
  {
    "id": "bloomberg-business-youtube-b3bea82",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump, Putin Set To Meet In Alaska | Balance of Power 8/15/2025",
    "url": "https://www.youtube.com/watch?v=MihzwmAT35A",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T19:27:57.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "b3bea82"
  },
  {
    "id": "wsj-youtube-1c3b8160",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Trump and Putin Shake Hands After Landing in Alaska | WSJ News",
    "url": "https://www.youtube.com/watch?v=OOpbAJMG06c",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T19:27:25.000Z",
    "fetchedAt": "2025-08-16T02:23:18.577Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1c3b8160"
  },
  {
    "id": "bloomberg-markets-192353c2",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Blackstone-Backed Engineering Firm Legence Files for US IPO",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/blackstone-backed-engineering-firm-legence-files-for-us-ipo",
    "summary": "Legence Corp. filed for an initial public offering that could position it to be at the forefront of a potentially busy September for first-time share sales.",
    "fullContent": "Legence Corp. filed for an initial public offering that could position it to be at the forefront of a potentially busy September for first-time share sales.",
    "publishedAt": "2025-08-15T19:25:54.000Z",
    "fetchedAt": "2025-08-16T02:22:46.570Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "192353c2"
  },
  {
    "id": "economist-business-5c57133f",
    "sourceId": "economist-business",
    "sourceName": "Economist Business",
    "title": "What might Trumpian meddling mean for Intel?",
    "url": "https://www.economist.com/business/2025/08/15/what-might-trumpian-meddling-mean-for-intel",
    "summary": "The president is behaving like an activist investor on Wall Street.",
    "fullContent": "The president is behaving like an activist investor on Wall Street",
    "publishedAt": "2025-08-15T19:25:19.000Z",
    "fetchedAt": "2025-08-16T02:22:47.810Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5c57133f"
  },
  {
    "id": "techmeme-48b92648",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "The Federal Reserve continues its relaxation of crypto oversight by ending a program created in 2023 to scrutinize fintech and crypto activities by banks (Jesse Hamilton/CoinDesk)",
    "url": "http://www.techmeme.com/250815/p16#a250815p16",
    "summary": "Jesse Hamilton / CoinDesk: The Federal Reserve continues its relaxation of crypto oversight by ending a program created in 2023 to scrutinize fintech and crypto activities by banks — The Federal Reserve has shuttered the Novel Activities Supervision Program it built in 2023...",
    "fullContent": "Jesse Hamilton / CoinDesk: The Federal Reserve continues its relaxation of crypto oversight by ending a program created in 2023 to scrutinize fintech and crypto activities by banks — The Federal Reserve has shuttered the Novel Activities Supervision Program it built in 2023 that was — in part — meant to focus on banks' crypto activity.",
    "publishedAt": "2025-08-15T19:25:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "48b92648"
  },
  {
    "id": "zerohedge-33a2567d",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "DC Attorney General Sues Over Trump's 'Hostile Takeover'",
    "url": "https://www.zerohedge.com/political/dc-attorney-general-sues-over-trumps-hostile-takeover",
    "summary": "DC Attorney General Sues Over Trump's 'Hostile Takeover' Washington DC Attorney General Brian Schwalb (D) filed a lawsuit against President Trump early Friday after the administration installed the Drug Enforcement Agency (DEA) head to command the city's police force.",
    "fullContent": "DC Attorney General Sues Over Trump's 'Hostile Takeover' Washington DC Attorney General Brian Schwalb (D) filed a lawsuit against President Trump early Friday after the administration installed the Drug Enforcement Agency (DEA) head to command the city's police force. Members of the National Guard patrol at Union Station in Washington on Aug. 14, 2025. Madalina Kilroy/The Epoch Times In a 33-page (!) complaint, Schwalb claims that DEA Administrator Terry Cole's appointment as \"emergency police commissioner\" exceeds the administration's authority in the DC Home Rule Act that Trump invoked in order to clean up the city. The lawsuit seeks to cancel Cole's appointment and keep the Metropolitan Police Department (MPD) under the command of Mayor Muriel Bowser (D) and Police Chief Pamela Smith, who doesn't know what \"chain of command\" means - and says she still reports to Bowser. \"We are suing to block the federal government takeover of D.C. police. By illegally declaring a takeover of MPD, the Administration is abusing its temporary, limited authority under the law. This is the gravest threat to Home Rule DC has ever faced, and we are fighting to stop it,\" reads the lawsuit. \"There is no greater risk to public safety in a large, professional police force like MPD than to not know who is in command.\" Trump announced on Aug. 11 that the federal government would take over the capital city's police department in an effort to combat crime and homelessness in the city. He also deployed the National Guard. The Home Rule Act requires the mayor to provide law enforcement \"services\" to the president when special emergency conditions are declared. City leaders initially agreed to comply, but now they say the Trump administration has gone too far. \"By declaring a hostile takeover of MPD, the Administration is abusing its limited, temporary authority under the Home Rule Act, infringing on the District’s right to self-governance and putting the safety of DC residents and visitors at risk. The Administration’s unlawful actions are an affront to the dignity and autonomy of the 700,000 Americans who call DC home,\" Schwalb said in a press release. Hours earlier on Friday, US Attorney General Pam Bondi issued an order appointing Cole to take command of the force, and required MPD leaders to receive his approval before issuing new directives. Bondi also reportedly rescinded MPD orders limiting how officers could aid immigration enforcement. In response, Schwalb issued a legal opinion stating that the order is unlawful and instructing Smith not to enforce it. \"Section 740 does not authorize this brazen usurpation of the District’s authority over its own government,\" the lawsuit reads. Tyler Durden Fri, 08/15/2025 - 15:25",
    "publishedAt": "2025-08-15T19:25:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.091Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "33a2567d"
  },
  {
    "id": "bloomberg-markets-481bc740",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Dodging Dividend Taxes Just Got a Little Easier This Week",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-15/how-some-newer-etfs-cphy-cpag-made-dodging-taxes-a-little-easier",
    "summary": "Issuers are increasingly launching equity and fixed-income ETFs designed to maximize after-tax returns.",
    "fullContent": "Issuers are increasingly launching equity and fixed-income ETFs designed to maximize after-tax returns",
    "publishedAt": "2025-08-15T19:21:27.000Z",
    "fetchedAt": "2025-08-16T02:22:46.570Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "481bc740"
  },
  {
    "id": "ft-markets-1d13fb7c",
    "sourceId": "ft-markets",
    "sourceName": "Financial Times Markets",
    "title": "CoreWeave investors sell more than $1bn in shares as IPO lock-up ends",
    "url": "https://www.ft.com/content/e1281a73-61bf-4161-bd00-2be6a53cf074",
    "summary": "Director Jack Cogen offloads stake with an aggregate market value of about $300mn.",
    "fullContent": "Director Jack Cogen offloads stake with an aggregate market value of about $300mn",
    "publishedAt": "2025-08-15T19:20:48.000Z",
    "fetchedAt": "2025-08-16T02:22:47.436Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1d13fb7c"
  },
  {
    "id": "ft-technology-1d13fb7c",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "CoreWeave investors sell more than $1bn in shares as IPO lock-up ends",
    "url": "https://www.ft.com/content/e1281a73-61bf-4161-bd00-2be6a53cf074",
    "summary": "Director Jack Cogen offloads stake with an aggregate market value of about $300mn.",
    "fullContent": "Director Jack Cogen offloads stake with an aggregate market value of about $300mn",
    "publishedAt": "2025-08-15T19:20:48.000Z",
    "fetchedAt": "2025-08-16T02:22:48.361Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1d13fb7c"
  },
  {
    "id": "bloomberg-markets-5f44e4c6",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Fed Portfolio Shift Could Hand Treasury $2 Trillion, BofA Says",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/fed-portfolio-shift-could-hand-treasury-2-trillion-bofa-says",
    "summary": "A possible shift in the composition of the Federal Reserve’s portfolio of Treasury holdings could result in the central bank buying nearly $2 trillion of bills over the next two years, enough to absorb nearly all of the Treasury’s issuance during that period, according to Bank...",
    "fullContent": "A possible shift in the composition of the Federal Reserve’s portfolio of Treasury holdings could result in the central bank buying nearly $2 trillion of bills over the next two years, enough to absorb nearly all of the Treasury’s issuance during that period, according to Bank of America Corp.",
    "publishedAt": "2025-08-15T19:17:08.000Z",
    "fetchedAt": "2025-08-16T02:22:46.570Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5f44e4c6"
  },
  {
    "id": "dwarkesh-patel-youtube-5c95f789",
    "sourceId": "dwarkesh-patel-youtube",
    "sourceName": "Dwarkesh Patel YouTube",
    "title": "Why China's Energy Dominance Won't Lead to AI Supremacy",
    "url": "https://www.youtube.com/watch?v=ZU8_FGdGAHQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T19:15:03.000Z",
    "fetchedAt": "2025-08-16T02:23:09.128Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5c95f789"
  },
  {
    "id": "bloomberg-markets-6b815a98",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump Suggests 300% Tariff on Chips",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/trump-suggests-300-tariff-on-chips-video",
    "summary": "Marta Norton, Empower Chief Investment Strategist, says there has been a benign neglect of tariffs by the market, which has emboldened President Donald Trump to push rates even higher. Norton joins Caroline Hyde and Ed Ludlow on “Bloomberg Tech.” (Source: Bloomberg)",
    "fullContent": "Marta Norton, Empower Chief Investment Strategist, says there has been a benign neglect of tariffs by the market, which has emboldened President Donald Trump to push rates even higher. Norton joins Caroline Hyde and Ed Ludlow on “Bloomberg Tech.” (Source: Bloomberg)",
    "publishedAt": "2025-08-15T19:12:34.000Z",
    "fetchedAt": "2025-08-16T02:22:46.570Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6b815a98"
  },
  {
    "id": "cnbc-markets-770368eb",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Is the activist heat on Salesforce ramping back up? The market sure thinks so",
    "url": "https://www.cnbc.com/2025/08/15/is-the-activist-heat-on-salesforce-ramping-back-up-the-market-sure-thinks-so.html",
    "summary": "Starboard Value, which successfully pushed for changes at Salesforce a few years ago, has upped its stake in the software provider.",
    "fullContent": "Starboard Value, which successfully pushed for changes at Salesforce a few years ago, has upped its stake in the software provider.",
    "publishedAt": "2025-08-15T19:10:30.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "770368eb"
  },
  {
    "id": "zerohedge-69389262",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "The Usual Suspects: Disclosure On The Scuttled Clinton Foundation Investigation Reveals Familiar Names",
    "url": "https://www.zerohedge.com/political/usual-suspects-disclosure-scuttled-clinton-foundation-investigation-reveals-familiar",
    "summary": "The Usual Suspects: Disclosure On The Scuttled Clinton Foundation Investigation Reveals Familiar Names Authored by Jonathan Turley, As the Trump Administration finally releases the underlying documents related to prior scandals and investigations, the public has learned a...",
    "fullContent": "The Usual Suspects: Disclosure On The Scuttled Clinton Foundation Investigation Reveals Familiar Names Authored by Jonathan Turley, As the Trump Administration finally releases the underlying documents related to prior scandals and investigations, the public has learned a great deal about the origins of the Russian collusion investigation and other subjects. This week, another document was released explaining why the investigation into the Clinton Foundation seemed to go nowhere. What is less surprising are the characters involved in shutting down the investigation. It is, as Claude Rains would say, “the usual suspects” from former Acting Attorney General Sally Yates to former Deputy FBI Director Andrew McCabe. Many of us had written about the allegations of influence peddling by the Clintons. While Hillary Clinton was Secretary of State, the Clintons raked in hundreds of millions of dollars from foreign sources. Clinton Foundation officials were shown to have intervened for donors at the State Department. Those funds were used not only for the Clinton Foundation programs but also for travel and support for the Clinton family members. (Tellingly, donations reportedly plummeted after Clinton left office). What is striking is that officials who relentlessly pursued Trump and his associates on little evidence were reportedly opposed to aggressive efforts involving the Clintons. I was one of the loudest critics of Sally Yates, who ordered the entire Justice Department not to assist Trump on immigration efforts after his inauguration. In my view, Yates’s conduct (just days before she was scheduled to leave the department) was a raw political move that shattered standards of professional conduct. It would also make her a heroine on the left and in the media. Ultimately, Trump prevailed on the underlying claims of authority raised in the immigration orders before the Supreme Court. In these documents, Yates is shown in an email shutting down the investigation into the Clintons. Despite findings of good cause for further investigation into these allegations of pay-to-play corruption, Yates (then-Deputy Attorney General) is quoted as saying, “Shut it down!” FBI Director Kash Patel released a memo showing a timeline of the interference, including the message from Sally Yates, whom Trump fired as acting attorney general. McCabe, who is now a CNN contributor, is again shown intervening in a crushingly predictable way. The declassified timeline revealed that as early as February 2016, the Justice Department “indicated they would not be supportive of an FBI investigation.” The timeline also shows that, in mid-February 2016, McCabe ordered that “no overt investigative steps” were allowed to be taken in the Clinton Foundation investigation “without his approval” — a command he allegedly repeated numerous times over the coming months. […] The timeline detailed how Yates ordered one of the federal prosecutors to “shut it down,” likely in the March 2016 timeframe. Federal prosecutors in the Southern District of New York (SDNY) and Eastern District of New York (EDNY) purportedly said in August 2016 that they “would not support the investigation” into the Clinton Foundation, according to the timeline, and that “no explanation was given.” Special Counsel John Durham found that the FBI’s Little Rock and New York investigations “included predication based on source reporting that identified foreign governments that had made, or offered to make, contributions to the Foundation in exchange for favorable or preferential treatment from Clinton.” Nevertheless, the FBI timeline stated that DOJ “indicated they would not be supportive of an FBI investigation” on February 1, 2016. For those of us who closely followed these investigations and wrote about them, this is hardly surprising but still very valuable for historical purposes. The consistent efforts of figures like McCabe only magnify concerns over the role of key figures in pushing investigations of Trump while discouraging investigations of top Democrats. Once again, the media is largely ignoring the disclosures. The same reporters who exhaustively pushed the false Russian collusion claims have little interest in these countervailing disclosures. As with the conduct of Yates and McCabe, that is also an all-too-familiar pattern. Tyler Durden Fri, 08/15/2025 - 15:05",
    "publishedAt": "2025-08-15T19:05:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.091Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "69389262"
  },
  {
    "id": "techmeme-3f2c38a0",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Senator Josh Hawley says he will investigate Meta after a report on its AI policy allowing sensual chats with kids, tells Meta to produce docs by September 19 (Jonathan Vanian/CNBC)",
    "url": "http://www.techmeme.com/250815/p15#a250815p15",
    "summary": "Jonathan Vanian / CNBC: Senator Josh Hawley says he will investigate Meta after a report on its AI policy allowing sensual chats with kids, tells Meta to produce docs by September 19 — Sen. Josh Hawley, R-Mo.",
    "fullContent": "Jonathan Vanian / CNBC: Senator Josh Hawley says he will investigate Meta after a report on its AI policy allowing sensual chats with kids, tells Meta to produce docs by September 19 — Sen. Josh Hawley, R-Mo., said Friday that he will investigate Meta following a report that the company approved rules allowing &hellip;",
    "publishedAt": "2025-08-15T19:00:50.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3f2c38a0"
  },
  {
    "id": "oil-price-4b696c45",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Tariffs and Energy Costs Could Spark an Economic Crisis for Germany",
    "url": "https://oilprice.com/Energy/Energy-General/Tariffs-and-Energy-Costs-Could-Spark-an-Economic-Crisis-for-Germany.html",
    "summary": "The asymmetrical trade agreement between the EU and the US will further worsen Germany’s recession. Yet neither politicians nor corporate leaders show any willingness to make the sweeping policy changes needed to reverse course.",
    "fullContent": "The asymmetrical trade agreement between the EU and the US will further worsen Germany’s recession. Yet neither politicians nor corporate leaders show any willingness to make the sweeping policy changes needed to reverse course. Germany’s economic data leaves no room for illusions. After contracting by 0.9% in 2023 and another 0.5% last year, the decline will continue this year. The Machine Room Has Been Blown Apart It is precisely the sectors that have sustained German prosperity for decades—automobiles, construction, machinery—that…",
    "publishedAt": "2025-08-15T19:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.543Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "4b696c45"
  },
  {
    "id": "oil-price-3a00ab54",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Venezuelan Crude Oil On Its Way to the US",
    "url": "https://oilprice.com/Latest-Energy-News/World-News/Venezuelan-Crude-Oil-On-Its-Way-to-the-US.html",
    "summary": "Chevron has dispatched the first two Venezuelan crude cargoes to the U.S. since Washington restored its license to operate in the sanctioned nation last month. The Mediterranean Voyager and Canopus Voyager left Venezuelan waters on Friday loaded with Hamaca and Boscan heavy...",
    "fullContent": "Chevron has dispatched the first two Venezuelan crude cargoes to the U.S. since Washington restored its license to operate in the sanctioned nation last month. The Mediterranean Voyager and Canopus Voyager left Venezuelan waters on Friday loaded with Hamaca and Boscan heavy crudes, bound for the U.S. West Coast and Port Arthur, Texas, respectively. The move signals a tentative reopening of trade flows that had been abruptly halted earlier this year when the White House revoked Chevron’s license, triggering a 20% drop in Venezuela’s…",
    "publishedAt": "2025-08-15T19:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.543Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "3a00ab54"
  },
  {
    "id": "ndtv-profit-rss-5ebbe35a",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Ola Developing Indigenous Cell, Alternate Tech For Rare Earth Magnet: Bhavish Aggarwal",
    "url": "https://www.ndtvprofit.com/auto/biz-ola-electric-ceo",
    "summary": "Ola Electric's Bhavish Aggarwal also launched the Ferrite Motor technology, an alternative to rare earth magnets, used in the development of electric vehicles.",
    "fullContent": "Ola Electric's Bhavish Aggarwal also launched the Ferrite Motor technology, an alternative to rare earth magnets, used in the development of electric vehicles.",
    "publishedAt": "2025-08-15T18:57:44.112Z",
    "fetchedAt": "2025-08-16T02:22:49.576Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5ebbe35a"
  },
  {
    "id": "bloomberg-politics-5873be7f",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "US Mulls Rosneft, Lukoil Sanctions if Putin Balks on Ceasefire",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/us-mulls-rosneft-lukoil-sanctions-if-putin-balks-on-ceasefire",
    "summary": "The US is weighing the threat of sanctions against Russian oil companies Rosneft PJSC and Lukoil PJSC as part of a menu of options to push President Vladimir Putin to accept a ceasefire with Ukraine, people familiar with the matter said.",
    "fullContent": "The US is weighing the threat of sanctions against Russian oil companies Rosneft PJSC and Lukoil PJSC as part of a menu of options to push President Vladimir Putin to accept a ceasefire with Ukraine, people familiar with the matter said.",
    "publishedAt": "2025-08-15T18:57:31.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5873be7f"
  },
  {
    "id": "wsj-youtube-b075830",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "WSJ Reporter Describes the Scene as Trump Lands in Alaska | WSJ News",
    "url": "https://www.youtube.com/watch?v=K13Zxq0Gfzo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T18:57:10.000Z",
    "fetchedAt": "2025-08-16T02:23:18.577Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "b075830"
  },
  {
    "id": "ndtv-profit-rss-536c461",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "GST Rates Shake-Up: Government Proposes To Scrap 12%, 28% Rate Slabs, Eyes Two-Slab System| Profit Exclusive",
    "url": "https://www.ndtvprofit.com/economy-finance/gst-shake-up-government-plans-two-slab-gst-to-scrap-12-18-slabs-profit-exclusive",
    "summary": "About 99% of items currently taxed at 12% will move to the 5% category, sources said, adding that the Centre proposes new 40% for sin goods and is aiming for GST rate rejig by Q3 FY26.",
    "fullContent": "About 99% of items currently taxed at 12% will move to the 5% category, sources said, adding that the Centre proposes new 40% for sin goods and is aiming for GST rate rejig by Q3 FY26.",
    "publishedAt": "2025-08-15T18:53:31.100Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "536c461"
  },
  {
    "id": "wired-3783899a",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Best Early Labor Day Mattress Sales (2025)",
    "url": "https://www.wired.com/story/best-labor-day-mattress-deals-2025/",
    "summary": "It's one of the best times of the year to score a new mattress. Here are all the best deals (plus some exclusive sale codes) to snag ahead of the long weekend.",
    "fullContent": "It's one of the best times of the year to score a new mattress. Here are all the best deals (plus some exclusive sale codes) to snag ahead of the long weekend.",
    "publishedAt": "2025-08-15T18:53:27.000Z",
    "fetchedAt": "2025-08-16T02:22:49.336Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3783899a"
  },
  {
    "id": "cnbc-markets-3678f52c",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Judge sets hearing Friday on lawsuit challenging Trump takeover of DC police force",
    "url": "https://www.cnbc.com/2025/08/15/dc-sues-trump-police.html",
    "summary": "Trump on Monday federalized the Washington, D.C., police department and ordered the deployment of National Guard troops in the capital city.",
    "fullContent": "Trump on Monday federalized the Washington, D.C., police department and ordered the deployment of National Guard troops in the capital city.",
    "publishedAt": "2025-08-15T18:46:52.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3678f52c"
  },
  {
    "id": "wired-7940413c",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Decoding Palantir, the Most Mysterious Company in Silicon Valley",
    "url": "https://www.wired.com/story/uncanny-valley-podcast-palantir-most-mysterious-company-silicon-valley/",
    "summary": "This week on Uncanny Valley, we talk about one of the most notorious American corporations. So what does Palantir actually do?",
    "fullContent": "This week on Uncanny Valley, we talk about one of the most notorious American corporations. So what does Palantir actually do?",
    "publishedAt": "2025-08-15T18:46:13.000Z",
    "fetchedAt": "2025-08-16T02:22:49.336Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7940413c"
  },
  {
    "id": "zerohedge-53665052",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Putin Hails 'Heroic' North Korean Troops In Warm Letter To Kim",
    "url": "https://www.zerohedge.com/geopolitical/putin-hails-heroic-north-korean-troops-warm-letter-kim",
    "summary": "Putin Hails 'Heroic' North Korean Troops In Warm Letter To Kim Russian President Vladimir Putin has praised North Korean troops deployed as part of the Ukraine war as \"heroic\" in a message to North Korean leader Kim Jong Un, North Korean state media has revealed Friday.",
    "fullContent": "Putin Hails 'Heroic' North Korean Troops In Warm Letter To Kim Russian President Vladimir Putin has praised North Korean troops deployed as part of the Ukraine war as \"heroic\" in a message to North Korean leader Kim Jong Un, North Korean state media has revealed Friday. The timing of the letter's revelation is interesting, given that President Putin is currently in Anchorage, Alaska - hours away from meeting with President Donald Trump and the US delegation to talk all things Ukraine war and its resolution. Is this a bit of a troll move by Pyongyang? Via The Associated Press The Putin letter also commemorated Korea's liberation from Japanese colonial rule, with Putin recalling the joint efforts of Soviet and Korean forces during World War II. He hailed those wartime bonds of \"military friendship and mutual assistance\" and compared them to today, where DPRK troops are deployed in support of Russian forces, reportedly in the Kursk region and possibly even within eastern Ukraine itself. Reports stretching back to last year suggest over ten thousand North Korean troops are there, and possibly more cycling through. In particular Putin highlighted the Korean troop sacrifice to secure the Kursk region as \"heroic\" and said the Russian people would always remember their bravery, according to the state-run KCNA news agency. \"This was fully proved by the heroic participation of the DPRK soldiers in liberating the territory of Kursk region from the Ukrainian occupationists,\" he said The Russian leader also emphasized the two countries' work toward creating a stronger \"multipolar global order\". According to more context via The Guardian: About 600 North Korean soldiers have been killed and thousands more wounded fighting for Russia, Seoul has said. South Korea’s intelligence agency said in June that North Korea was potentially ready to send more troops to Russia. The letter was delivered by the chair of Russia’s Duma – Vyacheslav Volodin – who met Kim during an official visit to Pyongyang on Thursday. Volodin thanked Kim for “dispatching excellent soldiers to the Kursk liberation operations for driving out the Ukrainian aggressors”, according to KCNA. ❗️ Putin CALLS North Korea’s Kim Jong Un DAYS before Trump summit Shares info ahead of talks Leaders agree on MORE direct contact Russian President ‘HIGHLY appreciates’ Pyongyang’s support in liberation of Kursk region from Ukrainian forces https://t.co/a791S16jDF pic.twitter.com/PwlDXg9jjZ — RT (@RT_com) August 12, 2025 Earlier this summer, in July, North Korea's state-run media aired footage showing leader Kim Jong-un mourning the deaths of North Korean soldiers said to be killed while fighting in Russia's war in Ukraine as part of allied forces. The occasion for the memorial footage was the return of the soldiers' remains from Russia, though no details were given as to the number of the deceased being remembered. But the event was significant, offering high-level confirmation of troop deaths related to the Ukraine war. Tyler Durden Fri, 08/15/2025 - 14:45",
    "publishedAt": "2025-08-15T18:45:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.091Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "53665052"
  },
  {
    "id": "nse-online-announcements-5ac4e40f",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Deutsche Investments India Private Limited",
    "url": "https://nsearchives.nseindia.com/corporate/bharram_15082025184327_DNBS4B_DIIPL_July2025.pdf",
    "summary": "Asset/Liability management Statement |SUBJECT: Asset/Liability management Statement.",
    "fullContent": "Asset/Liability management Statement |SUBJECT: Asset/Liability management Statement",
    "publishedAt": "2025-08-15T18:43:40.000Z",
    "fetchedAt": "2025-08-15T13:16:00.782Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "5ac4e40f"
  },
  {
    "id": "bloomberg-politics-e3b19bd",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "DC Skirts Rating Downgrade as US Capital Battles Trump Cuts",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/dc-skirts-rating-downgrade-as-us-capital-battles-trump-cuts",
    "summary": "Washington, DC, avoided a credit-rating downgrade after Fitch Ratings removed its negative watch on the district’s debt.",
    "fullContent": "Washington, DC, avoided a credit-rating downgrade after Fitch Ratings removed its negative watch on the district’s debt.",
    "publishedAt": "2025-08-15T18:40:08.000Z",
    "fetchedAt": "2025-08-16T02:22:47.263Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "e3b19bd"
  },
  {
    "id": "nse-online-announcements-4c9b37f1",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Nectar Lifesciences Limited",
    "url": "https://nsearchives.nseindia.com/corporate/NECLIFE_15082025183730_NECLIFE_Publication_250630.pdf",
    "summary": "Nectar Lifesciences Limited has informed the Exchange about Revised legible Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication.",
    "fullContent": "Nectar Lifesciences Limited has informed the Exchange about Revised legible Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-15T18:38:31.000Z",
    "fetchedAt": "2025-08-15T13:16:00.787Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "4c9b37f1"
  },
  {
    "id": "cnbc-tv18-youtube-1a125186",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Aaj Ki Taaza Khabar LIVE : Trump - Putin Meeting | PM Modi | Russia Ukraine War | Janmashtami 2025",
    "url": "https://www.youtube.com/watch?v=PHb7KrmzRYY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T18:38:08.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1a125186"
  },
  {
    "id": "ndtv-profit-rss-1c819a27",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "'Food Business May Become Bigger Than Edible Oil In Four Years': Saffola Owner Marico's MD",
    "url": "https://www.ndtvprofit.com/business/food-business-may-become-bigger-than-edible-oil-in-four-years-saffola-owner-maricos-md",
    "summary": "The home-grown fast moving consumer goods major, which also operates with brands like 'True Elements' and the plant-based nutrition portfolio of Plix, sees a significant opportunity for expansion of Total Addressable Market, Saffola's MD said.",
    "fullContent": "The home-grown fast moving consumer goods major, which also operates with brands like 'True Elements' and the plant-based nutrition portfolio of Plix, sees a significant opportunity for expansion of Total Addressable Market, Saffola's MD said.",
    "publishedAt": "2025-08-15T18:30:56.777Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1c819a27"
  },
  {
    "id": "ndtv-profit-rss-74252d3d",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Nagaland Governor La Ganesan Dies At 80",
    "url": "https://www.ndtvprofit.com/nation/nagaland-governor-la-ganesan-dies-at-80",
    "summary": "Ganesan was undergoing treatment at the ICU of the hospital for the past few days and he died on Friday night, the Kohima Raj Bhavan PRO said.",
    "fullContent": "Ganesan was undergoing treatment at the ICU of the hospital for the past few days and he died on Friday night, the Kohima Raj Bhavan PRO said.",
    "publishedAt": "2025-08-15T18:30:16.162Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "74252d3d"
  },
  {
    "id": "ndtv-profit-rss-3d43da0",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Two Senior Chinese Ministers Attend India’s Independence Day Reception In Beijing",
    "url": "https://www.ndtvprofit.com/nation/two-senior-chinese-ministers-attend-indias-independence-day-reception-in-beijing",
    "summary": "Vice Minister of Foreign Affairs Miao Deyu and Vice Minister Sun Haiyan of the International Department of the ruling Communist Party of China were the chief guests at a well-attended reception, held for the first time since the COVID-19 pandemic and over the year-long eastern...",
    "fullContent": "Vice Minister of Foreign Affairs Miao Deyu and Vice Minister Sun Haiyan of the International Department of the ruling Communist Party of China were the chief guests at a well-attended reception, held for the first time since the COVID-19 pandemic and over the year-long eastern Ladakh stand-off.",
    "publishedAt": "2025-08-15T18:30:00.489Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3d43da0"
  },
  {
    "id": "the-verge-855e7c2",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Here are the best AirPods deals you can get right now",
    "url": "https://www.theverge.com/21302051/best-apple-airpods-deals",
    "summary": "If you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C.",
    "fullContent": "If you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Amazon Prime Day, Black Friday, and Cyber Monday often bring the steepest discounts, [&#8230;]",
    "publishedAt": "2025-08-15T18:29:53.000Z",
    "fetchedAt": "2025-08-16T02:22:49.376Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "855e7c2"
  },
  {
    "id": "ndtv-profit-rss-4eae9a11",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Enterprises See AI's Main Value In Better Decision-Making Rather Than As An Automation Tool: Survey",
    "url": "https://www.ndtvprofit.com/technology/enterprises-see-ais-main-value-in-better-decision-making-rather-than-as-an-automation-tool-survey",
    "summary": "The survey is based on insight received between May and July 2025 from over 350 chief IT officers or chief technology officers of enterprises having an annual turnover of over Rs 5,000 crore.",
    "fullContent": "The survey is based on insight received between May and July 2025 from over 350 chief IT officers or chief technology officers of enterprises having an annual turnover of over Rs 5,000 crore.",
    "publishedAt": "2025-08-15T18:29:38.880Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4eae9a11"
  },
  {
    "id": "ndtv-profit-rss-41147c23",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "PM Modi's 'Sahi Samay Hai' Message For Samriddha Bharat",
    "url": "https://www.ndtvprofit.com/nation/pm-modis-sahi-samay-hai-message-for-samriddha-bharat",
    "summary": "The Prime Minister made an impassioned call for 'Samriddha Bharat' by making the country 'aatmanirbhar' (self-reliant).",
    "fullContent": "The Prime Minister made an impassioned call for 'Samriddha Bharat' by making the country 'aatmanirbhar' (self-reliant).",
    "publishedAt": "2025-08-15T18:29:21.192Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "41147c23"
  },
  {
    "id": "ndtv-profit-rss-798b0128",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "PM Modi Lauds SVANidhi Yojana Scheme For Street Vendors",
    "url": "https://www.ndtvprofit.com/nation/pm-modi-lauds-svanidhi-yojana-scheme-for-street-vendors",
    "summary": "Modi said the PM Street Vendor's AtmaNirbhar Nidhi, a special micro-credit facility for street vendors, is one of grassroots schemes bringing changes to people's lives.",
    "fullContent": "Modi said the PM Street Vendor's AtmaNirbhar Nidhi, a special micro-credit facility for street vendors, is one of grassroots schemes bringing changes to people's lives.",
    "publishedAt": "2025-08-15T18:29:06.817Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "798b0128"
  },
  {
    "id": "ndtv-profit-rss-14884c86",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "EaseMyTrip Sees Q1 Growth Driven By Hotels, Packages, Robust Intel Operations",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/easemytrip-sees-q1-growth-driven-by-hotels-packages-robust-intel-operations",
    "summary": "Hotels and holiday package bookings grew by 81.2% year-on-year, rising from 1.8 lakhs to 3.3 lakhs, the firm said in a statement.",
    "fullContent": "Hotels and holiday package bookings grew by 81.2% year-on-year, rising from 1.8 lakhs to 3.3 lakhs, the firm said in a statement.",
    "publishedAt": "2025-08-15T18:28:55.223Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "14884c86"
  },
  {
    "id": "ndtv-profit-rss-7a79435e",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Trump-Putin Meeting: The Presidents Have Different Goals For Anchorage Summit",
    "url": "https://www.ndtvprofit.com/world/trump-putin-meeting-the-presidents-have-different-goals-for-anchorage-summit",
    "summary": "The meeting between Tump and Putin also marks a repudiation of former President Joe Biden’s approach of “nothing about Ukraine without Ukraine.\"",
    "fullContent": "The meeting between Tump and Putin also marks a repudiation of former President Joe Biden’s approach of “nothing about Ukraine without Ukraine.\"",
    "publishedAt": "2025-08-15T18:28:06.478Z",
    "fetchedAt": "2025-08-16T02:22:49.577Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a79435e"
  }
]