[
  {
    "id": "bbc-business-4587b00a",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Nerd glasses and friendship necklaces: Claire's was heaven until Shein came along",
    "url": "https://www.bbc.com/news/articles/c23pek275p5o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "As the future of the chain hangs in the balance, what made tweenagers fall in love with its quirky charm?",
    "fullContent": "As the future of the chain hangs in the balance, what made tweenagers fall in love with its quirky charm?",
    "publishedAt": "2025-08-16T23:21:53.000Z",
    "fetchedAt": "2025-08-17T09:41:14.421Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4587b00a"
  },
  {
    "id": "techmeme-6ecd2001",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Barbour ABI: the UK's data center count, currently 477, is set to jump by ~100 over the next five years, with more than half in London and neighboring counties (BBC)",
    "url": "http://www.techmeme.com/250816/p17#a250816p17",
    "summary": "BBC: Barbour ABI: the UK's data center count, currently 477, is set to jump by ~100 over the next five years, with more than half in London and neighboring counties — The number of data centres in the UK is set to increase by almost a fifth, according to figures shared with...",
    "fullContent": "BBC: Barbour ABI: the UK's data center count, currently 477, is set to jump by ~100 over the next five years, with more than half in London and neighboring counties — The number of data centres in the UK is set to increase by almost a fifth, according to figures shared with BBC News.",
    "publishedAt": "2025-08-16T23:20:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6ecd2001"
  },
  {
    "id": "fortune-2e535f2",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Government forces Air Canada and flight attendants back to work and into arbitration, after strike strands over 100,000 travelers",
    "url": "https://fortune.com/2025/08/16/air-canada-strike-flight-attendants-cancelations-operations-travel-sesason/",
    "summary": "A complete shutdown will impact about 130,000 people a day, and some 25,000 Canadians may be stranded abroad daily. Air Canada operates around 700 flights per day.",
    "fullContent": "A complete shutdown will impact about 130,000 people a day, and some 25,000 Canadians may be stranded abroad daily. Air Canada operates around 700 flights per day.",
    "publishedAt": "2025-08-16T23:17:03.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2e535f2"
  },
  {
    "id": "zerohedge-122ddacc",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Visualizing How America's Workforce Has Changed Over The Past 25 Years",
    "url": "https://www.zerohedge.com/personal-finance/visualizing-how-americas-workforce-has-changed-over-past-25-years",
    "summary": "Visualizing How America's Workforce Has Changed Over The Past 25 Years Two decades ago, nearly one in five American workers answered phones, filed paperwork, or managed calendars. Today, that figure has fallen sharply.",
    "fullContent": "Visualizing How America's Workforce Has Changed Over The Past 25 Years Two decades ago, nearly one in five American workers answered phones, filed paperwork, or managed calendars. Today, that figure has fallen sharply. The visualization, via Visual Capitalist's Pallavi Rao, compares how 100 hypothetical workers were distributed across occupations in 2002 versus 2024. It revealing which fields lost—or gained—share during a period marked by globalization, new technology, and a pandemic. The data for this visualization comes from the U.S. Bureau of Labor Statistics’ Occupational Employment and Wage Statistics, which track headcounts across more than 800 detailed job categories. Those categories are grouped into 21 broad buckets, visualized here, to spotlight long-term structural shifts in U.S. jobs. ℹ️ BLS does not collect data on the agriculture sector, except for a few support categories. Office Work is Still the Most Common U.S. Job Back-office roles were once the backbone of white-collar employment. But widespread adoption of enterprise software—from automated invoicing to cloud-based scheduling—has pared back demand. Rank 2002 2002 Workforce as 100 People 2024 2024 Workforce as 100 People 1 🧑‍💼 Office & Admin 18 🧑‍💼 Office & Admin 12 2 📈 Sales 10 🚚 Transport & Logistics 9 3 🏭 Manufacturing 8 🍽️ Food 9 4 🍽️ Food 8 📈 Sales 9 5 🚚 Transport & Logistics 7 👔 Management 7 6 🎓 Education 6 💹 Business and Financial 7 7 👔 Management 6 🩺 Doctors, Nurses, Technicians 6 8 🩺 Doctors, Nurses, Technicians 5 🎓 Education 6 9 🏗️ Construction & Extraction 5 🏭 Manufacturing 6 10 🔧 Installation & Repair 4 🧑‍⚕️ Health Assistants & Aides 5 11 💹 Business & Financial 4 🏗️ Construction & Extraction 4 12 🧹 Custodial 3 🔧 Installation & Repair 4 13 🧑‍⚕️ Health Assistants & Aides 2 💻 Data & Tech 3 14 🛡️ Protection 2 🧹 Custodial 3 15 🏨 Hospitality 2 🛡️ Protection 2 16 💻 Data & Tech 2 🏨 Hospitality 2 17 📐 Architecture & Engineering 2 🤝 Community & Social Service 2 18 🤝 Community & Social Services 1 📐 Architecture & Engineering 2 19 🎭 Arts, Media, Sport 1 🎭 Arts, Media, Sport 1 20 🔬 Science 1 🔬 Science 1 21 ⚖️ Legal 1 ⚖️ Legal 1 22 🌾 Farming, Fishing, and Forestry 0 🌾 Farming, Fishing, and Forestry 0 N/A 🌐 All Occupations 100 🌐 All Occupations 100 Note: Figures are rounded. Between 2002 and 2024, Office & Administrative workers went from 18% of the employed workforce to 12%. Even with the rise of hybrid work, clerical duties are increasingly handled by self-service portals and AI chatbots, leaving fewer traditional desk jobs. The decline underscores how routine cognitive tasks are nearly as vulnerable to automation as factory work. Despite this, Office & Administrative jobs are still the largest category by number of workers (12 per 100), even in 2024. Services Surge in Transport, Food, and Healthcare While clerical and manufacturing roles receded, service-oriented fields expanded. Transport & Logistics now has nine workers per 100, compared to seven in 2002, buoyed by e-commerce that multiplies parcel volumes and warehouse positions. Food Service has also climbed, reflecting a consumer shift toward dining out and delivery. Healthcare saw twin gains: Doctors/Nurses/Technicians held steady at six workers per 100, while Health Assistants & aides rose from two to five workers as an aging population demands more support staff. Together, these categories illustrate how in-person, non-routine work remains resilient. High-Skill Roles Grow—but So Do Inequalities Both Management and Data & Tech occupations added roughly one worker per 100 since 2002, mirroring a broader pivot toward knowledge work. Overall, the workforce is more diversified, with less concentration in a few dominant sectors. The shift reflects structural change: technology is reducing clerical jobs while demographic and digital trends are fueling growth in healthcare and tech. If you enjoyed today’s post, check out The Most Common Job in Each U.S. State in 2024 on Voronoi, the new app from Visual Capitalist. Tyler Durden Sat, 08/16/2025 - 19:15",
    "publishedAt": "2025-08-16T23:15:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "122ddacc"
  },
  {
    "id": "fortune-1a264d59",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "OpenAI staffers to sell $6 billion in stock to SoftBank, other investors",
    "url": "https://fortune.com/2025/08/16/openai-staffers-6-billion-secondary-stock-sale-softbank-thrive-capital-dragoneer/",
    "summary": "The secondary share sale will give OpenAI employees a chance to get cash-rich amid a high-stakes talent war in the AI industry.",
    "fullContent": "The secondary share sale will give OpenAI employees a chance to get cash-rich amid a high-stakes talent war in the AI industry.",
    "publishedAt": "2025-08-16T23:11:55.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1a264d59"
  },
  {
    "id": "wsj-world-news-6bf69828",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Putin Returns to Moscow With Air of Triumph After Summit",
    "url": "https://www.wsj.com/world/putin-returns-to-moscow-with-air-of-triumph-after-summit-4e6bf35e",
    "summary": "The meeting with Trump helped give the Kremlin leader much of what he wanted, including putting Russia on an equal footing with the U.S.",
    "fullContent": "The meeting with Trump helped give the Kremlin leader much of what he wanted, including putting Russia on an equal footing with the U.S.",
    "publishedAt": "2025-08-16T23:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.967Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "6bf69828"
  },
  {
    "id": "oil-price-c3cbb25",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Natural Gas Could Be Angola’s Next Big Money Maker",
    "url": "https://oilprice.com/Energy/Natural-Gas/Natural-Gas-Could-Be-Angolas-Next-Big-Money-Maker.html",
    "summary": "Angola is betting big on natural gas developments as a short-term increase in oil production is not expected to last despite the West African country leaving OPEC over capped production. Companies operating in Angola have recently started up two oil projects, but they have...",
    "fullContent": "Angola is betting big on natural gas developments as a short-term increase in oil production is not expected to last despite the West African country leaving OPEC over capped production. Companies operating in Angola have recently started up two oil projects, but they have also begun to target non-associated offshore gas plays, hoping that a massive gas resource could be waiting to be tapped. Despite the recent oil project startups, Angola’s oil production is expected to drop to about 1 million barrels per day (bpd) in 2027,…",
    "publishedAt": "2025-08-16T23:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.066Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "c3cbb25"
  },
  {
    "id": "fortune-7b64680f",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump&#8217;s reciprocal tariffs could be struck down as soon as this month — and the administration is warning of economic apocalypse",
    "url": "https://fortune.com/2025/08/16/trump-tariffs-appeals-court-case-ieepa-authority-reciprocal-duties/",
    "summary": "\"In short, the economic consequences would be ruinous, instead of unprecedented success.\"",
    "fullContent": "\"In short, the economic consequences would be ruinous, instead of unprecedented success.\"",
    "publishedAt": "2025-08-16T22:46:00.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7b64680f"
  },
  {
    "id": "zerohedge-12473306",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Average American To Receive $3,752 Tax Cut In 2026 Due To OBBBA",
    "url": "https://www.zerohedge.com/personal-finance/average-american-receive-3752-tax-cut-2026-due-obbba",
    "summary": "Average American To Receive $3,752 Tax Cut In 2026 Due To OBBBA Authored by Thérèse Boudreaux via The Center Square, The White House is touting a new economic analysis that estimates taxpayers will see an average $3,752 tax cut in 2026, due to provisions in the One Big...",
    "fullContent": "Average American To Receive $3,752 Tax Cut In 2026 Due To OBBBA Authored by Thérèse Boudreaux via The Center Square, The White House is touting a new economic analysis that estimates taxpayers will see an average $3,752 tax cut in 2026, due to provisions in the One Big Beautiful Bill Act. According to the nonpartisan Tax Foundation report, taxpayers in every state will see reduced federal taxes next year and though there is “considerable geographic variation” in tax benefits. “President Trump’s One Big Beautiful Bill is the largest, most consequential tax cut on the middle class ever,” White House Deputy Press Secretary Anna Kelly said Friday. “Between lower inflation, massive investments, and historic tax cuts, all Americans are reaping the benefits of the Trump Economy – and the Golden Age has just begun.” Republicans’ multitrillion-dollar OBBBA, among other things, made permanent the expiring 2017 Tax Cuts and Jobs Act’s across-the-board reduced tax rates; $15,000 standard deduction; $2,000 Child Tax Credit; 20% QBI deduction for small businesses; and $750,000 home mortgage interest deduction cap. Three key business tax credits were made permanent as well – full reimbursement for new capital investments like machinery and equipment, an expanded deduction for corporation’s interest on debt, and immediate deductions for companies’ research costs. The OBBBA also implemented a host of temporary tax provisions set to expire in 2030, including a quadrupling of the $10,000 state and local tax (SALT) deduction cap; a $6,000 deduction for seniors; and temporary tax deductions for tips and overtime pay, capped for single filers at $25,000 and $12,500, respectively. Taken together, the Tax Foundation analysis estimates that the OBBBA’s tax provisions will lower individuals’ taxes in every state and create 938,000 full-time jobs in the long run. Individuals in Wyoming, Washington, and Massachusetts will see the largest average tax cuts in 2026 – hovering around $5,100 – while residents of West Virginia and Mississippi will see the smallest average tax cuts that year, around $2,400. On a more local level, taxpayers in mountain resort towns will receive the highest average tax benefits while taxpayers in rural counties will receive the lowest tax benefits. Once the temporary tax provisions expire, however, the average tax cut will fall to $2,505 in 2030, then climb to $3,301 by 2035 due to inflation. Although individual households will benefit from the tax cuts, the country’s fiscal health likely won’t, according to budget watchdogs like the Congressional Budget Office. CBO estimates that the trillions in lost federal revenue will add an extra $4.1 trillion to the national debt by 2034. The U.S. national debt just topped $37 trillion, as The Center Square reported. Tyler Durden Sat, 08/16/2025 - 18:40",
    "publishedAt": "2025-08-16T22:40:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "12473306"
  },
  {
    "id": "zerohedge-9292cc0",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "California Democrats Unveil Proposed Congressional Map To Counter Texas Redistricting",
    "url": "https://www.zerohedge.com/political/california-democrats-unveil-proposed-congressional-map-counter-texas-redistricting",
    "summary": "California Democrats Unveil Proposed Congressional Map To Counter Texas Redistricting California Democratic lawmakers unveiled on Friday a proposed redrawn state congressional map they intend to place on the November ballot amid a redistricting battle with Texas.",
    "fullContent": "California Democrats Unveil Proposed Congressional Map To Counter Texas Redistricting California Democratic lawmakers unveiled on Friday a proposed redrawn state congressional map they intend to place on the November ballot amid a redistricting battle with Texas. The proposed congressional map is expected to give Democrats five additional seats in the U.S. House of Representatives in the 2026 election, which Democratic lawmakers said was a response to Texas Republicans’ redistricting plan. As Aldgra Fredly reports for The Epoch Times, the Democratic Congressional Campaign Committee (DCCC) said in a statement that the proposed map is consistent with guidelines laid out by the independent California Citizens Redistricting Commission. “It allows for more compact districts than in the current Commission-drawn map, keeps more communities and neighborhoods together, splits fewer cities, and makes minimal disruptions to the Commission-drawn map so as to impact as few residents as possible,” DCCC Executive Director Julie Merz stated in a letter accompanying the proposed map. California Gov. Gavin Newsom said they would introduce a legislative package next week aimed at allowing state voters to decide on whether to adopt the proposed constitutional amendment without going through the state’s independent redistricting commission. The package also includes a bill enabling the new congressional map to take effect if other states redraw districts, and another bill authorizing reimbursement of costs to administer the election. The governor accused President Donald Trump and Republicans of undermining democracy with a plan to redraw the congressional map in Texas. “This moment calls for urgency and action—that is what we are putting before voters this November, a chance to fight back against his anti-American ways,” Newsom said. California’s First Congressional District is currently anchored in the state’s conservative far northeast corner and is represented by Republican Rep. Doug LaMalfa. The district has a nearly 18-point GOP registration edge. Under the proposal, Democrats would end up with a 10-point registration advantage there after drastic reshaping to include parts of heavily Democratic Sonoma County near the Pacific Coast. LaMalfa has criticized the proposed congressional map. “How on earth does Modoc County, on the Nevada and Oregon border, have any common interest with Marin County and the Golden Gate Bridge? Voters took this power from Sacramento for just this reason,” he stated. “This is naked politics at its worst.” The move came as Texas Republicans proposed a new congressional map after the U.S. Department of Justice suggested that several districts in Texas are likely unconstitutionally created by grouping minorities to form a majority. The redistricting proposal, which would flip five Democratic seats in the 2026 election, prompted more than 50 Texas Democratic lawmakers to leave the state in early August and break quorum in a bid to block the plan from moving forward. They mostly sought refuge in Illinois, where Gov. JB Pritzker vowed to protect them from extradition or other legal threats leveled by Texas Gov. Greg Abbott and Texas Attorney General Ken Paxton. Others fled to New York and California, both led by Democrats. Abbott has accused Democrats of gerrymandering in the past and said his state could go further than California when it comes to redistricting. “Look at the map of Illinois. Look at the map they gerrymandered a long time ago. They got nothing left with regard to what they can do,” he said on CNN on Aug. 11. “And know this: If California tries to gerrymander, find more districts, listen, Texas has the ability to eliminate 10 Democrats in our state.” Tyler Durden Sat, 08/16/2025 - 18:05",
    "publishedAt": "2025-08-16T22:05:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "9292cc0"
  },
  {
    "id": "zerohedge-7f1784bc",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Child Gender Clinics Are Shutting Down Across US",
    "url": "https://www.zerohedge.com/medical/child-gender-clinics-are-shutting-down-across-us",
    "summary": "Child Gender Clinics Are Shutting Down Across US Authored by Kurt Miceli via RealClearWire, Here’s some good news you may not have heard. From coast to coast, child gender clinics are shutting down, thanks to the leadership of the Trump administration.",
    "fullContent": "Child Gender Clinics Are Shutting Down Across US Authored by Kurt Miceli via RealClearWire, Here’s some good news you may not have heard. From coast to coast, child gender clinics are shutting down, thanks to the leadership of the Trump administration. Children are safer because of these closures—protected from radical transgender ideology and the sex changes that threaten their bodies, minds, and futures. The latest gender clinic to announce its closure is at Connecticut Children’s Medical Center, which confirmed this news on July 23. Just one day earlier, the gender clinic at the Children’s Hospital in Los Angeles closed. The L.A. clinic was one of the first and largest in the country, subjecting hundreds of children to invasive and irreversible transgender treatments, including hormones and surgeries. Do No Harm, where I work, has documented nearly 20 gender clinics and programs either pausing child sex changes or shutting down since the start of the year. This progress is the direct result of the Trump administration’s January executive order, which directed federal agencies to prohibit hospitals from getting federal funding if they provide so-called “gender-affirming care” to minors. In reality, such care is neither caring nor gender-affirming. It forces confused children to become something they’re not, because, as studies show, the vast majority of these kids wouldn’t try to change genders if they simply waited. Yet once they’re pushed down the sex-change road, they very often can’t fully go back, and they very often have lifelong physical and mental health complications. Taxpayers should never be forced to support this medical and moral nightmare. Children should be able to develop naturally, especially those who are confused. They don’t need a dangerous cocktail of off-label chemicals or sex-change surgeries. Yet that’s what activists have long demanded, and medical associations and many providers largely gave into their demands instead of putting children’s health first. To this day, the medical establishment is dominated by those activists, and they’re loudly lamenting the closure of these clinics. But they’re very clearly ignoring the evidence. Look no further than the recently shuttered clinic at the Children’s Hospital at Los Angeles. The clinic’s leader, the famous transgender activist Dr. Johanna Olson-Kennedy, became infamous last year when she refused to release the findings of her own taxpayer-funded study on gender-confused kids. She finally relented under pressure in May, and lo and behold, it turns out that puberty blockers aren’t associated with improvement in kids’ mental health. Dr. Olson-Kennedy’s own research undercuts the entire argument for child sex changes—that it will help them become healthier and happier with who they are. The evidence is mounting that child sex changes are built on a foundation of lies—and incredibly dangerous to those who receive them. In June, a new study found that boys taking feminizing hormones are far more likely to have strokes and develop various cancers. In fact, they’re up to 40 times more likely to develop breast cancer. Other studies show that girls taking testosterone are in for a world of physical pain, as well. The Trump administration has grounded its actions in this medical research, whereas the medical establishment has largely put radical ideology ahead of real evidence. That fact was on full display earlier this year, after the Department of Health and Human Services released its groundbreaking analysis of the state of medical research on sex changes for kids. The report concluded that there’s “very weak evidence of benefit” to kids, but there are “significant risks,” including irreversible harms like infertility. Rather than acknowledge reality, medical groups and hospitals rushed to condemn the report and defend their desire to continue endangering children’s health and well-being. Thankfully, that danger is beginning to fade, now that child gender clinics are shutting down. But there’s more work to do when it comes to protecting children. The clinics and programs that have closed only account for about 13 percent of the child sex change treatments that Do No Harm has documented from 2019 to 2023 alone. Another 28 percent of children who suffered from this ideology lived in states that have since banned child sex changes. But that leaves a lot of states and hospitals that are still putting a majority of America’s children at risk. The Trump administration shouldn’t rest until everyone who’s endangering children is held accountable—and every child in America is safe. Tyler Durden Sat, 08/16/2025 - 17:30",
    "publishedAt": "2025-08-16T21:30:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7f1784bc"
  },
  {
    "id": "bloomberg-politics-3ee62fe",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Ivorian Opposition Rallies Against President’s Fourth-Term Bid",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/ivorian-opposition-rallies-against-president-s-fourth-term-bid",
    "summary": "Thousands of Ivorians rallied against incumbent leader Alassane Ouattara’s bid for a fourth term on Saturday — the second such demonstration in a single week.",
    "fullContent": "Thousands of Ivorians rallied against incumbent leader Alassane Ouattara’s bid for a fourth term on Saturday — the second such demonstration in a single week.",
    "publishedAt": "2025-08-16T21:27:45.000Z",
    "fetchedAt": "2025-08-17T02:34:42.475Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "3ee62fe"
  },
  {
    "id": "techmeme-251cacd0",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A new Artificial Analysis benchmark, focusing on OpenAI's gpt-oss-120b, shows how open-weight LLMs exhibit inconsistent performance across hosting providers (Simon Willison/Simon Willison's Weblog)",
    "url": "http://www.techmeme.com/250816/p16#a250816p16",
    "summary": "Simon Willison / Simon Willison's Weblog: A new Artificial Analysis benchmark, focusing on OpenAI's gpt-oss-120b, shows how open-weight LLMs exhibit inconsistent performance across hosting providers — Artificial Analysis published a new benchmark the other day, this time...",
    "fullContent": "Simon Willison / Simon Willison's Weblog: A new Artificial Analysis benchmark, focusing on OpenAI's gpt-oss-120b, shows how open-weight LLMs exhibit inconsistent performance across hosting providers — Artificial Analysis published a new benchmark the other day, this time focusing on how an individual model - OpenAI's gpt-oss-120b - performs across different hosted providers.",
    "publishedAt": "2025-08-16T21:20:01.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "251cacd0"
  },
  {
    "id": "oil-price-61d0a193",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Global Nuclear Power Hits Record High as Asia Surges Ahead",
    "url": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Global-Nuclear-Power-Hits-Record-High-as-Asia-Surges-Ahead.html",
    "summary": "Nuclear power has always been a paradox. It can produce massive amounts of low-carbon electricity, yet it must constantly battle the headwinds of politics and public perception. The latest Statistical Review of World Energy shows that while nuclear generation is growing...",
    "fullContent": "Nuclear power has always been a paradox. It can produce massive amounts of low-carbon electricity, yet it must constantly battle the headwinds of politics and public perception. The latest Statistical Review of World Energy shows that while nuclear generation is growing globally—setting a new record high in 2024—the trend is anything but uniform. Some countries are charging ahead, while others are stepping back. Global Output: Modest Growth, Unevenly Shared In 2024, global nuclear generation reached 2,817 terawatt-hours, a modest…",
    "publishedAt": "2025-08-16T21:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.066Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "61d0a193"
  },
  {
    "id": "zerohedge-188f67a4",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Escobar: Putin-Trump Summit Went Much Better Than Expected",
    "url": "https://www.zerohedge.com/geopolitical/escobar-putin-trump-summit-went-much-better-expected",
    "summary": "Escobar: Putin-Trump Summit Went Much Better Than Expected There are few details about what exactly was discussed in the meeting, but Russian officials have made it clear that they’re pleased with how it went, says veteran geopolitical analyst, Pepe Escobar.",
    "fullContent": "Escobar: Putin-Trump Summit Went Much Better Than Expected There are few details about what exactly was discussed in the meeting, but Russian officials have made it clear that they’re pleased with how it went, says veteran geopolitical analyst, Pepe Escobar. There were even some indications that a serious US-Russia reset could be on the horizon. \"Even according to President Trump himself, they came to agreement on several important points and only a few are left. So this implies, serious discussions not only about Ukraine, a possible resolution in Ukraine, and of course we we have no idea about the terms and the parameters, but a reset, a serious reset of US-Russia relations.\" Tyler Durden Sat, 08/16/2025 - 16:55",
    "publishedAt": "2025-08-16T20:55:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "188f67a4"
  },
  {
    "id": "cnbc-markets-4adf6253",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Samsung taking market share from Apple in U.S. as foldable phones gain momentum",
    "url": "https://www.cnbc.com/2025/08/16/samsungs-us-market-share-apple-rivalry-foldable-phones.html",
    "summary": "Samsung introduced two folding phones in July that are garnering praise on social media and putting pressure on Apple to deliver new types of iPhones.",
    "fullContent": "Samsung introduced two folding phones in July that are garnering praise on social media and putting pressure on Apple to deliver new types of iPhones",
    "publishedAt": "2025-08-16T20:50:56.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4adf6253"
  },
  {
    "id": "business-insider-1e548f1b",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Growing up, I spent nearly every weekend with my grandmother. She made me see that I am smart and powerful.",
    "url": "https://www.businessinsider.com/spent-weekends-with-grandmother-she-made-me-understand-my-worth-2025-8",
    "summary": "Growing up, I viewed my grandmother as my best friend. Now, years after her death, the lessons she taught me still guide my life.",
    "fullContent": "Growing up, I viewed my grandmother as my best friend. Now, years after her death, the lessons she taught me still guide my life.",
    "publishedAt": "2025-08-16T20:40:02.000Z",
    "fetchedAt": "2025-08-17T02:34:42.451Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e548f1b"
  },
  {
    "id": "summer-of-protocols-4729c4ef",
    "sourceId": "summer-of-protocols",
    "sourceName": "Summer of Protocols",
    "title": "A Very Short Introduction to Memory and Technology",
    "url": "https://protocolized.summerofprotocols.com/p/a-very-short-introduction-to-memory",
    "summary": "Issue #44: From the Memory Research Group",
    "fullContent": "Issue #44: From the Memory Research Group",
    "publishedAt": "2025-08-16T20:27:38.000Z",
    "fetchedAt": "2025-08-17T02:37:35.968Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "4729c4ef"
  },
  {
    "id": "zerohedge-3d59f35",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Two Charts Of Extremely Perverse Incentives",
    "url": "https://www.zerohedge.com/political/two-charts-extremely-perverse-incentives",
    "summary": "Two Charts Of Extremely Perverse Incentives Authored by Charles Hugh Smith via OfTwoMinds blog, As a thought experiment, consider these changes to our economy's incentive structure. Warren Buffett's partner Charlie Munger had a maxim: Show me the incentives, and I'll show you...",
    "fullContent": "Two Charts Of Extremely Perverse Incentives Authored by Charles Hugh Smith via OfTwoMinds blog, As a thought experiment, consider these changes to our economy's incentive structure. Warren Buffett's partner Charlie Munger had a maxim: Show me the incentives, and I'll show you the outcome. With that in mind, let's look at two charts. The first is a chart depicting the use of ChatGPT. (Source: OpenAI Usage Plummets in the Summer, When Students Aren't Cheating on Homework.) Usage fell by 2/3 once classes ended, and the dips in use during the Spring align with weekends. There are any number of conclusions we can draw, but let's start with another of Munger's maxims: why? The reason is obvious: students are required to do homework as part of the learning process, and are incentivized to complete their homework so they pass the class. So they use generative AI tools to either help them complete their homework or do their homework for them. We can't tell which option they selected without testing their knowledge without any digital devices within reach to help them. Note the incentives are to complete the homework, not to master the material. That's a big difference, and it's the foundation of our entire system of education: pass the class, accumulate credits, and you will be issued a credential / diploma certifying that you passed X number of classes. This incentive leads to students learning very little despite spending a fortune and four years attending college courses. Consider the study Academically Adrift: Limited Learning on College Campuses which concluded that \"American higher education is characterized by limited or no learning for a large proportion of students.\" The institutions of education are incentivized to issue credentials that cost a lot of money and time. The causal link between learning and doing homework is now weak, as generative AI can do their homework for them. The obvious solution is to issue educational credentials only for passing exams given in real time without any digital devices allowed. In other words, test the students' actual learning / knowledge, rather than tote up homework completed and classes passed. In other words, accredit the student, not the institution. This was a key suggestion in my book The Nearly Free University. The testing would have to be lengthy and clever enough to demand real mastery rather than superficial recall / memory, and it would have to be closely guarded and the component exams would have to be issued semi-randomly to each student at the moment the testing began, to minimize gaming the test or cheating. In this incentive system, if a well-educated 17-year old passed the entire battery of university accreditation tests, they would be issued a university diploma without attending a single class because the system accredits the student, not the institution. In my book Get a Job and Build a Real Career, I take this one step further, outlining a path to accredit yourself. What the existing system incentivizes is becoming dependent on generative AI while learning very little because there is little incentive for actual learning. There are also no incentives for those within the institutions to focus on students learning essential skills and knowledge. Imagine if the wildly unproductive belief that \"everyone has to go to college\" was replaced with a system that enabled students to choose to learn skills on a broad spectrum, from welding to calculus. Imagine if every employee in the school / university received minimum-wage paychecks if the students learned very little and received a bonus if the students passed rigorous tests documenting that they'd learned skills and knowledge that are useful in life and in the real economy. Imagine if every student who passed the tests was given a paid internship in their field of choice. Instead, we incentivize students in insert typos into their chatbot-composed papers to make it appear that they actually wrote the paper themselves. If we want a more productive outcome, we have to change the incentive structure of the entire education complex. Next up: stock buybacks, which were only legalized in 1982 at the start of America's great hollow out the real economy to benefit the few experiment, also known as Financialization. (Source: American Companies Are Buying Their Own Stocks at a Record Pace Buybacks are expected to top $1.1 trillion in 2025, led by big banks and tech firms (in other words, the usual suspects.) The approved narrative seems to be that Corporate America would be investing these trillions in new productivity, except for all this uncertainty about tariffs. But this explanation conveniently ignores the enormous annual buybacks that preceded the present tariff kerfuffle. The real issue is the incentives favor financialization, not investing in real-world productive assets. As a thought experiment, consider these changes to our economy's incentive structure: 1. Buybacks are taxed at a rate of 50%. If you want to buy back $1 of your company's shares, you pay $1 in tax. So Corporate America's $1.1 trillion in buybacks would generate $550 billion in taxes and a net $550 billion in shares purchased via buybacks. 2. Profits earned from domestic production are tax-free. Given the complexities of global supply chains, there has to be some wiggle room here, so if 80% of all components and labor are domestic, this qualifies for the zero tax rate. How would changing the incentives change Corporate America's decisions regarding where they invest their profits? If we want to change the outcome, we have to change the incentive structure. The problem, as we all know, is those with vested interests in maintaining the current perverse incentives hold all the power, and they have zero incentive to relinquish any of that power. * * * Check out my new book Ultra-Processed Life and my updated Books and Films. Become a $3/month patron of my work via patreon.com Subscribe to my Substack for free Tyler Durden Sat, 08/16/2025 - 16:20",
    "publishedAt": "2025-08-16T20:20:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3d59f35"
  },
  {
    "id": "bloomberg-markets-1b3fe80b",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Central Bankers Flock to Jackson Hole at Pivotal Moment",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/fed-rates-central-bankers-flock-to-jackson-hole-at-pivotal-moment",
    "summary": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "fullContent": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "publishedAt": "2025-08-16T20:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.000Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1b3fe80b"
  },
  {
    "id": "bloomberg-economics-1b3fe80b",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Central Bankers Flock to Jackson Hole at Pivotal Moment",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/fed-rates-central-bankers-flock-to-jackson-hole-at-pivotal-moment",
    "summary": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "fullContent": "A big week is coming up for the Federal Reserve and central bank enthusiasts.",
    "publishedAt": "2025-08-16T20:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.468Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "1b3fe80b"
  },
  {
    "id": "ndtv-profit-youtube-59cdc65f",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Meet | F-35 Jets Escort Putin’s ‘Flying Kremlin’ From Alaska After Trump Meeting",
    "url": "https://www.youtube.com/shorts/RG40KxQqVRg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:45:25.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "59cdc65f"
  },
  {
    "id": "zerohedge-984d2e2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Fleeing High-Cost Blue States? Here's Where Bills Are Lowest",
    "url": "https://www.zerohedge.com/personal-finance/fleeing-high-cost-blue-states-heres-where-bills-are-lowest",
    "summary": "Fleeing High-Cost Blue States? Here's Where Bills Are Lowest The U.S. consumer landscape remains mixed. Recent datapoints have painted a softer macroeconomic backdrop, with subpar jobs reports with downward revisions, a pullback in personal spending, two consecutive monthly...",
    "fullContent": "Fleeing High-Cost Blue States? Here's Where Bills Are Lowest The U.S. consumer landscape remains mixed. Recent datapoints have painted a softer macroeconomic backdrop, with subpar jobs reports with downward revisions, a pullback in personal spending, two consecutive monthly declines in credit card balances, a record jump in student loan delinquencies, and downward pressure in consumer discretionary stocks. However, July’s consumer report showed an unexpected surge in spending, suggesting resilience so far this summer despite economic headwinds. Against this complicated macroeconomic backdrop for consumers, new data from DoxoINSIGHTS’ 2025 State-by-State Bill Pay Market Report provides a granular view of household bill costs nationwide. The report ranks states by monthly expenses, highlighting the most and least expensive places to live. Doxo's unique aggregate bill pay dataset shows that consumers spend an average of $2,058 per month on bills, or about 31% of the $84,583 median household income. The analysis, covering 97% of ZIP codes and 45 bill categories, shows California, Hawaii, New Jersey, and Massachusetts as the priciest states, while West Virginia, Mississippi, Arkansas, and Oklahoma are the cheapest. Californians face a median monthly bill of $2,854, 39% above the national level, compared with $1,149 in West Virginia, 44% below. The report, based on median payments for 13 major household expenses including mortgages, rent, utilities, auto loans, insurance and telecoms, ranks all 50 states by bill cost. 10 Most Expensive States for Household Bills 10 Least Expensive States for Household Bills This state-level cost profile can help individuals and employers make more informed decisions when considering job relocations or moves to escape expensive blue states to affordable red states. * * * View the full report here: . . . Tyler Durden Sat, 08/16/2025 - 15:45",
    "publishedAt": "2025-08-16T19:45:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "984d2e2"
  },
  {
    "id": "fortune-6dc29ae7",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Airfares are surging again after a months-long slump as carriers trim flights to ease a capacity glut",
    "url": "https://fortune.com/2025/08/16/airfares-cheap-plane-tickets-flight-capacity-cuts-travel-demand/",
    "summary": "The latest consumer price index report showed airfares jumped 4% in July from June, marking the first monthly increase since January.",
    "fullContent": "The latest consumer price index report showed airfares jumped 4% in July from June, marking the first monthly increase since January.",
    "publishedAt": "2025-08-16T19:28:53.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6dc29ae7"
  },
  {
    "id": "ndtv-profit-youtube-4da24989",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump-Putin Alaska Summit Ends in Spectacle | Zelenskyy Heads to White House",
    "url": "https://www.youtube.com/watch?v=0XtcgtYCyp4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:25:48.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4da24989"
  },
  {
    "id": "techmeme-5adbbf82",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "GPT-5's underwhelming performance on benchmarks suggests that the current approach of scaling LLMs is starting to reach the limits of available resources (Financial Times)",
    "url": "http://www.techmeme.com/250816/p15#a250816p15",
    "summary": "Financial Times: GPT-5's underwhelming performance on benchmarks suggests that the current approach of scaling LLMs is starting to reach the limits of available resources — OpenAI's underwhelming new GPT-5 model suggests progress is slowing — and competition in the space is...",
    "fullContent": "Financial Times: GPT-5's underwhelming performance on benchmarks suggests that the current approach of scaling LLMs is starting to reach the limits of available resources — OpenAI's underwhelming new GPT-5 model suggests progress is slowing — and competition in the space is changing",
    "publishedAt": "2025-08-16T19:25:01.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5adbbf82"
  },
  {
    "id": "bloomberg-politics-51b768e4",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "West Virginia, Ohio Guard to Join Trump’s DC Crime Crackdown",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/west-virginia-guard-to-join-trump-s-crackdown-on-crime-in-dc",
    "summary": "West Virginia, South Carolina and Ohio are sending several hundred National Guard troops to Washington to bolster the federal deployment that President Donald Trump has ordered in his effort to reduce crime in the nation’s capital.",
    "fullContent": "West Virginia, South Carolina and Ohio are sending several hundred National Guard troops to Washington to bolster the federal deployment that President Donald Trump has ordered in his effort to reduce crime in the nation’s capital.",
    "publishedAt": "2025-08-16T19:22:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.475Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "51b768e4"
  },
  {
    "id": "zerohedge-3f758132",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Trump Says Xi Assured Him China Will Not Invade Taiwan During His Presidency",
    "url": "https://www.zerohedge.com/geopolitical/trump-says-xi-assured-him-china-will-not-invade-taiwan-during-his-presidency",
    "summary": "Trump Says Xi Assured Him China Will Not Invade Taiwan During His Presidency Authored by Travis Gillmore via The Epoch Times, President Donald Trump said Chinese leader Xi Jinping promised him that China will refrain from invading Taiwan for the next four years.",
    "fullContent": "Trump Says Xi Assured Him China Will Not Invade Taiwan During His Presidency Authored by Travis Gillmore via The Epoch Times, President Donald Trump said Chinese leader Xi Jinping promised him that China will refrain from invading Taiwan for the next four years. Trump made the remarks during a nearly 30-minute-long interview with Fox News’ Brett Baier which was filmed on Air Force One and aired while the president was in Alaska meeting with Russian President Vladimir Putin. “I will never do it as long as you’re president; President Xi told me that, and I said, well, I appreciate that,” Trump said. The guarantee does not extend to future administrations, the president noted. “But he also said, but I am very patient, and China is very patient,” Trump said. “Say, well, that’s up to you, but it better not happen now.” It remains unclear when Xi made the remarks. The White House did not respond to requests for comment before publication. Taiwan, a self-governing democratic island territory, is viewed by Beijing as a breakaway province. Its freedom remains a volatile point of contention in U.S.-China relations. The United States guarantees defensive arms to Taipei under the Taiwan Relations Act. Xi has vowed to achieve “reunification” with the island by any means necessary, and he’s ramped up military exercises in the waters around the island. Optimism that the president’s foreign policy agenda will deter China’s aggression is a recurring theme in the administration’s first 200 days. Treasury Secretary Scott Bessent told CNBC host Andrew Ross Sorkin in March that China will stay out of Taiwan. “I follow President Trump’s lead, and he is confident that President Xi will not make that move during his presidency,” Bessent said. U.S. Defense Secretary Pete Hegseth publicly declared at the Shangri-La Dialogue—an annual summit held in Singapore by the International Institute for Strategic Studies—in May that China is signaling a desire to be capable of attacking the island nation by 2027, with a buildup in nuclear weapons and military readiness. “Every day you see it. China’s military harasses Taiwan,” Hegseth said. “It has to be clear to all that Beijing is credibly preparing to potentially use military force to alter the balance of power in the Indo-Pacific.” He expressed confidence that the communist regime will wait until the current administration leaves office, but warned of the threat the Chinese Communist Party poses to world peace. “Again, to be clear: any attempt by communist China to conquer Taiwan by force would result in devastating consequences for the Indo-Pacific and the world,” Hegseth said. “There’s no reason to sugarcoat it. The threat China poses is real.” Tyler Durden Sat, 08/16/2025 - 15:10",
    "publishedAt": "2025-08-16T19:10:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3f758132"
  },
  {
    "id": "ndtv-profit-youtube-2a1d7851",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Meet | F-35 Jets Escort Putin’s ‘Flying Kremlin’ From Alaska After Trump Meeting",
    "url": "https://www.youtube.com/watch?v=eBLWi626koc",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T19:03:32.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2a1d7851"
  },
  {
    "id": "cnbc-markets-4ad89744",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Zelenskyy to meet with Trump after Putin talks end without a ceasefire",
    "url": "https://www.cnbc.com/2025/08/16/trump-putin-russia-ukraine-zelensky-.html",
    "summary": "Zelenskyy said he and Trump would meet Monday to \"discuss all of the details regarding ending the killing and the war.\"",
    "fullContent": "Zelenskyy said he and Trump would meet Monday to \"discuss all of the details regarding ending the killing and the war.\"",
    "publishedAt": "2025-08-16T19:02:47.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ad89744"
  },
  {
    "id": "marketwatch-a2bf88d",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "3 ways to make sure the &#x2018;great wealth transfer&#x2019; enriches your family",
    "url": "https://www.marketwatch.com/story/how-to-break-the-cycle-of-entitlement-so-your-heirs-value-their-privilege-and-your-money-2c8cd8ab?mod=mw_rss_topstories",
    "summary": "From &#x2018;affluenza&#x2019; to abundance: How to teach heirs to value their privilege &#x2014; and your money.",
    "fullContent": "From &#x2018;affluenza&#x2019; to abundance: How to teach heirs to value their privilege &#x2014; and your money",
    "publishedAt": "2025-08-16T19:02:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a2bf88d"
  },
  {
    "id": "oil-price-167ec5d6",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Trump Moves to Open 82% of Alaska’s Petroleum Reserve for Drilling",
    "url": "https://oilprice.com/Energy/Energy-General/Trump-Moves-to-Open-82-of-Alaskas-Petroleum-Reserve-for-Drilling.html",
    "summary": "Since coming into office, United States President Donald Trump has doubled down on his “Drill, baby, drill” statement by opening federal land for licensing and encouraging oil and gas companies to increase production.",
    "fullContent": "Since coming into office, United States President Donald Trump has doubled down on his “Drill, baby, drill” statement by opening federal land for licensing and encouraging oil and gas companies to increase production. One state Trump has set his sights on is Alaska, an area where oil operations have become increasingly more controversial in recent years due to concerns over environmental degradation. President Trump hopes to double the quantity of crude moving through Alaska’s pipelines, as well as construct a giant gas project,…",
    "publishedAt": "2025-08-16T19:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.066Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "167ec5d6"
  },
  {
    "id": "marginal-revolution-4e0dd315",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "Scott Sumner is still the greatest movie critic in the world",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/scott-sumner-is-still-the-greatest-movie-critic-in-the-world.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=scott-sumner-is-still-the-greatest-movie-critic-in-the-world",
    "summary": "Here is the intro: Over time, I’ve noticed that an unusual number of important films came out in the late 1950s and early 1960s. In this post, I’ll argue that the period from 1958 to 1963 is the artistic peak of filmmaking. So what is the evidence for this claim?",
    "fullContent": "Here is the intro: Over time, I’ve noticed that an unusual number of important films came out in the late 1950s and early 1960s. In this post, I’ll argue that the period from 1958 to 1963 is the artistic peak of filmmaking. So what is the evidence for this claim? I certainly won’t argue that [&#8230;] The post Scott Sumner is still the greatest movie critic in the world appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-16T18:55:08.000Z",
    "fetchedAt": "2025-08-17T02:34:43.409Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e0dd315"
  },
  {
    "id": "cnbc-markets-156e3b2e",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump warned by top Senate Democrats to rethink advanced AI chip sales to China",
    "url": "https://www.cnbc.com/2025/08/16/senate-democrats-letter-trump-advanced-ai-chip-sales-china.html",
    "summary": "On Aug. 15, top Senate Democrats warned Trump about AI chip deal with China in an open letter.",
    "fullContent": "On Aug. 15, top Senate Democrats warned Trump about AI chip deal with China in an open letter",
    "publishedAt": "2025-08-16T18:39:59.000Z",
    "fetchedAt": "2025-08-17T02:34:42.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "156e3b2e"
  },
  {
    "id": "zerohedge-18fa5fa5",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Here's Where ChatGPT Is Currently Banned",
    "url": "https://www.zerohedge.com/ai/heres-where-chatgpt-currently-banned",
    "summary": "Here's Where ChatGPT Is Currently Banned Governments around the world are taking different stances on artificial intelligence tools like ChatGPT. While some embrace the technology, others have restricted or outright banned access due to political, cultural, or security concerns.",
    "fullContent": "Here's Where ChatGPT Is Currently Banned Governments around the world are taking different stances on artificial intelligence tools like ChatGPT. While some embrace the technology, others have restricted or outright banned access due to political, cultural, or security concerns. In 2025, ChatGPT remains unavailable in 20 countries. In this visualization, Visual Capitalist's Marcus Lu highlights where ChatGPT is banned, as well as places where OpenAI does not offer service. Data & Discussion The data for this visualization comes from a list compiled by Cybernews, which we referenced with an official OpenAI list of supported countries. Government-Imposed Bans Many of the bans are found in countries with strict internet control, such as China, North Korea, and Iran. These governments limit access to foreign digital platforms, often citing information control and political stability as reasons. In China, for example, users have access to several LLMs that were developed by domestic companies, including Alibaba’s Qwen, DeepSeek, Baichuan, and Tencent-backed Hunyuan. Meanwhile, in conflict zones like Syria, Afghanistan, and Yemen, bans are linked to both security concerns and limited infrastructure. Unsupported Regions Not all countries on the list have active bans. In places like Hong Kong and Belarus, the service is unavailable because OpenAI does not support accounts there. These exclusions are often due to business, regulatory, or legal complexities rather than explicit censorship. If you enjoyed today’s post, check out the AI “Big Bang” Study 2025 on Voronoi, the new app from Visual Capitalist. Tyler Durden Sat, 08/16/2025 - 14:35",
    "publishedAt": "2025-08-16T18:35:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.145Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18fa5fa5"
  },
  {
    "id": "marketwatch-334e712f",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x200b;Trump has perfected a tax on corporate America &#x2014; just don&#x2019;t call it a tax. Here&#x2019;s how it could affect stocks.",
    "url": "https://www.marketwatch.com/story/trumps-nvidia-deal-opens-a-pay-to-play-toll-road-to-do-business-in-america-investors-will-feel-every-bump-5601f2f7?mod=mw_rss_topstories",
    "summary": "The art of the steal: Trump&#x2019;s Nvidia deal opens a &#x2018;pay to play&#x2019; floodgate to do business. If you can&#x2019;t afford the toll, don&#x2019;t approach the booth.",
    "fullContent": "The art of the steal: Trump&#x2019;s Nvidia deal opens a &#x2018;pay to play&#x2019; floodgate to do business. If you can&#x2019;t afford the toll, don&#x2019;t approach the booth.",
    "publishedAt": "2025-08-16T18:34:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "334e712f"
  },
  {
    "id": "marketwatch-3cd3a37c",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Most boomers and Gen X-ers are terrified about running out of money in retirement &#x2014; even if they&#x2019;re already retired",
    "url": "https://www.marketwatch.com/story/most-boomers-and-gen-x-ers-are-terrified-about-running-out-of-money-in-retirement-even-if-theyre-already-retired-43d52ed0?mod=mw_rss_topstories",
    "summary": "Anxiety has been peaking for people in and approaching retirement &#x2014; how to manage it.",
    "fullContent": "Anxiety has been peaking for people in and approaching retirement &#x2014; how to manage it",
    "publishedAt": "2025-08-16T18:22:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3cd3a37c"
  },
  {
    "id": "wsj-world-news-2713c23b",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Trump Tells Europeans He Is Open to U.S. Security Guarantees in Ukraine",
    "url": "https://www.wsj.com/world/europe/trump-tells-europeans-he-is-open-to-u-s-security-guarantees-in-ukraine-347892f6",
    "summary": "Trump said that Putin accepted that any peace would need to include the presence of Western troops in Ukraine as a way of ensuring its durability.",
    "fullContent": "Trump said that Putin accepted that any peace would need to include the presence of Western troops in Ukraine as a way of ensuring its durability.",
    "publishedAt": "2025-08-16T18:09:00.000Z",
    "fetchedAt": "2025-08-17T02:34:42.967Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "2713c23b"
  },
  {
    "id": "techmeme-3e62cbc",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "How an editor uncovered the \"largest self-promotion operation in Wikipedia's history\" that promoted obscure composer David Woodard with entries in 335 languages (Nate Anderson/Ars Technica)",
    "url": "http://www.techmeme.com/250816/p14#a250816p14",
    "summary": "Nate Anderson / Ars Technica: How an editor uncovered the \"largest self-promotion operation in Wikipedia's history\" that promoted obscure composer David Woodard with entries in 335 languages — Quick—what are the top entries in the category \"Wikipedia articles written in the...",
    "fullContent": "Nate Anderson / Ars Technica: How an editor uncovered the \"largest self-promotion operation in Wikipedia's history\" that promoted obscure composer David Woodard with entries in 335 languages — Quick—what are the top entries in the category \"Wikipedia articles written in the greatest number of languages\"?",
    "publishedAt": "2025-08-16T18:00:34.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3e62cbc"
  },
  {
    "id": "zerohedge-65f5ff10",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Hell Freezes: Hillary Says Trump Has Been \"Great\" And Would Nominate Him For Peace Prize",
    "url": "https://www.zerohedge.com/political/hell-freezes-hillary-says-trump-has-been-great-and-would-nominate-him-peace-prize",
    "summary": "Hell Freezes: Hillary Says Trump Has Been \"Great\" And Would Nominate Him For Peace Prize Authored by Steve Watson via Modernity.news, Hillary Clinton has praised President Trump. Yes you read that right, she said something nice about him. What’s she up to?",
    "fullContent": "Hell Freezes: Hillary Says Trump Has Been \"Great\" And Would Nominate Him For Peace Prize Authored by Steve Watson via Modernity.news, Hillary Clinton has praised President Trump. Yes you read that right, she said something nice about him. What’s she up to? Hillary declared on the ‘Raging Moderates’ podcast that she is pleased with the way Trump has dealt with NATO in recent months. Hillary Clinton praises Trump: “I actually was encouraged by the events of the last several months. The NATO commitment by individual member states to increase defense spending is very welcome and the willingness of European countries to support Ukraine.” pic.twitter.com/mYCbAHPuE2 — TheBlaze (@theblaze) August 15, 2025 “I actually was encouraged by the events of the last several months. First of all, the NATO commitment by individual member states to increase their defense spending is very welcome. It’s something that prior administrations have certainly sought,” Clinton said. Trump has pressured the other member states to boost spending from just 2 percent of their GDP to 5 percent, and made a deal for NATO to foot the bill for US weapons going to Ukraine. “I think it’s great that we are seeing these commitments that now have to be followed through on,” Hillary stated. ‘Great’ is an interesting choice of word. She added that “The willingness of European countries to support Ukraine, and by doing so by American weapons in order to provide them to the Ukrainians,” Of course, she wants more weapons for Ukraine, and Trump had to do that deal. Under the agreement, European NATO members—Germany, the Netherlands, Denmark, Norway, Sweden, Finland, the UK, and Canada—commit to purchasing billions of dollars worth of American military equipment, including Patriot air defense systems, missiles, artillery, and ammunition. These allies then either send the newly acquired U.S. weapons directly to Ukraine or donate their existing stockpiles to Kyiv while replenishing their own inventories with U.S. replacements. This setup marks a shift from direct U.S. aid packages, which Trump has heavily criticized as overly burdensome on American taxpayers. “I think all of that is a very good signal that there is beginning to be a better understanding, both by the president and the people around him, as well as by the leaders of our European allies, that there can be common ground amongst us,” Clinton further suggested. “And the kind of dismissiveness that we saw in the first Trump administration has been replaced by a much more obvious working relationship to the good of European security, transatlantic security, and hopefully Ukrainian security. So I’m actually encouraged,” she added. Elsewhere during the podcast, Hillary commented on Trump’s meeting with Vladimir Putin scheduled for today, noting “Honestly, if he could bring about the end to this terrible war, if he could end it without putting Ukraine in a position where it had to concede its territory to the aggressor, could really stand up to Putin — something we haven’t seen, but maybe this is the opportunity — if President Trump were the architect of that, I’d nominate him for a Nobel Peace Prize.” “Because my goal here is to not allow capitulation to Putin,” Clinton added. Donald Trump and Vladimir Putin meet today in Alaska and even Hillary Clinton sees a path toward a Nobel Peace Prize for Trump (but it’s going to take a lot). Here’s how: https://t.co/SPuj87qz48 pic.twitter.com/4GJPBmSnhs — Jessica Tarlov (@JessicaTarlov) August 15, 2025 Trump responded to Clinton’s comments in his inimitable style. 🔥Bige news: Hillary Clinton said \"i will nominate you for the Nobel Peace Prize if you get a deal with Russia without capitulating to Putin… 🎙️President Trump: PRESIDENT TRUMP: \"Well, that was very nice – I may have to start liking her again.\"😁 pic.twitter.com/oMvXXe34HR — Wall Street Mav (@WallStreetMav) August 15, 2025 As we highlighted earlier, Trump has announced that his meeting with Vladmir Putin on Friday was “very successful” and that a full peace deal, not merely a ceasefire, is in the works. Trump cautioned that this is highly dependent on Ukrainian President Zelensky playing ball, but that he is ready to act as mediator between Zelensky and Putin. Can Trump pull off what would be an historic outcome? * * * Your support is crucial in helping us defeat mass censorship. Please consider donating via Locals or check out our unique merch. Follow us on X @ModernityNews. Tyler Durden Sat, 08/16/2025 - 14:00",
    "publishedAt": "2025-08-16T18:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "65f5ff10"
  },
  {
    "id": "marketwatch-3df14ff",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Why your stock portfolio may actually &#x2018;feel&#x2019; depressed that summer is almost over",
    "url": "https://www.marketwatch.com/story/summers-almost-over-and-the-return-of-pumpkin-spice-lattes-is-a-sign-that-your-stock-portfolio-may-fall-ac250c2e?mod=mw_rss_topstories",
    "summary": "Halloween merchandise and pumpkin-spice lattes in August are reminders that winter is coming.",
    "fullContent": "Halloween merchandise and pumpkin-spice lattes in August are reminders that winter is coming.",
    "publishedAt": "2025-08-16T17:52:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3df14ff"
  },
  {
    "id": "bbc-business-3fea963f",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Topshop returns to the High Street, but can it get its cool back?",
    "url": "https://www.bbc.com/news/articles/ckgl4w1zkypo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "For many, the stores defined their childhood. Now the retailer says it is reopening them, and held its first catwalk for years on Saturday.",
    "fullContent": "For many, the stores defined their childhood. Now the retailer says it is reopening them, and held its first catwalk for years on Saturday.",
    "publishedAt": "2025-08-16T17:42:42.000Z",
    "fetchedAt": "2025-08-17T02:34:45.043Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3fea963f"
  },
  {
    "id": "fortune-577b6234",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump&#8217;s tax cut could mean a nearly half-trillion-dollar cut to Medicare starting in 2027, CBO warns",
    "url": "https://fortune.com/2025/08/16/trump-tax-cut-medicare-spending-federal-deficits-cbo/",
    "summary": "The $3.4 trillion that the tax and spending law adds to the federal deficit over the next decade means that many Medicare programs could see cuts.",
    "fullContent": "The $3.4 trillion that the tax and spending law adds to the federal deficit over the next decade means that many Medicare programs could see cuts.",
    "publishedAt": "2025-08-16T17:41:01.000Z",
    "fetchedAt": "2025-08-17T02:34:45.118Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "577b6234"
  },
  {
    "id": "ndtv-profit-rss-1a53fb54",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Mumbai Witnesses Two Deaths During Dahi Handi Festivities; 95 Injured",
    "url": "https://www.ndtvprofit.com/nation/mumbai-witnesses-two-deaths-during-dahi-handi-festivities-95-injured",
    "summary": "Earlier, in the afternoon, a 32-year-old man fell to death while tying 'Dahi Handi' in Mankhurd in the north eastern part of the metropolis, officials said.",
    "fullContent": "Earlier, in the afternoon, a 32-year-old man fell to death while tying 'Dahi Handi' in Mankhurd in the north eastern part of the metropolis, officials said.",
    "publishedAt": "2025-08-16T17:39:34.455Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1a53fb54"
  },
  {
    "id": "marketwatch-3c0e6085",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "An obsession with avoiding the estate tax cost this top exec his marriage. Now his son is speaking out.",
    "url": "https://www.marketwatch.com/story/an-obsession-with-avoiding-the-estate-tax-cost-this-top-exec-his-marriage-now-his-son-is-speaking-out-2d4afbef?mod=mw_rss_topstories",
    "summary": "The documentary &#x201c;Death & Taxes&#x201d; delves into Harvey Schein&#x2019;s obsession with avoiding the IRS.",
    "fullContent": "The documentary &#x201c;Death & Taxes&#x201d; delves into Harvey Schein&#x2019;s obsession with avoiding the IRS",
    "publishedAt": "2025-08-16T17:33:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c0e6085"
  },
  {
    "id": "fortune-6bf2bb5a",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump could trigger a financial crisis in Russia — if he wants to — but has backed off from his threat of &#8216;very severe consequences&#8217;",
    "url": "https://fortune.com/2025/08/16/trump-putin-summit-russia-oil-sanctions-financial-crisis-severe-consequences-ukraine-war-ceasefire/",
    "summary": "\"Trump can squeeze the Russians; he seems to forget that the United States holds the cards, not Moscow.\"",
    "fullContent": "\"Trump can squeeze the Russians; he seems to forget that the United States holds the cards, not Moscow.\"",
    "publishedAt": "2025-08-16T17:30:07.000Z",
    "fetchedAt": "2025-08-17T02:34:45.117Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6bf2bb5a"
  },
  {
    "id": "business-insider-3ba43ae3",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Which ChatGPT version is best? A guide on the difference between all of OpenAI's models.",
    "url": "https://www.businessinsider.com/which-chatgpt-model-is-best",
    "summary": "GPT-5, OpenAI's latest release, will decide for you which model is best for certain tasks. Here's the difference between them.",
    "fullContent": "GPT-5, OpenAI's latest release, will decide for you which model is best for certain tasks. Here's the difference between them.",
    "publishedAt": "2025-08-16T17:26:50.000Z",
    "fetchedAt": "2025-08-17T02:34:42.451Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3ba43ae3"
  },
  {
    "id": "ndtv-profit-rss-6f46dac4",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Dixon Tech, China's HKC Overseas Form Rs 370 Crore JV To Make Display Modules",
    "url": "https://www.ndtvprofit.com/business/dixon-tech-chinas-hkc-overseas-form-rs-370-crore-jv-to-make-display-modules",
    "summary": "The Dixon Technologies-HKC Overseas joint venture is for manufacturing and selling of LCD and TFT-LCD modules that are used in electronic devices like TV, mobile phones etc for display.",
    "fullContent": "The Dixon Technologies-HKC Overseas joint venture is for manufacturing and selling of LCD and TFT-LCD modules that are used in electronic devices like TV, mobile phones etc for display.",
    "publishedAt": "2025-08-16T17:26:20.983Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6f46dac4"
  },
  {
    "id": "zerohedge-16e16b34",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "China's \"Assassin's Mace\" Irregular Warfare Campaign May Render Trump's Golden Dome Useless",
    "url": "https://www.zerohedge.com/geopolitical/chinas-assassins-mace-irregular-warfare-campaign-may-render-trumps-golden-dome-useless",
    "summary": "China's \"Assassin's Mace\" Irregular Warfare Campaign May Render Trump's Golden Dome Useless There has been extensive media coverage of President Trump's new Golden Dome hemispheric defense push, a key element of the administration's revised force posture in the Western...",
    "fullContent": "China's \"Assassin's Mace\" Irregular Warfare Campaign May Render Trump's Golden Dome Useless There has been extensive media coverage of President Trump's new Golden Dome hemispheric defense push, a key element of the administration's revised force posture in the Western Hemisphere. CNN reported Friday that the Pentagon is preparing to deploy thousands of troops across Latin American waters to disrupt narco-terrorist command-and-control networks. Here is the critical blind spot most are overlooking: All of this hemispheric defense posturing, and the eventual missile defense shield, basically an Iron Dome on steroids, risks being completely undermined by Beijing's asymmetric warfare playbook. Aware of its conventional military disadvantages relative to the U.S., the Chinese Communist Party (CCP) and its armed wing, the People's Liberation Army (PLA), have invested heavily in unconventional weapons systems and covert action programs that are already well underway. Several of the PLA's irregular warfare tools and covert action programs can be classified as Weapons of Mass Destruction (WMD). These include bioweapons, biochemical weapons, nanoweapons, brain-computer interface weapons, directed-energy weapons, and miniaturized EMPs. With American deaths caused by Covid-19 now well exceeding Vietnam War casualty figures, a strong case can be made that the CCP's covert program to develop, test, and deploy the next generation of more lethal, genetically stable, and stealthy engineered pathogens qualifies as a WMD program. It's become entirely clear that the CCP shows limited to no signs of modifying or reversing its intent to target, degrade, and eventually dissolve the U.S. from within, conquer Taiwan, dominate the Indo-Pacific, and implode the dollar system for a new \"international system\" for all things China. President Trump knows this, which is why he recently said any BRICS member will be slapped with tariffs over de-dollarization attempts. What the CCP clearly understands is that the U.S. remains the single greatest obstacle to its global domination plan. By contrast, Europe has effectively neutralized itself through the consequences of mass migration and the self-sabotaging policies of woke liberal elites in Brussels. This is why the CCP has developed a dark new unconventional weapons platform system that is designed to achieve kinetic effects inside the U.S. that are traditionally associated with conventional warfare. Typical democrat run city, how can people vote for this, democrats do you really think this is helping these addicts? Look at all that democrat progress. These people need help, not free drugs and a place to be high until they die. pic.twitter.com/bNoh5QNLdp — Greg Dayoob 🇺🇲 (@CoachDayoob) August 10, 2025 The book China's Total War Strategy: Next-Generation Weapons of Mass Destruction - published by the CCP BioThreats Initiative and authored by Dr. Ryan Clarke, LJ Eads, Dr. Robert McCreight, and Dr. Xiaoxu Sean Lin - outlines how the CCP has been pursuing an aggressive, multifaceted \"total war\" against the U.S. that leverages next-generation weapons, including synthetic narcotics (e.g., fentanyl and cannabinoids), bioweapons (e.g., Covid-19), psychological manipulation and influence (e.g., TikTok), and a broad arsenal of irregular warfare tools. The authors describe this strategy as the CCP's \"assassin's mace\", an indirect, hybrid warfare doctrine designed to exploit U.S. vulnerabilities and collapse the nation from within. The results are already visible in the fentanyl epidemic and the broader drug crisis. Compounding the threat, as we must add, Democratic leadership in major U.S. cities has spent years refusing to enforce certain laws, defunding police, and allowing open-air drug markets. This has fueled a decade of decline, accelerating the spiral of America's urban centers into death and destruction from within, something President Trump and his 'America First' leadership in the White House no longer tolerate and called in federal troops to stop the death and destruction. The book is structured around several pillars of the CCP's irregular warfare techniques. It emphasizes asymmetric technologies (e.g., bioweapons, nanoweapons, electromagnetic systems), as well as the CCP's strategy that will undermine the U.S. from within. Here are those three pillars, plus the fourth pillar, which describes U.S. response options: Pillar One: The (Previously) Unsurfaced Revolution in Military Affairs – The Weaponization of Nature (Bioweapons, Nanoweapons, and (Bio) Chemical Weapons) This pillar details the CCP/PLA's acceleration of offensive biological, nano-, and chemical programs, often hidden in civilian research. Key points include: Post-COVID Bioweapons Expansion: Acceleration of programs at institutions like the Wuhan Institute of Virology (WIV), Harbin Veterinary Research Institute (HVRI), and Academy of Military Medical Sciences (AMMS). Involves gain-of-function (GoF) research, synthetic virus creation, and pathogen engineering, with networks linking civilian and military labs. The CCP has absorbed Western expertise, demonstrating willingness to sacrifice millions (e.g., during COVID-19) to protect regime interests. International Frontiers: Expansion into Pakistan via joint labs for high-risk pathogens, enhancing stealth and deniability. Synthetic Narcotics as Weapons: CCP-backed syndicates traffic fentanyl-like substances, targeting the Five Eyes Alliance (U.S., UK, Canada, Australia, New Zealand) with unique distribution patterns as a vectored threat. Nanoweapons Development: Invisible arsenals blending nanotechnology with biology/chemistry for targeted delivery, increasing stealth and origin obfuscation. Risks require multifaceted non-proliferation efforts. Dual-Use Virology and Nanotechnology: Advances in stealthy, point-of-origin-obscuring tech, including exponential increases in capabilities post-COVID. BGI Genomics Entanglements: Beijing Genomics Institute (BGI) linked to PLA for biosecurity, military applications, and ethical dilemmas. Research thrusts include genetic modification, therapies, pathogen identification, and data analytics—promising advancements but raising security concerns (e.g., military associations, data privacy). Chemical Defense Research: PLA's Research Institute of Chemical Defense focuses on guardians of \"invisible arsenals,\" advancing dual-use chemical weapons. The pillar warns of unreformable institutions (e.g., WIV, AMMS) due to decades of CCP control, PLA integration, and bioweapons focus. Pillar Two: Weaponizing New Energy and the Electromagnetic Spectrum (NeuroStrike, Scalar Waves, and EMP) Focuses on non-kinetic, cognitive-domain warfare using energy and electromagnetic tools. Key points: TikTok as Subversion Tool: U.S. operations involve psychological manipulation, shaping perceptions, and cognitive warfare to undermine unity. NeuroStrike Program: PLA's advanced psychological weapons target cognitive spaces, collapsing enemy resolve. Involves AI, brain-computer interfaces (BCIs), biological weapons, and tactics for precision targeting non-CCP intellectuals via social media. Cognitive Warfare Evolution: PLA emphasizes psychological resilience, embedding operations in modern conflict. Categories include military intimidation, bilateral influence, religious interference, and disinformation. Mirrors broader shifts to uncertainty/invisibility as threats. EMP Weapons: Rising threat of electromagnetic pulse (EMP) systems for grid disruption and global destabilization. Scalar Waves: Potentially globally destabilizing force, exploiting new energy domains for asymmetric advantage. This pillar highlights the PLA's integration of tech for \"next-generation warfare in the cognitive age,\" expanding combat into psychological dimensions. Pillar Three: Stealing for the Future – Western Subversion, Strategic IP Exfiltration, and (Dual-Use) Research for Next-Generation WMD Development Examines CCP's exploitation of Western institutions for technology transfer. Key points: Hypersonic Collaborations: Sino-American ties in aerodynamic frontiers, encompassing design to propulsion (e.g., scramjet tech). Talent Acquisition: Eastern Institute of Technology (Ningbo) recruits U.S. experts for dual-use advancements; generous policies (e.g., relocation subsidies up to 8 million RMB for top talents). 6G Ambitions: Purple Mountain Laboratories (Nanjing) leverages U.S. experts for global tech supremacy. Brain-Inspired AI: McGovern Institute's PLA engagements in neuroscience research. International Academic Ties: Collaborations between ETH Zurich/University of Toronto and PLA/Chinese defense academia, facilitating IP exfiltration. Chip Alliance Circumvention: Maneuvers by China (and Russia) to bypass the Chip Four Alliance (U.S., Japan, South Korea, Taiwan) plus the Netherlands, targeting semiconductors. The pillar stresses challenges in navigating global tech supremacy, intellectual property theft, and infiltration of U.S./Allied institutions. Pillar Four: Strategic Offense and Collapsing Threat Networks – Response Options for Rapidly Accelerating CCP WMD Programs Outlines countermeasures amid CCP regime collapse scenarios. Key points: National Biodefense Strategy: Forging a coherent \"malevolent matrix\" to address biothreats, emphasizing precision targeting. Targeting Bioweapons Facilities: Post-CCP collapse options include ground entry/occupation (U.S. Army-led), air/missile strikes (U.S. Air Force/Navy), or unconventional operations (CIA-led with State/Treasury/Commerce support). Destruction is deemed the only viable path, with surveillance to prevent reconstitution. Global Threat Assessment: CCP's total war strategy post-2025 involves convergent WMD (nano-, bio-, chemical, directed energy), academic subversion, and non-kinetic shifts (neuroscience, scalar). Echoes classical strategies for indirect dominance, undermining Western infrastructure, morale, and cohesion. Focusing on the pillars above and the dilemmas and threats post-2025 - especially in the 2030s as the world fractures deeper into a bi-polar state, it describes ongoing infiltration, subversion, espionage, and exploitation through irregular warfare techinques, mainly though the exploitation of Western openness, particularly in academia, technology, and media, to erode U.S. advantages without direct kinetic conflict. This means CCP is already degrading America from within - and not through a fight in the Pacific or launching hypersonic gliders at the U.S. West Coast. This begs the question about Trump's $175 billion Golden Dome, how will missile interceptors stop the drug death crisis, TikTok brain rot, color revolutions in city streets (think billionaire Neville Roy Singham's far-left Marxist NGO network), and other irregular warfare techniques? We must come to terms with the fight that is already here. Tyler Durden Sat, 08/16/2025 - 13:25",
    "publishedAt": "2025-08-16T17:25:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "16e16b34"
  },
  {
    "id": "ndtv-profit-rss-39fc56ee",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Foreign Secretary Vikram Misri To Visit Nepal On Sunday",
    "url": "https://www.ndtvprofit.com/nation/foreign-secretary-vikram-misri-to-visit-nepal-on-sunday",
    "summary": "The foreign secretary of India, who is visiting Nepal at the invitation of his Nepalese counterpart Amrit Bahadur Rai, will also meet Foreign Minister Arzu Rana Deuba.",
    "fullContent": "The foreign secretary of India, who is visiting Nepal at the invitation of his Nepalese counterpart Amrit Bahadur Rai, will also meet Foreign Minister Arzu Rana Deuba.",
    "publishedAt": "2025-08-16T17:24:26.692Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39fc56ee"
  },
  {
    "id": "bloomberg-politics-6edc8f9b",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "France Says Citizen Detained in Mali Coup Plot Is Embassy Worker",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/france-says-citizen-detained-in-mali-coup-plot-is-embassy-worker",
    "summary": "A French national detained in Mali on accusations of plotting against the junta is a member of the French Embassy in Bamako, France’s Foreign Ministry said on Saturday.",
    "fullContent": "A French national detained in Mali on accusations of plotting against the junta is a member of the French Embassy in Bamako, France’s Foreign Ministry said on Saturday.",
    "publishedAt": "2025-08-16T17:21:10.000Z",
    "fetchedAt": "2025-08-17T02:34:42.475Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6edc8f9b"
  },
  {
    "id": "ndtv-profit-rss-49b748c7",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Air India Express Flight Fails To Land In First Attempt At Gwalior Airport; Touches Down Safely Later",
    "url": "https://www.ndtvprofit.com/nation/air-india-express-flight-fails-to-land-in-first-attempt-at-gwalior-airport-touches-down-safely-later",
    "summary": "The airline said the flight 'conducted a go-around followed by a safe and uneventful landing'.",
    "fullContent": "The airline said the flight 'conducted a go-around followed by a safe and uneventful landing'.",
    "publishedAt": "2025-08-16T17:20:06.194Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49b748c7"
  },
  {
    "id": "bloomberg-markets-203eb6c",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Echo Investment Unit Inks €565 Million Polish Real Estate Sale",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/echo-investment-unit-inks-565-million-polish-real-estate-sale",
    "summary": "A Polish residential rental provider Resi4Rent, partly owned by Echo Investment, agreed to sell some real estate assets to TAG Immobilien’s unit for €565 million ($660 million).",
    "fullContent": "A Polish residential rental provider Resi4Rent, partly owned by Echo Investment, agreed to sell some real estate assets to TAG Immobilien’s unit for €565 million ($660 million).",
    "publishedAt": "2025-08-16T17:14:33.000Z",
    "fetchedAt": "2025-08-17T02:34:42.001Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "203eb6c"
  },
  {
    "id": "ndtv-profit-rss-623410c9",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "No Need For Reading Glasses? Vizz Eye Drop That Improves Near Vision Has FDA Nod",
    "url": "https://www.ndtvprofit.com/trending/no-need-for-reading-glasses-vizz-eye-drop-that-improves-near-vision-has-fda-nod",
    "summary": "The US FDA approval of Vizz was based on results from three randomised, double-masked, controlled Phase 3 studies.",
    "fullContent": "The US FDA approval of Vizz was based on results from three randomised, double-masked, controlled Phase 3 studies.",
    "publishedAt": "2025-08-16T17:13:36.116Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "623410c9"
  },
  {
    "id": "ndtv-profit-youtube-715e54c1",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "'Will Do If...': Trump's Big Claim On 'India-Russia Oil' Deal; Hints At Harsher Sanctions",
    "url": "https://www.youtube.com/watch?v=sTx3rQQLvxA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T17:03:37.000Z",
    "fetchedAt": "2025-08-17T02:34:51.939Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "715e54c1"
  },
  {
    "id": "marketwatch-fcadfe1",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "What is the worst financial mistake you&#x2019;ve ever made?",
    "url": "https://www.marketwatch.com/story/what-is-the-worst-financial-decision-youve-ever-made-02314556?mod=mw_rss_topstories",
    "summary": "Listening without prejudice to people&#x2019;s worst financial decisions may be helpful in helping you to avoid the same fate.",
    "fullContent": "Listening without prejudice to people&#x2019;s worst financial decisions may be helpful in helping you to avoid the same fate.",
    "publishedAt": "2025-08-16T17:01:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "fcadfe1"
  },
  {
    "id": "oil-price-746d539",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Renewable Energy Faces a Looming Workforce Crisis",
    "url": "https://oilprice.com/Alternative-Energy/Renewable-Energy/Renewable-Energy-Faces-a-Looming-Workforce-Crisis.html",
    "summary": "Despite a discouraging political climate and unprecedented uncertainty in the United States clean energy sector, low costs of wind and solar energy continue to drive growth of the domestic clean energy sector.",
    "fullContent": "Despite a discouraging political climate and unprecedented uncertainty in the United States clean energy sector, low costs of wind and solar energy continue to drive growth of the domestic clean energy sector. However, while market forces continue to support the expansion of renewable energy capacity, the sector faces critical challenges extending beyond the antagonism of the Trump administration. The continued growth of solar and wind power risks being hampered by several mitigating factors, including (but not limited to) intensifying competition…",
    "publishedAt": "2025-08-16T17:00:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.066Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "746d539"
  },
  {
    "id": "business-insider-7f3c9fb2",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I started a business at 14. Thanks to it, I was able to take my cousins on an all-expenses-paid trip to Disney World.",
    "url": "https://www.businessinsider.com/budget-less-trip-disney-world-business-viral-2025-8",
    "summary": "Aaliyah Arnold's company went viral in 2022. Now at age 21, she was able to take her cousins — who had never flown before — to Disney World.",
    "fullContent": "Aaliyah Arnold's company went viral in 2022. Now at age 21, she was able to take her cousins — who had never flown before — to Disney World.",
    "publishedAt": "2025-08-16T16:57:01.000Z",
    "fetchedAt": "2025-08-17T02:34:42.451Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7f3c9fb2"
  },
  {
    "id": "marketwatch-26bbe2be",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x2018;She has no immediate family&#x2019;: Will my mother receive the contents of my aunt&#x2019;s safe-deposit box after she dies?",
    "url": "https://www.marketwatch.com/story/i-personally-dont-care-about-her-money-what-happens-to-my-aunts-safe-deposit-box-after-she-dies-e35546ad?mod=mw_rss_topstories",
    "summary": "&#x201c;I am asking for my mom, who is on a fixed income. It would be a nice boon.&#x201d;",
    "fullContent": "&#x201c;I am asking for my mom, who is on a fixed income. It would be a nice boon.&#x201d;",
    "publishedAt": "2025-08-16T16:57:00.000Z",
    "fetchedAt": "2025-08-17T02:34:44.966Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "26bbe2be"
  },
  {
    "id": "zerohedge-109c5ce6",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Florida Highway Horror: Migrant Truck Driver Leaves 3 Americans Dead Amid CDL Crisis",
    "url": "https://www.zerohedge.com/political/florida-highway-horror-migrant-truck-driver-leaves-3-americans-dead-amid-cdl-crisis",
    "summary": "Florida Highway Horror: Migrant Truck Driver Leaves 3 Americans Dead Amid CDL Crisis Submitted by American Truckers United, In yet another tragic incident underscoring the dangers on America's highways, a Punjabi migrant truck driver allegedly executed an illegal U-turn on...",
    "fullContent": "Florida Highway Horror: Migrant Truck Driver Leaves 3 Americans Dead Amid CDL Crisis Submitted by American Truckers United, In yet another tragic incident underscoring the dangers on America's highways, a Punjabi migrant truck driver allegedly executed an illegal U-turn on Florida's Turnpike near Fort Pierce on August 12, resulting in a catastrophic collision that killed three innocent Americans. The semi-truck, attempting the prohibited maneuver in an \"official use only\" area, was struck by a minivan carrying a 30-year-old driver from Pompano Beach and his passengers—a 37-year-old woman and a 54-year-old man from Miami. All three perished, with two dying at the scene and the driver succumbing later in the hospital. Video footage captured the horrifying moment, showing the 18-wheeler blocking lanes and causing the fatal impact. The driver, reportedly an Indian migrant suspected of being part of a California Eco-System that exploits cheap labor, walked away uninjured. This crash mirrors a disturbing trend we've repeatedly highlighted: untrained migrant drivers flooding U.S. highways, leading to preventable deaths. As American Truckers United has warned in previous reports, the Biden-era surge in foreign and non-domiciled CDLs has turned interstates into killing fields. From the deadly pileups in Austin, Terrell, Thomasville, and Chattanooga involving suspected non-citizen truckers, to cargo thefts by \"ghost carriers,\" these incidents are no coincidence. We've urged Transportation Secretary Duffy to ban CDLs issued to non-citizens and probe these threats, but inaction persists amid record migrant influxes into the industry. This Florida tragedy, involving a California-based trucking profile from this cheap labor ecosystem, fits the exact mold: reckless actions by undertrained foreigners endangering American lives. Multilingual signs at Walmart and Amazon depots signal the scale, yet mom-and-pop U.S. truckers face bankruptcy while migrants fuel fraud and fatalities.\" For the edification of the group, here are the most common last names of trucking companies started since 2018. pic.twitter.com/IPz80w3H30 — may be danielle 💻🚛🇺🇸 (@maybedanielleee) August 16, 2025 How many more Americans must die before we secure our highways? American Truckers United demands immediate federal intervention to halt this national security nightmare. The American Trucking Industry has been gutted by unregulated immigration over the past five years. These “California ” drivers are part of an eco system that puts profit over safety. That puts greed before your family. A system that not only doesn’t put Americans first but… pic.twitter.com/HZBXWg0eck — American Truckers 🚛🦅 (@atutruckers) August 16, 2025 Time to demand action! Tyler Durden Sat, 08/16/2025 - 12:50",
    "publishedAt": "2025-08-16T16:50:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.147Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "109c5ce6"
  },
  {
    "id": "ndtv-profit-rss-433266f5",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "US Negotiators' Aug. 25 Visit To New Delhi For Trade Talks Called Off; To Be Rescheduled",
    "url": "https://www.ndtvprofit.com/economy-finance/us-negotiators-aug-25-visit-to-new-delhi-for-trade-talks-called-off",
    "summary": "This round of trade talks was much anticipated, given that it was scheduled ahead of the imposition of additional 25% tariffs on India.",
    "fullContent": "This round of trade talks was much anticipated, given that it was scheduled ahead of the imposition of additional 25% tariffs on India.",
    "publishedAt": "2025-08-16T16:46:36.436Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "433266f5"
  },
  {
    "id": "techmeme-58ac991e",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Global smart glasses shipments grew 110% YoY in H1; Meta's share of the market rose to 73%; AI smart glasses accounted for 78% of shipments, up from 46% YoY (Counterpoint Research)",
    "url": "http://www.techmeme.com/250816/p13#a250816p13",
    "summary": "Counterpoint Research: Global smart glasses shipments grew 110% YoY in H1; Meta's share of the market rose to 73%; AI smart glasses accounted for 78% of shipments, up from 46% YoY — - The global smart glasses market grew by 110% YoY in H1 2025, fueled by robust demand for...",
    "fullContent": "Counterpoint Research: Global smart glasses shipments grew 110% YoY in H1; Meta's share of the market rose to 73%; AI smart glasses accounted for 78% of shipments, up from 46% YoY — - The global smart glasses market grew by 110% YoY in H1 2025, fueled by robust demand for Ray-Ban Meta Smart Glasses and the entry &hellip;",
    "publishedAt": "2025-08-16T16:40:01.000Z",
    "fetchedAt": "2025-08-17T02:34:44.663Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "58ac991e"
  },
  {
    "id": "cnbc-markets-15835b81",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Why Wall Street kept sending the S&P 500, Nasdaq to fresh records this week",
    "url": "https://www.cnbc.com/2025/08/16/why-wall-street-kept-sending-the-sp-500-nasdaq-to-fresh-records-this-week-.html",
    "summary": "Wall Street speculated on how a spate of economic data would impact the Federal Reserve's next interest rate decision.",
    "fullContent": "Wall Street speculated on how a spate of economic data would impact the Federal Reserve's next interest rate decision.",
    "publishedAt": "2025-08-16T16:37:52.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15835b81"
  },
  {
    "id": "thehindubusinessline-290ced12",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Air Canada grounds flights as flight attendants go on strike",
    "url": "https://www.thehindubusinessline.com/news/world/air-canada-grounds-flights-as-flight-attendants-go-on-strike/article69941605.ece",
    "summary": "About 10,000 flight attendants walked off the job early Saturday after pay talks between the Canadian Union of Public Employees and the country’s biggest airline fell through.",
    "fullContent": "About 10,000 flight attendants walked off the job early Saturday after pay talks between the Canadian Union of Public Employees and the country’s biggest airline fell through",
    "publishedAt": "2025-08-16T16:31:13.000Z",
    "fetchedAt": "2025-08-17T02:34:42.642Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "290ced12"
  },
  {
    "id": "ndtv-profit-rss-454acd64",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Trump-Putin Summit Falls Short Of Achieving Ceasefire In Ukraine — Key Highlights",
    "url": "https://www.ndtvprofit.com/world/donald-trump-vladimir-putin-meeting-live-updates-coverage-anchorage-alaska-summit-india-oil-impact-us-russia-ukraine-zelensky",
    "summary": "\"The way forward can only be through dialogue and diplomacy. The world wants to see an early end to the conflict in Ukraine,\" India's Ministry of External Affairs said.",
    "fullContent": "\"The way forward can only be through dialogue and diplomacy. The world wants to see an early end to the conflict in Ukraine,\" India's Ministry of External Affairs said.",
    "publishedAt": "2025-08-16T16:28:51.211Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "454acd64"
  },
  {
    "id": "ndtv-profit-rss-1fa79f6a",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Samsung Expanding Manufacturing Portfolio In India: Ashwini Vaishnaw",
    "url": "https://www.ndtvprofit.com/business/samsung-expanding-manufacturing-portfolio-in-india-ashwini-vaishnaw",
    "summary": "Earlier this year, Samsung Electronics President and Head of Mobile eXperience (MX) Business TM Roh had said the company is preparing for manufacturing laptops in India.",
    "fullContent": "Earlier this year, Samsung Electronics President and Head of Mobile eXperience (MX) Business TM Roh had said the company is preparing for manufacturing laptops in India.",
    "publishedAt": "2025-08-16T16:23:12.764Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1fa79f6a"
  },
  {
    "id": "ndtv-profit-rss-790ec1e5",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "India, South Korea Resolve To Set 'New Industrial Ambition' In High-Tech Sectors",
    "url": "https://www.ndtvprofit.com/business/india-south-korea-resolve-to-set-new-industrial-ambition-in-high-tech-sectors",
    "summary": "Ways to ramp up the overall bilateral cooperation figured prominently in talks between External Affairs Minister S Jaishankar and his visiting South Korean counterpart, Cho Hyun.",
    "fullContent": "Ways to ramp up the overall bilateral cooperation figured prominently in talks between External Affairs Minister S Jaishankar and his visiting South Korean counterpart, Cho Hyun.",
    "publishedAt": "2025-08-16T16:22:28.708Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "790ec1e5"
  },
  {
    "id": "business-insider-2d652e5e",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Here's why Google might have to sell Chrome, and which companies want to buy it",
    "url": "https://www.businessinsider.com/chrome-buyers-web-browser-google-antitrust-case-search-perplexity-yahoo-2025-8",
    "summary": "A judge will soon decide if Google must sell Chrome to remedy its antitrust case. Competitors like Perplexity have already expressed interest.",
    "fullContent": "A judge will soon decide if Google must sell Chrome to remedy its antitrust case. Competitors like Perplexity have already expressed interest.",
    "publishedAt": "2025-08-16T16:16:44.000Z",
    "fetchedAt": "2025-08-17T02:34:42.451Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2d652e5e"
  },
  {
    "id": "zerohedge-75dc2a3c",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Watch: Hellfire Missile Launcher Hidden Inside Civilian Box Truck",
    "url": "https://www.zerohedge.com/military/hellfire-missile-launcher-hidden-inside-civilian-box-truck",
    "summary": "Watch: Hellfire Missile Launcher Hidden Inside Civilian Box Truck Concealing missile and rocket artillery launchers, or even swarms of kamikaze drones, inside civilian-style trucks and shipping containers fits directly into next-generation warfare, especially under the...",
    "fullContent": "Watch: Hellfire Missile Launcher Hidden Inside Civilian Box Truck Concealing missile and rocket artillery launchers, or even swarms of kamikaze drones, inside civilian-style trucks and shipping containers fits directly into next-generation warfare, especially under the umbrella of deception and the ability to distribute lethality in plain sight. The latest setup to pique our interest is a truck-mounted launch system for AGM-114 Hellfire missiles, developed by the 209th Arsenal, a production facility within Taiwan's Armaments Bureau under the Ministry of National Defense. According to military blog The War Zone, the twin-rail Hellfire launcher inside the bed of a box truck has a roof-mounted sensor mast that carries a small radar and an electro-optical/infrared sensor turret. The system can fire laser-guided Hellfires and radar-guided AGM-114L Longbows. Video of the box truck with missiles in the rear first appeared on the Military News Agency's YouTube page on Thursday, in a short feature from Taiwan's Ministry of National Defense showcasing the latest military technology. TWZ noted, \"Missile and rocket artillery launchers hidden in plain sight inside civilian-style trucks, as well as unassuming shipping containers, have become something of a trend globally in recent years. China, Iran, North Korea, Russia, and even the United States have all been developing and/or fielding systems that fall into these categories,\" adding, \"Terrorists and other non-state actors have also employed improvised concealed launch systems over the years.\" Which brings us to the other side of the world, where Ukraine recently launched a brazen drone swarm attack deep inside Russia using shipping containers packed with armed drones. These containers were hidden in plain sight, allowing the drones, armed with mini warheads, to penetrate far into Russian territory and strike Moscow's fleet of long-range bombers, damaging several. We found a warehouse where containers with drones were collected. Chelyabinsk, Sverdlovsk tract 28A. It was rented for 350,000 rubles. That's why the truck in the Amur region had Chelyabinsk license plates - they were leaving from there. pic.twitter.com/rf5DJy8RDa — Elizaveta Igorevna 🇷🇺 🇷🇺 (@ElisaIgorevna) June 1, 2025 Ukraine just mounted an attack that marks a turning point in the history of warfare Hundreds of drones were pre-deployed and then struck 40+ aircraft 1000+ km inside of Russia $1B in damage by Critical infra is no longer safepic.twitter.com/qaPS3oKD1Y — Shaun Maguire (@shaunmmaguire) June 1, 2025 The bigger picture here is that militaries are disguising weapon systems as ordinary vehicles, shipping containers, and likely other in-plain-sight platforms that can bypass traditional countermeasures. This points to a very dangerous world ahead of the 2030s, one we would characterize as a high-threat environment. Tyler Durden Sat, 08/16/2025 - 12:15",
    "publishedAt": "2025-08-16T16:15:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.147Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "75dc2a3c"
  },
  {
    "id": "thehindubusinessline-39b91681",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "'Next Gen GST' precursor to eventual single tax slab GST: Centre",
    "url": "https://www.thehindubusinessline.com/economy/next-gen-gst-precursor-to-eventual-single-tax-slab-gst-centre/article69941558.ece",
    "summary": "They said the proposed new GST regime, which slashes tax rates and assigns just two slabs of 5% and 18%, will boost the economy and also serve to mitigate tariff threats.",
    "fullContent": "They said the proposed new GST regime, which slashes tax rates and assigns just two slabs of 5% and 18%, will boost the economy and also serve to mitigate tariff threats",
    "publishedAt": "2025-08-16T16:14:59.000Z",
    "fetchedAt": "2025-08-17T02:34:42.642Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39b91681"
  },
  {
    "id": "thehindubusinessline-103eb1",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Kerala goes all out to make State safe for women travellers",
    "url": "https://www.thehindubusinessline.com/news/variety/kerala-goes-all-out-to-make-state-safe-for-women-travellers/article69941483.ece",
    "summary": "The State is also leveraging its green credentials to position itself as a wedding and MICE destination.",
    "fullContent": "The State is also leveraging its green credentials to position itself as a wedding and MICE destination",
    "publishedAt": "2025-08-16T16:09:23.000Z",
    "fetchedAt": "2025-08-17T02:34:42.643Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "103eb1"
  },
  {
    "id": "thehindubusinessline-1f37a9e9",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Trump sets Up Zelenskiy meeting after Putin renews land demands",
    "url": "https://www.thehindubusinessline.com/news/world/trump-sets-up-zelenskiy-meeting-after-putin-renews-land-demands/article69941520.ece",
    "summary": "They spoke as Trump flew back from Friday’s high-profile summit with Putin in Alaska, which failed to deliver a path to end the war, currently in its fourth year.",
    "fullContent": "They spoke as Trump flew back from Friday’s high-profile summit with Putin in Alaska, which failed to deliver a path to end the war, currently in its fourth year",
    "publishedAt": "2025-08-16T16:08:53.000Z",
    "fetchedAt": "2025-08-17T02:34:42.643Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1f37a9e9"
  },
  {
    "id": "ndtv-profit-rss-30515a9b",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Ukraine’s Allies Plan Talks Before Zelenskiy’s Washington Trip",
    "url": "https://www.ndtvprofit.com/world/ukraines-allies-plan-talks-before-zelenskiys-washington-trip",
    "summary": "The Coalition of the Willing will hold a video call, the Elysee said.",
    "fullContent": "The Coalition of the Willing will hold a video call, the Elysee said.",
    "publishedAt": "2025-08-16T16:05:58.498Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "30515a9b"
  },
  {
    "id": "marginal-revolution-59f0902b",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "Saturday assorted links",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/saturday-assorted-links-523.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=saturday-assorted-links-523",
    "summary": "1. Ten year old Indian girl beats grandmaster in chess. 2. Low birthrates today forecast low house price appreciation in the future. 3. Dubov on working with Magnus (subtitles in English). 4. One hypothesis about the best news in America right now. 5.",
    "fullContent": "1. Ten year old Indian girl beats grandmaster in chess. 2. Low birthrates today forecast low house price appreciation in the future. 3. Dubov on working with Magnus (subtitles in English). 4. One hypothesis about the best news in America right now. 5. TFR in Heilongjiang, Manchuria is about 0.52. 6. No, conscientiousness has not [&#8230;] The post Saturday assorted links appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-16T16:05:13.000Z",
    "fetchedAt": "2025-08-17T02:34:43.409Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "59f0902b"
  },
  {
    "id": "ndtv-profit-rss-431530c9",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Air Canada Grounds Flights As Flight Attendants Go On Strike",
    "url": "https://www.ndtvprofit.com/world/air-canada-grounds-flights-as-flight-attendants-go-on-strike",
    "summary": "Air Canada suspended operations of its main line and Rouge budget brand as the strike began at 12:58 a.m. New York time.",
    "fullContent": "Air Canada suspended operations of its main line and Rouge budget brand as the strike began at 12:58 a.m. New York time.",
    "publishedAt": "2025-08-16T16:04:43.625Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "431530c9"
  },
  {
    "id": "ndtv-profit-rss-7b8905a",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "IndiGo Aircraft Suffers Tail Strike While Landing At Mumbai Airport",
    "url": "https://www.ndtvprofit.com/nation/indigo-aircraft-suffers-tail-strike-while-landing-at-mumbai-airport",
    "summary": "The incident has prompted aviation safety regulator DGCA to order a probe.",
    "fullContent": "The incident has prompted aviation safety regulator DGCA to order a probe.",
    "publishedAt": "2025-08-16T16:02:33.832Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7b8905a"
  },
  {
    "id": "thehindubusinessline-3c76c4d2",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Low FII holdings mask selective sector buys",
    "url": "https://www.thehindubusinessline.com/portfolio/low-fii-holdings-mask-selective-sector-buys/article69941477.ece",
    "summary": "Within the Nifty-500 universe, FIIs increased their holdings in 9 out of 24 sectors year-on-year as of June quarter end.",
    "fullContent": "Within the Nifty-500 universe, FIIs increased their holdings in 9 out of 24 sectors year-on-year as of June quarter end",
    "publishedAt": "2025-08-16T16:00:42.000Z",
    "fetchedAt": "2025-08-17T02:34:42.643Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c76c4d2"
  },
  {
    "id": "cnbc-markets-606c8c65",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "41-year-old American lives on $3,633 a month in France: 'I wish I had the courage to move sooner'",
    "url": "https://www.cnbc.com/2025/08/16/41-year-old-american-moved-to-france-lives-on-3633-a-month.html",
    "summary": "Adriel Sanders worked as a lawyer in Washington D.C. for years before moving to Paris in 2020. She has no plans to return to live in the U.S.",
    "fullContent": "Adriel Sanders worked as a lawyer in Washington D.C. for years before moving to Paris in 2020. She has no plans to return to live in the U.S.",
    "publishedAt": "2025-08-16T16:00:01.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "606c8c65"
  },
  {
    "id": "thehindubusinessline-385fccaf",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Trump greets Putin with red carpet, Ukrainians feel betrayed",
    "url": "https://www.thehindubusinessline.com/news/world/trump-greets-putin-with-red-carpet-ukrainians-feel-betrayed/article69941407.ece",
    "summary": "Trump also ignored the arrest warrant issued for Putin by the International Criminal Court that has kept him mostly confined at home or in nations that are strong allies.",
    "fullContent": "Trump also ignored the arrest warrant issued for Putin by the International Criminal Court that has kept him mostly confined at home or in nations that are strong allies",
    "publishedAt": "2025-08-16T15:59:40.000Z",
    "fetchedAt": "2025-08-17T02:34:42.643Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "385fccaf"
  },
  {
    "id": "cnbc-markets-1177eea9",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Bill Gates meets Willy Wonka: How Epic's 82-year-old billionaire CEO, Judy Faulkner, built her software factory",
    "url": "https://www.cnbc.com/2025/08/16/how-epics-82-year-old-ceo-judy-faulkner-built-her-software-factory.html",
    "summary": "Judy Faulkner has run Epic Systems for 46 years and has a detailed plan for what happens when she's no longer the boss.",
    "fullContent": "Judy Faulkner has run Epic Systems for 46 years and has a detailed plan for what happens when she's no longer the boss.",
    "publishedAt": "2025-08-16T15:58:36.000Z",
    "fetchedAt": "2025-08-17T02:34:42.416Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1177eea9"
  },
  {
    "id": "thehindubusinessline-67eda603",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "IndiGo's Bangkok-Mumbai flight suffers tail strike; DGCA to order probe",
    "url": "https://www.thehindubusinessline.com/economy/logistics/indigos-bangkok-mumbai-flight-suffers-tail-strike-dgca-to-order-probe/article69941404.ece",
    "summary": "\"On August 16, an IndiGo Airbus A321 aircraft tail touched the runway while executing a low-altitude go-around due to unfavourable weather conditions in Mumbai,\" IndiGo spokesperson said.",
    "fullContent": "\"On August 16, an IndiGo Airbus A321 aircraft tail touched the runway while executing a low-altitude go-around due to unfavourable weather conditions in Mumbai,\" IndiGo spokesperson said",
    "publishedAt": "2025-08-16T15:56:46.000Z",
    "fetchedAt": "2025-08-17T02:34:42.643Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "67eda603"
  },
  {
    "id": "ndtv-profit-rss-7aeda1a1",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Vikram Solar IPO: Price Band, GMP, Financials — All You Need To Know",
    "url": "https://www.ndtvprofit.com/ipos/vikram-solar-ipo-price-band-gmp-financials-all-you-need-to-know",
    "summary": "Vikram Solar's IPO is a mix of a fresh issue of shares up to Rs 1,500 crore and an offer for sale worth Rs 579 crore.",
    "fullContent": "Vikram Solar's IPO is a mix of a fresh issue of shares up to Rs 1,500 crore and an offer for sale worth Rs 579 crore.",
    "publishedAt": "2025-08-16T15:54:07.497Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7aeda1a1"
  },
  {
    "id": "bloomberg-business-youtube-4fe41217",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Lamborghini says tariffs have caused prices to go up",
    "url": "https://www.youtube.com/watch?v=ttppM-2nPF0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T15:50:19.000Z",
    "fetchedAt": "2025-08-17T02:34:55.072Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4fe41217"
  },
  {
    "id": "bloomberg-business-youtube-32bfabd0",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Bentley Debuts Bentayga Speed SUV",
    "url": "https://www.youtube.com/watch?v=9GT8Abfo7v4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T15:47:26.000Z",
    "fetchedAt": "2025-08-17T02:34:55.072Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "32bfabd0"
  },
  {
    "id": "dwarkesh-patel-youtube-44ff8b12",
    "sourceId": "dwarkesh-patel-youtube",
    "sourceName": "Dwarkesh Patel YouTube",
    "title": "Environmental Laws Are Blocking Clean Energy",
    "url": "https://www.youtube.com/watch?v=wYHZNxNjPMI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T15:45:09.000Z",
    "fetchedAt": "2025-08-17T02:35:04.405Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "44ff8b12"
  },
  {
    "id": "zerohedge-744aeb34",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Boiled Frogs: AI Slop, Phishing, Deep-Fakes, & Spam, Spam, Spam",
    "url": "https://www.zerohedge.com/ai/boiled-frogs-ai-slop-phishing-deep-fakes-spam-spam-spam",
    "summary": "Boiled Frogs: AI Slop, Phishing, Deep-Fakes, & Spam, Spam, Spam Authored by Charles Hugh Smith via OfTwoMinds blog, We're frogs in a pot that's being heated so gradually that we no longer notice the sewage is extinguishing the utility of the Web.",
    "fullContent": "Boiled Frogs: AI Slop, Phishing, Deep-Fakes, & Spam, Spam, Spam Authored by Charles Hugh Smith via OfTwoMinds blog, We're frogs in a pot that's being heated so gradually that we no longer notice the sewage is extinguishing the utility of the Web. Let's take \"Show me the incentives, and I'll show you the outcome\" and direct it on the Internet, the digital realm that is now central to modern life The incentives are making money from attention, i.e. clicks, engagement, etc. by any means available, and a burgeoning universe of cons, deception, extortion and fraud. And with those incentives, the outcome is an ever-expanding river of toxic sewage, a river of AI slop, deep-fakes, phishing, clickbait and spam, spam, spam on every device, every platform, every screen. This is not inconsequential. A physician-correspondent recently reported that he was researching a cardiovascular condition online and realized the article he was reviewing was AI slop, a conglomeration of inaccurate diagrams and plausible-sounding nonsense slapped together to get whatever meager income would be generated by a modest number of views. That's the incentive the Big Tech platforms set up: since it's a low-odds gamble that any post will go viral on a large enough scale to make serious income, the incentive is to post 1,000 AI slop posts which each collect 1,000 views. In other words, make it up on volume. Since the Internet is global, people in low-income nations have an incentive to generate AI slop to earn what is a pittance in developed nations. The barrier to entry is low--anyone can produce veritable mountains of AI slop with free tools and low-cost bandwidth--and the gains, however modest, are welcome if paid work is scarce. The same \"make it up on volume\" approach incentivizes churning out millions of phishing and spam SMS, emails and posts on every platform under the sun. If there's only one sucker per 10,000 entreaties, then send out 10 million. Since views and engagement generate income, the more outrageous the clickbait, the better. And of course, the greater the volume of clickbait, the greater the income stream flowing to platforms hosting the clickbait. AI tools incentivize creating deep-fakes of celebrities' voices and personas which can then be deployed to con older Internet users who are often credulous enough to believe that yes, Owen Wilson is talking to me, see, it's him. Every legitimate institution is now a tripwire for phishing and spam. Your USPS package can't be delivered, here's your Social Security Statement, and so on. AI Search is broken, too. I couldn't find the original PropOrNot \"fake-news about fake-news\" list from 2016, and AI search concluded it was not available. Then a correspondent sent me a post on Zero Hedge which prominently displayed the entire original PropOrNot list. (oftwominds.com was on the list, thank you very much.) Washington Post Names Drudge, Zero Hedge, & Ron Paul As Anti-Clinton \"Sophisticated Russian Propaganda Tools\" (November 25, 2016) The burden of shadow work required to delete, unsubscribe and purge our lives of all this sewage is growing heavier by the day. This calls to mind the boiled-frog analogy: we're frogs in a pot that's being heated so gradually that we no longer notice the sewage is extinguishing the utility of the Web. And the reason is--drum roll--that's how everyone makes money: views, engagement, scams, cons, fraud and above all, sheer volume. And who makes money from volume? The Big Tech platforms. So what if it's misleading AI slop, deep-fake scams or clickbait, the more \"engagement\" we get, the more money we make. So where's the incentive to staunch the flood of sewage? There isn't one. The incentive is to shrug and let the user sort it out by burning their own time. If we want a different outcome, we have to change the incentives. * * * Check out my new book Ultra-Processed Life and my updated Books and Films. Become a $3/month patron of my work via patreon.com Subscribe to my Substack for free Tyler Durden Sat, 08/16/2025 - 11:40",
    "publishedAt": "2025-08-16T15:40:00.000Z",
    "fetchedAt": "2025-08-17T02:34:43.147Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "744aeb34"
  },
  {
    "id": "ndtv-profit-rss-78468cc9",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Gem Aromatics IPO: Issue Price, Price Band, Financials, Business — All You Need To Know",
    "url": "https://www.ndtvprofit.com/ipos/gem-aromatics-ipo-issue-price-price-band-financials-business-all-you-need-to-know",
    "summary": "Gem Aromatics IPO includes a fresh issue worth Rs 175 crore and OFS of Rs 276.25 crore.",
    "fullContent": "Gem Aromatics IPO includes a fresh issue worth Rs 175 crore and OFS of Rs 276.25 crore.",
    "publishedAt": "2025-08-16T15:35:55.980Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "78468cc9"
  },
  {
    "id": "fortune-156e1c49",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "The twisted economics of &#8216;RushTok&#8217;: Some sorority pledge influencers can pay their tuition, but they&#8217;re fleeing online hate and backlash",
    "url": "https://fortune.com/2025/08/16/what-is-rushtok-sorority-pledge-social-media-backlash/",
    "summary": "“This year it was just like a whole different level of hate,\" said Kylan Darnell, who became an overnight celebrity four years ago on social media.",
    "fullContent": "“This year it was just like a whole different level of hate,\" said Kylan Darnell, who became an overnight celebrity four years ago on social media.",
    "publishedAt": "2025-08-16T15:24:40.000Z",
    "fetchedAt": "2025-08-17T02:34:45.118Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "156e1c49"
  },
  {
    "id": "ndtv-profit-rss-6fc85ad9",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Earnestly Wish Friends In Ukraine Peace, Progress: PM Modi To Zelenskyy",
    "url": "https://www.ndtvprofit.com/nation/earnestly-wish-friends-in-ukraine-peace-progress-pm-modi-to-zelenskyy",
    "summary": "Wishing India on its Independence Day, Zelenskyy on Friday said he hoped New Delhi would contribute to efforts aimed at ending the war with Russia.",
    "fullContent": "Wishing India on its Independence Day, Zelenskyy on Friday said he hoped New Delhi would contribute to efforts aimed at ending the war with Russia.",
    "publishedAt": "2025-08-16T15:22:37.582Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6fc85ad9"
  },
  {
    "id": "ndtv-profit-rss-6437bc07",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Election Commission To Hold Press Conference On Sunday Amid Opposition Allegations",
    "url": "https://www.ndtvprofit.com/nation/election-commission-to-hold-press-conference-on-sunday-amid-opposition-allegations",
    "summary": "It is unusual for the poll authority to convene a formal press conference on issues other than announcing election schedules.",
    "fullContent": "It is unusual for the poll authority to convene a formal press conference on issues other than announcing election schedules.",
    "publishedAt": "2025-08-16T15:22:05.663Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6437bc07"
  },
  {
    "id": "nse-online-announcements-787d60ae",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Baweja Studios Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/PRIOR_INTIMATION_64485_1514031_16082025031819_WEB.xml",
    "summary": "BAWEJA STUDIOS LIMITED has informed the Exchange about Board Meeting to be held on 23-Aug-2025 to consider Other business. |SUBJECT: Board Meeting Intimation.",
    "fullContent": "BAWEJA STUDIOS LIMITED has informed the Exchange about Board Meeting to be held on 23-Aug-2025 to consider Other business. |SUBJECT: Board Meeting Intimation",
    "publishedAt": "2025-08-16T15:18:20.000Z",
    "fetchedAt": "2025-08-16T09:49:22.704Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "787d60ae"
  },
  {
    "id": "nse-online-announcements-39e8d8bb",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "DJ Mediaprint & Logistics Limited",
    "url": "https://nsearchives.nseindia.com/corporate/DJML_16082025151754_DJMLNP150825.pdf",
    "summary": "Dj Mediaprint & Logistics Limited has informed the Exchange about Copy of Newspaper Publication- UFR-Q1-FY 2025-26 |SUBJECT: Copy of Newspaper Publication.",
    "fullContent": "Dj Mediaprint & Logistics Limited has informed the Exchange about Copy of Newspaper Publication- UFR-Q1-FY 2025-26 |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-16T15:18:01.000Z",
    "fetchedAt": "2025-08-16T09:49:22.704Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "39e8d8bb"
  },
  {
    "id": "fortune-6e67fb35",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Judge sends singer Sean Kingston to jail for over 3 years: &#8216;He is a thief and a conman, plain and simple&#8217;",
    "url": "https://fortune.com/2025/08/16/sean-kingston-jail-sentence-wire-fraud-singer/",
    "summary": "Kingston and his mother, Janice Eleanor Turner, were convicted in March by a federal jury of conspiracy to commit wire fraud and four counts of wire fraud.",
    "fullContent": "Kingston and his mother, Janice Eleanor Turner, were convicted in March by a federal jury of conspiracy to commit wire fraud and four counts of wire fraud.",
    "publishedAt": "2025-08-16T15:18:01.000Z",
    "fetchedAt": "2025-08-17T02:34:45.118Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6e67fb35"
  },
  {
    "id": "nse-online-announcements-19c74644",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "TITAGARH RAIL SYSTEMS LIMITED",
    "url": "https://nsearchives.nseindia.com/corporate/TWL_16082025151527_IntimationtoSEAnalystMeet16082025.pdf",
    "summary": "TITAGARH RAIL SYSTEMS LIMITED has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "TITAGARH RAIL SYSTEMS LIMITED has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-16T15:15:54.000Z",
    "fetchedAt": "2025-08-16T09:49:22.704Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "19c74644"
  },
  {
    "id": "nse-online-announcements-478c2ba1",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "India Nippon Electricals Limited",
    "url": "https://nsearchives.nseindia.com/corporate/INDNIPPON2_16082025151518_Newspaperpublication.pdf",
    "summary": "India Nippon Electricals Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication.",
    "fullContent": "India Nippon Electricals Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-16T15:15:37.000Z",
    "fetchedAt": "2025-08-16T09:49:22.704Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "478c2ba1"
  },
  {
    "id": "ndtv-profit-rss-20e667c7",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Dwarka Expressway, UER-II Opens Sunday: PM Modi To Inaugurate Rs 11,000 Crore Project — Details Here",
    "url": "https://www.ndtvprofit.com/nation/dwarka-expressway-uer-ii-opens-sunday-pm-modi-to-inaugurate-rs-11000-crore-project-details-here",
    "summary": "The new stretches have been developed under the comprehensive plan to decongest the national capital, the Prime Minister's Office said.",
    "fullContent": "The new stretches have been developed under the comprehensive plan to decongest the national capital, the Prime Minister's Office said.",
    "publishedAt": "2025-08-16T15:15:34.200Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "20e667c7"
  },
  {
    "id": "nse-online-announcements-126e0152",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Vasa Denticity Limited",
    "url": "https://nsearchives.nseindia.com/corporate/VASADENTICITY_16082025151424_Revised_Outcome_of_Board_Meeting.pdf",
    "summary": "Vasa Denticity Limited has informed the Exchange regarding Outcome of Board Meeting held on August 01, 2025. |SUBJECT: Outcome of Board Meeting.",
    "fullContent": "Vasa Denticity Limited has informed the Exchange regarding Outcome of Board Meeting held on August 01, 2025. |SUBJECT: Outcome of Board Meeting",
    "publishedAt": "2025-08-16T15:14:46.000Z",
    "fetchedAt": "2025-08-16T09:49:22.704Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "126e0152"
  },
  {
    "id": "nse-online-announcements-721af0c2",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Modern Threads (India) Limited",
    "url": "https://nsearchives.nseindia.com/corporate/MODTHREAD_16082025151429_Newspaper_Publication.pdf",
    "summary": "Pursuant to Regulation 47 and 30 of the SEBI (Listing Obligations and Disclosure Requirement) Regulations, 2015, as amended, please find enclosed herewith copies of the newspaper publications pertaining to the extract of standalone Un-audited Financial Results of the Company...",
    "fullContent": "Pursuant to Regulation 47 and 30 of the SEBI (Listing Obligations and Disclosure Requirement) Regulations, 2015, as amended, please find enclosed herewith copies of the newspaper publications pertaining to the extract of standalone Un-audited Financial Results of the Company for the quarter ended 30th June, 2025. The Un-audited financial results was approved in the Board Meeting held on 14th August, 2025. |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-16T15:14:41.000Z",
    "fetchedAt": "2025-08-16T09:49:22.704Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "721af0c2"
  },
  {
    "id": "ndtv-profit-rss-64749e15",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Q1 Results Review: Earnings Cuts Moderating, Says Motilal Oswal; Sees Nifty 50 EPS Growth At 9% In FY26",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/q1-results-review-earnings-cuts-moderating-says-motilal-oswal-sees-nifty-50-eps-growth-at-9-in-fy26",
    "summary": "The EPS growth will be aided by a likely improvement in the macro environment owing to the stimulative fiscal and monetary measures, Motilal Oswal said.",
    "fullContent": "The EPS growth will be aided by a likely improvement in the macro environment owing to the stimulative fiscal and monetary measures, Motilal Oswal said.",
    "publishedAt": "2025-08-16T15:09:12.193Z",
    "fetchedAt": "2025-08-17T02:34:44.786Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "64749e15"
  },
  {
    "id": "thehindubusinessline-39e152bf",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "CreditAccess Grameen, Spandana Sphoorty, Fusion Finance, Satin Creditcare, Ujjivan SFB et al: Are microfinance lenders out of the woods yet?",
    "url": "https://www.thehindubusinessline.com/portfolio/big-story/creditaccess-grameen-spandana-sphoorty-fusion-finance-satin-creditcare-ujjivan-sfb-et-al-are-microfinance-lenders-out-of-the-woods-yet/article69937429.ece",
    "summary": "Q1 FY26 marks the beginning of a gradual recovery for microfinance players, the sustenance of which remains to be seen.",
    "fullContent": "Q1 FY26 marks the beginning of a gradual recovery for microfinance players, the sustenance of which remains to be seen",
    "publishedAt": "2025-08-16T15:08:22.000Z",
    "fetchedAt": "2025-08-17T02:34:42.643Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39e152bf"
  }
]