[
  {
    "id": "bloomberg-business-youtube-11b498a7",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "US Stocks Slide as Trump, Putin Hold High-Stakes Talks | The Close 8/15/2025",
    "url": "https://www.youtube.com/watch?v=HoGTCokV6i4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:04:14.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "11b498a7"
  },
  {
    "id": "cnbc-tv18-youtube-2429fa89",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Top News LIVE: 16 August की खबरें| Trump - Putin Meeting | Modi | Janmashtami | War | Russia Ukraine",
    "url": "https://www.youtube.com/watch?v=2j4kdywDddk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:57:28.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2429fa89"
  },
  {
    "id": "cnbc-tv18-youtube-121ebc5e",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Trump Putin Meeting LIVE:Alkasha में पुतिन और ट्रंप के बीच हुई Meeting, संघर्ष विराम पर नहीं बनी बात",
    "url": "https://www.youtube.com/watch?v=N8WncxK9GLs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:54:27.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "121ebc5e"
  },
  {
    "id": "bloomberg-business-youtube-df836a4",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Says ‘No Deal’ Yet in ‘Productive’ Talks With Putin",
    "url": "https://www.youtube.com/watch?v=d4exNTjLONY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:41:58.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "df836a4"
  },
  {
    "id": "zerohedge-5941e79a",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Hezbollah Chief Threatens 'No Life In Lebanon' If Government Moves To Disarm It",
    "url": "https://www.zerohedge.com/geopolitical/hezbollah-chief-threatens-no-life-lebanon-if-government-moves-disarm-it",
    "summary": "Hezbollah Chief Threatens 'No Life In Lebanon' If Government Moves To Disarm It Hezbollah leader Naim Qassem has warned that if the Lebanese government moves to disarm Hezbollah, which is the large Shia militia group backed by Iran, then the whole country will suffer...",
    "fullContent": "Hezbollah Chief Threatens 'No Life In Lebanon' If Government Moves To Disarm It Hezbollah leader Naim Qassem has warned that if the Lebanese government moves to disarm Hezbollah, which is the large Shia militia group backed by Iran, then the whole country will suffer destabilization, death, and destruction. He claimed that there would be \"no life in Lebanon\" should its weapons be taken by force - which brings to mind the mass death and destruction the country experienced during the prior two-decade long Lebanese civil war of the end of the 20th century. Via AFP The United States has long exerted immense pressure on the Lebanese government of President Joseph Aoun to take away Hezbollah's weapons. These pressures have amplified in the wake of the recent Israel-Lebanon war, which subsided due to a fragile truce. This is why Qassem has accused the Lebanese government of in essence \"implementing an American-Israeli order to end the resistance, even if it leads to civil war and internal strife.\" \"The resistance will not surrender its weapons while aggression continues, occupation persists, and we will fight it… if necessary to confront this American-Israeli project no matter the cost,\" he continued, warning the government \"not to hand over the country to an insatiable Israeli aggressor or an American tyrant with limitless greed.\" Without doubt, Hezbollah has been immensely weakened since last year's assassination of longtime leader Hassan Nasrallah - and the killings of many other top and mid-level leaders. Hezbollah's abiding by the ceasefire with Israel is a reflection of this. However, the last year has seen sporadic airstrikes on southern Lebanon by Israel. The fall of Assad in Syria last December has also greatly weakened Hezbollah. Still, the group remains the single most well-armed and militarily powerful entity in the Lebanese state. It is actually stronger that the Lebanese Army. So if there is a big move to disarm Hezbollah, there's a likelihood that indeed the whole state would unravel - also at a moment the country has been experience economic collapse, and destruction due to recent Israeli bombings. The general view among regional analysts is that Hezbollah, representing the 'Shia axis', has ultimately lost at this point. This is also underscored in the fact that the Israeli army is now occupying large swathes of southern Syria - perhaps less than a dozen miles from the outskirts of Damascus. Tyler Durden Fri, 08/15/2025 - 19:40",
    "publishedAt": "2025-08-15T23:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.086Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5941e79a"
  },
  {
    "id": "bloomberg-business-youtube-381cc9e0",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Does Apple risk falling behind on AI? #shorts #apple #artificialintelligence #china",
    "url": "https://www.youtube.com/shorts/zwaA-z20ALk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:38:06.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "381cc9e0"
  },
  {
    "id": "the-verge-66cef59a",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Laura Loomer and the limits of posting everything",
    "url": "https://www.theverge.com/politics/760269/laura-loomer-deposition",
    "summary": "For all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc.",
    "fullContent": "For all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc. But the fact remains that she's the influencer responsible for getting Donald [&#8230;]",
    "publishedAt": "2025-08-15T23:36:49.000Z",
    "fetchedAt": "2025-08-16T02:22:49.376Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "66cef59a"
  },
  {
    "id": "bloomberg-business-youtube-127e88ae",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Jackson Hole Preview, Apple's AI Ambitions, Rule of Law, New Housing Investors | Wall Street Week",
    "url": "https://www.youtube.com/watch?v=fdp_gyyYfjQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:31:20.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "127e88ae"
  },
  {
    "id": "techmeme-430d5fc3",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: current and former OpenAI employees plan to sell ~$6B in stock to Thrive Capital, SoftBank, and others in a secondary sale that values OpenAI at ~$500B (Kate Clark/Bloomberg)",
    "url": "http://www.techmeme.com/250815/p23#a250815p23",
    "summary": "Kate Clark / Bloomberg: Sources: current and former OpenAI employees plan to sell ~$6B in stock to Thrive Capital, SoftBank, and others in a secondary sale that values OpenAI at ~$500B — SoftBank, Dragoneer and Thrive Capital are set to buy OpenAI shares from current and...",
    "fullContent": "Kate Clark / Bloomberg: Sources: current and former OpenAI employees plan to sell ~$6B in stock to Thrive Capital, SoftBank, and others in a secondary sale that values OpenAI at ~$500B — SoftBank, Dragoneer and Thrive Capital are set to buy OpenAI shares from current and former employees at a $500 billion valuation.",
    "publishedAt": "2025-08-15T23:25:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "430d5fc3"
  },
  {
    "id": "bloomberg-markets-3eaac003",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Stocks Slide as Trump, Putin Hold High-Stakes Talks | The Close 8/15/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/the-close-8-15-2025-video",
    "summary": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Bokeh Capital Partners’s Kim Forrest, RBC Capital Markets’ Blake Gwinn, Morningstar’s Ahmed Khan,...",
    "fullContent": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Bokeh Capital Partners’s Kim Forrest, RBC Capital Markets’ Blake Gwinn, Morningstar’s Ahmed Khan, Oliver Wyman’s Daniel Tannebaum, Kayne Anderson Rudnick’s Julie Biel, Robinhood Markets’ Steve Quirk, Pandora’s Alexander Lacik, Mimi Cheng’s Dumplings’ Marian Cheng, Fordham Global Foresight’s Tina Fordham. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T23:23:54.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3eaac003"
  },
  {
    "id": "fortune-18d15ea6",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump says &#8216;we didn&#8217;t get there&#8217; but touts progress as meeting with Putin ends without a deal to stop Ukraine war",
    "url": "https://fortune.com/2025/08/15/trump-putin-summit-alaska-ukraine-war-us-russia-sanctions/",
    "summary": "\"We had an extremely productive meeting, and many points were agreed to and there are just a very few that are left.\"",
    "fullContent": "\"We had an extremely productive meeting, and many points were agreed to and there are just a very few that are left.\"",
    "publishedAt": "2025-08-15T23:20:49.000Z",
    "fetchedAt": "2025-08-16T02:22:49.894Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18d15ea6"
  },
  {
    "id": "wsj-opinion-24b183d",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "More Justice for Elizabeth Warren",
    "url": "https://www.wsj.com/opinion/more-justice-for-elizabeth-warren-911bf317",
    "summary": "Trump wins a key victory in the effort to shrink her bureaucratic pride and joy.",
    "fullContent": "Trump wins a key victory in the effort to shrink her bureaucratic pride and joy.",
    "publishedAt": "2025-08-15T23:15:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "24b183d"
  },
  {
    "id": "zerohedge-45385e03",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Gerrymandering, Race-Pandering, & Political-Meandering",
    "url": "https://www.zerohedge.com/political/gerrymandering-race-pandering-political-meandering",
    "summary": "Gerrymandering, Race-Pandering, & Political-Meandering Authored by Arthur Schaper via American Greatness, Gerrymandering, the political practice of carving up awkward-looking legislative districts to benefit one party’s political power, has slithered into the public...",
    "fullContent": "Gerrymandering, Race-Pandering, & Political-Meandering Authored by Arthur Schaper via American Greatness, Gerrymandering, the political practice of carving up awkward-looking legislative districts to benefit one party’s political power, has slithered into the public conversation once again. Some of us remember the history behind this political practice, starting with the governor of Massachusetts, Elbridge Gerry. Democratic-Republicans want to shore up their new power in the Commonwealth of Massachusetts. Federalist opponents of the maneuver mocked one of the serpentine-like districts created by the party, christening the shape with claws, wings, and a razor-sharp mouth, calling the monstrosity “The Gerrymander.” Why has the discussion roared into the public consensus this time? It started with the Texas legislature’s efforts to redraw its state’s districts after a request from the Trump Administration to review the fairness of the districts. Yes, there is gerrymandering in Texas, but not the way that liberal reformers want to portray the problem. Consider some of the urban, Democratic Congressional districts in Texas: the 29th, 32nd, and 33rd, for example, are obscenely drawn. These contortions are examples of race pandering, or “race-mandering,” which result from the tortured misuse of the Voting Rights Act and fears of ongoing legal challenges from left-wing legal activists demanding more majority-minority districts. This kind of lawfare recently forced Alabama and Louisiana to create gerrymandered districts. Texas is not alone in this fight, either. Ohio has to redraw its Congressional districts. This opportunity could create three more Republican-leaning Congressional seats, while the Texas legislature advances a map creating five more GOP seats. Of course, Governor Abbott and the Republican leadership have floated increasing the GOP advantage to six to eight seats if absent Democrats refuse to come back to work in their vain efforts to break legislative quorums. Democrats have not helped their cause by fleeing to Illinois, whose districts are so gerrymandered that even Stephen Colbert poked fun at them. Florida Governor Ron DeSantis, who bravely pushed through a race-neutral Congressional map in 2021, netting four more GOP seats, has offered to redraw the Congressional districts yet again, in part because the state population has grown due to an increase in migration from failed blue states. DeSantis deserves credit for the current GOP-mandering effort, since he had refused weak maps from the Florida RINOs at the beginning of the decade. Indiana, Missouri, and South Carolina are also exploring more daring redistricting efforts, not just because of Trump’s leadership and Texas’s fight, but because the United States Supreme Court will be reviewing the “majority-minority” provisions in the Voting Rights Act. Democrats and liberal pundits fear that the court will strike them down entirely, wiping away the need for “majority-minority districts” and ensuring that Republicans gain more seats! Republicans are fighting back, and Democrats don’t like that the Republicans are using their tactics against them. California Governor Gavin Newsom, who is running for President even though he won’t admit it, is leading the charge, demanding that fellow Democrats start fighting with fire, although they started the fire, perfecting the art of gerrymandering under the guise of independent commissioners. Newsom urged the California legislature to reform the state’s Citizens Redistricting Commission to create more Democratic-favoring districts. The problem with this effort, though, is that Democratic-leaning states already have some of the most heavily gerrymandered districts in the country. Maryland had three Republicans as recently as 2003, but has reduced the number with creative redrawing. Illinois is the most gerrymandered state, despite relying on an independent commission. New York State tried to push through one of the most gerrymandered districts possible, but even the all-Democratic New York Supreme Court rejected the naked political grab from Albany politicians. Declining Governor Kathy Hochul wants to jump into the fray anyway. They wear their lawlessness like a dinner jacket. Even Massachusetts Governor Maura Healey jumped on the merry gerrymander bandwagon. She made a total fool of herself. All nine Congressional districts are gerrymandered to the Democrats’ advantage, since the Bay State hasn’t had a Republican Congressman since 1997. Republicans are looking good going into Election 2026, but there are rumblings against the gerrymandering sparring. Rep. Kevin Kiley (R-CA) has introduced legislation to stop the national mid-decade redistricting efforts. This effort is understandable, since Kiley will likely lose his seat should Gavin Newsom get his way. However, the country needs a strong GOP majority in both chambers to ensure lasting electoral and cultural change, and if a couple of seats get lost in California but more make up for the loss in other states, I can live with it (and I live in California). Kiley appears to be panicking unnecessarily, as there is no legal way for Newsom to push through his so-called ‘Newsom-mandering’ without significant legal retaliation. Moreover, Newsom’s efforts are not winning him support from California voters or liberal columnists. Should we be concerned about the constant political meandering caused by redistricting? Voters deserve consistency in representation. I do not agree with banning mid-decade redistricting, especially if a state’s population shifts or changes radically within a decade. Independent commissioners don’t work—they are unaccountable to the people, and still produce gerrymandered districts. California Globe dishes on this perfectly. We have already discussed Illinois, with its contorted, snake-like districts designed to force out Republican congressmen, even though they garnered 43% of the vote in the 2024 election. State legislatures should be required to draw the districts. How do we prevent the ridiculous salamander shuffle, though? If the district covers multiple counties, at least one should be placed entirely within the congressional district. If a governing county is large enough to incorporate more districts, then it should not straddle more than one other county. Municipal and geographical boundaries should be respected. No portion of a congressional district should be thinner than 20 miles. Lastly, the notion that districts are set in stone despite gerrymandering or partisan advantage is dubious in the long run. Political demographics and voting patterns change, and even well-entrenched incumbents face losses when they lose touch with voters. Nothing is static in politics. Tyler Durden Fri, 08/15/2025 - 19:15",
    "publishedAt": "2025-08-15T23:15:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.086Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45385e03"
  },
  {
    "id": "bbc-business-2474cb6a",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "'I spend £120 a month on buses': Under-22s on what free travel would mean to them",
    "url": "https://www.bbc.com/news/articles/c70xjj8746wo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "fullContent": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "publishedAt": "2025-08-15T23:06:54.000Z",
    "fetchedAt": "2025-08-16T02:22:49.862Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2474cb6a"
  },
  {
    "id": "bbc-business-7a7d639d",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "'Bus fares have cut my food budget': Under-22s on what free travel would mean to them",
    "url": "https://www.bbc.com/news/articles/c70xjj8746wo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "fullContent": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "publishedAt": "2025-08-15T23:06:54.000Z",
    "fetchedAt": "2025-08-16T09:40:38.712Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a7d639d"
  },
  {
    "id": "bloomberg-politics-70a8fa6b",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Says Up to Zelenskiy to Make Deal After Summit With Putin",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/trump-says-talks-with-putin-productive-but-no-deal-made-yet",
    "summary": "US President Donald Trump called his meeting with Russian counterpart Vladimir Putin productive but indicated that a path to end the war had still not been finalized, adding that he would speak to Ukrainian President Volodymyr Zelenskiy and tell him to make a deal.",
    "fullContent": "US President Donald Trump called his meeting with Russian counterpart Vladimir Putin productive but indicated that a path to end the war had still not been finalized, adding that he would speak to Ukrainian President Volodymyr Zelenskiy and tell him to make a deal.",
    "publishedAt": "2025-08-15T23:06:40.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "70a8fa6b"
  },
  {
    "id": "bbc-business-10e13657",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Topshop returns to the High Street, but can it get its cool back?",
    "url": "https://www.bbc.com/news/articles/ckgl4w1zkypo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "For many people, the stores defined their childhood. Now they are due to come back.",
    "fullContent": "For many people, the stores defined their childhood. Now they are due to come back.",
    "publishedAt": "2025-08-15T23:05:44.000Z",
    "fetchedAt": "2025-08-16T02:22:49.862Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "10e13657"
  },
  {
    "id": "bbc-business-15127dd3",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Topshop returns to the High Street, but can it get its cool back?",
    "url": "https://www.bbc.com/news/articles/ckgl4w1zkypo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "For many, the stores defined their childhood. Now the retailer says it is reopening them, and holds its first catwalk for years today.",
    "fullContent": "For many, the stores defined their childhood. Now the retailer says it is reopening them, and holds its first catwalk for years today.",
    "publishedAt": "2025-08-15T23:05:44.000Z",
    "fetchedAt": "2025-08-16T09:40:38.712Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15127dd3"
  },
  {
    "id": "nyt-technology-65855c70",
    "sourceId": "nyt-technology",
    "sourceName": "NYT Technology",
    "title": "Judge Blocks F.T.C. Investigation of Media Matters",
    "url": "https://www.nytimes.com/2025/08/15/technology/media-matters-ftc-musk-injunction.html",
    "summary": "The agency began looking into the liberal watchdog group’s research critical of Elon Musk and his social media platform, X, in May.",
    "fullContent": "The agency began looking into the liberal watchdog group’s research critical of Elon Musk and his social media platform, X, in May.",
    "publishedAt": "2025-08-15T23:02:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.605Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "65855c70"
  },
  {
    "id": "scmp-business-183f55a3",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Chinese start-up joins NetDragon-owned Cherrypicks to push AI tech overseas",
    "url": "https://www.scmp.com/tech/tech-trends/article/3322029/chinese-start-joins-netdragon-owned-cherrypicks-push-ai-solutions-overseas?utm_source=rss_feed",
    "summary": "An AI start-up backed by the Chinese Academy of Sciences’ Institute of Automation is seeking to promote its artificial intelligence offerings outside the mainland under a strategic partnership with Cherrypicks, the firm behind Hong Kong’s Covid-19 tracking app.",
    "fullContent": "An AI start-up backed by the Chinese Academy of Sciences’ Institute of Automation is seeking to promote its artificial intelligence offerings outside the mainland under a strategic partnership with Cherrypicks, the firm behind Hong Kong’s Covid-19 tracking app. Beijing-based Zhongke WengAI, whose services are used by various Chinese ministries and state media outlets, will also jointly develop with Cherrypicks – owned by Hong Kong-listed NetDragon Websoft – enterprise AI solutions for industries...",
    "publishedAt": "2025-08-15T23:00:09.000Z",
    "fetchedAt": "2025-08-16T02:22:50.133Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "183f55a3"
  },
  {
    "id": "cnbc-markets-69829d19",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "China's booming bubble tea industry faces a test: Is it here to stay or just a fad?",
    "url": "https://www.cnbc.com/2025/08/15/chinas-bubble-tea-industry-is-it-here-to-stay-or-just-a-fad.html",
    "summary": "Market saturation at home, rising costs and intense price wars are testing the resilience of the country's bubble tea brands.",
    "fullContent": "Market saturation at home, rising costs and intense price wars are testing the resilience of the country's bubble tea brands.",
    "publishedAt": "2025-08-15T23:00:01.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "69829d19"
  },
  {
    "id": "oil-price-3f795976",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "How Much Energy Does ChatGPT’s Newest Model Consume?",
    "url": "https://oilprice.com/Energy/Energy-General/How-Much-Energy-Does-ChatGPTs-Newest-Model-Consume.html",
    "summary": "How much energy does the newest version of ChatGPT consume? No one knows for sure, but one thing is certain – it’s a whole lot. OpenAI, the company behind ChatGPT, hasn’t released any official figures for the large language model’s energy footprints, but academics are working...",
    "fullContent": "How much energy does the newest version of ChatGPT consume? No one knows for sure, but one thing is certain – it’s a whole lot. OpenAI, the company behind ChatGPT, hasn’t released any official figures for the large language model’s energy footprints, but academics are working to quantify the energy use for query – and it’s considerably higher than for previous models. There are no mandates forcing AI companies to disclose their energy use or environmental impact, so most do not offer up those kinds of statistics…",
    "publishedAt": "2025-08-15T23:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.543Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "3f795976"
  },
  {
    "id": "bloomberg-markets-13d9ff44",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Jackson Hole Preview, Apple's AI Ambitions, Rule of Law, New Housing Investors | Wall Street Week",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/new-rules-wall-street-week-video",
    "summary": "This week, the framework of the Federal Reserve Board of Governors meets signs of economic softness just ahead of the Fed's annual meeting in Jackson Hole, Wyoming. And, Apple wants to increase its AI presence, but its focus on manufacturing and the tariff environment might...",
    "fullContent": "This week, the framework of the Federal Reserve Board of Governors meets signs of economic softness just ahead of the Fed's annual meeting in Jackson Hole, Wyoming. And, Apple wants to increase its AI presence, but its focus on manufacturing and the tariff environment might pose challenges. Plus, rule of law is more than a legal concept - why businesses need it to operate in the US. And, the American dream of home ownership now belongs to small investors who are seeing opportunity in market conditions that are pricing out potential home owners. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:59:37.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "13d9ff44"
  },
  {
    "id": "wsj-youtube-1212bcd3",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "WSJ Reporter Describes Pro-Ukraine Protest in Alaska Amid Trump-Putin Summit | WSJ News",
    "url": "https://www.youtube.com/watch?v=CkVqkY_nDVo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:58:54.000Z",
    "fetchedAt": "2025-08-16T02:23:18.577Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1212bcd3"
  },
  {
    "id": "zerohedge-71d2dfa7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Joby Aviation Makes \"Aviation History\" With First Piloted eVTOL Flying In FAA-Controlled Airspace",
    "url": "https://www.zerohedge.com/technology/joby-aviation-makes-aviation-history-first-piloted-evtol-flying-faa-controlled-airspace",
    "summary": "Joby Aviation Makes \"Aviation History\" With First Piloted eVTOL Flying In FAA-Controlled Airspace Joby Aviation shares rose in premarket trading after news that one of its electric vertical takeoff and landing (eVTOL) air taxis \"successfully operated\" in highly controlled...",
    "fullContent": "Joby Aviation Makes \"Aviation History\" With First Piloted eVTOL Flying In FAA-Controlled Airspace Joby Aviation shares rose in premarket trading after news that one of its electric vertical takeoff and landing (eVTOL) air taxis \"successfully operated\" in highly controlled airspace between two California airports: Marina (OAR) and Monterey (MRY). The 12-minute, 10-nautical-mile flight of the eVTOL air taxi in Federal Aviation Administration (FAA)-controlled airspace integrated with other aircraft and demonstrated vertical takeoff, wingborne transition, and vertical landing. This is clear evidence that commercialization will happen within this decade. \"The achievement is a major step as part of Joby's commercial market readiness,\" the aviation startup wrote in a press release, adding, \"It's a critical measure of the maturity of the Company's path to commercialization as the flights also demonstrated the type of real-world service Joby intends to offer to the public.\" Joby has previously stated that commercial flights of its eVTOL air taxis will begin in early 2026, with a broader rollout of this revolutionary mode of transportation expected by 2028. Shares of Joby were up 8% in New York premarket trading. Year-to-date, the stock is up 114% as of Thursday's close. Short interest stands at about 11.5% of the float, or approximately 58 million shares, with around 1.3 days to cover. Watch: We’ve made aviation history with the first piloted eVTOL air taxi test flight between two public airports! FAA-controlled airspace. 10 nautical miles. 12 minutes (including 5 minutes in a holding pattern for air traffic spacing). Not only does it represent our flight testing and… pic.twitter.com/QFoKmbA6XP — Joby Aviation (@jobyaviation) August 15, 2025 Related: Los Angeles Announces Flying Taxis For Visitors At 'No-Car' Olympics Guess who delayed America's industry? You'll never guess... Flying Taxis Officially Lift Off - But Only In China, Thank Biden's FAA . . . Tyler Durden Fri, 08/15/2025 - 18:50",
    "publishedAt": "2025-08-15T22:50:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.087Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "71d2dfa7"
  },
  {
    "id": "bloomberg-markets-4f741309",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Retail Investors Spotted UNH Before Buffett: Robinhood",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/retail-investors-spotted-unh-before-buffett-robinhood-video",
    "summary": "Steve Quirk, Robinhood Chief Brokerage Officer, says retail investors remain cautiously optimistic and resilient, with equity and crypto volumes hitting record highs. He spoke with Scarlet Fu and Vonnie Quinn on “The Close.” (Source: Bloomberg)",
    "fullContent": "Steve Quirk, Robinhood Chief Brokerage Officer, says retail investors remain cautiously optimistic and resilient, with equity and crypto volumes hitting record highs. He spoke with Scarlet Fu and Vonnie Quinn on “The Close.” (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:48:55.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4f741309"
  },
  {
    "id": "cnbc-markets-33d6e0c2",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Tech IPOs are roaring after 'years of Prohibition' — it may be too good",
    "url": "https://www.cnbc.com/2025/08/15/tech-ipos-bullish-figma-circle-roaring-after-years-of-prohibition-.html",
    "summary": "Bullish's IPO this week is another sign that the market is swinging wide open after a prolonged dry spell.",
    "fullContent": "Bullish's IPO this week is another sign that the market is swinging wide open after a prolonged dry spell.",
    "publishedAt": "2025-08-15T22:44:18.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "33d6e0c2"
  },
  {
    "id": "bloomberg-markets-63c09ac0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Mimi Cheng’s Dumplings Expands to Whole Foods",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/mimi-cheng-s-dumplings-expands-to-whole-foods",
    "summary": "Marian Cheng, Co-Founder of Mimi Cheng’s Dumplings, says she wants to break the stereotype of Chinese food, offering fresh, Taiwanese-style dumplings. She tells Scarlet Fu and Vonnie Quinn on “The Close” that the restaurant has been open for over 10 years and now sells frozen...",
    "fullContent": "Marian Cheng, Co-Founder of Mimi Cheng’s Dumplings, says she wants to break the stereotype of Chinese food, offering fresh, Taiwanese-style dumplings. She tells Scarlet Fu and Vonnie Quinn on “The Close” that the restaurant has been open for over 10 years and now sells frozen dumplings in grocery stores. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:39:29.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "63c09ac0"
  },
  {
    "id": "bloomberg-markets-375e33a7",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Has Leverage as Trump, Putin Meet: Tannebaum",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/us-has-leverage-as-trump-putin-meet-tannebaum-video",
    "summary": "Daniel Tannebaum, Oliver Wyman Global Anti-Financial Crime Practice Leader, says a mismatch may exist between U.S. President Donald Trump and Russian President Vladimir Putin, stressing the U.S. and its Western allies have more leverage over Russia than realized.",
    "fullContent": "Daniel Tannebaum, Oliver Wyman Global Anti-Financial Crime Practice Leader, says a mismatch may exist between U.S. President Donald Trump and Russian President Vladimir Putin, stressing the U.S. and its Western allies have more leverage over Russia than realized. He tells Scarlet Fu and Vonnie Quinn on “The Close” that American businesses are reluctant to return to Russia. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:38:44.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "375e33a7"
  },
  {
    "id": "nyt-business-444bfa4c",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "MAHA Draft Report Brings Relief to Some, Chagrin to Others",
    "url": "https://www.nytimes.com/2025/08/15/health/maha-draft-report-pesticides.html",
    "summary": "A draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped.",
    "fullContent": "A draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped.",
    "publishedAt": "2025-08-15T22:36:45.000Z",
    "fetchedAt": "2025-08-16T02:22:47.574Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "444bfa4c"
  },
  {
    "id": "wired-21a98c9f",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "9 Best Pillows (2025) Tested For Side, Back, and Stomach Sleepers",
    "url": "https://www.wired.com/gallery/best-pillows/",
    "summary": "We’ve spent over a year testing the best pillows to support your noggin, whether you snooze on your side, back, or in a tangle of blankets.",
    "fullContent": "We’ve spent over a year testing the best pillows to support your noggin, whether you snooze on your side, back, or in a tangle of blankets.",
    "publishedAt": "2025-08-15T22:36:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.335Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "21a98c9f"
  },
  {
    "id": "bloomberg-politics-504e9d3f",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Tells Fox News He Believes Xi Won’t Act on Taiwan",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/trump-tells-fox-news-he-believes-xi-won-t-act-on-taiwan-medeonhg",
    "summary": "Donald Trump said Chinese President Xi Jinping told him he would not “move on” Taiwan as long as the US president remained in office.",
    "fullContent": "Donald Trump said Chinese President Xi Jinping told him he would not “move on” Taiwan as long as the US president remained in office.",
    "publishedAt": "2025-08-15T22:34:47.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "504e9d3f"
  },
  {
    "id": "ndtv-profit-youtube-301d4b60",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Donald Trump-Vladimir Putin Meet: B-2 Bomber Hovers Over Alaska Skies",
    "url": "https://www.youtube.com/shorts/O4R0yQzrbCo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:30:39.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "301d4b60"
  },
  {
    "id": "zerohedge-dcd3b3b",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "The Death Of The Small Farm Is The Death Of Rural America",
    "url": "https://www.zerohedge.com/personal-finance/death-small-farm-death-rural-america",
    "summary": "The Death Of The Small Farm Is The Death Of Rural America Authored by Mollie Engelhart via The Epoch Times, Modern farming is destroying small communities as we move more and more toward the “go big or go home” model—thousands of acres of the same monocrop, managed by one or...",
    "fullContent": "The Death Of The Small Farm Is The Death Of Rural America Authored by Mollie Engelhart via The Epoch Times, Modern farming is destroying small communities as we move more and more toward the “go big or go home” model—thousands of acres of the same monocrop, managed by one or two people on a tractor spraying chemicals. What used to be 20 or 30 small farms—each with a household and family that supported the local restaurant, gas station, feed store, and the veterinarian who served a few counties—is now replaced by a single sprawling operation with no animals, no neighbors, and no community. Over the past decade, roughly 140,000 U.S. farms have vanished, and it’s not just those farms that have collapsed—but the entire ecosystem they supported: diners, auction barns, schools, vets, and feed stores have all felt the blow. The economic destruction radiates outward—every boarded-up business is a ripple from a missing farm. Despite this, small farms are often treated as quaint, inefficient, and economically irrelevant in the modern food system. But the numbers tell a different story. Globally, farms under 2 hectares (about 5 acres) produce around 30 to 34 percent of the world’s food, while using only about 24 percent of agricultural land. That’s not inefficiency—that’s productivity. If you expand that to farms under 5 hectares, they produce more than half of the world’s food. These farms grow a diverse range of crops and raise animals in ways that serve local and regional markets—feeding people directly, not just supplying commodity markets or overseas exports. Small farms matter because they produce food where it’s eaten, keeping supply chains short and resilient. They’re often the ones growing the vegetables at your farmers market, the eggs from down the road, the beef from a rancher you know by name. They support biodiversity, employ more people per acre, and keep profits circulating locally. Dismissing them as outdated isn’t just wrong—it’s dangerous to our food security. While most of the farms we’ve lost were small family operations, the fight to save rural America isn’t just about acreage—it’s about approach. It’s not the size of the farm that determines its value to a community, but the farming practices it uses and the relationships it sustains. A larger farm can still operate in a way that regenerates the soil, employs local people, and feeds its neighbors—if it’s run with vision and courage. That’s exactly what Will Harris has done at White Oak Pastures, his 1,250-acre family farm in Bluffton, Georgia (held by his family since 1866). In the mid-1990s, Harris made a radical break from industrial agriculture. He replaced chemical inputs and confinement feeding with rotational grazing, diversified livestock, and on-site, USDA-inspected processing facilities. White Oaks Pastures is now one of the only farms in the country with separate abattoirs for red meat and poultry. To make this transformation, Harris took an extraordinary risk—borrowing $7.5 million against the family land to build these processing plants in 2008. It was a gamble most would never dare, but it paid off. His farm now operates as a zero-waste, closed-loop agricultural ecosystem, where nothing goes to waste, and grass-fed meats, eggs, organic vegetables, and byproducts like hides are turned into artisanal goods and compost. His regenerative practices have rebuilt topsoil, captured carbon, and sparked a local economic revival. Today, White Oak Pastures employs up to 180 people, making it Clay County’s largest private employer. What was once a dying ghost town now has a general store, a restaurant, lodging, and an event center—because one man chose to bet everything on a different way forward. His example proves it’s not the scale that matters—it’s the soil health, the humane treatment of animals, the jobs created, and the way the farm integrates into the life of the town. The wake-up call is already ringing: boarded-up Main Streets, closed auction barns, veterinarians relocated to cities, feed stores shuttered, schools shrinking. And make no mistake—this is not just an economic issue. It’s a matter of national security. If we lose the ability to feed ourselves, we lose the ability to protect ourselves. Food has been a weapon in almost every war in history. Without control over our food supply, we surrender control over our future. When we allow small and mid-size farms to fail, we don’t just lose their food production—we lose the skills, the infrastructure, and the intergenerational knowledge that comes with them. We also lose the community glue they provide. Farmers don’t just grow food—they buy feed, fix equipment locally, hire the local vet, and send their kids to the local school. Multiply that by dozens of farms in a county, and you see why their disappearance hollows out whole regions. That’s why I am thrilled that Will Harris will be joining us at Sovereignty Ranch at the end of September for our Food is Medicine retreat—a gathering dedicated to restoring health, community, and resilience through the way we grow, cook, and share food. We’ll be talking about soil, nutrition, farm economics, and the urgent need to rebuild regional food systems—because the fight for our farms is the fight for our future. If you care about your country, your health, and your freedom, start now: support small farmers. Buy from them directly. Demand that your grocery stores and restaurants source from them. And most importantly—eat the small farm diet. This means real food from real farms, grown in a way that nourishes the soil and the people. Every purchase is a vote for the kind of America we want to live in. The survival of rural America—and perhaps the survival of America itself—depends on it. Views expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times or ZeroHedge. Tyler Durden Fri, 08/15/2025 - 18:25",
    "publishedAt": "2025-08-15T22:25:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.087Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "dcd3b3b"
  },
  {
    "id": "cnbc-markets-530a8cc8",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Why Bezos-backed Slate Automotive says it has cracked the code to affordable EVs",
    "url": "https://www.cnbc.com/2025/08/15/why-slate-automotive-says-it-has-cracked-the-code-to-affordable-evs.html",
    "summary": "Slate Automotive, backed by Jeff Bezos, targets EV buyers with a customizable, barebones truck under $30K, despite lost tax incentives.",
    "fullContent": "Slate Automotive, backed by Jeff Bezos, targets EV buyers with a customizable, barebones truck under $30K, despite lost tax incentives.",
    "publishedAt": "2025-08-15T22:23:27.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "530a8cc8"
  },
  {
    "id": "bloomberg-markets-6a65f10c",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Corporate Bond Spreads Sink to 27-Year Low as ‘FOMO’ Sets In",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/us-corporate-bond-spreads-sink-to-27-year-low-as-fomo-sets-in",
    "summary": "A key measure of US corporate-bond valuations surged to the highest level in nearly three decades as investors raced to lock in still-elevated yields amid speculation that the Federal Reserve will resume cutting interest rates next month.",
    "fullContent": "A key measure of US corporate-bond valuations surged to the highest level in nearly three decades as investors raced to lock in still-elevated yields amid speculation that the Federal Reserve will resume cutting interest rates next month.",
    "publishedAt": "2025-08-15T22:21:23.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6a65f10c"
  },
  {
    "id": "techmeme-294d7a9",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A US district court judge temporarily blocks an FTC probe into Media Matters, part of an antitrust investigation into ad boycotts, calling the probe retaliatory (Bloomberg)",
    "url": "http://www.techmeme.com/250815/p22#a250815p22",
    "summary": "Bloomberg: A US district court judge temporarily blocks an FTC probe into Media Matters, part of an antitrust investigation into ad boycotts, calling the probe retaliatory — Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information...",
    "fullContent": "Bloomberg: A US district court judge temporarily blocks an FTC probe into Media Matters, part of an antitrust investigation into ad boycotts, calling the probe retaliatory — Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information demand for documents &hellip;",
    "publishedAt": "2025-08-15T22:15:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "294d7a9"
  },
  {
    "id": "ndtv-profit-youtube-3c643296",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Meet | US President Donald Trump Rules Out NATO Guarantees For Ukraine",
    "url": "https://www.youtube.com/watch?v=HB8gSiWWy7o",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:11:09.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3c643296"
  },
  {
    "id": "techmeme-79f4e2dd",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Roblox shares closed down 6.34% on Friday after the company was accused in two lawsuits of failing to sufficiently protect youngsters on its platform (Cecilia D'Anastasio/Bloomberg)",
    "url": "http://www.techmeme.com/250815/p21#a250815p21",
    "summary": "Cecilia D'Anastasio / Bloomberg: Roblox shares closed down 6.34% on Friday after the company was accused in two lawsuits of failing to sufficiently protect youngsters on its platform — Roblox Corp. shares fell more than 6% Friday after the company, which operates an online...",
    "fullContent": "Cecilia D'Anastasio / Bloomberg: Roblox shares closed down 6.34% on Friday after the company was accused in two lawsuits of failing to sufficiently protect youngsters on its platform — Roblox Corp. shares fell more than 6% Friday after the company, which operates an online video-game service popular with children &hellip;",
    "publishedAt": "2025-08-15T22:10:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "79f4e2dd"
  },
  {
    "id": "techmeme-410a9b0b",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Winklevoss twins' Gemini files for a US IPO and reports a $282.5M net loss on $67.9M revenue in H1 2025, vs. a $41.4M net loss on $73.5M revenue a year earlier (Monique Mulima/Bloomberg)",
    "url": "http://www.techmeme.com/250815/p20#a250815p20",
    "summary": "Monique Mulima / Bloomberg: Winklevoss twins' Gemini files for a US IPO and reports a $282.5M net loss on $67.9M revenue in H1 2025, vs. a $41.4M net loss on $73.5M revenue a year earlier — Gemini Space Station Inc.",
    "fullContent": "Monique Mulima / Bloomberg: Winklevoss twins' Gemini files for a US IPO and reports a $282.5M net loss on $67.9M revenue in H1 2025, vs. a $41.4M net loss on $73.5M revenue a year earlier — Gemini Space Station Inc., led by the billionaire Winklevoss twins, filed for an IPO as the cohort of crypto businesses seeking to list on public markets continues to swell.",
    "publishedAt": "2025-08-15T22:05:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "410a9b0b"
  },
  {
    "id": "ndtv-profit-youtube-431f211",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Putin Lands In Alaska | Top Moments From Vladimir Putin's Reception In Alaska",
    "url": "https://www.youtube.com/watch?v=quwMuuyh4Ys",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:02:53.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "431f211"
  },
  {
    "id": "zerohedge-195ca624",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "China Rushes To Buy Russian Oil As India Pulls Back",
    "url": "https://www.zerohedge.com/commodities/china-rushes-buy-russian-oil-india-pulls-back",
    "summary": "China Rushes To Buy Russian Oil As India Pulls Back While Trump has been raging in the past month at India for buying Russian oil (then processing it and reselling it to Europe at a huge markup) and slapping it with punitive tariffs in response to repeat sanctions violations,...",
    "fullContent": "China Rushes To Buy Russian Oil As India Pulls Back While Trump has been raging in the past month at India for buying Russian oil (then processing it and reselling it to Europe at a huge markup) and slapping it with punitive tariffs in response to repeat sanctions violations, he has generally ignored the fact that China has been importing glorious amounts of Russian oil as well: amounts which are only set to become even more glorious in coming weeks. And now that India is suddenly shy about funneling millions of Russian barrels with the world spotlight aimed squarely at it, Beijing is stepping up to fill the void: according to Kpler, Chinese state-owned and mega-sized private refiners are snapping up Western Russian crude cargoes for Oct. and Nov. arrival as India eases off. Previously Bloomberg reported that in hopes to appease Trump and as they hedged their bets ahead of the Trump-Putin summit, refiners in India, the world’s top importer of seaborne Russian crude, have been scouring the globe for alternative supplies. Trump has demanded that India stop purchases of cut-price crude and doubled tariffs on the country’s goods as punishment for imports he has said were fuelling “the war machine”. The move left refiners in the world’s third-largest oil consumer looking to switch up their procurement plans. India’s state processors have bought large volumes of non-Russian crude this week for prompt September-October delivery, extending a buying spree spurred by an early threat by Washington. Indian Oil Corp. and Bharat Petroleum Corp. have taken cargoes from all corners of the market including the US, but also Brazil and the Middle East. Just earlier today, Reuters reported that IOC bought another cargo of US WTI for delivery in October. These spot market purchases come on top of supplies from long-term sellers like Saudi Arabia, which is set to send about 22.5 million barrels of crude to India for September loading, traders said. India’s monthly imports from Saudi last exceeded that level in September 2024, according to data from analytics firm Kpler. And with India slowing, China has stepped up: as Bloomberg reports, Chinese refiners purchased about 13 cargoes of Urals and Varandey for October delivery, and at least two Urals cargoes for Nov., Kpler analyst Muyu Xu wrote in a report. The last time China took Varandey was Sept. 2023. Following intensified Ukrainian drone attacks, which have crippled many of its refineries and lowered domestic intakes, Russia instead moved to export 10-12 more Urals cargoes. Indeed, according to BBG, refineriies at Saratov, Novokuibyshevsk, Afipskiy, and Ryazan have fully or partially halted crude intake Still, the rise in Chinese demand for Russian oil has failed to fully offset loss of Indian demand, and Urals may be trading at $0.80/bbl premium to Dated Brent, down from $2/bbl before India scaled back buying in July. Prices are expected to fall further if India continues to eschew Russian, although with India forced to buy oil in the open market, it will likely push broader benchmark prices solidly higher in coming weeks. Tyler Durden Fri, 08/15/2025 - 18:00",
    "publishedAt": "2025-08-15T22:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.087Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "195ca624"
  },
  {
    "id": "cnbc-markets-467a7f41",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "OpenAI in talks to sell around $6 billion in stock at roughly $500 billion valuation",
    "url": "https://www.cnbc.com/2025/08/15/openai-6-billion-stock-500-billion-valuation.html",
    "summary": "The talks are still in early stages and the details could change.",
    "fullContent": "The talks are still in early stages and the details could change.",
    "publishedAt": "2025-08-15T21:57:35.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "467a7f41"
  },
  {
    "id": "bloomberg-politics-3ad09b84",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "FTC Reined in by Judge for Retaliating Against Media Group",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/ftc-reined-in-by-judge-for-retaliating-against-media-nonprofit",
    "summary": "Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information demand for documents from the group as part of an antitrust probe into advertising boycotts.",
    "fullContent": "Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information demand for documents from the group as part of an antitrust probe into advertising boycotts.",
    "publishedAt": "2025-08-15T21:56:17.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "3ad09b84"
  },
  {
    "id": "cnbc-markets-15da5d2a",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "UnitedHealth shares log best day since 2020 after Buffett's new stake is revealed",
    "url": "https://www.cnbc.com/2025/08/15/unitedhealth-shares-soar-after-warren-buffetts-new-stake-provides-a-vote-of-confidence.html",
    "summary": "The advance came after Buffett's conglomerate Berkshire Hathaway revealed a stake of 5 million shares, worth about $1.6 billion.",
    "fullContent": "The advance came after Buffett's conglomerate Berkshire Hathaway revealed a stake of 5 million shares, worth about $1.6 billion.",
    "publishedAt": "2025-08-15T21:50:52.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15da5d2a"
  },
  {
    "id": "marketwatch-70bea201",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Opendoor bulls are getting what they want, and the stock is surging again",
    "url": "https://www.marketwatch.com/story/opendoor-bulls-are-getting-what-they-want-and-the-stock-is-surging-again-b99dcea2?mod=mw_rss_topstories",
    "summary": "CEO Carrie Wheeler has stepped down to the delight of institutional investors.",
    "fullContent": "CEO Carrie Wheeler has stepped down to the delight of institutional investors.",
    "publishedAt": "2025-08-15T21:49:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "70bea201"
  },
  {
    "id": "the-verge-2cd551df",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Louisiana sues Roblox for creating an environment where &#8216;child predators thrive&#8217;",
    "url": "https://www.theverge.com/news/760162/roblox-louisiana-lawsuit-child-predators-safety",
    "summary": "The state of Louisiana has filed a lawsuit against Roblox, alleging that the company has “permitted and perpetuated an online environment in which child predators thrive, directly contributing to the widespread victimization of minor children in Louisiana.",
    "fullContent": "The state of Louisiana has filed a lawsuit against Roblox, alleging that the company has “permitted and perpetuated an online environment in which child predators thrive, directly contributing to the widespread victimization of minor children in Louisiana.”&#160; Roblox sees more than 111.8 million daily active users, and it’s hugely popular with children, with users under [&#8230;]",
    "publishedAt": "2025-08-15T21:48:55.000Z",
    "fetchedAt": "2025-08-16T02:22:49.376Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "2cd551df"
  },
  {
    "id": "business-insider-4e8321cd",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I'm a psychiatrist who has treated 12 patients with 'AI psychosis' this year. Watch out for these red flags.",
    "url": "https://www.businessinsider.com/chatgpt-ai-psychosis-induced-explained-examples-by-psychiatrist-patients-2025-8",
    "summary": "A psychiatrist says he's not against clients using ChatGPT. But it can &#34;supercharge&#34; people's vulnerabilities, leading to &#34;AI psychosis.&#34;",
    "fullContent": "A psychiatrist says he's not against clients using ChatGPT. But it can &#34;supercharge&#34; people's vulnerabilities, leading to &#34;AI psychosis.&#34;",
    "publishedAt": "2025-08-15T21:47:14.000Z",
    "fetchedAt": "2025-08-16T02:22:47.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4e8321cd"
  },
  {
    "id": "nyt-technology-45aca78f",
    "sourceId": "nyt-technology",
    "sourceName": "NYT Technology",
    "title": "Senator Josh Hawley Begins Child Safety Inquiry Into Meta’s A.I. Bot",
    "url": "https://www.nytimes.com/2025/08/15/technology/meta-child-safety-senate-investigation.html",
    "summary": "Josh Hawley, Republican of Missouri, said he would look into whether the social media company’s artificial intelligence technology endangers children.",
    "fullContent": "Josh Hawley, Republican of Missouri, said he would look into whether the social media company’s artificial intelligence technology endangers children.",
    "publishedAt": "2025-08-15T21:46:34.000Z",
    "fetchedAt": "2025-08-16T02:22:47.605Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "45aca78f"
  },
  {
    "id": "wsj-opinion-527db420",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Real House Democratic Nightmare",
    "url": "https://www.wsj.com/opinion/the-real-house-democratic-nightmare-3002f098",
    "summary": "Democrats could lose 10 seats in 2030 as voters flee blue states.",
    "fullContent": "Democrats could lose 10 seats in 2030 as voters flee blue states.",
    "publishedAt": "2025-08-15T21:41:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "527db420"
  },
  {
    "id": "bloomberg-markets-49d6a2ae",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Winklevosses’ Gemini Files for IPO as Crypto Listings Accelerate",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/winklevoss-gemini-files-for-ipo-as-crypto-listings-accelerate",
    "summary": "Gemini Space Station Inc., led by the billionaire Winklevoss twins, filed for an IPO as the cohort of crypto businesses seeking to list on public markets continues to swell.",
    "fullContent": "Gemini Space Station Inc., led by the billionaire Winklevoss twins, filed for an IPO as the cohort of crypto businesses seeking to list on public markets continues to swell.",
    "publishedAt": "2025-08-15T21:40:08.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49d6a2ae"
  },
  {
    "id": "wsj-world-news-7735be9e",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "A Prison Confrontation Gives the First Glimpse in Years of a Popular Palestinian Leader",
    "url": "https://www.wsj.com/world/middle-east/a-prison-confrontation-gives-the-first-glimpse-in-years-of-a-popular-palestinian-leader-6c2665f9",
    "summary": "A far-right Israeli security minister released video of an exchange with Marwan Barghouti that the Palestinian&#x2019;s family called threatening.",
    "fullContent": "A far-right Israeli security minister released video of an exchange with Marwan Barghouti that the Palestinian&#x2019;s family called threatening.",
    "publishedAt": "2025-08-15T21:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.779Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "7735be9e"
  },
  {
    "id": "zerohedge-34a274e3",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "I Challenged Duke's DEI Dogma - And Paid With My Job",
    "url": "https://www.zerohedge.com/political/i-challenged-dukes-dei-dogma-and-paid-my-job",
    "summary": "I Challenged Duke's DEI Dogma - And Paid With My Job Authored by Dr. Kendall Conger via RealClearInvestigations, I was heartened to see my former employer, Duke University Health System, quietly reverse its commitment to woke racism this year.",
    "fullContent": "I Challenged Duke's DEI Dogma - And Paid With My Job Authored by Dr. Kendall Conger via RealClearInvestigations, I was heartened to see my former employer, Duke University Health System, quietly reverse its commitment to woke racism this year. I had joined the internal resistance to its diversity, equity, and inclusion crusade and was fired because of it. Here’s my story. Without public notice, the 38,000-employee organization scrubbed its website of the commitment to DEI it had trumpeted in 2021, when it proclaimed racism a “public health crisis,” and “equity” as its cure. Now, all such fealty to DEI has been discarded with its new 2025 statement of values. The title of its 2021 pledge to patients – “Duke Health Stands Against Racism, Bias, and Hate” – has been replaced by “Leading with Heart: Rooted in Humanity.” No doubt some of this change is due to increasing pushback to those policies: a federal civil rights lawsuit alleging pervasive racial discrimination in its hiring and admissions practices, and the Trump administration’s freezing last month of $108 million of federal monies to Duke University and Duke Health because of “the illegal use of racial preferences.” Duke Health did not respond to requests for comment. I worked at Duke for 10 years without incident before spending the last few years of my tenure battling the 2021 policy – at the cost of my job as an emergency room physician, which is now the subject of a separate lawsuit I have brought. As much as I would like to proclaim victory, I do not want this episode to get memory-holed by organizational leaders who would rather we forget the moral panic that gripped them and the price many of us paid for their destructive and divisive efforts. As the country pulls back from the pernicious ideology of DEI, there are countless other people like myself who suffered the repercussions for refusing to buckle to the madness. Lest there be any misunderstanding, let me be clear: Everyone I know is opposed to racism, bias, and hate, but Duke distorted those words to indict white doctors and nurses for complicity in the poorer health outcomes of black patients. My own form of resistance began in 2018 when Duke’s chief diversity officer gave a talk on implicit bias at a physicians’ meeting. I was shocked by what I heard. For the previous six years, I had been secluded from the world, working weekends in the ER while spending the week homeschooling my children. I was blithely unaware that academia had shifted from a love of Western civilization (a mandatory course when I was in college) to a disdain. The diversity officer told us that “society can be broken up into two groups, the oppressors (those with power - essentially, white males) and the oppressed.” With stunned incredulity, I wondered, “Who thinks like this?” One week later, and purely coincidentally, I read “The Communist Manifesto” by Karl Marx. There it lay in his opening paragraph: “The history of society is the history of class struggles…of oppressor and the oppressed.” As I continued reading, I was shocked by how similar Duke’s diversity officer sounded to the discredited 19th-century polemicist. Didn’t she know Marx seized on this confrontational construct as dynamite to obliterate the current capitalist system via the communist revolution? Although Marx held out hope for one day creating an imagined classless society, the purpose of his model was destruction. Desiring answers, I read all I could on diversity, equity, and inclusion, and the historical origins of this ideology. I expressed my concerns over the divisiveness of her ideas. “What else do you propose?” she asked me. I was prepared, and quoted social psychologist and author Jonathan Haidt: “To make a human hive, you want to make everyone feel like family. So don’t call attention to racial and ethnic differences; make them less relevant by ramping up similarity and celebrating the group’s shared values and common identity. You can make people care less about race by drowning it in a sea of similarities, shared goals, and mutual interdependencies.” Haidt’s advice seemed like common sense to me. There was an awkward, discomfited pause before she responded, “That’s not our model.” Discussion over. After the George Floyd riots in 2020, Duke’s embrace of DEI tightened. The university prepared an antiracist pledge to the community, dedicating itself to equity. It read, in part: “We commit to the elimination of racial inequities. … We recognize our own implicit biases and actively seek, listen, and respond to feedback from others as part of our personal growth and development. When confronted with racism, we always take action to speak out against it. … We are guided by science and know that excellent research and health care cannot happen without equity.” Call for Questions Before its public release, Duke asked its employees if they had any “questions or concerns” regarding the content. I knew remaining silent meant giving tacit approval to their political pursuits, and I thought it unfair of them to strong-arm our complicity, knowing most people would fear “poking the bear,” as I was warned. Not totally naïve to the danger, I spoke up. Upon questioning the pledge, I was told by an ill-informed chief medical officer (CMO) that equity did not mean “equal outcomes for groups,” as I had feared, but rather “equal distribution of resources and equal access to treatments.” However, my reading on DEI told me this was a dodge, that its advocates believed if racial groups were given equal “resources and access” then outcomes for groups necessarily would follow. The proof for “equitably distributed resources” could only be equal group outcomes. The pledge alleged “racism is a public health crisis,” an assertion that was purportedly “guided by science,” and signed by four senior-level physicians. As racism was not my observation, I asked my supervisor for the medical data supporting this audacious claim that racism was the primary driver of the unfortunate health disparities among many African Americans. He did not have the evidence, nor did he offer to find it. So, I approached the CMO. He likewise did not have the data, nor did he offer to look into it. At this juncture, I was beginning to understand this ideology as tyrannical, precariously held in place by fiat – an automatic red flag to its dubious legitimacy. Next in line was Duke Health’s vice president. My supervisor urged caution in approaching him. “Why,” I thought, “is the data a state secret?” I was redirected to the chief architect of the pledge, who sent me eight studies to read. Unconvincingly, the studies showed differences in racial outcomes without any link to implicit bias (unconscious racism) as alleged. The assumption was that unequal outcomes were proof of harbored unconscious racism. I pressed the architect: “I did not see a correlation between outcomes and unconscious racism in these studies, did you?” He conceded he did not, but there were “social science studies” linking implicit bias to unequal outcomes. I was dumbfounded and, as a physician trained in evidence-based/clinical data, I was uninterested in social science studies. I had social science studies of my own with different conclusions. The pledge misleadingly claimed to be “guided by science,” only it was not medical science. Disagreement Turns Dangerous My persistent efforts nettled Duke, and tension was growing. A nurse saw me reviewing those eight studies at work and asked what I was working on. This segued into a discussion about implicit bias. We civilly disagreed, and I assumed that was the end of the matter. I soon learned that she reported me to the ER supervisor. A few days later, my presence was requested in his office along with a human resources representative in tow. I wasn’t asked what had happened or for my side of the story. I was simply told the nurse felt my speech was “unsafe.” Instead of receiving instruction on the science of implicit bias, I received a hard lesson on how this dogma would be wielded in the workplace. It was Kafkaesque, with the conclusion predetermined, with no evidence presented to me and none asked of me. With the gravity of the proceedings sinking in, I leveled my gaze to his and inquired, “Which ideas were unsafe?” He seemed flummoxed that I asked, telling me he wasn’t prepared to discuss it. All that mattered was my expression of opinions inconsistent with Duke’s dogma. In addition, as a doctor, I had exploited a power differential with the nurse – who had initiated our conversation – leaving her, presumably, in no position to withstand a conversation with me, even though I wasn’t her supervisor. In consequence, I was forbidden to speak about or discuss the pledge in any way with anyone while on Duke property. I had been silenced. Around that time, I had reached out to the new president of Duke Raleigh Hospital regarding the subject of equity. Earlier, I had informed Duke that equity seemed like discrimination and a new form of racism in line with the work of Ibram X. Kendi, whose bestselling work, “How To be Anti-Racist,” was recommended reading. In this left-wing, social justice bible, Kendi famously claimed the “only remedy to past discrimination is present discrimination. The only remedy to present discrimination is future discrimination.” I arranged a meeting with her, indicating I had one question I wanted made official and on the books, not a passing curb-side consult. To my surprise, she brought along HR for backup. “Here is my question,” I said, “Please explain why equity is a better goal for society than equality.” In my mind, equity was the foundation upon which the whole woke edifice rested, and I wanted to know why America’s original foundation of equality, in place since 1776, was being replaced. The president never got back to me with an answer, but suggested that if others joined me, then maybe Duke would reply. She knew others would never join, and Duke would never explain itself. Since the head of HR was at my meeting with the president, I sought a substantive answer from her. Instead, she sent this: “Duke leaders have shared with you that these commitments were made after many opportunities listening to the voices of the people we serve. Our commitment is resolute.” Duke was resolute, resolute to not answering my question. I asked my supervisor why Duke was refusing to answer my concern about equity, as it seemed discriminatory by favoring certain preferred groups. He said that whenever Duke speaks with me, I share their responses with others. It was true. Was that a crime? The pledge was a public document; shouldn’t their defense of it be public as well if they were willing to provide one? I said, “Supervisor, do you hear the words coming out of your mouth? Duke does NOT want the public to know why it values equity above equality? How strange.” I decided to put equity on pause and test diversity. I wrote to the CMO, “Does diversity mean that Duke hires the best and the brightest, or is diversity a goal to be sought as an end in itself?” The response I received, minus some verbiage, was, “Diversity is a Duke value.” “Right,” I said, “but as a goal or as an accommodation of hiring the best and the brightest no matter how it looks?” He wouldn’t say. When I asked my supervisor, he responded, “My opinion is that our emergency department team should be focused on the delivery of high quality emergency medical care to anyone seeking it. This is my singular focus as medical director. Duke’s values and policies serve as a guide for me in that work and should guide all of us in our care of patients at DRAH [Duke Raleigh Hospital]. Persistent emails demanding debate are a distraction and consume time that could otherwise be better directed.” The ER Is Colorblind I wrote back to my supervisor: “It was an important question. It never occurred to me that diversity would be a goal. I thought diversity was a way of acknowledging that greatness comes in various shapes, sizes and colors, and that we should be open to it. However, the goal should be greatness and excellence, not diversity for its own sake. Priorities seem twisted. We should look for the person best fitted and capable for the job rather than looking at melanin or gonads when hiring. Merit is a better way to deliver high quality care.” (I wanted to tell him we both knew how silly these ideas were. When a patient comes into the ER struggling to breathe, bleeding out, or crashing in any way, all we think about is the algorithms in our heads for cheating death, not the physical characteristics of the person on the gurney. Every save is cause for equal celebration and reflects on our skill and training as physicians.) I shared most communications with family and co-workers so they could stay abreast of developments. My colleagues cautioned against foolhardiness and quixotic endeavors, and my family feared for our livelihood. Moreover, my wife said termination would be an embarrassment. I was counseled to keep quiet because things would turn on their own, and my meager efforts wouldn’t make a ripple. The prudent path was to keep my head down and lie low. The pendulum would swing. The confrontation with Duke brought tense moments between my wife and me. To her credit, she did become a staunch supporter as Duke showed its ineptitude. I had read “The Gulag Archipelago,” including Solzhenitsyn’s conclusion that the work camps were the result of good men holding their tongues and taking the expedient path in the face of evil. I knew the equality of individuals was the good and proper goal for society. Individuals were created equal, not groups, and imperfect equality was better than forced equity. I was convinced Solzhenitsyn was right when he said, “If one man can tell the truth, and always tell the truth, and never lie, he can bring down a tyranny.” It was clear to me that Duke was not interested in substantive diversity, only superficial diversity. Each year, we could propose a change to help improve the health system. As I could find no conservatives in leadership or on the board, I recommended a diversity of ideas by actively seeking out conservative voices for leadership positions to offset their uber-left echo-chamber. The leadership declined. Apparently, it’s not a diversity of ideas that matters, but diversity of color and genitals. I sensed most medical professionals at Duke agreed with me, so the next year I asked for an anonymous survey of the employees with this question: “Would you rather be judged and treated based on your personal and individual qualities or by your group identity?” Duke said they couldn’t do anonymous surveys. My supervisor and CMO never replied after I showed them that Duke had done so in the past. Told To Go Home I had pushed them near the breaking point, not with difficult questions, but embarrassingly simple ones. How had this whole DEI fiasco been allowed to progress this far? I showed up for work on Jan. 1, 2024, but was instead directed to a room with the president and the CMO while a security officer stood outside. Having done nothing medically or ethically wrong, I was told I was being terminated “not for cause.” The president opined, “You don’t seem surprised.” I replied, “From the first day I spoke up, I knew this was a possibility.” I was given six months’ notice. “Go home,” they said, “we have someone to cover your shift.” “I’m fine,” I said, “I don’t want anyone covering my shift.” They insisted. What bothered me more was walking back into the house and facing my wife. How would I tell her? She is strong, but this stung and needed processing. One year later, when it was time to renew my medical license through the North Carolina Medical Board, I had to answer in the affirmative that I had been terminated from a previous position. This triggered an investigation, which triggered more stress and more consultations with my lawyer. Duke listed the cause of my termination as “disruptive behavior.” However, nothing I did qualified as disruptive behavior per the board’s website. Fortunately, the Board found no violation. Finding a new job that would not require moving became difficult. Attaining employment at a new hospital as an employee was typically blocked by HR. I would interview with the medical director, and things would be fine until HR found out who I was. I eventually found a facility where I work as a contractor (not an employee), a little more than an hour’s drive from home. With twelve-hour shifts and driving back and forth, it makes for a long day. As my hero Jordan Peterson, the Canadian psychologist, says, “always tell the truth and you will have the adventure of your life.” The adventure may not be easy, but it will be worthwhile. Have faith that continually telling the truth, whatever happens, will eventually be for the best. Don’t let falsehoods pass by you. Some people think I was courageous. I was not. With a timid and small voice, I barely dared to ask the first question. It was Duke’s pathetic answers and evasions that emboldened me. Its supervisors weren’t so smart, they were just more fearful of the people above them than I was. As Duke has quietly changed its pledge, I have grown to feel indomitable – and vindicated. My biggest takeaway was what this experience allowed me to tell my four children, “You will fear something. Fear God, not man. Never shy away from asking questions in the pursuit of truth.” Tyler Durden Fri, 08/15/2025 - 17:40",
    "publishedAt": "2025-08-15T21:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.088Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "34a274e3"
  },
  {
    "id": "wsj-opinion-98b86f2",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Will China Let Jimmy Lai Die in Prison?",
    "url": "https://www.wsj.com/opinion/will-china-let-jimmy-lai-die-in-prison-30275e9c",
    "summary": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "fullContent": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "publishedAt": "2025-08-15T21:38:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "98b86f2"
  },
  {
    "id": "wsj-world-news-6b5f7c14",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Will China Let Jimmy Lai Die in Prison?",
    "url": "https://www.wsj.com/opinion/will-china-let-jimmy-lai-die-in-prison-30275e9c",
    "summary": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "fullContent": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "publishedAt": "2025-08-15T21:38:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "6b5f7c14"
  },
  {
    "id": "wsj-world-news-15eb3535",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | In France, Sweltering Is a Climate Virtue",
    "url": "https://www.wsj.com/opinion/in-france-sweltering-is-a-climate-virtue-77145796",
    "summary": "Paris wants you to use a fan and limit the AC to a single room.",
    "fullContent": "Paris wants you to use a fan and limit the AC to a single room.",
    "publishedAt": "2025-08-15T21:38:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "15eb3535"
  },
  {
    "id": "ndtv-profit-youtube-7d462f83",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Reporter Asks About Civilian Killings, Watch How Putin Reacts",
    "url": "https://www.youtube.com/shorts/EIIB1T5i4ks",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T21:30:25.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7d462f83"
  },
  {
    "id": "nyt-business-59e6daf8",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Air Canada’s Flight Attendants Reject Call for Arbitration",
    "url": "https://www.nytimes.com/2025/08/15/world/canada/air-canada-flight-attendant-strike.html",
    "summary": "Their union says one of its core demands, to receive pay for groundwork, is unlikely to be introduced in arbitration. The airline began canceling flights ahead of the potential strike.",
    "fullContent": "Their union says one of its core demands, to receive pay for groundwork, is unlikely to be introduced in arbitration. The airline began canceling flights ahead of the potential strike.",
    "publishedAt": "2025-08-15T21:26:41.000Z",
    "fetchedAt": "2025-08-16T02:22:47.574Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "59e6daf8"
  },
  {
    "id": "techmeme-55c16774",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: Meta plans its fourth AI restructuring in six months, dividing its superintelligence lab into TBD Lab, a product team, an infrastructure team, and FAIR (Kalley Huang/The Information)",
    "url": "http://www.techmeme.com/250815/p19#a250815p19",
    "summary": "Kalley Huang / The Information: Sources: Meta plans its fourth AI restructuring in six months, dividing its superintelligence lab into TBD Lab, a product team, an infrastructure team, and FAIR — Meta Platforms is planning the fourth restructuring of its artificial intelligence...",
    "fullContent": "Kalley Huang / The Information: Sources: Meta plans its fourth AI restructuring in six months, dividing its superintelligence lab into TBD Lab, a product team, an infrastructure team, and FAIR — Meta Platforms is planning the fourth restructuring of its artificial intelligence efforts in six months, according to three people familiar with the matter.",
    "publishedAt": "2025-08-15T21:25:02.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "55c16774"
  },
  {
    "id": "marketwatch-3eb2111",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x2018;I&#x2019;ve been kept in poverty&#x2019;: Do I take a $70K job at 74 and lose my Section 8 housing allowance?",
    "url": "https://www.marketwatch.com/story/should-i-apply-for-a-70k-a-year-job-at-74-and-risk-losing-my-section-8-housing-allowance-9932217d?mod=mw_rss_topstories",
    "summary": "&#x201c;After the age of 50, I really only had sporadic contract work and I had to sell my house.&#x201d;",
    "fullContent": "&#x201c;After the age of 50, I really only had sporadic contract work and I had to sell my house.&#x201d;",
    "publishedAt": "2025-08-15T21:22:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3eb2111"
  },
  {
    "id": "marketwatch-55060b1e",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "This is how important Taylor Swift&#x2019;s &#x2018;The Life of a Showgirl&#x2019; is to an entire industry",
    "url": "https://www.marketwatch.com/story/this-is-how-important-taylor-swifts-the-life-of-a-showgirl-is-to-an-entire-industry-f5689ef3?mod=mw_rss_topstories",
    "summary": "Also: Bargain stocks, Warren Buffett&#x2019;s bottom-fishing with UnitedHealth and how you can grab a real-estate commission.",
    "fullContent": "Also: Bargain stocks, Warren Buffett&#x2019;s bottom-fishing with UnitedHealth and how you can grab a real-estate commission.",
    "publishedAt": "2025-08-15T21:22:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "55060b1e"
  },
  {
    "id": "wsj-opinion-fe283f8",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Notable & Quotable: Trump&#x2019;s Nobel Peace Prize",
    "url": "https://www.wsj.com/opinion/notable-quotable-trumps-nobel-peace-prize-norway-6bc8506c",
    "summary": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "fullContent": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "publishedAt": "2025-08-15T21:16:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "fe283f8"
  },
  {
    "id": "wsj-world-news-597a941a",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Notable & Quotable: Trump&#x2019;s Nobel Peace Prize",
    "url": "https://www.wsj.com/opinion/notable-quotable-trumps-nobel-peace-prize-norway-6bc8506c",
    "summary": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "fullContent": "&#x2018;It&#x2019;s too bad. I deserve it, but they will never give it to me.&#x2019;",
    "publishedAt": "2025-08-15T21:16:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "597a941a"
  },
  {
    "id": "ndtv-profit-youtube-7ff99494",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Putin Trump Meet | What To Expect From Trump-Putin Meeting?: Experts Decode",
    "url": "https://www.youtube.com/watch?v=6GrY2cSE6pI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T21:11:16.000Z",
    "fetchedAt": "2025-08-16T02:22:56.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7ff99494"
  },
  {
    "id": "marketwatch-46d8332c",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "In this economy, here&#x2019;s what it takes to get people to spend on summer fun",
    "url": "https://www.marketwatch.com/story/americans-who-make-over-100-000-are-still-propping-up-the-economy-but-how-long-can-they-keep-doing-it-b9535f3e?mod=mw_rss_topstories",
    "summary": "In an uncertain economic environment, at least one thing is clear: Six-figure earners are still spending money..",
    "fullContent": "In an uncertain economic environment, at least one thing is clear: Six-figure earners are still spending money..",
    "publishedAt": "2025-08-15T21:09:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "46d8332c"
  },
  {
    "id": "bloomberg-business-youtube-70fee507",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Stocks Slide as Trump Meets Putin | Closing Bell",
    "url": "https://www.youtube.com/watch?v=b-u5W7-CSaY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T21:04:51.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "70fee507"
  },
  {
    "id": "zerohedge-4c623836",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "MAHA Advocates Urge Trump To Block Immunity For Pesticide And Chemical Manufacturers",
    "url": "https://www.zerohedge.com/markets/maha-advocates-urge-trump-block-immunity-pesticide-and-chemical-manufacturers",
    "summary": "MAHA Advocates Urge Trump To Block Immunity For Pesticide And Chemical Manufacturers Authored by Jeff Louderbeck via The Epoch Times, As anticipation builds about the upcoming Make America Healthy Again (MAHA) Commission Report’s release, 241 MAHA advocates sent a letter to...",
    "fullContent": "MAHA Advocates Urge Trump To Block Immunity For Pesticide And Chemical Manufacturers Authored by Jeff Louderbeck via The Epoch Times, As anticipation builds about the upcoming Make America Healthy Again (MAHA) Commission Report’s release, 241 MAHA advocates sent a letter to President Donald Trump urging him to prevent the House of Representatives from limiting regulation for pesticides and “forever chemicals” in its environmental appropriations bill. “We ask you to take action to make sure any protections for pesticides are stricken from this Appropriations bill,” the letter says, or risk losing Republican backing. The letter also expressed opposition to liability shields for pesticide companies. Every year, more than 1.1 billion pounds of pesticides are used on U.S. farmland, including dozens of chemicals banned in other developed nations, the letter states. “These toxic substances are present in our food, air, soil, and water, and are increasingly in our children’s bodies, negatively impacting normal brain development and hormonal function,” the letter explains. “Extensive peer-reviewed research has linked glyphosate to infertility, increased reproductive risks, and 6 of the top 10 most common cancers in the [United States]. At the same time, atrazine is a known endocrine disruptor affecting sexual development, and paraquat has been linked to Parkinson’s and neurological and respiratory diseases.” Signers of the letter highlighted provisions in the Fiscal Year 2026 House Interior and Environment Appropriations Bill—Sections 453 and 507 —which they claim create broad product-liability protections for domestic and foreign pesticide and chemical manufacturers “by refusing to fund the critical, legally required scientific safety assessments needed to update labels across more than 57,000 synthetic chemicals.” “Numerous pesticides that fall under Section 453 are chemicals that are already banned in multiple other developed nations. Despite a massive outcry from citizens, the House Appropriations committee passed the spending bill last month with Section 453 and Section 507 intact,” the letter states. MAHA advocates also expressed concern about Section 507 because “it prohibits the EPA from finalizing risk assessments for PFOA and PFOS forever chemicals found in biosolids spread on farmer’s fields and eliminates funding for community health monitoring, new research, and the cleanup of more than 70 million acres of U.S. 2 farmland contaminated with PFAS from the application of biosolids.” “Mr. President, creating broad liability protections for pesticides is a losing issue for your party and your coalition, and may well cost you the House majority in the midterms,” the letter said. MAHA Action CEO Tony Lyons said in a July 24 X post that stopping Section 453 should be MAHA’s top priority right now. “There couldn’t be anything that is more important to MAHA than making sure that we don’t have pesticide liability protection for big corporations,” Lyons wrote. “Nobody should want their children to be exposed to them. Nobody should wanna be exposed to them themselves. What’s happening now looks a lot like what happened in 1986 with the vaccine liability protection for these big companies.” The letter stated that some Republicans “talk MAHA” on camera while silently advancing policies that undercut the movement. “Republicans must do more than ride the wave of MAHA’s high polling,” David Murphy, founder of United We Eat, a major fundraiser for Robert F. Kennedy Jr.’s presidential campaign, said in a press release. “President Trump must stand firm and follow through with real policy that protects American health, including opposing chemical liability shields and the Eats Act that put our children at risk and trample Americans’ constitutional right to sue,” Murphy added. The letter pointed to a 2024 poll of Iowa Republicans by Accountable Iowa that found efforts to pass cancer lawsuit liability bills “could significantly cost Republicans in state and federal elections in 2026.” The proposed legislation was not passed in Iowa. According to the poll, 87 percent of registered Republicans oppose giving chemical companies like Bayer-Monsanto immunity from lawsuits, while 94 percent agreed it is “very concerning” that the EPA relies on industry-funded data to administer safety studies. “If Republicans want to retain MAHA support long-term, they need to stop siding with agrochemical companies and take leadership on these issues,” Charles Eisenstein, who served as Kennedy’s chief speechwriter during the Health and Human Services Secretary’s presidential campaign, said. The Make America Healthy Again (MAHA) Commission “is on track to submit its Make Our Children Healthy Again Strategy report to the President on August 12th,” Kush Desai, a spokesman for the White House, told The Epoch Times in an email on Aug. 11. “The report will be unveiled to the public shortly thereafter as we coordinate the schedules of the President and the various cabinet members who are a part of the commission.” The MAHA Commission’s first report was released in May. It mostly details issues related to the health of Americans and attributes the rise of chronic diseases among children to a diet focused on ultraprocessed foods, exposure to chemicals, a lack of physical activity, and the over-prescription of medications. When Trump established the commission not long after beginning his second term, the panel was tasked to submit its first report to the president within 100 days and present him with a strategy on how to address chronic diseases, including obesity, within 180 days. That deadline was Aug. 12. The White House has not commented on the MAHA advocates’ letter as of this article’s publication time. Tyler Durden Fri, 08/15/2025 - 17:00",
    "publishedAt": "2025-08-15T21:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.089Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c623836"
  },
  {
    "id": "oil-price-698a2997",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Insurers Urged to Reassess Russian Oil Exposure",
    "url": "https://oilprice.com/Energy/Energy-General/Insurers-Urged-to-Reassess-Russian-Oil-Exposure.html",
    "summary": "An insurance association has urged its members to assess their exposure to Russian oil as the UK and EU prepare to update their oil price cap regimes. The oil price cap, introduced by the G7, EU, and Australia, aims to restrict Russia’s oil revenues by preventing Russian...",
    "fullContent": "An insurance association has urged its members to assess their exposure to Russian oil as the UK and EU prepare to update their oil price cap regimes. The oil price cap, introduced by the G7, EU, and Australia, aims to restrict Russia’s oil revenues by preventing Russian companies from selling oil above a specified threshold. In July, the UK and EU announced plans to lower the price cap to further limit Russia’s ability to fund its war in Ukraine. The new measures take effect on 2 September in the UK and 3 September in the EU. However,…",
    "publishedAt": "2025-08-15T21:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.543Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "698a2997"
  },
  {
    "id": "cnbc-markets-673fe134",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Student loan forgiveness program has a 72,730-person backlog. Here's what borrowers need to know",
    "url": "https://www.cnbc.com/2025/08/15/public-service-loan-forgiveness-buyback-has-a-72730-person-backlog.html",
    "summary": "Many student loan borrowers have likely heard about or experienced issues with the Public Service Loan Forgivness 'Buyback' program. Here's what to know.",
    "fullContent": "Many student loan borrowers have likely heard about or experienced issues with the Public Service Loan Forgivness 'Buyback' program. Here's what to know.",
    "publishedAt": "2025-08-15T20:59:33.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "673fe134"
  },
  {
    "id": "cnbc-markets-3066d8cf",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "46-year-old woman is weeks away from student loan forgiveness but stuck in Trump-era backlog",
    "url": "https://www.cnbc.com/2025/08/15/student-loan-forgiveness-trump-pslf-backlog.html",
    "summary": "Tens of thousands of student loan borrowers who are likely eligible for Public Service Loan Forgiveness are stuck in limbo. CNBC spoke to three of them.",
    "fullContent": "Tens of thousands of student loan borrowers who are likely eligible for Public Service Loan Forgiveness are stuck in limbo. CNBC spoke to three of them.",
    "publishedAt": "2025-08-15T20:59:05.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3066d8cf"
  },
  {
    "id": "wsj-markets-main-12568ec8",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Dow Industrials Hit First Intraday High of 2025, Powered by UnitedHealth Shares",
    "url": "https://www.wsj.com/finance/stocks/dow-industrials-hit-first-intraday-high-of-2025-powered-by-unitedhealth-shares-43af6339?mod=rss_markets_main",
    "summary": "A vote of confidence by Warren Buffett&#x2019;s Berkshire Hathaway delivered the Dow laggard its best day since 2020.",
    "fullContent": "A vote of confidence by Warren Buffett&#x2019;s Berkshire Hathaway delivered the Dow laggard its best day since 2020.",
    "publishedAt": "2025-08-15T20:57:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.037Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "12568ec8"
  },
  {
    "id": "techmeme-4c573027",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Some developers say GPT-5 excels at technical reasoning and planning coding tasks and is cost-effective, but Claude Opus and Sonnet still produce better code (Lauren Goode/Wired)",
    "url": "http://www.techmeme.com/250815/p18#a250815p18",
    "summary": "Lauren Goode / Wired: Some developers say GPT-5 excels at technical reasoning and planning coding tasks and is cost-effective, but Claude Opus and Sonnet still produce better code — Software engineers are finding that OpenAI's new GPT-5 model is helping them think through...",
    "fullContent": "Lauren Goode / Wired: Some developers say GPT-5 excels at technical reasoning and planning coding tasks and is cost-effective, but Claude Opus and Sonnet still produce better code — Software engineers are finding that OpenAI's new GPT-5 model is helping them think through coding problems—but isn't much better at actual coding.",
    "publishedAt": "2025-08-15T20:55:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4c573027"
  },
  {
    "id": "bloomberg-markets-35bb33b2",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Stocks Slide as Trump Meets Putin | Closing Bell",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/stocks-slide-as-trump-meets-putin-closing-bell-video",
    "summary": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Scarlet Fu, Vonnie Quinn, Carol Massar and Emily Graffeo. (Source: Bloomberg)",
    "fullContent": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Scarlet Fu, Vonnie Quinn, Carol Massar and Emily Graffeo. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:52:54.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "35bb33b2"
  },
  {
    "id": "cnbc-markets-6191a611",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "FBI Director Patel and foundation win defamation lawsuit against blogger, awarded $250,000",
    "url": "https://www.cnbc.com/2025/08/15/fbi-kash-patel-lawsuit-stewartson.html",
    "summary": "Blogger Jim Stewartson accused Kash Patel of being a \"Kremlin asset,\" of trying to overthrow the U.S. government, and of planning the Jan. 6, 2021, attack.",
    "fullContent": "Blogger Jim Stewartson accused Kash Patel of being a \"Kremlin asset,\" of trying to overthrow the U.S. government, and of planning the Jan. 6, 2021, attack.",
    "publishedAt": "2025-08-15T20:49:04.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6191a611"
  },
  {
    "id": "bloomberg-business-youtube-319d684d",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump, Putin Arrive for Alaska Summit | Bloomberg Businessweek Daily 8/15/2025",
    "url": "https://www.youtube.com/watch?v=vgR1-RnY0tw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:47:23.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "319d684d"
  },
  {
    "id": "cnbc-markets-2ec59af9",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Opendoor CEO resigns following investor pressure campaign",
    "url": "https://www.cnbc.com/2025/08/15/opendoor-stock-ceo-resignation.html",
    "summary": "Opendoor CEO Carrie Wheeler said on Friday that she's resigning following \"weeks of intense outside interest\" in the online real estate company.",
    "fullContent": "Opendoor CEO Carrie Wheeler said on Friday that she's resigning following \"weeks of intense outside interest\" in the online real estate company.",
    "publishedAt": "2025-08-15T20:45:24.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2ec59af9"
  },
  {
    "id": "nautilus-magazine-6d9b95cc",
    "sourceId": "nautilus-magazine",
    "sourceName": "Nautilus Magazine",
    "title": "Making Backpacks for Tiny Fish",
    "url": "https://nautil.us/making-backpacks-for-tiny-fish-1231478/",
    "summary": "A new generation of petite, submersible tracking tags offers a fresh look at the lives of little fishes The post Making Backpacks for Tiny Fish appeared first on Nautilus.",
    "fullContent": "A new generation of petite, submersible tracking tags offers a fresh look at the lives of little fishes The post Making Backpacks for Tiny Fish appeared first on Nautilus.",
    "publishedAt": "2025-08-15T20:43:56.000Z",
    "fetchedAt": "2025-08-16T02:25:52.987Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "6d9b95cc"
  },
  {
    "id": "wsj-youtube-16a9adc",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Ukrainian Community in New York Demands Peace as Trump, Putin Meet | WSJ News",
    "url": "https://www.youtube.com/watch?v=bevZ3c6Lhps",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:43:31.000Z",
    "fetchedAt": "2025-08-16T02:23:18.577Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "16a9adc"
  },
  {
    "id": "the-verge-60ab39a",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Dead Take’s best scares come from real-life performances",
    "url": "https://www.theverge.com/games/760213/dead-take-review-fmv-horror-game-ben-starr",
    "summary": "Dead Take, the second game from Tales of Kenzera: Zau developer Surgent Studios, is a quiet horror game where the monster is ambition and the lengths a person will go for stardom. Like a lot of horror games, Dead Take relies on jumpscares to get the heart pumping.",
    "fullContent": "Dead Take, the second game from Tales of Kenzera: Zau developer Surgent Studios, is a quiet horror game where the monster is ambition and the lengths a person will go for stardom. Like a lot of horror games, Dead Take relies on jumpscares to get the heart pumping. But playing this game, my deepest, most [&#8230;]",
    "publishedAt": "2025-08-15T20:42:42.000Z",
    "fetchedAt": "2025-08-17T02:34:44.127Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "60ab39a"
  },
  {
    "id": "bloomberg-markets-1c00a516",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Wall Street Wrestles With Hedging Conundrum as Valuations Swell",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/wall-street-wrestles-with-hedging-conundrum-as-valuations-swell",
    "summary": "Nathan Thooft is no market bear. His team at Manulife Investment Management, which oversees $160 billion, still holds a modest overweight in stocks. But as US markets jump from record to record, he’s been trimming big winners, buying bonds and adding a layer of protection with...",
    "fullContent": "Nathan Thooft is no market bear. His team at Manulife Investment Management, which oversees $160 billion, still holds a modest overweight in stocks. But as US markets jump from record to record, he’s been trimming big winners, buying bonds and adding a layer of protection with longer-dated options.",
    "publishedAt": "2025-08-15T20:41:34.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1c00a516"
  },
  {
    "id": "bloomberg-markets-22d1087b",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Pandora CEO on Tariff Impact, European Market, Lab Grown Diamonds, Prices",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/pandora-ceo-on-tariff-impact-european-market-diamonds-video",
    "summary": "Danish jewelry company Pandora CEO Alexander Lacik discusses the impact of the tariffs imposed by President Trump. He speaks with Scarlet Fu on \"The Close\" about the European market, price increases, lab grown diamonds and the option of moving manufacturing to the US.",
    "fullContent": "Danish jewelry company Pandora CEO Alexander Lacik discusses the impact of the tariffs imposed by President Trump. He speaks with Scarlet Fu on \"The Close\" about the European market, price increases, lab grown diamonds and the option of moving manufacturing to the US. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:40:47.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "22d1087b"
  },
  {
    "id": "zerohedge-bf197b2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Power Bill Crisis Is Here To Stay \"For A Few Years\"",
    "url": "https://www.zerohedge.com/ai/power-bill-crisis-here-stay-few-years",
    "summary": "Power Bill Crisis Is Here To Stay \"For A Few Years\" To close out the week, we're getting a much clearer picture of the power bill crisis financially battering working-poor and middle-class households, as well as mom-and-pop businesses - and it's about to get a whole lot worse.",
    "fullContent": "Power Bill Crisis Is Here To Stay \"For A Few Years\" To close out the week, we're getting a much clearer picture of the power bill crisis financially battering working-poor and middle-class households, as well as mom-and-pop businesses - and it's about to get a whole lot worse. Monthly bills are set to spike even higher, and the political fallout could be brutal for Democrats who championed everything 'green' - retiring stable fossil fuel power generation in favor of unreliable wind and solar. This epic failure guarantees voters a monthly reminder of just how disastrous these policies have become across Maryland and New Jersey (soon, many other states) every time they open their power statement. On Thursday, Secretary of Energy Chris Wright joined conservative commentator Glenn Beck in a discussion about all things energy, especially the emerging power bill crisis that will soon become a national topic in the era of faltering green policies colliding with surging power demand from AI data centers. The takeaway from Beck and Wright's conversation is that the power bill crisis won't be solved this year and will only worsen. Here's the conversation: Beck: When should we see this actually starting to happen and how long before power prices come down? Wright: Oh, man. That is the big question that President Trump asked me that every single day, let's get oil prices down, let's get gas prices down, let's get electricity prices down. And it takes a while to build infrastructure. Fortunately quickly we can stop the closure of coal plants, but still have lots of lifetime left. We've already done that. That's why we don't have much worse blackouts already today. We do have new gas plants coming on this year, a lot more coming on next year. We'll have nuclear plants on later this term. We'll have a whole bunch of them under construction. But yet to turn the giant aircraft carrier that is the electricity grid, that's going to take a few years. But hopefully we can stop the huge rise in prices. We can build the capacity so the United States can keep our lead on artificial intelligence over China. We get behind China and they control AI, our national security is at risk. Beck: Yeah, I know. Wright: So the whole administration is seven days a week working on this effort. You will see dramatically fewer blackouts this summer than you would have had the election gone the other way. And I think we'll be in a little bit better situation next summer, somewhere in between there this winter. We're rapidly swimming the right way. I wish I could say power prices are going down twenty percent next year, but it's simply not possible to do that in twelve months. What I will tell you, President Trump is seven days a week doing everything he can towards that goal. .@SecretaryWright says President Trump asks him \"every single day\" when Americans will see lower energy bills: “I wish I could say power prices are going down 20% next year. But it’s simply not possible to do that in 12 months. But Trump is 7 days a week doing everything he can.” pic.twitter.com/BkYzvQoCHq — Glenn Beck (@glennbeck) August 14, 2025 To recap the week in all things power: The epicenter of America's power crisis appears to be on the PJM Interconnection grid, with the Mid-Atlantic area at ground zero. In Baltimore, Maryland, on Monday, a single substation outage pushed a grid serving a million people to the brink of collapse, with no spare capacity (thank the Democrats), as the local utility warned of widespread blackouts. The grid was ultimately fixed hours later, but the near collapse raised alarms at the local, state, and national levels over how fragile Maryland's grid has become after years of Democrats retiring fossil fuel power generation in favor of unstable solar and wind. \"Prepare Now\": Substation Failure Puts Baltimore At Risk Of \"Widespread\" Blackout https://t.co/pCbEvuXk7P — zerohedge (@zerohedge) August 11, 2025 Then by Tuesday, a new poll in Maryland showed that among the many things, if that's fisical crisis, taxes, illegal aliens, crime, and whatever else, as well as exploding power bills for millions, Maryland Governor Westley Watende Omari Moore, who is being positioned for the party's 2028 presidential run, experinced sliding poll numbers that have set the Democratic Party into a panic. Power Bill Crisis Sends Maryland Gov. Wes Moore's Approval Plummeting https://t.co/uQebt96XLa — zerohedge (@zerohedge) August 12, 2025 And later in the week, we identified that the power bill crisis had spread from Maryland to New Jersey. What state is next? Power-Bill Crisis Spreads From Maryland To New Jersey, May Doom Democrats As 'Green' Implodes https://t.co/yKULnafoT8 — zerohedge (@zerohedge) August 14, 2025 As well as citing a Goldman Sachs note about how America's power crisis is only getting started. Key chart from the report (read here). Ah yes, this. Mark our words. In one year, this will be the most popular chart on this site pic.twitter.com/h93gWXMoNL — zerohedge (@zerohedge) August 11, 2025 . . . Tyler Durden Fri, 08/15/2025 - 16:40",
    "publishedAt": "2025-08-15T20:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.090Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "bf197b2"
  },
  {
    "id": "bloomberg-markets-f5fcda3",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump Tempers Expectations for Putin Summit | Bloomberg Markets 8/15/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/bloomberg-markets-8-15-2025-video",
    "summary": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. SharpLink gaming CO-CEO Jospeh Chalom, Bloomberg's Joe Deaux, Yinqin Shen and Thomas Seal. (Source: Bloomberg)",
    "fullContent": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. SharpLink gaming CO-CEO Jospeh Chalom, Bloomberg's Joe Deaux, Yinqin Shen and Thomas Seal. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:37:29.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "f5fcda3"
  },
  {
    "id": "ndtv-profit-youtube-55a64413",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Donald Trump Receives Vladimir Putin In Alaska: Red Carpet, Smiles And Handshakes",
    "url": "https://www.youtube.com/watch?v=XbRHLKKNDqo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:35:38.000Z",
    "fetchedAt": "2025-08-16T02:22:56.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "55a64413"
  },
  {
    "id": "bloomberg-politics-5757790d",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump-Putin Summit Overwhelms Anchorage",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-15/trump-putin-summit-overwhelms-anchorage",
    "summary": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Today, White House correspondent Hadriana Lowenkron sets the scene for President Trump’s meeting with Russian leader Vladimir Putin. Sign up here and follow us at @bpolitics.",
    "fullContent": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Today, White House correspondent Hadriana Lowenkron sets the scene for President Trump’s meeting with Russian leader Vladimir Putin. Sign up here and follow us at @bpolitics. Email our editors here.",
    "publishedAt": "2025-08-15T20:30:38.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5757790d"
  },
  {
    "id": "bloomberg-politics-33c3cd09",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump-Putin Summit Began With Cozy Chat Alone in ‘The Beast’",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/trump-putin-summit-began-with-a-cosy-chat-alone-in-the-beast",
    "summary": "Donald Trump and Vladimir Putin’s summit in Alaska started with a very stage-managed opening — each leader descending from their respective airplanes, a visibly warm handshake on the tarmac. Pats on the arm. A military overfly.",
    "fullContent": "Donald Trump and Vladimir Putin’s summit in Alaska started with a very stage-managed opening — each leader descending from their respective airplanes, a visibly warm handshake on the tarmac. Pats on the arm. A military overfly.",
    "publishedAt": "2025-08-15T20:26:11.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "33c3cd09"
  },
  {
    "id": "yahoo-finance-d0e435a",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Nucor Stock Gets a Boost From Buffett. Berkshire’s Last Steel Buy Didn’t Go So Well.",
    "url": "https://www.barrons.com/articles/nucor-stock-steel-price-nue-buffett-buy-1c98cdd6?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:26:00.000Z",
    "fetchedAt": "2025-08-17T02:34:41.997Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d0e435a"
  },
  {
    "id": "yahoo-finance-55d749e6",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "This Meatpacker Stock Is a Quality Buy at a Discount Price",
    "url": "https://www.barrons.com/articles/buy-jbs-stock-price-pick-8f42f412?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:25:00.000Z",
    "fetchedAt": "2025-08-17T02:34:41.997Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "55d749e6"
  },
  {
    "id": "yahoo-finance-3cde594e",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Stocks Close Mildly Lower as US Consumer Sentiment Declines",
    "url": "https://finance.yahoo.com/news/stocks-close-mildly-lower-us-202450519.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:24:50.000Z",
    "fetchedAt": "2025-08-17T02:34:41.997Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3cde594e"
  },
  {
    "id": "bloomberg-business-youtube-1f0d33f8",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Debate Heats Up Over Fed's Next Move | Real Yield 8/15/2025",
    "url": "https://www.youtube.com/watch?v=51dNP878_q0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:23:52.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1f0d33f8"
  },
  {
    "id": "marginal-revolution-7617ecb3",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "&#8220;A bunch of economists&#8221;",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/a-bunch-of-economists.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=a-bunch-of-economists",
    "summary": "Here is the link. The post &#8220;A bunch of economists&#8221; appeared first on Marginal REVOLUTION.",
    "fullContent": "Here is the link. The post &#8220;A bunch of economists&#8221; appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-15T20:23:34.000Z",
    "fetchedAt": "2025-08-16T02:22:48.189Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "7617ecb3"
  },
  {
    "id": "cnbc-markets-319d49c6",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump meets Putin in Alaska for summit on Ukraine war",
    "url": "https://www.cnbc.com/2025/08/15/nothing-is-off-the-table-as-trump-and-putin-set-to-meet.html",
    "summary": "\"Trump wants to exhaust all options to have a peaceful end to war,\" the White House said in advance of his meeting with Vladimir Putin.",
    "fullContent": "\"Trump wants to exhaust all options to have a peaceful end to war,\" the White House said in advance of his meeting with Vladimir Putin.",
    "publishedAt": "2025-08-15T20:23:02.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "319d49c6"
  },
  {
    "id": "yahoo-finance-714a24e3",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "How Argenx's 'Blowout' Quarter Sparked A Blazing 31% Monthlong Run",
    "url": "https://www.investors.com/research/the-new-america/argenx-stock-q2-2025-vyvgart-prefilled-syringe-cidp/?src=A00220&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:20:48.000Z",
    "fetchedAt": "2025-08-17T02:34:41.997Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "714a24e3"
  },
  {
    "id": "nyt-business-493c6048",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Frank Savage, 87, Business Leader Entangled in Enron Scandal, Is Dead",
    "url": "https://www.nytimes.com/2025/08/15/business/frank-savage-dead-at-87.html",
    "summary": "He was one of the relatively few Black Americans to reach the upper echelons of global finance. He was also a competitive sailor.",
    "fullContent": "He was one of the relatively few Black Americans to reach the upper echelons of global finance. He was also a competitive sailor.",
    "publishedAt": "2025-08-15T20:20:41.000Z",
    "fetchedAt": "2025-08-16T02:22:47.574Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "493c6048"
  },
  {
    "id": "bloomberg-markets-62e8694d",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Giuliano: Putin Winning 'War of Narratives'",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/giuliano-putin-winning-war-of-narratives-video",
    "summary": "Columbia University Senior Lecturer in Political Science Elise Giuliano previews the impending summit between President Donald Trump and Russian President Vladimir Putin in Alasaka, saying Putin has already achieved a victory just by having the summit without Ukraine.",
    "fullContent": "Columbia University Senior Lecturer in Political Science Elise Giuliano previews the impending summit between President Donald Trump and Russian President Vladimir Putin in Alasaka, saying Putin has already achieved a victory just by having the summit without Ukraine. Giuliano believes the US has leverage, and President Trump needs to exercise it as much as possible. She talks with Carol Massar and Emily Graffeo on Bloomberg's \"Businessweek Daily.\" (Source: Bloomberg)",
    "publishedAt": "2025-08-15T20:20:17.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62e8694d"
  },
  {
    "id": "zerohedge-3d8f3a96",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Stockman: America Don't Need No \"Independent\" Fed",
    "url": "https://www.zerohedge.com/political/stockman-america-dont-need-no-independent-fed",
    "summary": "Stockman: America Don't Need No \"Independent\" Fed Authored by David Stockman via InternationalMan.com, Talk about hiding in plain sight. Here is possibly the most important graph ever about the flagging state of the US economy and the utter failure of Washington’s constant...",
    "fullContent": "Stockman: America Don't Need No \"Independent\" Fed Authored by David Stockman via InternationalMan.com, Talk about hiding in plain sight. Here is possibly the most important graph ever about the flagging state of the US economy and the utter failure of Washington’s constant efforts during the last two decades to “stimulate” improved outcomes. To wit, the US industrial production index—which measures the sum of manufacturing, energy, mining, and utility output—marched straight uphill at a 3.3% annual rate between 1954 and 2007. Yet since then it has essentially plateaued, rising by just 0.10% per annum during the past 17 years. That’s right. The growth rate of America’s industrial foundation has plunged by 97% since the pre-crisis peak in Q4 2007. And yet June’s industrial production index, which was up a small tad, gets headlined as a sign of economic strength. In fact, the longer-term chart below screams the very opposite. After all, there is no logic that says an economy can remain healthy and prosperous that is increasingly based on educating a shrinking number of kids, feeding an expanding national waistline at fast food joints, and changing adult diapers among the soaring share of the population composed of octogenarians. At the end of the day, you actually have to make things in order for the population to pay for taking in each other’s laundry. As it has happened, however, during the 48 months since June 2021 the industrial production index has been negative or flat nearly half the time on a month-over-month basis. For all practical purposes, the US industrial economy is just playing “mother may I”, advancing one step forward and the next step backwards month after month. And if that’s “strong” or even a sign of anything except decaying performance, we’d suggest the English language has lost all meaning. As it happens, the disconnect becomes even more dramatic when you compare the production of goods since Q4 2007 with the constant dollar value of goods consumption (PCE) during the same period. That is to say, cumulative real consumption of goods (durable and non-durable) rose by 62% but domestic industrial output was up by only 1.4%! Obviously, the yawning gap got filled by imports. On the margin, therefore, the growth of goods consumption during the last 17 years was based on imports financed by massive current account deficits. Needless to say, the above disconnect was not due to a want of trying by means of Washington-based stimmies. The index lines for Federal Debt and the Fed’s balance sheet since 1954 show the opposite pattern to that embedded in the industrial index chart above. That is to say, growth was slow to moderate between 1954 and 2007, but then took off like a bat out of hell thereafter. Thus, between 1954 and 2007, US Treasury debt outstanding grew by 6.5% per annum, while the Fed’s balance sheet expanded by 5.6% per year. During the last 17 years, by contrast, the public debt rose by 10.7% per year, and the Fed’s balance sheet grew by 13.3% per year. To reprise, industrial production growth has essentially ground to a halt at 0.1% per year since 2007, notwithstanding a 13.3% per annum expansion of Fed credit. Self-evidently, all that high-powered central bank money was going somewhere, but clearly it was not into the production of goods on Main Street. There is no mystery, however, as to where it actually went. Since Q4 2007, the NASDAQ 100 index has risen by 86-fold. In turn, the net worth of the top 1% of US households has soared from $18.9 trillion to $49.4 trillion. Stated differently, industrial production went nowhere, even as the net worth of the top 1.35 million US households soared by nearly $31 trillion. And yet and yet. Bubble vision today was replete with Wall Street experts rebuking the Donald in the name of the Fed’s purportedly sacrosanct “independence” for his impending plan to fire Jay Powell. Then again, the Latin phrase “cui bono” immediately comes to mind. The answer to “who benefits” from the Fed’s so-called “independence” is surely not Main Street America. The fact is, the Fed is neither a democratically accountable arm of the state nor an agency of the free market. It was, is, and may always be a tool of the traders and gamblers who inhabit the canyons of Wall Street. To be sure, the Donald’s comprehension of monetary policy is about as wrong-headed as it gets, but his imminent frontal attack on the rogue institution domiciled in the Eccles Building may well be the only way to upend its destructive reign. * * * The data doesn’t lie—and neither do the consequences. As Washington’s debt-fueled “stimulus” regime enriches Wall Street while hollowing out Main Street, the illusion of prosperity continues to mask an industrial and monetary decay that cannot go on forever. The cracks are widening, and the next phase may bring seismic changes most Americans are unprepared for. That’s why we’ve put together a free special report: “Guide to Surviving and Thriving During an Economic Collapse.” If you want to understand what’s coming—and how to protect yourself, your assets, and your freedom—don’t wait until the crisis hits full force. Click here to claim your free copy now. You owe it to yourself to be informed—and ready. Tyler Durden Fri, 08/15/2025 - 16:20",
    "publishedAt": "2025-08-15T20:20:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.090Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3d8f3a96"
  },
  {
    "id": "yahoo-finance-403f0ee4",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "US appeals court sides with Argentina, keeps YPF share turnover on hold",
    "url": "https://finance.yahoo.com/news/us-appeals-court-grants-argentina-201927944.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:19:27.000Z",
    "fetchedAt": "2025-08-17T02:34:41.997Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "403f0ee4"
  },
  {
    "id": "yahoo-finance-3e842a40",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Opendoor stock pops 4% after CEO steps down following pressure from investors",
    "url": "https://finance.yahoo.com/news/opendoor-stock-pops-4-after-ceo-steps-down-following-pressure-from-investors-201920387.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:19:20.000Z",
    "fetchedAt": "2025-08-17T02:34:41.997Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3e842a40"
  },
  {
    "id": "yahoo-finance-64c84ad7",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Joby Aviation Falls. What a 12-Minute Flight Means for the Stock.",
    "url": "https://www.barrons.com/articles/joby-aviation-stock-air-taxi-flight-23d18b4d?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T20:19:00.000Z",
    "fetchedAt": "2025-08-17T02:34:41.997Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "64c84ad7"
  },
  {
    "id": "ft-technology-5f83a1b0",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "Data of former UK ministers and Afghan refugees leaked after cyber attack",
    "url": "https://www.ft.com/content/d9b41de8-c287-4bd8-89cb-fa2d04905598",
    "summary": "Action against third-party contractor comes a month after revelations of breach related to resettlement scheme.",
    "fullContent": "Action against third-party contractor comes a month after revelations of breach related to resettlement scheme",
    "publishedAt": "2025-08-15T20:18:43.000Z",
    "fetchedAt": "2025-08-16T02:22:48.361Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5f83a1b0"
  }
]