[
  {
    "id": "yahoo-finance-181d5881",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Eastman Kodak Raises Doubt About Ability to Pay Debt",
    "url": "https://www.wsj.com/business/eastman-kodak-raises-doubt-about-ability-to-pay-debt-38870c83?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T22:04:00.000Z",
    "fetchedAt": "2025-08-13T09:45:58.624Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "181d5881"
  },
  {
    "id": "the-verge-4bf7dec",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "That viral video of a ‘deactivated’ Tesla Cybertruck is a fake",
    "url": "https://www.theverge.com/tesla/757594/tesla-cybertruck-deactivated-viral-video-fake",
    "summary": "Did Tesla remotely deactivate a Cybertruck in the middle of a highway because the owner featured it in an unauthorized music video? The story already seemed highly unlikely, and on Monday afternoon, Tesla tweeted about the video, saying, “This is fake – that’s not our screen.",
    "fullContent": "Did Tesla remotely deactivate a Cybertruck in the middle of a highway because the owner featured it in an unauthorized music video? The story already seemed highly unlikely, and on Monday afternoon, Tesla tweeted about the video, saying, “This is fake – that’s not our screen. Tesla does NOT disable vehicles remotely.” On Sunday, Instagram [&#8230;]",
    "publishedAt": "2025-08-11T22:03:43.000Z",
    "fetchedAt": "2025-08-12T02:23:23.096Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4bf7dec"
  },
  {
    "id": "bloomberg-markets-661f5012",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Japan’s Government Pension Investment Fund Is Hiring as Assets Balloon",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/japan-pension-running-1-8-trillion-with-tiny-team-is-now-hiring",
    "summary": "Japan’s Government Pension Investment Fund, one of the world’s largest retirement funds, is about to increase its unusually small staff as the assets it oversees balloon.",
    "fullContent": "Japan’s Government Pension Investment Fund, one of the world’s largest retirement funds, is about to increase its unusually small staff as the assets it oversees balloon.",
    "publishedAt": "2025-08-11T22:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "661f5012"
  },
  {
    "id": "zerohedge-484f745f",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Goldman Finds \"Inflection Point\" With Humanoid Robots; We Tested Unitree's Robodog",
    "url": "https://www.zerohedge.com/ai/goldman-chats-humanoid-robot-makers-we-tested-unitrees-robodog",
    "summary": "Goldman Finds \"Inflection Point\" With Humanoid Robots; We Tested Unitree's Robodog Goldman analyst Jacqueline Du attended the 2025 World Robot Conference (WRC) in Beijing, China, this past weekend and spoke with executives from some of the top humanoid robot companies to gauge...",
    "fullContent": "Goldman Finds \"Inflection Point\" With Humanoid Robots; We Tested Unitree's Robodog Goldman analyst Jacqueline Du attended the 2025 World Robot Conference (WRC) in Beijing, China, this past weekend and spoke with executives from some of the top humanoid robot companies to gauge the state of the industry, with the overall consensus that the \"ChatGPT moment\" for these robots is not far away. Chinese humanoids game is insane! 🥡 At the 2025 World Robot Conference in Beijing, @UBTECHRobotics unveiled the Walker S2, the world’s first humanoid robot with autonomous battery swapping, completing the process in just three minutes. UBTECH says this capability enables 24/7… pic.twitter.com/fpMSCdlM7v — Lukas Ziegler (@lukas_m_ziegler) August 11, 2025 Du spoke with CEOs, CFOs, COOs, research heads, product VPs, and capital market managers from nine major humanoid robot companies, including Astribot, Booster Robotics, Galbot, Kepler, LimX, Paxini, RobotEra, Spirit.ai, and UBTech. The World Robot Conference 2025 opened in Beijing on Friday, as a robotic host invited attendees to jointly inaugurate the event. The expo of the World Robot Conference features over 1,500 exhibits from more than 200 leading domestic and international robotics companies,… pic.twitter.com/4ABzwuZ9YX — Global Times (@globaltimesnews) August 8, 2025 What she found is that consumer interest in humanoid robots is beginning to rise. Her view is that the tech inflection point for these bots entering the real world is still 2 to 3 years away - certainly less than ten. At least 20 new humanoid robots were launched at the event. Here are Du's top takeaways from WRC: 1. Very strong family/consumer visitor traffic that we observed at the event as compared to 2025 WAIC in Shanghai. While the latter was more focused on broad AI academic and industry development topics with humanoid robot as a subset, and thus had more professional visitors, WRC is completely dedicated to robot technologies and product demos. This in our view suggests that near-term educational, companion and entertainment demand potential could be strong (aside from scientific study, AI model training, government, developers and stage performance demand etc). In the long term, we see this as an early indicator that as long as robot products are useful, affordable and safe enough, consumer demand potential could be very significant aside from manufacturing demand. Recently Unitree launched its new product R1 that is priced at Rmb39,900 (121cm/25kg/26 DOF) and Engine.ai announced plans to launch SA02 (125cm/25kg/26+2 DOF) soon at Rmb38,500, both of which could be targeting these demands with product specs that are also much more simplified. 2. Regarding the technology inflection point, the most positive comments we heard suggest that at least 1-2 years are still required to scale up data and enhance models for reinforcement learning (RL), or to transition to end-to-end operations after 1-2 years of rule-based operation. This is primarily because industrial settings are difficult to simulate, potentially requiring up to 70-80% of high-quality real-world data for effective training, per some comments. We also heard about practices such as multi-modal remote operation by humans as a bridge solution, provided low latency can be ensured (with two companies citing Tesla's new diner in Los Angeles where Optimus robots were observed serving popcorn). During his speech at the opening ceremony, Unitree CEO Wang Xingxing defined the robot's \"ChatGPT moment\" as actually being able to complete tasks with generalized skillsets in a completely new environment, which he said is at least 2-3 years away, but not more than 10 years away. That said, Google's new AI video generation model, Veo3, introduced in May 2025, which notably creates and incorporates audio (including dialogue, sound effects, and background music) and excels from text and image prompting to real-world physics and accurate lip-syncing, presents an interesting discussion point among robot companies. Its capabilities have raised the question of whether its underlying AI architecture could be even more optimal than Vision-Language-Action (VLA) models combined with Reinforcement Learning (RL), which some have regarded as a primary AI solution for robotics and embodied AI since early this year. Therefore, we highlight that investors should be aware of potential product redesign risk given the ongoing, rapid co-evolution between software and hardware structures, as these two elements remain intrinsically linked in AI development. However, we are encouraged to see the industry's swift progress, with new advancements emerging every couple of months. A side note is that Nvidia has been very proactive at WRC, delivering keynote speech/seminars and showcasing its strategic initiatives in Physical AI and General-purpose Robotics, with its full-stack suite that encompasses cloud-scale model training, physics-based simulation (e.g., Isaac Sim/Lab) for synthetic data generation, and real-time edge AI deployment (e.g., Jetson AGX Thor). They have also recently newly introduced Cosmos Reason, an advanced Vision Language Model (VLM) designed to imbue robots with common sense and the ability to understand real-world scenarios. It is worth noting that almost every robot product is still using Jetson AGX Thor or the broader Jetson platform, per our checks. 3. There have been 20+ new products launched around this event (in July/Aug) out of total ~50 humanoid robot exhibitors (alongside another ~120 industrial robots and component companies). We saw variations across wheel-based and bipedal robots (with full rotary actuators or combination of rotary+linear). Overall product performance (WBC or whole body control) has improved quite significantly vs our visits in Feb/May in terms of speed and smoothness. All live demos functioned well from those companies that we saw and we came away positively surprised on this front. 4. In terms of applications, there were four major directions that we perceived: a) for education, show-room guide and stage performance purposes; b) standard platform for developers and scientific study/AI training purposes; c) manufacturing & logistics; and d) consumer/elderly care/companion. a) and b) are currently contributing the bulk of the volumes while for c), we were informed by companies we met that success rates for selective tasks such as pick and place, sorting, assembly and inspection has now reached 80-99.5% with further improvement mainly to address long tail and abnormal situations; while regarding whether robot operation speed (reasoning & execution) can match that of customers' product line, it seems that non-production line tasks are where those robot players are currently targeting in a pragmatic way to ramp up initial volumes, and also to adapt to future flexible manufacturing system (FMS) needs. We also learned that manufacturers value whole system efficiency (e.g. multi-robot collaboration) more than single robot efficiency against single human labor on the same task. An 18-month payback is considered reasonable by customers to place orders, per one company's comment. 5. On cost reduction, we perceived that among those robot players, domestic component ratio appears quite high (possibly ~80% already). They have also worked on the design optimization aspect this year to further lower cost with some hardware specs being lowered, we noticed. Going forward, volume leverage remains the key to bring the cost curve down. 6. In terms of recent government subsidies news, media reports suggest consumer purchase subsidies at Rmb1,500 per unit (on a single purchase exceeding Rmb10,000) and corporate purchase subsidies at Rmb250k per unit (on a single purchase exceeding Rmb5mn). These discounts are for in-store purchases at the \"E-Town Robot Consumption Festival\" in Beijing, which will run from Aug 2 to Aug 17. Online discounts are also available on JD.com: consumers and enterprises alike can get Rmb 600 off orders greater than Rmb 6,000, and Rmb 50 off orders greater than Rmb 500. (news link, link). In markets, the Solactive China Humanoid Robotics Index - a thematic equity index tracking Chinese companies involved in the commercialization of humanoid and robotics technologies - is up 27.5% on the year. The index jumped last week on news of Chinese robotics firm Unitree's new robotic dog called \"A2 Stellar Hunter.\" Unitree Introducing | Unitree A2 Stellar Hunter 🤩 Total weight: ~37kg | Unloaded range: ~20km Lighter, Stronger and Faster. Engineered for Industrial Applications. pic.twitter.com/Rqpa7EkU0B — Unitree (@UnitreeRobotics) August 5, 2025 Our coverage focuses on a 'Skynet-like system' materializing in the years ahead: Goldman's Chat With Top Robotics Firm Reveals Skynet Humanoid Timeline Goldman's Investing Guide To Skynet \"Here Come Humanoids\": Morgan Stanley Braces For The Looming Phase Shift in AI There's An iPhone Moment Happening With Humanoids \"iPhone Moment\" Nears For Humanoid Robots China Warns of Rogue Robot Troops Unleashing Terminator-Style \"Indiscriminate Killings\" China Humanoid Robotics Index Jumps After Unitree Debuts \"Stellar Hunter\" Vacuuming, Mopping, Mowing: The Household Robots Are Coming Meta Plans For New AI Humanoid Robot For \"Household Chores\"; Headline Fuels Stock Rally A New Fear Unlocked. We tested the Unitree Go2 Quadruped Robot. New fear unlocked… it stands and everything. What should we do with it next? Flamethrower? Tyler Durden Mon, 08/11/2025 - 18:00",
    "publishedAt": "2025-08-11T22:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.060Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "484f745f"
  },
  {
    "id": "oil-price-3980b6ee",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Exxon Will Benefit Most from South America’s Newest Petrostate",
    "url": "https://oilprice.com/Energy/Crude-Oil/Exxon-Will-Benefit-Most-from-South-Americas-Newest-Petrostate.html",
    "summary": "The South American country of Guyana has recently emerged as a world-recognized oil-producing nation. This occurred due to ExxonMobil’s string of world-class discoveries in offshore Guyana, starting with the 2015 Liza-1 wildcat well, drilled 118 miles northeast of the capital,...",
    "fullContent": "The South American country of Guyana has recently emerged as a world-recognized oil-producing nation. This occurred due to ExxonMobil’s string of world-class discoveries in offshore Guyana, starting with the 2015 Liza-1 wildcat well, drilled 118 miles northeast of the capital, Georgetown, in the 6.6 million-acre Stabroek Block. Big Oil is pouring billions of dollars into Guyana, an impoverished country of less than one million, now among the world’s top offshore drilling locations. Ongoing exploration and development will further boost…",
    "publishedAt": "2025-08-11T22:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.382Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "3980b6ee"
  },
  {
    "id": "marketwatch-622eccff",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "AMC sees moviegoers spending record amounts. &#x2018;Choke on that!&#x2019; CEO says to naysayers.",
    "url": "https://www.marketwatch.com/story/amc-sees-moviegoers-spending-record-amounts-and-its-stock-surges-72b55800?mod=mw_rss_topstories",
    "summary": "AMC&#x2019;s CEO had a blunt message for naysayers as the movie-theater chain rides a rebound.",
    "fullContent": "AMC&#x2019;s CEO had a blunt message for naysayers as the movie-theater chain rides a rebound.",
    "publishedAt": "2025-08-11T21:57:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.477Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "622eccff"
  },
  {
    "id": "the-verge-13fbf4aa",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Anthropic’s Claude chatbot can now remember your past conversations",
    "url": "https://www.theverge.com/news/757743/anthropic-claude-ai-search-past-chats",
    "summary": "On Monday, Anthropic released a hotly anticipated memory function for its Claude chatbot. In a YouTube video, the company demonstrated a user asking what they had been chatting about with Claude before their vacation.",
    "fullContent": "On Monday, Anthropic released a hotly anticipated memory function for its Claude chatbot. In a YouTube video, the company demonstrated a user asking what they had been chatting about with Claude before their vacation. Claude searches past chats to read and summarize them for the user, then asks if they’d like to move on and [&#8230;]",
    "publishedAt": "2025-08-11T21:56:15.000Z",
    "fetchedAt": "2025-08-12T02:23:23.096Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "13fbf4aa"
  },
  {
    "id": "techmeme-a0ba9ae",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Trump says he met with Lip-Bu Tan and that the Intel CEO will continue talks with his Cabinet members in the coming days, after calling for his resignation (Skylar Woodhouse/Bloomberg)",
    "url": "http://www.techmeme.com/250811/p28#a250811p28",
    "summary": "Skylar Woodhouse / Bloomberg: Trump says he met with Lip-Bu Tan and that the Intel CEO will continue talks with his Cabinet members in the coming days, after calling for his resignation — President Donald Trump said members of his Cabinet would continue discussions with Lip-Bu...",
    "fullContent": "Skylar Woodhouse / Bloomberg: Trump says he met with Lip-Bu Tan and that the Intel CEO will continue talks with his Cabinet members in the coming days, after calling for his resignation — President Donald Trump said members of his Cabinet would continue discussions with Lip-Bu Tan in the coming days after meeting &hellip;",
    "publishedAt": "2025-08-11T21:55:01.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "a0ba9ae"
  },
  {
    "id": "techmeme-16f46ee",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "President Trump meets with Lip-Bu Tan and says the Intel CEO will continue talks with his Cabinet members in the coming days, after calling for his resignation (Skylar Woodhouse/Bloomberg)",
    "url": "http://www.techmeme.com/250811/p28#a250811p28",
    "summary": "Skylar Woodhouse / Bloomberg: President Trump meets with Lip-Bu Tan and says the Intel CEO will continue talks with his Cabinet members in the coming days, after calling for his resignation — President Donald Trump said members of his Cabinet would continue discussions with...",
    "fullContent": "Skylar Woodhouse / Bloomberg: President Trump meets with Lip-Bu Tan and says the Intel CEO will continue talks with his Cabinet members in the coming days, after calling for his resignation — President Donald Trump said members of his Cabinet would continue discussions with Lip-Bu Tan in the coming days after meeting &hellip;",
    "publishedAt": "2025-08-11T21:55:01.000Z",
    "fetchedAt": "2025-08-12T09:44:56.962Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "16f46ee"
  },
  {
    "id": "nyt-business-79fe7fba",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "As Trump Curbs Wind Farms, Orsted Plans $9.4 Billion Share Offering",
    "url": "https://www.nytimes.com/2025/08/11/business/trump-wind-farm-orsted.html",
    "summary": "Shares of the Danish renewable energy developer tumbled after it said it would issue more stock to raise funds instead of divesting a stake in a wind farm off the U.S. coast.",
    "fullContent": "Shares of the Danish renewable energy developer tumbled after it said it would issue more stock to raise funds instead of divesting a stake in a wind farm off the U.S. coast.",
    "publishedAt": "2025-08-11T21:50:59.000Z",
    "fetchedAt": "2025-08-12T02:23:21.664Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "79fe7fba"
  },
  {
    "id": "yahoo-finance-17f28168",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Albemarle Names New COO, Restructures as Lithium Market Struggles",
    "url": "https://www.wsj.com/business/energy-oil/albemarle-names-new-coo-restructures-as-lithium-market-struggles-ce5036d9?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T21:49:00.000Z",
    "fetchedAt": "2025-08-13T09:45:58.623Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "17f28168"
  },
  {
    "id": "wsj-opinion-1219e738",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Putin Stakes for Trump",
    "url": "https://www.wsj.com/opinion/the-putin-stakes-for-trump-932c942a",
    "summary": "A cease-fire won&#x2019;t last if it doesn&#x2019;t have security guarantees for Ukraine.",
    "fullContent": "A cease-fire won&#x2019;t last if it doesn&#x2019;t have security guarantees for Ukraine.",
    "publishedAt": "2025-08-11T21:43:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "1219e738"
  },
  {
    "id": "business-insider-47eacb7b",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Three friends, one mortgage: How a group of Gen Zers bought a home together before turning 25",
    "url": "https://www.businessinsider.com/gen-z-friends-co-buying-to-afford-homeownership-2025-8",
    "summary": "Three Gen Z friends who work in finance said buying with friends makes homeownership attainable for young people. They bought a condo in Tampa, Florida.",
    "fullContent": "Three Gen Z friends who work in finance said buying with friends makes homeownership attainable for young people. They bought a condo in Tampa, Florida.",
    "publishedAt": "2025-08-11T21:42:30.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "47eacb7b"
  },
  {
    "id": "bloomberg-economics-38866137",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Argentina’s Peso Debt Yields Soar to Record Ahead of Key Auction",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/argentina-s-peso-debt-yields-soar-to-record-ahead-of-key-auction",
    "summary": "Yields on the Argentine government’s short-term notes soared to record highs Monday, just two days before the Treasury faces an auction that will help gauge investor appetite ahead of crucial midterm elections in October.",
    "fullContent": "Yields on the Argentine government’s short-term notes soared to record highs Monday, just two days before the Treasury faces an auction that will help gauge investor appetite ahead of crucial midterm elections in October.",
    "publishedAt": "2025-08-11T21:42:04.000Z",
    "fetchedAt": "2025-08-12T02:23:21.283Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "38866137"
  },
  {
    "id": "bloomberg-economics-f454909",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Argentina’s Peso Debt Yields Soared Before Key Auction",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/argentina-s-peso-debt-yields-soar-to-record-ahead-of-key-auction",
    "summary": "Yields on the Argentine government’s short-term notes soared to record highs Monday, just two days before the Treasury faces an auction that will help gauge investor appetite ahead of crucial midterm elections in October.",
    "fullContent": "Yields on the Argentine government’s short-term notes soared to record highs Monday, just two days before the Treasury faces an auction that will help gauge investor appetite ahead of crucial midterm elections in October.",
    "publishedAt": "2025-08-11T21:42:04.000Z",
    "fetchedAt": "2025-08-14T02:26:05.538Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "f454909"
  },
  {
    "id": "yahoo-finance-6ac76f3a",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Stocks to Watch Recap: Nvidia, AMC, Coinbase",
    "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-08-11-2025/card/stocks-to-watch-monday-nvidia-amd-intel-coinbase-MMQJHFlaLsU6JFKGnrOJ?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T21:41:14.000Z",
    "fetchedAt": "2025-08-13T09:45:58.623Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6ac76f3a"
  },
  {
    "id": "wsj-opinion-52314c7f",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Now Trump Wants an Export Tax",
    "url": "https://www.wsj.com/opinion/now-trump-wants-an-export-tax-4141f9a8",
    "summary": "Want a license to sell chips to China? Better pay the man.",
    "fullContent": "Want a license to sell chips to China? Better pay the man.",
    "publishedAt": "2025-08-11T21:41:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "52314c7f"
  },
  {
    "id": "zerohedge-414c43bd",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Is Your Data Held Hostage? There's A Ransomware Negotiator For That",
    "url": "https://www.zerohedge.com/political/your-data-held-hostage-theres-ransomware-negotiator",
    "summary": "Is Your Data Held Hostage? There's A Ransomware Negotiator For That Authored by Chris Summers via The Epoch Times (emphasis ours), Mark Lance’s phone rings when a company’s data is being held hostage.",
    "fullContent": "Is Your Data Held Hostage? There's A Ransomware Negotiator For That Authored by Chris Summers via The Epoch Times (emphasis ours), Mark Lance’s phone rings when a company’s data is being held hostage. Often, the perpetrators are demanding a ransom to return sensitive information. Mark Lance, a ransomware negotiator with Guidepoint Security, said early intervention is key in cyberattacks, as it helps manage expectations and outline options for victims. Courtesy of Guidepoint Security “The largest demand for one of our victims was $70 million,” said Lance, a ransomware negotiator with Virginia-based Guidepoint Security. Failure to pay is under the threat that the company’s information will be made public. “The earlier we get engaged, the better,” Lance told The Epoch Times. “In most circumstances … a client has already recognized that they’ve been a victim—they’ve been informed via ransom notes,” he said. “We help people recognize that even if there’s no intent on paying a ransom, there’s a tremendous amount of value in engaging the cyber criminals, because … you can still do things like delay the inevitable release of their information, which will allow for more time for the forensics and incident response work stream to make sure that they are patched.” Cyber attacks, usually involving ransomware, are being perpetrated against corporations and state-owned agencies in the United States every day. In the first half of 2025, a Comparitech report shows 208 ransomware attacks on government agencies globally, a 65 percent increase from the same period of 2024. Ransomware is a type of malicious software—or malware—that prevents a user from accessing his or her computer files, systems, or networks and demands that he or she pay a ransom for their return, according to the FBI. The average cost to the victim of a ransomware attack has risen from $761,106 in 2019 to an estimated $5.13 million in 2025, according toPurpleSec, a U.S.-based cybersecurity company. That includes the ransom payment itself, the recovery costs, and various indirect costs such as reputational damage. Lance, who has worked in cybersecurity for 25 years, said when he is called in at the early stage of an attack, the victim is usually still performing a business impact analysis. “They’re not necessarily sure what has fully transpired or has occurred within their environment, to know what they potentially need to do as next steps,” he said. By “environment,” Lance means all the hardware, software, and networks that support an organization’s operating systems. He said a ransomware negotiator can manage expectations and give the victim an idea of their options. He said he can buy valuable time, and also allow the victim to work with legal counsel to determine what sort of disclosure they are going to have to make to the public, to stockholders, to the Securities and Exchange Commission (SEC), and other regulators. Lance said the threat actors also have to provide some sort of evidence that they have accessed the victim’s data, and will have to provide a file tree, which is a map of directories leading to the files they have accessed. “We can gather and glean information from those communications that can be shared, that they might not have otherwise. But yeah, the earlier [we are brought in], the better,” he said. Jeanette Manfra, chief cybersecurity official for the Department of Homeland Security, speaks during a briefing at the White House on Dec. 19, 2017. Manfra announced that the United States believes North Korea was behind the global WannaCry cyberattacks. Saul Loeb/AFP via Getty Images Lance said at an early stage he tries to figure out what the client wants from the communication with the ransomware gang, “and then we develop a strategy around that.” He said the initial strategy might be simply to delay while they find out more about the attack and how serious it is in terms of consequences. He said the victim might later decide they are willing to make a ransom payment, and he said, “Then our strategy changes into how we’re negotiating terms, like, do they need it quickly? Or do we have time? So our strategy will change based on the needs of the client and what they’re trying to get out of it.” Cyber Ransom Notes Most often, the ransom note is left as a message on an individual system, Lance said. The note will usually advise the victim not to try to touch any of the IT systems and to download a Tor browser, go to a website on the darknet, and initiate communications with the ransomware attackers. Read the rest here... Tyler Durden Mon, 08/11/2025 - 17:40",
    "publishedAt": "2025-08-11T21:40:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.060Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "414c43bd"
  },
  {
    "id": "yahoo-finance-79480ce6",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "UFC Parent TKO Punches Higher, Leads S&P 500; Intel Extends Gains Late On Trump Reversal",
    "url": "https://www.investors.com/news/sp-500-stocks-ufc-parent-tko-micron-intel-punch-higher-lead-index/?src=A00220&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T21:38:22.000Z",
    "fetchedAt": "2025-08-13T09:45:58.623Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "79480ce6"
  },
  {
    "id": "wsj-opinion-6832881c",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Donald Trump, D.C. Police Commissioner",
    "url": "https://www.wsj.com/opinion/donald-trump-d-c-police-commissioner-2dab1387",
    "summary": "Cleaning up the city is a worthy task, and local control is dysfunctional.",
    "fullContent": "Cleaning up the city is a worthy task, and local control is dysfunctional.",
    "publishedAt": "2025-08-11T21:38:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "6832881c"
  },
  {
    "id": "cnbc-markets-5a694c7c",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Sinclair is exploring merger options for its broadcast business",
    "url": "https://www.cnbc.com/2025/08/11/sinclair-is-exploring-mergers-for-its-broadcast-business.html",
    "summary": "Sinclair, one of the largest owners of broadcast stations in the U.S., is launching a strategic review of its broadcast business that could result in a merger.",
    "fullContent": "Sinclair, one of the largest owners of broadcast stations in the U.S., is launching a strategic review of its broadcast business that could result in a merger.",
    "publishedAt": "2025-08-11T21:36:11.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5a694c7c"
  },
  {
    "id": "cnbc-business-5a694c7c",
    "sourceId": "cnbc-business",
    "sourceName": "CNBC Business",
    "title": "Sinclair is exploring merger options for its broadcast business",
    "url": "https://www.cnbc.com/2025/08/11/sinclair-is-exploring-mergers-for-its-broadcast-business.html",
    "summary": "Sinclair, one of the largest owners of broadcast stations in the U.S., is launching a strategic review of its broadcast business that could result in a merger.",
    "fullContent": "Sinclair, one of the largest owners of broadcast stations in the U.S., is launching a strategic review of its broadcast business that could result in a merger.",
    "publishedAt": "2025-08-11T21:36:11.000Z",
    "fetchedAt": "2025-08-12T02:23:22.012Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5a694c7c"
  },
  {
    "id": "business-insider-410d07cd",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "How to get Maroon 5 tickets: Las Vegas, Chicago, Boston, and more",
    "url": "https://www.businessinsider.com/guides/streaming/how-to-buy-maroon-5-tickets-concert-tour-2024",
    "summary": "Maroon 5 is hitting major cities across the US, and tickets are available from verified resellers like StubHub and Vivid Seats.",
    "fullContent": "Maroon 5 is hitting major cities across the US, and tickets are available from verified resellers like StubHub and Vivid Seats.",
    "publishedAt": "2025-08-11T21:31:27.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "410d07cd"
  },
  {
    "id": "ft-economics-62e97421",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "FirstFT: Trump to consider allowing Nvidia sales of advanced AI chips to China",
    "url": "https://www.ft.com/content/a13a1647-bf27-436f-9bf7-2465a996f0ef",
    "summary": "Also in today’s newsletter, US president deploys National Guard to Washington, and CATL suspends Chinese lithium mine.",
    "fullContent": "Also in today’s newsletter, US president deploys National Guard to Washington, and CATL suspends Chinese lithium mine",
    "publishedAt": "2025-08-11T21:31:25.000Z",
    "fetchedAt": "2025-08-12T02:23:22.368Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "62e97421"
  },
  {
    "id": "ft-technology-62e97421",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "FirstFT: Trump to consider allowing Nvidia sales of advanced AI chips to China",
    "url": "https://www.ft.com/content/a13a1647-bf27-436f-9bf7-2465a996f0ef",
    "summary": "Also in today’s newsletter, US president deploys National Guard to Washington, and CATL suspends Chinese lithium mine.",
    "fullContent": "Also in today’s newsletter, US president deploys National Guard to Washington, and CATL suspends Chinese lithium mine",
    "publishedAt": "2025-08-11T21:31:25.000Z",
    "fetchedAt": "2025-08-12T02:23:22.312Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "62e97421"
  },
  {
    "id": "business-insider-6660077",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Elon Musk's Grok is briefly suspended from Elon Musk's X",
    "url": "https://www.businessinsider.com/elon-musk-grok-suspended-x-2025-8",
    "summary": "The account for xAI's chatbot was temporarily suspended from X, and the later offered varying responses as to why.",
    "fullContent": "The account for xAI's chatbot was temporarily suspended from X, and the later offered varying responses as to why.",
    "publishedAt": "2025-08-11T21:30:25.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6660077"
  },
  {
    "id": "techmeme-66af5339",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "The Yomiuri Shimbun, Japan's largest newspaper by circulation, sues Perplexity, alleging unauthorized reproduction of its articles, and seeks $14.7M in damages (Andrew Deck/Nieman Lab)",
    "url": "http://www.techmeme.com/250811/p27#a250811p27",
    "summary": "Andrew Deck / Nieman Lab: The Yomiuri Shimbun, Japan's largest newspaper by circulation, sues Perplexity, alleging unauthorized reproduction of its articles, and seeks $14.7M in damages — The Yomiuri Shimbun, Japan's largest newspaper by circulation, has sued the generative AI...",
    "fullContent": "Andrew Deck / Nieman Lab: The Yomiuri Shimbun, Japan's largest newspaper by circulation, sues Perplexity, alleging unauthorized reproduction of its articles, and seeks $14.7M in damages — The Yomiuri Shimbun, Japan's largest newspaper by circulation, has sued the generative AI startup Perplexity for copyright infringement.",
    "publishedAt": "2025-08-11T21:30:01.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "66af5339"
  },
  {
    "id": "bloomberg-markets-7b182421",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Looking Ahead to the CPI: What to Watch",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/looking-ahead-to-the-cpi-what-to-watch-video",
    "summary": "KPMG Chief Economist Diane Swonk previews the US inflation data scheduled to be released this week on \"Bloomberg The Close.\" (Source: Bloomberg)",
    "fullContent": "KPMG Chief Economist Diane Swonk previews the US inflation data scheduled to be released this week on \"Bloomberg The Close.\" (Source: Bloomberg)",
    "publishedAt": "2025-08-11T21:26:54.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7b182421"
  },
  {
    "id": "business-insider-7d5fe1fd",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "The top 10 fastest trains in the world, ranked",
    "url": "https://www.businessinsider.com/fastest-trains-in-the-world-ranked",
    "summary": "The NextGen Acela trains will run with a top speed of 160 mph, out-speeding the current Acela fleet by 10 mph.",
    "fullContent": "The NextGen Acela trains will run with a top speed of 160 mph, out-speeding the current Acela fleet by 10 mph.",
    "publishedAt": "2025-08-11T21:22:20.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d5fe1fd"
  },
  {
    "id": "zerohedge-35b9da56",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Man's Private Plane Repeatedly Stolen For Joyrides, Then Repaired, By Unknown Stranger",
    "url": "https://www.zerohedge.com/markets/mans-private-plane-repeatedly-stolen-joyrides-unknown-stranger",
    "summary": "Man's Private Plane Repeatedly Stolen For Joyrides, Then Repaired, By Unknown Stranger Here's one you don't see every day. A baffling aviation mystery has left 75-year-old Jason Hong both confused and frustrated: an unknown stranger has repeatedly stolen his plane, flown it...",
    "fullContent": "Man's Private Plane Repeatedly Stolen For Joyrides, Then Repaired, By Unknown Stranger Here's one you don't see every day. A baffling aviation mystery has left 75-year-old Jason Hong both confused and frustrated: an unknown stranger has repeatedly stolen his plane, flown it without incident, landed it flawlessly — and even repaired it, according to Local 12. Hong told the Los Angeles Times the saga began when he first noticed the plane was gone. \"I got confused,\" he recalled. \"I thought, 'did I park it somewhere else, did the airport manager move it?' But I looked all over.\" Two days later, the aircraft turned up about 25 miles away, unscathed except for some cigarette butts in the cabin. The Local 12 report says that, determined to prevent a repeat theft, Hong removed the battery and planned to check back the following weekend. But when he returned, the plane was missing again — this time found 18 miles from the thief’s first landing spot. Even stranger, the battery had been replaced with a new one. Using a flight-tracking app, Hong discovered that both joyrides occurred on his 75th birthday. With no security cameras at the airports, authorities have been unable to identify the culprit. Hong suspects the thief has significant flying experience, noting that \"landing is not easy\" and replacing a plane’s battery requires specialized tools and knowledge. He estimates the intruder spent hundreds of dollars on the new battery, tools, and even a headset found in the cockpit. \"Someone breaks into your house, they're looking for jewelry or cash right?\" Hong said. \"But in this case, what's the purpose? It's like someone breaks my window, and then they put a new one up.\" One pilot at the second airport claimed to have seen a woman in her 40s or 50s sitting in the cockpit rather than in the lounge. Hong has now chained the aircraft in place until a full inspection can be completed. Tyler Durden Mon, 08/11/2025 - 17:20",
    "publishedAt": "2025-08-11T21:20:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "35b9da56"
  },
  {
    "id": "cnbc-markets-56c56662",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump says gold will not be tariffed",
    "url": "https://www.cnbc.com/2025/08/11/trump-gold-tariffs-futures.html",
    "summary": "A ruling by U.S. Customs and Border Protection that gold bars from Switzerland were subject to tariffs surprised the market.",
    "fullContent": "A ruling by U.S. Customs and Border Protection that gold bars from Switzerland were subject to tariffs surprised the market.",
    "publishedAt": "2025-08-11T21:17:54.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "56c56662"
  },
  {
    "id": "fortune-3b541dc9",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "AI talent comes at a 30% salary premium: &#8216;If you try to play catch up later, this is going to cost you even more&#8217;",
    "url": "https://fortune.com/2025/08/11/ai-talent-salary-premium/",
    "summary": "No longer are AI skills only associated with tech or IT roles.",
    "fullContent": "No longer are AI skills only associated with tech or IT roles.",
    "publishedAt": "2025-08-11T21:15:41.000Z",
    "fetchedAt": "2025-08-12T02:23:23.467Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b541dc9"
  },
  {
    "id": "cnbc-markets-3a5ea56b",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "StubHub IPO is back on for September after ticketing company delayed plans on tariff concerns",
    "url": "https://www.cnbc.com/2025/08/11/stubhub-ipo-back-on-for-september-after-company-delayed-plans-in-april.html",
    "summary": "StubHub updated its IPO prospectus on Monday, effectively restarting the process to go public.",
    "fullContent": "StubHub updated its IPO prospectus on Monday, effectively restarting the process to go public.",
    "publishedAt": "2025-08-11T21:13:49.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3a5ea56b"
  },
  {
    "id": "wsj-markets-main-2e2758f4",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Stock Market Today: Trump Extends China Deadline, Says No Gold Tariff",
    "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-08-11-2025?mod=rss_markets_main",
    "summary": "Gold prices have dropped since news reports of a customs notice last week spurred a runup.",
    "fullContent": "Gold prices have dropped since news reports of a customs notice last week spurred a runup",
    "publishedAt": "2025-08-11T21:11:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2e2758f4"
  },
  {
    "id": "bloomberg-politics-4bb3894b",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Bessent on Tariffs, Deficits and Embracing Trump’s Economic Plan",
    "url": "https://www.bloomberg.com/news/features/2025-08-11/treasury-secretary-bessent-on-tariffs-deficits-trump-s-economic-plan",
    "summary": "The US Treasury secretary has the ear of an impulsive president—and nervous investors worldwide hope it stays that way. An exclusive interview.",
    "fullContent": "The US Treasury secretary has the ear of an impulsive president—and nervous investors worldwide hope it stays that way. An exclusive interview.",
    "publishedAt": "2025-08-11T21:00:30.000Z",
    "fetchedAt": "2025-08-12T02:23:21.297Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4bb3894b"
  },
  {
    "id": "zerohedge-3b07ff86",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "DHS Remembers Victims Of Serious Crimes Committed By Illegal Immigrants",
    "url": "https://www.zerohedge.com/political/dhs-remembers-victims-serious-crimes-committed-illegal-immigrants",
    "summary": "DHS Remembers Victims Of Serious Crimes Committed By Illegal Immigrants Authored by Yeny Sora Robles via The Epoch Times (emphasis ours), The Department of Homeland Security (DHS) on Aug. 6 commemorated the victims of fatalities and serious crimes committed this year by...",
    "fullContent": "DHS Remembers Victims Of Serious Crimes Committed By Illegal Immigrants Authored by Yeny Sora Robles via The Epoch Times (emphasis ours), The Department of Homeland Security (DHS) on Aug. 6 commemorated the victims of fatalities and serious crimes committed this year by illegal immigrants in the United States. The Department of Homeland Security in Washington on Aug. 12, 2024. Madalina Vasiliu/The Epoch Times “For too long, politicians turned a blind eye to the suffering of American citizens while protecting criminal illegal aliens. That ended on January 20,” the department’s Assistant Secretary Tricia McLaughlin said in an Aug. 6 statement. “Under President [Donald] Trump and Secretary [Kristi] Noem, DHS is standing with the victims—not depraved criminal illegal aliens,” she added. DHS honored “the strength and resilience” of the victims and their families affected by crimes committed by illegal immigrants. “Behind every one of these crimes is a victim and their family left to rebuild their lives after unimaginable loss, suffering, and brutality,” McLaughlin said. Among the victims remembered in the statement are girls, adolescents, women, and men, including officials and ICE officers. Luis Jocsan Nanez López, 15, was shot and killed on July 20 while trying to protect his mother from an attempted rape, allegedly by Mexican national Gildardo Amandor-Martínez in Kentucky. Amandor-Martínez also allegedly assaulted Luis’s sister with a firearm. Martinez made two failed attempts to enter the United States, but on the third attempt, he was able to enter at an unknown date and location. Megan Bos, 37, was found decapitated in a bleach-filled container in Illinois in April, after being reported missing on March 9. The alleged perpetrator was identified as Luis Mendoza-González, from Mexico. Santiago López Morales, 48, was murdered at a Motel 6 in Garland, Texas, in June 2025. DHS confirmed that the suspects in the crime are three Venezuelan men identified as Yosguar Aponte-Jiménez, José Trivino-Cruz, and Jesús Bellorín-Guzmán. Hallie Helgeson, 18, and Brady Heiling, 19, died in a car crash in Wisconsin in 2025, caused by a suspected drunk driver, Noelia Saray Martínez-Avila, from Honduras. Maria Pleitez, 42, and her 11-year-old daughter, Dayanara, died in a car crash in New Jersey in 2025. Mexican national Raúl Luna-Pérez is suspected of driving under the influence and causing the deaths. An unnamed woman was sexually assaulted on July 2, allegedly by José Maldonado-Zavala, a native of Honduras, at an apartment complex in Houston, Texas. According to records, Maldonado-Zavala falsely claimed the victim’s air conditioning was leaking into his apartment. He then forcibly grabbed her arm, dragged her into his residence against her will, and sexually assaulted her; she fought off the attacker and managed to flee. A 17-year-old girl was harassed and raped, allegedly by a transgender illegal immigrant from Colombia who presents as a woman, Nicol Alexandra Contreras-Suarez. Contreras-Suarez was charged with rape of a minor and harassment in Columbia, New York, in 2025. A man suffered life-threatening stab wounds after being attacked during a public soccer game, allegedly by Jefferson Javier López-Tinoco of Honduras, in Maryland in 2025. A U.S. Customs and Border Protection officer was shot in the arm and cheek during an attempted armed robbery in New York in 2025, allegedly by Cristian Aybar Berroa and Miguel Francisco Mora Núñez from the Dominican Republic. A U.S. government official was harassed in Virginia in 2025, allegedly by José Madrid Reyes of El Salvador. In 2018, a woman was sexually assaulted in Oregon while walking on Independence Day by Kevin Contreras-Mendoza of Mexico. DHS said it reinforced its commitment to restoring security in the country and sent a message of support to all victims and families affected by crimes committed by illegal immigrants. Tyler Durden Mon, 08/11/2025 - 17:00",
    "publishedAt": "2025-08-11T21:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b07ff86"
  },
  {
    "id": "oil-price-8c7db6c",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "National Oil Companies Lead Aggressive Refining Growth",
    "url": "https://oilprice.com/Energy/Crude-Oil/National-Oil-Companies-Lead-Aggressive-Refining-Growth.html",
    "summary": "Global refining is at a crossroads, as shifting regional demand, mounting sustainability pressures and heightened energy security concerns reshape the industry. Rystad Energy’s research shows that even though there are fewer refineries today, overall refining capacity has...",
    "fullContent": "Global refining is at a crossroads, as shifting regional demand, mounting sustainability pressures and heightened energy security concerns reshape the industry. Rystad Energy’s research shows that even though there are fewer refineries today, overall refining capacity has grown to keep up with the rising volume of oil that needs processing. In the last two decades, global primary refining capacity has increased by about 13.5 million barrels per day (bpd), or roughly 15%. In contrast, the absolute number of refineries peaked in 2011 and has…",
    "publishedAt": "2025-08-11T21:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.382Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "8c7db6c"
  },
  {
    "id": "wsj-markets-main-70b565c7",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Stocks Slip Despite China Tariff Extension",
    "url": "https://www.wsj.com/finance/stocks/stocks-slip-despite-china-tariff-extension-36b26d68?mod=rss_markets_main",
    "summary": "Dow industrials lose 201 points; investors await inflation data.",
    "fullContent": "Dow industrials lose 201 points; investors await inflation data.",
    "publishedAt": "2025-08-11T20:59:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "70b565c7"
  },
  {
    "id": "nyt-business-b6ed8d1",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Brazil Clamped Down on Big Tech. Trump’s Tariffs Could Change That.",
    "url": "https://www.nytimes.com/2025/08/11/world/americas/brazil-big-tech-trump-tariffs.html",
    "summary": "With President Trump on their side, U.S. technology companies now have more leverage in Brazil, where they seek to influence new rules policing their platforms.",
    "fullContent": "With President Trump on their side, U.S. technology companies now have more leverage in Brazil, where they seek to influence new rules policing their platforms.",
    "publishedAt": "2025-08-11T20:58:11.000Z",
    "fetchedAt": "2025-08-12T02:23:21.664Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "b6ed8d1"
  },
  {
    "id": "nyt-technology-b6ed8d1",
    "sourceId": "nyt-technology",
    "sourceName": "NYT Technology",
    "title": "Brazil Clamped Down on Big Tech. Trump’s Tariffs Could Change That.",
    "url": "https://www.nytimes.com/2025/08/11/world/americas/brazil-big-tech-trump-tariffs.html",
    "summary": "With President Trump on their side, U.S. technology companies now have more leverage in Brazil, where they seek to influence new rules policing their platforms.",
    "fullContent": "With President Trump on their side, U.S. technology companies now have more leverage in Brazil, where they seek to influence new rules policing their platforms.",
    "publishedAt": "2025-08-11T20:58:11.000Z",
    "fetchedAt": "2025-08-12T02:23:21.673Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "b6ed8d1"
  },
  {
    "id": "bloomberg-business-youtube-7919963c",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "US Extends China Truce, Open to Scaled-Back Blackwell Sales | Bloomberg Businessweek Daily 8/11/2025",
    "url": "https://www.youtube.com/watch?v=CTrTKzlvV6E",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:52:35.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7919963c"
  },
  {
    "id": "techmeme-3a243bb2",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "SEC filing: crypto exchange Bullish increased the size and price of its US IPO to sell 30M shares for $32 to $33 each, up from 20.3M shares for $28 to $31 each (Charles Capel/Bloomberg)",
    "url": "http://www.techmeme.com/250811/p26#a250811p26",
    "summary": "Charles Capel / Bloomberg: SEC filing: crypto exchange Bullish increased the size and price of its US IPO to sell 30M shares for $32 to $33 each, up from 20.3M shares for $28 to $31 each — Bullish increased the size and price of its initial public offering, boosting the...",
    "fullContent": "Charles Capel / Bloomberg: SEC filing: crypto exchange Bullish increased the size and price of its US IPO to sell 30M shares for $32 to $33 each, up from 20.3M shares for $28 to $31 each — Bullish increased the size and price of its initial public offering, boosting the potential deal size to $990 million &hellip;",
    "publishedAt": "2025-08-11T20:50:01.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3a243bb2"
  },
  {
    "id": "bloomberg-markets-3ed7710f",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Quest Creates ‘3.5-Tier’ Loan With Second Debt Shuffle in Months",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/quest-creates-3-5-tier-loan-with-second-debt-shuffle-in-months",
    "summary": "Clearlake Capital Group-backed Quest Software is shuffling the order that its creditors get repaid for the second time in three months as it launches another debt exchange to lessen its debt load.",
    "fullContent": "Clearlake Capital Group-backed Quest Software is shuffling the order that its creditors get repaid for the second time in three months as it launches another debt exchange to lessen its debt load.",
    "publishedAt": "2025-08-11T20:48:57.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3ed7710f"
  },
  {
    "id": "bloomberg-markets-43944f4e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Grid Operator Orders Baltimore Power Cuts After Plant Shutdown",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/grid-operator-orders-baltimore-power-cuts-after-plant-shutdown",
    "summary": "The largest US grid operator has ordered emergency action to curtail power use in the Baltimore area after a substation failure forced a large coal-fired power plant to trip offline.",
    "fullContent": "The largest US grid operator has ordered emergency action to curtail power use in the Baltimore area after a substation failure forced a large coal-fired power plant to trip offline.",
    "publishedAt": "2025-08-11T20:48:39.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "43944f4e"
  },
  {
    "id": "techmeme-118e95fb",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Source: StubHub now aims to hold its IPO in September after pausing plans in April; it updated its IPO prospectus, reporting Q1 revenue up 10% YoY to $397.6M (CNBC)",
    "url": "http://www.techmeme.com/250811/p25#a250811p25",
    "summary": "CNBC: Source: StubHub now aims to hold its IPO in September after pausing plans in April; it updated its IPO prospectus, reporting Q1 revenue up 10% YoY to $397.6M — StubHub, the ticketing marketplace that spun out of eBay in 2020, has resumed its plans to go public and is now...",
    "fullContent": "CNBC: Source: StubHub now aims to hold its IPO in September after pausing plans in April; it updated its IPO prospectus, reporting Q1 revenue up 10% YoY to $397.6M — StubHub, the ticketing marketplace that spun out of eBay in 2020, has resumed its plans to go public and is now aiming to hold its IPO next month, CNBC has learned.",
    "publishedAt": "2025-08-11T20:46:08.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "118e95fb"
  },
  {
    "id": "fortune-44a106d5",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Exclusive: Fintech giant Stripe building ‘Tempo’ blockchain with crypto VC Paradigm",
    "url": "https://fortune.com/crypto/2025/08/11/stripe-blockchain-tempo-paradigm/",
    "summary": "Stripe’s newest push into crypto comes as the company has made an aggressive push into stablecoins.",
    "fullContent": "Stripe’s newest push into crypto comes as the company has made an aggressive push into stablecoins.",
    "publishedAt": "2025-08-11T20:43:20.000Z",
    "fetchedAt": "2025-08-12T02:23:23.467Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "44a106d5"
  },
  {
    "id": "bloomberg-business-youtube-4e448e8d",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "S&P, Dow Slips Ahead of CPI Hearing | Closing Bell",
    "url": "https://www.youtube.com/watch?v=5szTzvET2cg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:41:50.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4e448e8d"
  },
  {
    "id": "zerohedge-660d283b",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Chaos In South China Sea: China Rams Own Warship While In Pursuit Of Philippine Vessel",
    "url": "https://www.zerohedge.com/geopolitical/chaos-south-china-sea-china-rams-own-warship-while-pursuit-philippine-vessel",
    "summary": "Chaos In South China Sea: China Rams Own Warship While In Pursuit Of Philippine Vessel Dramatic footage has emerged showing two Chinese navy vessels colliding while chasing a Philippine patrol boat near Scarborough Shoal in the South China Sea on Monday - an area considered by...",
    "fullContent": "Chaos In South China Sea: China Rams Own Warship While In Pursuit Of Philippine Vessel Dramatic footage has emerged showing two Chinese navy vessels colliding while chasing a Philippine patrol boat near Scarborough Shoal in the South China Sea on Monday - an area considered by some as a geopolitical flashpoint between Manila and Beijing. \"The (China Coast Guard vessel) CCG 3104, which was chasing the (Filipino coast guard vessel) BRP Suluan at high speed, performed a risky manoeuvre from the (Philippine) vessel's starboard quarter, leading to the impact with the PLA (People's Liberation Army) Navy warship,\" Philippine Coast Guard (PCG) officer Jay Tarriela said in a statement, quoted by AFP News. \"This resulted in substantial damage to the CCG vessel's forecastle, rendering it unseaworthy,\" Tarriela said. Tarriela released the footage on X. He described what unfolded: Here is a longer video capturing the collision between the PLA Navy 164 and the China Coast Guard 3104. The Philippine Coast Guard (PCG) has consistently urged the Chinese government to respect the COLREGS and to approach these matters with professionalism, especially considering their role in enforcing maritime laws. We have also emphasized that such reckless behavior at sea could ultimately lead to accidents. Our thoughts are with the CCG personnel who may have been injured in this incident. Here is a longer video capturing the collision between the PLA Navy 164 and the China Coast Guard 3104. The Philippine Coast Guard (PCG) has consistently urged the Chinese government to respect the COLREGS and to approach these matters with professionalism, especially considering… https://t.co/n7vcU4lGWq pic.twitter.com/cHU7rG2wAj — Jay Tarriela (@jaytaryela) August 11, 2025 The incident is the latest in a series of dangerous encounters in the South China Sea that could easily trigger broader conflict. Tensions in the area have been rising since Beijing seized Scarborough Shoal in 2012. Related: Building Frenzy In The South China Sea - Who Is Fortifying Islands? China Seizes Disputed Reef In South China Sea, Next To Key Philippines Military Base Disputes In South China Sea Could Disrupt Trade Lanes, Lead To War, Experts Say All of this plays into a broader theme of a more chaotic world heading into the 2030s, with the global order fracturing into a dangerous bipolar state. Tyler Durden Mon, 08/11/2025 - 16:40",
    "publishedAt": "2025-08-11T20:40:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "660d283b"
  },
  {
    "id": "bloomberg-markets-2d34323",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "S&P, Dow Slips Ahead of CPI Hearing | Closing Bell",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/s-p-dow-slips-ahead-of-cpi-hearing-closing-bell-video",
    "summary": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Romaine Bostick, Vonnie Quinn, Isabelle Lee and Tim Stenovec. (Source: Bloomberg)",
    "fullContent": "Comprehensive cross-platform coverage of the U.S. market close on Bloomberg Television, Bloomberg Radio, and YouTube with Romaine Bostick, Vonnie Quinn, Isabelle Lee and Tim Stenovec. (Source: Bloomberg)",
    "publishedAt": "2025-08-11T20:35:19.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2d34323"
  },
  {
    "id": "bloomberg-markets-15525390",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Klein: Nvidia, AMD Deal Doesn't Mean \"Free-for-All\" For Companies Selling to China",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/klein-nvidia-amd-deal-doesn-t-mean-free-for-all-video",
    "summary": "US President Donald Trump signaled on Monday that he’d be open to allowing Nvidia Corp. to sell a scaled-back version of its most advanced AI chip to China. Trump said he would consider a deal that would allow Nvidia to ship its Blackwell chips to China if the company could...",
    "fullContent": "US President Donald Trump signaled on Monday that he’d be open to allowing Nvidia Corp. to sell a scaled-back version of its most advanced AI chip to China. Trump said he would consider a deal that would allow Nvidia to ship its Blackwell chips to China if the company could design it to be less advanced. “It’s possible I’d make a deal” on a “somewhat enhanced — in a negative way — Blackwell” processor, he said in a briefing with reporters. “In other words, take 30% to 50% off of it.” Jordan Klein, Managing Director at Mizuho Securities USA tells Bloomberg Businessweek Daily says the policy change enables Nvidia to sell more chips. (Source: Bloomberg)",
    "publishedAt": "2025-08-11T20:31:48.000Z",
    "fetchedAt": "2025-08-12T02:23:20.602Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15525390"
  },
  {
    "id": "cnbc-markets-45f9c1e1",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump extends China tariff deadline by 90 days",
    "url": "https://www.cnbc.com/2025/08/11/trump-china-tariffs-deadline-extended.html",
    "summary": "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
    "fullContent": "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
    "publishedAt": "2025-08-11T20:31:33.000Z",
    "fetchedAt": "2025-08-12T02:23:21.251Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45f9c1e1"
  },
  {
    "id": "bloomberg-politics-6811841a",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump’s Deal for Chip Revenue May Usher In Trade Policy Shift",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-11/trump-s-deal-for-chip-revenue-may-usher-in-trade-policy-shift",
    "summary": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Every Monday, Bloomberg Intelligence senior analyst Nathan Dean gives his insights into what’s been happening and what’s coming up in the nooks and crannies of government and...",
    "fullContent": "This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Every Monday, Bloomberg Intelligence senior analyst Nathan Dean gives his insights into what’s been happening and what’s coming up in the nooks and crannies of government and markets. Sign up here and follow us at @bpolitics. Email our editors here.",
    "publishedAt": "2025-08-11T20:31:30.000Z",
    "fetchedAt": "2025-08-12T02:23:21.297Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6811841a"
  },
  {
    "id": "business-insider-d47809e",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I lived 2,000 miles away from my dying mother. I traveled to her as often as I could, but caregiving took its toll on my family.",
    "url": "https://www.businessinsider.com/caregiving-dying-mother-difficult-lived-far-away-2025-8",
    "summary": "My mother was diagnosed with cancer and dementia. I tried to visit her at least once a month, but I felt guilty not being there for her.",
    "fullContent": "My mother was diagnosed with cancer and dementia. I tried to visit her at least once a month, but I felt guilty not being there for her.",
    "publishedAt": "2025-08-11T20:31:12.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d47809e"
  },
  {
    "id": "ndtv-profit-youtube-6a671a12",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump News | Trump Says He’s Placing DC Police Under Federal Control, Deploying National Guard",
    "url": "https://www.youtube.com/shorts/Eysod4Isx6E",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:30:02.000Z",
    "fetchedAt": "2025-08-12T02:23:30.423Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6a671a12"
  },
  {
    "id": "oil-price-6741aed9",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Azerbaijan Orders Emergency Aid to Ukraine After SOCAR Drone Strike",
    "url": "https://oilprice.com/Latest-Energy-News/World-News/Azerbaijan-Orders-Emergency-Aid-to-Ukraine-After-SOCAR-Drone-Strike.html",
    "summary": "Azerbaijan has allocated $2 million to help Ukraine restore energy infrastructure damaged in recent Russian missile and drone attacks, President Ilham Aliyev announced Monday. The funds, drawn from the president’s reserve, will be transferred to the Ministry of Energy for the...",
    "fullContent": "Azerbaijan has allocated $2 million to help Ukraine restore energy infrastructure damaged in recent Russian missile and drone attacks, President Ilham Aliyev announced Monday. The funds, drawn from the president’s reserve, will be transferred to the Ministry of Energy for the purchase and delivery of Azerbaijani-made electrical equipment, according to APA News Agency. The decision follows a phone call between Aliyev and Ukrainian President Volodymyr Zelensky on Sunday, during which both leaders condemned recent Russian strikes on a SOCAR-operated…",
    "publishedAt": "2025-08-11T20:30:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.382Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "6741aed9"
  },
  {
    "id": "bloomberg-markets-5836d1af",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Extends China Truce, Open to Scaled-Back Blackwell Sales | Bloomberg Businessweek Daily 8/11/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-11/bloomberg-businessweek-daily-8-11-2025-video",
    "summary": "On today's episode of Bloomberg Businessweek Daily, Tim Stenovec and Isabelle Lee speak with Jordan Klein, Managing Director at Mizuho Securities USA on the signal from President Trump that he would be open to allowing Nvidia Corp.",
    "fullContent": "On today's episode of Bloomberg Businessweek Daily, Tim Stenovec and Isabelle Lee speak with Jordan Klein, Managing Director at Mizuho Securities USA on the signal from President Trump that he would be open to allowing Nvidia Corp. to sell a scaled-back version of its most advanced AI chip to China. They also spoke with Senior Non-Resident Fellow at New York University Ed Price on Trump's extension of the 90 day trade truce with China, and upcoming summit with Russian President Vladimir Putin. Finally, Tim Herbert, president and CEO of Inspire Medical System, discussed his company's earnings and share buyback announcement. (Source: Bloomberg)",
    "publishedAt": "2025-08-11T20:29:34.000Z",
    "fetchedAt": "2025-08-12T02:23:20.602Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5836d1af"
  },
  {
    "id": "bbc-business-71fcd7c1",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "AOL ends dial-up service after more than 30 years",
    "url": "https://www.bbc.com/news/articles/cj0yy3e6z4zo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "The internet service which soared in popularity in the 1990s will come to an end from 30 September.",
    "fullContent": "The internet service which soared in popularity in the 1990s will come to an end from 30 September",
    "publishedAt": "2025-08-11T20:26:24.000Z",
    "fetchedAt": "2025-08-12T02:23:23.542Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "71fcd7c1"
  },
  {
    "id": "bloomberg-business-youtube-1d59db2a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Lithium prices surged after one of the world's largest mines closed in China",
    "url": "https://www.youtube.com/shorts/urL9EgW9xmw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:25:34.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1d59db2a"
  },
  {
    "id": "ft-economics-27f93de7",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "Trump extends trade war truce with China",
    "url": "https://www.ft.com/content/82126a13-e66b-4f3b-bb6d-74f165a291d0",
    "summary": "US leader postpones new tariffs on world’s biggest exporter for another 90 days.",
    "fullContent": "US leader postpones new tariffs on world’s biggest exporter for another 90 days",
    "publishedAt": "2025-08-11T20:22:56.000Z",
    "fetchedAt": "2025-08-12T02:23:22.368Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "27f93de7"
  },
  {
    "id": "the-verge-78f672c2",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Even the lowly canister vacuum now wants access to your Wi-Fi network",
    "url": "https://www.theverge.com/news/757731/miele-guard-l1-electro-canister-vacuum-smart-wifi-mobile-app",
    "summary": "Despite the convenience of cordless stick vacs, canister vacuums are still very much a thing for those with battery anxiety or those who want a lighter cleaner. Miele still offers over 20 different models of canister vacs in the US, but its latest is the company’s first to...",
    "fullContent": "Despite the convenience of cordless stick vacs, canister vacuums are still very much a thing for those with battery anxiety or those who want a lighter cleaner. Miele still offers over 20 different models of canister vacs in the US, but its latest is the company’s first to introduce smart functionality making it yet another [&#8230;]",
    "publishedAt": "2025-08-11T20:20:32.000Z",
    "fetchedAt": "2025-08-12T02:23:23.096Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "78f672c2"
  },
  {
    "id": "bloomberg-business-youtube-a69a16a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Could Let Nvidia Sell Scaled-Down Blackwell Chip to China",
    "url": "https://www.youtube.com/watch?v=GjuiflzWWS0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:20:10.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "a69a16a"
  },
  {
    "id": "zerohedge-5be31ad1",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "RussiaGate: 'A Murder Of American Democracy Was Committed'",
    "url": "https://www.zerohedge.com/political/russiagate-murder-american-democracy-was-committed",
    "summary": "RussiaGate: 'A Murder Of American Democracy Was Committed' Authored by James Howard Kunstler, Under Color Of Law \"The second-order and third-order damages of RussiaGate are incalculable. A murder of American democracy was committed.",
    "fullContent": "RussiaGate: 'A Murder Of American Democracy Was Committed' Authored by James Howard Kunstler, Under Color Of Law \"The second-order and third-order damages of RussiaGate are incalculable. A murder of American democracy was committed.\" - Mike Benz on \"X\" Surely you’ve noticed the ominous cone of silence around the DOJ and the FBI as rumors of “accountability” mount against well-known figures who used government to make war against its own citizens. That is exactly what happened, by the way, in case you’re baffled by the news. The agencies aren’t leaking this time, especially not to the mendacious scribes that infest The New York Times and The WashPo, who function as vanguard to the corps of traitors in the rogue fourth branch of government called the Blob. So, the silence begs you to ask: Are they doing anything in there? Yes, they are making cases. And they are not yapping idly about it in the news, legacy or alt. They are preparing evidence for grand juries that will decide if probable cause exists to indict those well-known figures — several of whom have become cable news performers, foolishly, if obliquely, advertising their own culpability for years now. You’ll just have to wait, though perhaps not for long. It is August, after all, the horse latitudes of the year when things go still. You are lectured incessantly and sanctimoniously by these same suspects about the rule of law (in “our democracy”). Many of these characters are maestros in the dark arts of lawfare, which, paradoxically, is the practice of using law to pervert and dishonor the rule of law. Lately, you are introduced to a similar sounding phrase, under color of law, with a related meaning. Understand it and you will see what has been behind virtually all the mischief in our public affairs this past, vicious decade. Under color of law has deep roots in Anglo-American jurisprudence because law, by its nature, lends itself to abuse and nefarious misuse. The law’s “nature” is that it is a set of rules to decide matters of consequence, both personal and public, where much is at stake: ownership of property, liberty, life itself. At times, actions are taken in the name of the law to unjustly deprive persons of life, liberty, and property, usually for the benefit of other persons. The phrase, life, liberty, and property, derives from John Locke’s Two Treatises on Government (1689), which argued that these are natural rights, God-given, and that it is government’s duty to protect these rights, government being the practical application of law. The phrase life, liberty, and property deeply influenced America’s founders. Thomas Jefferson changed it up a bit in the Declaration of Independence as “life, liberty, and the pursuit of happiness,” with a eudaimonian twist to inspire America to flourish on its own, off England’s leash. It was also Jefferson’s way of detaching the Declaration from the issue of slavery, where “property” could refer to human beings. But the Lockean original, life, liberty and property, reappears in the Bill of Rights to the Constitution. It is in the Fifth Amendment, protecting persons from the arbitrary deprivation of these rights without due process by the federal government, and in the Fourteenth Amendment applying the same principle of law to state governments. Where lawfare comes in is under due process. Lawfare’s aim is to pervert due process, to use officers of the courts to act unfairly and unjustly in the name of the law, and thus, under color of law. This is exactly what you saw in the several cases brought against Mr. Trump in New York State in 2024, a three-ring circus of process-abuse engineered by the “Joe Biden” White House, coordinated with Merrick Garland’s DOJ (through Deputy AG Lisa Monaco), with assists from NY AG Letitia James and Manhattan DA Alvin Bragg. Ditto the RICO case attempted in Atlanta under Fulton County DA Fani Willis, a spectacular botch. And ditto, the cases brought under Special Counsel Jack Smith in Florida and DC, also badly botched. The slovenly ineptitude of these cases was really something to behold, including the sordid romantic complications around Fani Willis and her chosen chief prosecutor, “boyfriend” Nathan Wade, a divorce lawyer with no experience in criminal law. Throw in the disgraceful, self-conflicted antics of the Judges Kaplan, Engoron, and Merchan in the New York cases, and the oafish conduct of Jack Smith and his assistants in Florida and DC — and what you get is a demonstration of how crude an instrument sheer lying actually is in the practice of law, and how easily it breaks against the people using it. Some of these characters are just now coming to grief: Letitia James faces a DOJ action on depriving Mr. Trump’s rights, and SC Jack Smith is under active FBI investigation for evidence tampering and other crimes of process abuse. It would be fitting for all the prosecutors and the three judges in the New York cases to face similar inquiries. The phrase under color of law establishes liability for abuse of power for officials vested with the terrible authority for upending people’s lives. The phrase “deprivation of rights” appears explicitly in federal statutes primarily focused on holding government officials and others acting with apparent legal authority accountable for willfully violating an individual’s constitutional or legal rights. The most relevant statute is 18 U.S.C. § 242, which directly criminalizes such conduct. Additional statutes, such as 18 U.S.C. § 241, 18 U.S.C. § 250, 18 U.S.C. § 2243, and 18 U.S.C. § 2244. That’s where all this is going, even if all that’s coming out of the DOJ and FBI for the moment is that ominous silence. Tyler Durden Mon, 08/11/2025 - 16:20",
    "publishedAt": "2025-08-11T20:20:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.061Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5be31ad1"
  },
  {
    "id": "yahoo-finance-742ed9a7",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Lithium Stocks Are Soaring. Why Albemarle, Others Are Hot.",
    "url": "https://www.barrons.com/articles/lithium-stocks-albemarle-sqm-catl-mine-80e5a96b?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:20:00.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "742ed9a7"
  },
  {
    "id": "yahoo-finance-582a2822",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Tesla Is Benefiting From End of Tax-Credit Sales Rush",
    "url": "https://www.barrons.com/articles/tesla-tax-credit-sales-rush-d317a045?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:16:00.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "582a2822"
  },
  {
    "id": "cnbc-markets-6198f6b8",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "C3 AI stock falls 26% as CEO Siebel calls preliminary sales numbers 'completely unacceptable'",
    "url": "https://www.cnbc.com/2025/08/11/c3-ai-stock-ceo-thomas-siebel.html",
    "summary": "C3 AI shares tumbled after it announced preliminary financial results and a restructuring of its global sales and services organization.",
    "fullContent": "C3 AI shares tumbled after it announced preliminary financial results and a restructuring of its global sales and services organization.",
    "publishedAt": "2025-08-11T20:15:59.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6198f6b8"
  },
  {
    "id": "techmeme-1b1e4f93",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Trump family's World Liberty Financial is using a publicly listed company, ALT5 Sigma, to raise $1.5B for the purchase of its WLFI token (Ben Weiss/Fortune)",
    "url": "http://www.techmeme.com/250811/p24#a250811p24",
    "summary": "Ben Weiss / Fortune: Trump family's World Liberty Financial is using a publicly listed company, ALT5 Sigma, to raise $1.5B for the purchase of its WLFI token — World Liberty Financial cofounders Zach Witkoff (left) and Eric Trump.",
    "fullContent": "Ben Weiss / Fortune: Trump family's World Liberty Financial is using a publicly listed company, ALT5 Sigma, to raise $1.5B for the purchase of its WLFI token — World Liberty Financial cofounders Zach Witkoff (left) and Eric Trump. — The Trump family's crypto business, World Liberty Financial &hellip;",
    "publishedAt": "2025-08-11T20:15:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1b1e4f93"
  },
  {
    "id": "yahoo-finance-622a8429",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Sarah Jessica Parker used $40 for 3 days budget, says it gave her 'relief' to be able to pay bills when work was scarce",
    "url": "https://finance.yahoo.com/news/sarah-jessica-parker-used-40-201500373.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:15:00.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "622a8429"
  },
  {
    "id": "business-insider-2058c953",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I spent 2 nights in a tiny home hotel in Germany. 7 things surprised me about the 2-story, 100-square-foot house.",
    "url": "https://www.businessinsider.com/tiny-home-hotel-slube-germany-surprising-things",
    "summary": "From its tubular two-story shape to its smart tech and clever storage hacks, I was very impressed by the tiny home I booked in Germany.",
    "fullContent": "From its tubular two-story shape to its smart tech and clever storage hacks, I was very impressed by the tiny home I booked in Germany.",
    "publishedAt": "2025-08-11T20:14:41.000Z",
    "fetchedAt": "2025-08-12T02:23:21.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2058c953"
  },
  {
    "id": "yahoo-finance-576dfe47",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Circle set to release first quarterly earnings report since IPO as investors eye stablecoin growth",
    "url": "https://finance.yahoo.com/news/circle-set-to-release-first-quarterly-earnings-report-since-ipo-as-investors-eye-stablecoin-growth-201441726.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:14:41.000Z",
    "fetchedAt": "2025-08-12T09:44:54.741Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "576dfe47"
  },
  {
    "id": "yahoo-finance-73a22dc8",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Dow Falls 200 Points. All Eyes Are on CPI Tomorrow.",
    "url": "https://www.barrons.com/livecoverage/stock-market-news-today-081125/card/dow-falls-200-points-all-eyes-are-on-cpi-tomorrow--xtxSOWH7Y2HJYjuV02cC?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:14:37.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "73a22dc8"
  },
  {
    "id": "yahoo-finance-a497231",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Micron Stock Rises After Memory-Chip Maker Ups Outlook",
    "url": "https://www.investors.com/news/technology/micron-stock-memory-chip-maker-ups-outlook/?src=A00220&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:14:13.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a497231"
  },
  {
    "id": "cnbc-markets-4511f5b8",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Cannabis stocks rally after Trump says he is weighing drug reclassification",
    "url": "https://www.cnbc.com/2025/08/11/cannabis-stocks-trump-considering-reclassification-weed.html",
    "summary": "Trump said he's considering reclassifying marijuana's danger level. That drove cannabis stocks up Monday.",
    "fullContent": "Trump said he's considering reclassifying marijuana's danger level. That drove cannabis stocks up Monday.",
    "publishedAt": "2025-08-11T20:13:58.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4511f5b8"
  },
  {
    "id": "bloomberg-markets-3c70b4ed",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Merck KGaA Plans $4 Billion Bond Sale to Fund SpringWorks Therapeutics Acquisition",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/merck-kgaa-is-said-to-plan-4-billion-bond-sale-to-fund-purchase",
    "summary": "Merck KGaA, a German maker of drugs and electronics, is looking to sell around $4 billion of US investment-grade bonds to help fund its acquisition of SpringWorks Therapeutics Inc., according to people with knowledge of the matter.",
    "fullContent": "Merck KGaA, a German maker of drugs and electronics, is looking to sell around $4 billion of US investment-grade bonds to help fund its acquisition of SpringWorks Therapeutics Inc., according to people with knowledge of the matter.",
    "publishedAt": "2025-08-11T20:13:45.000Z",
    "fetchedAt": "2025-08-12T02:23:20.602Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c70b4ed"
  },
  {
    "id": "yahoo-finance-5190d6a3",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Avantor Surges As Activist Investor Takes Aim At 'Self-Inflicted' Issues",
    "url": "https://www.investors.com/news/technology/avantor-stock-engine-capital-activist-investor/?src=A00220&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:12:09.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5190d6a3"
  },
  {
    "id": "yahoo-finance-8d47437",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Tesla Stock Is Up Again. There’s a Key Momentum Level in Sight.",
    "url": "https://www.barrons.com/articles/tesla-stock-price-b2d3cbe9?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:11:00.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "8d47437"
  },
  {
    "id": "yahoo-finance-6497cee0",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Ford Announced $30,000 EV In 'Model T' Moment With EV Market At Cross Roads",
    "url": "https://www.investors.com/news/ford-stock-model-t-moment-ev-announcement-stock-market/?src=A00220&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:08:04.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6497cee0"
  },
  {
    "id": "yahoo-finance-692345d9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Investors Overwhelmingly Believe U.S. Stocks Are Overpriced, Survey Finds",
    "url": "https://www.barrons.com/advisor/articles/stock-market-bank-of-america-fund-manager-poll-august-cba58e14?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:08:00.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "692345d9"
  },
  {
    "id": "cnbc-markets-68fbb3e0",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "AMC significantly narrows losses, posts second-quarter revenue growth",
    "url": "https://www.cnbc.com/2025/08/11/amc-earnings-q2-2025-narrow-losses.html",
    "summary": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "fullContent": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "publishedAt": "2025-08-11T20:07:57.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68fbb3e0"
  },
  {
    "id": "cnbc-business-68fbb3e0",
    "sourceId": "cnbc-business",
    "sourceName": "CNBC Business",
    "title": "AMC significantly narrows losses, posts second-quarter revenue growth",
    "url": "https://www.cnbc.com/2025/08/11/amc-earnings-q2-2025-narrow-losses.html",
    "summary": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "fullContent": "AMC Entertainment posted strong second-quarter results Monday, reporting revenue growth of 35%.",
    "publishedAt": "2025-08-11T20:07:57.000Z",
    "fetchedAt": "2025-08-12T02:23:22.013Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68fbb3e0"
  },
  {
    "id": "yahoo-finance-4c61faef",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Ford Is Reinventing EV Manufacturing to Take On Tesla, BYD. The Stock Is Down.",
    "url": "https://www.barrons.com/articles/ford-stock-ev-model-t-bf29730e?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:07:00.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c61faef"
  },
  {
    "id": "bloomberg-business-youtube-760b86b0",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Confirms Nvidia Chips Payment | Balance of Power 8/11/2025",
    "url": "https://www.youtube.com/watch?v=QpJ3Ykn9BWg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:06:10.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "760b86b0"
  },
  {
    "id": "bloomberg-markets-50196dd0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Bitcoin-Miner MARA Strikes $168 Million Deal for EDF Unit",
    "url": "https://www.bloomberg.com/news/articles/2025-08-11/bitcoin-miner-mara-said-to-near-168-million-deal-for-edf-unit",
    "summary": "MARA Holdings Inc. has agreed to acquire a majority stake in Exaion from Electricite de France SA as the largest Bitcoin miner looks to extend its reach into artificial intelligence as an infrastructure provider.",
    "fullContent": "MARA Holdings Inc. has agreed to acquire a majority stake in Exaion from Electricite de France SA as the largest Bitcoin miner looks to extend its reach into artificial intelligence as an infrastructure provider.",
    "publishedAt": "2025-08-11T20:03:22.000Z",
    "fetchedAt": "2025-08-12T02:23:20.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "50196dd0"
  },
  {
    "id": "cnbc-markets-4370ad2b",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Sequoia's Moritz backs Intel CEO Lip-Bu Tan after Trump's 'artless bullying'",
    "url": "https://www.cnbc.com/2025/08/11/sequoia-moritz-intel-ceo-trump.html",
    "summary": "Sequoia Capital's Michael Moritz is calling on Intel to stand by CEO Lip-Bu Tan after President Donald Trump demanded his resignation last week.",
    "fullContent": "Sequoia Capital's Michael Moritz is calling on Intel to stand by CEO Lip-Bu Tan after President Donald Trump demanded his resignation last week.",
    "publishedAt": "2025-08-11T20:02:52.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4370ad2b"
  },
  {
    "id": "yahoo-finance-5909bd96",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Stock market today: Dow, S&P 500, Nasdaq slump with key inflation report on deck",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-slump-with-key-inflation-report-on-deck-200041060.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:00:41.000Z",
    "fetchedAt": "2025-08-13T06:54:37.716Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5909bd96"
  },
  {
    "id": "ndtv-profit-youtube-77cc579d",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Tariff News | Trump Says ‘We’ll See What Happens’ On China Tariffs As Midnight Deadline Looms",
    "url": "https://www.youtube.com/shorts/EfAUBrZ8nUw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T20:00:37.000Z",
    "fetchedAt": "2025-08-12T02:23:30.423Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "77cc579d"
  },
  {
    "id": "oil-price-e571031",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Trump’s Tariff Gambit Puts India in an Oil Price Bind",
    "url": "https://oilprice.com/Energy/Crude-Oil/Trumps-Tariff-Gambit-Puts-India-in-an-Oil-Price-Bind.html",
    "summary": "In one of his more controversial decisions last week, President Trump said the U.S. would impose an additional 25% on many Indian imports—because of India’s imports of Russian crude oil. The news lifted oil prices, and Indian refiners suspended their Russian oil orders.",
    "fullContent": "In one of his more controversial decisions last week, President Trump said the U.S. would impose an additional 25% on many Indian imports—because of India’s imports of Russian crude oil. The news lifted oil prices, and Indian refiners suspended their Russian oil orders. But the bigger picture shows India at a crossroads not dissimilar to that of the EU: a choice between cheap and expensive energy with all that either option entails. On the face of it, the choice is pretty simple, as laid out by the Economic Times in an article that…",
    "publishedAt": "2025-08-11T20:00:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.382Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "e571031"
  },
  {
    "id": "bloomberg-business-youtube-a19bd5b",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump-Putin Summit: Will a Deal About Ukraine be Reached in Alaska?",
    "url": "https://www.youtube.com/watch?v=n2G0gweMv04",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:59:39.000Z",
    "fetchedAt": "2025-08-12T02:23:33.576Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "a19bd5b"
  },
  {
    "id": "techmeme-7361b9ef",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Anthropic adds a memory feature for Claude to reference information from past chats, available now for Max, Team, and Enterprise plans, and soon for other plans (Zac Hall/9to5Mac)",
    "url": "http://www.techmeme.com/250811/p23#a250811p23",
    "summary": "Zac Hall / 9to5Mac: Anthropic adds a memory feature for Claude to reference information from past chats, available now for Max, Team, and Enterprise plans, and soon for other plans — Anthropic has introduced a helpful new feature for Claude that solves a problem similar to one...",
    "fullContent": "Zac Hall / 9to5Mac: Anthropic adds a memory feature for Claude to reference information from past chats, available now for Max, Team, and Enterprise plans, and soon for other plans — Anthropic has introduced a helpful new feature for Claude that solves a problem similar to one ChatGPT already addressed.",
    "publishedAt": "2025-08-11T19:55:01.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7361b9ef"
  },
  {
    "id": "cnbc-markets-24cfb02f",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "A new piece of Wall Street research prompted us to change our rating on Salesforce",
    "url": "https://www.cnbc.com/2025/08/11/a-new-piece-of-wall-street-research-prompted-us-to-change-our-rating-on-salesforce.html",
    "summary": "Melius Research's downgrade of Adobe makes the case that AI is a major threat to software providers like Salesforce.",
    "fullContent": "Melius Research's downgrade of Adobe makes the case that AI is a major threat to software providers like Salesforce.",
    "publishedAt": "2025-08-11T19:53:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.252Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "24cfb02f"
  },
  {
    "id": "wsj-opinion-5ae6b7c2",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Napoleon&#x2019;s Lessons for Trump",
    "url": "https://www.wsj.com/opinion/napoleons-lessons-for-trump-president-power-france-emperor-bf60820b",
    "summary": "The president grasps power dynamics but should learn from the French emperor&#x2019;s fall.",
    "fullContent": "The president grasps power dynamics but should learn from the French emperor&#x2019;s fall.",
    "publishedAt": "2025-08-11T19:53:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "5ae6b7c2"
  },
  {
    "id": "wsj-opinion-6a5341fa",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Recognizing a Palestinian State Is a Rebuke to Hamas",
    "url": "https://www.wsj.com/opinion/recognizing-a-palestinian-state-is-a-rebuke-to-hamas-middle-east-gaza-ee687a6c",
    "summary": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "fullContent": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "publishedAt": "2025-08-11T19:52:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "6a5341fa"
  },
  {
    "id": "wsj-opinion-4e3c7ab5",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Can Trump Tame the Washington, D.C., Streets?",
    "url": "https://www.wsj.com/opinion/can-trump-tame-the-d-c-streets-washington-home-rule-81bb61be",
    "summary": "Home rule is likely here to stay, but there are things he can do.",
    "fullContent": "Home rule is likely here to stay, but there are things he can do.",
    "publishedAt": "2025-08-11T19:52:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e3c7ab5"
  },
  {
    "id": "wsj-world-news-1e9296e4",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Recognizing a Palestinian State Is a Rebuke to Hamas",
    "url": "https://www.wsj.com/opinion/recognizing-a-palestinian-state-is-a-rebuke-to-hamas-middle-east-gaza-ee687a6c",
    "summary": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "fullContent": "But France, Canada and the U.K. are doing it too hastily. The plan won&#x2019;t work without conditions.",
    "publishedAt": "2025-08-11T19:52:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.952Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "1e9296e4"
  },
  {
    "id": "ft-markets-1cdc29c",
    "sourceId": "ft-markets",
    "sourceName": "Financial Times Markets",
    "title": "Trump says gold imports will not face US tariffs",
    "url": "https://www.ft.com/content/9e757ba7-73a5-4d19-bb76-4ddc303b26dd",
    "summary": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge.",
    "fullContent": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge",
    "publishedAt": "2025-08-11T19:51:44.000Z",
    "fetchedAt": "2025-08-12T02:23:21.590Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1cdc29c"
  },
  {
    "id": "ft-economics-1cdc29c",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "Trump says gold imports will not face US tariffs",
    "url": "https://www.ft.com/content/9e757ba7-73a5-4d19-bb76-4ddc303b26dd",
    "summary": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge.",
    "fullContent": "President’s intervention comes after shock plan to hit bullion with duties triggered price surge",
    "publishedAt": "2025-08-11T19:51:44.000Z",
    "fetchedAt": "2025-08-12T02:23:22.368Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "1cdc29c"
  },
  {
    "id": "wsj-markets-main-33079fbf",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Opinion | No Help Wanted, No Economic Growth",
    "url": "https://www.wsj.com/opinion/no-help-wanted-no-economic-growth-central-banking-cuts-109e4aaf?mod=rss_markets_main",
    "summary": "The economy faces problems more pressing than inflation.",
    "fullContent": "The economy faces problems more pressing than inflation.",
    "publishedAt": "2025-08-11T19:51:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.177Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "33079fbf"
  },
  {
    "id": "wsj-opinion-4e686203",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "No Help Wanted, No Economic Growth",
    "url": "https://www.wsj.com/opinion/no-help-wanted-no-economic-growth-central-banking-cuts-109e4aaf",
    "summary": "The economy faces problems more pressing than inflation.",
    "fullContent": "The economy faces problems more pressing than inflation.",
    "publishedAt": "2025-08-11T19:51:00.000Z",
    "fetchedAt": "2025-08-12T02:23:21.954Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "4e686203"
  },
  {
    "id": "zerohedge-13892265",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Goldman Finds \"Sharp Declines\" In Import Prices As Foreigners Absorb Trump's Tariffs",
    "url": "https://www.zerohedge.com/markets/goldman-finds-sharp-declines-import-prices-foreigners-absorb-trumps-tariffs",
    "summary": "Goldman Finds \"Sharp Declines\" In Import Prices As Foreigners Absorb Trump's Tariffs Back in late June, we were first to point out something startling: contrary to conventional wisdom according to which prices of heavily-tariffed goods would surge and spark runaway inflation...",
    "fullContent": "Goldman Finds \"Sharp Declines\" In Import Prices As Foreigners Absorb Trump's Tariffs Back in late June, we were first to point out something startling: contrary to conventional wisdom according to which prices of heavily-tariffed goods would surge and spark runaway inflation (just skim this from certified idiot Paul Krugman), we found just the opposite, namely that Japanese passenger car export prices had plunged by the most on record, demonstrating that it was foreign producers that were eating the bulk of the tariffs, certainly in this particular case. well would you look at that: guess who is eating all those tariff costs (hint, it's not US consumers) pic.twitter.com/iwdKyeqTII — zerohedge (@zerohedge) June 22, 2025 Three days later, our chart ended up in front of Fed Chair Jerome Powell during his periodic grilling in Congress, where he was unable to give a clear explanation as to why the export prices of Japanese autos would be plunging in response to sharply higher tariffs (the answer, of course, is simple: foreign producers simply can not pass through costs to the US market without losing much if not all of their market share, so they have no choice but to eat the loss). well would you look at that: three days later Powell has to discuss this chart https://t.co/6AfkRRSjJp pic.twitter.com/SOGjff2Fsl — zerohedge (@zerohedge) June 25, 2025 Fast forward to today when Goldman, similar to Morgan Stanley over the weekend, tried to analyze why those tariffs which it - and so many other economists predicted incorrectly - would already have sent inflation soaring, have failed to do so. While there is a bunch of stuff in the report (which pro subs can read at their leisure here), what was most notable is the \"discovery\" that it's not just Japanese car makers. As Goldman's Jan Hatzius reveals, \"we find that US import prices on tariffed goods have declined somewhat, suggesting that foreign exporters have absorbed some tariff costs by lowering their export prices to the US, unlike during the 2018-2019 trade war.\" Our updated analysis shows that a 1pp increase in the product-level tariff rate led to a 0.25% cumulative decline in import prices over the first three months of implementation, with minimal impact thereafter. Of course, here Goldman had to mix fact with projection to not sound like a bunch of wrong, confused career economists. When one strips away hypothesis and forecast, here is what actually happened: \"following the implementation of China and auto tariffs, import prices (exclusive of tariffs) of both consumer and non-consumer goods from China, as well as import prices of passenger cars (exclusive of tariffs) from the EU and Japan, all experienced sharp declines.\" Looking forward, Goldman concludes that whereas \"foreign exporters had absorbed 14% of the cost of all tariffs implemented so far through June, their share will rise to 25% if the more recent tariffs follow the same pattern as the earliest tariffs on China.\" This also means that the 9% increase in the effective tariff rate through June has reduced import prices by at least 1.3% so far, and that the total 14% increase in the effective tariff rate that Goldman expects in 2025 will likely reduce import prices by 3.7%, if not much more assuming foreign producers continue to keep prices reduced to remain competitive with lower-cost domestic producers. The rest of the Goldman note goes on to do what Morgan Stanley tried to do yesterday: forecast just when all those tariffs will eventually finally show up in inflation... an exercise they have to do because both giant banks were very wrong in incorrectly assuming that inflation would already be far higher than it is so far. Don't be surprise if tomorrow's CPI comes in tame yet again, prompting even more revisions to Goldman's inflation ETA. Much more in the full Goldman note, available to pro subscribers. Tyler Durden Mon, 08/11/2025 - 15:45",
    "publishedAt": "2025-08-11T19:45:00.000Z",
    "fetchedAt": "2025-08-12T02:23:22.062Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "13892265"
  },
  {
    "id": "ndtv-profit-youtube-55285c7d",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "If You're Weak And Pathetic, I Will Fire You So Fast: Trump Jokes With Top US Marshall",
    "url": "https://www.youtube.com/shorts/8Fki9-64o3Y",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-11T19:42:08.000Z",
    "fetchedAt": "2025-08-12T02:23:30.423Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "55285c7d"
  },
  {
    "id": "techmeme-7d78f9ec",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Revel plans to wind down rideshare operations in its home city of New York after four years, pivoting to an EV-charging business that counts Uber as a partner (Natalie Lung/Bloomberg)",
    "url": "http://www.techmeme.com/250811/p22#a250811p22",
    "summary": "Natalie Lung / Bloomberg: Revel plans to wind down rideshare operations in its home city of New York after four years, pivoting to an EV-charging business that counts Uber as a partner — Revel Transit Inc.",
    "fullContent": "Natalie Lung / Bloomberg: Revel plans to wind down rideshare operations in its home city of New York after four years, pivoting to an EV-charging business that counts Uber as a partner — Revel Transit Inc. plans to wind down rideshare operations after weathering stiff competition in its home city of New York &hellip;",
    "publishedAt": "2025-08-11T19:40:00.000Z",
    "fetchedAt": "2025-08-12T02:23:23.483Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7d78f9ec"
  }
]