[
  {
    "id": "bloomberg-markets-2af9a69e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Codelco Returns to Work at Chile Copper Mine Hit by Collapse",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/codelco-wins-partial-approval-to-restart-copper-mine-in-chile",
    "summary": "Codelco restarted underground and processing activities at its biggest copper mine, El Teniente, a little more than a week after suffering Chile’s deadliest mining accident in decades.",
    "fullContent": "Codelco restarted underground and processing activities at its biggest copper mine, El Teniente, a little more than a week after suffering Chile’s deadliest mining accident in decades.",
    "publishedAt": "2025-08-09T01:32:27.000Z",
    "fetchedAt": "2025-08-11T13:12:59.590Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2af9a69e"
  },
  {
    "id": "scmp-business-3aafa6d9",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "An ‘elegant’ English name would be all wrong for my Hong Kong baby",
    "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3321172/elegant-english-name-would-be-all-wrong-my-hong-kong-baby?utm_source=rss_feed",
    "summary": "Hong Kong’s Births Registry gives new parents 42 days to name their child before imposing a fine. This might seem enough, but when you are navigating new motherhood, learning to keep a tiny human alive while your body heals, time becomes both endless and insufficient.",
    "fullContent": "Hong Kong’s Births Registry gives new parents 42 days to name their child before imposing a fine. This might seem enough, but when you are navigating new motherhood, learning to keep a tiny human alive while your body heals, time becomes both endless and insufficient. It took me nearly all that time to settle on two names, not from indecision, but from the weight of history. Months before my daughter arrived, I had chosen for her a Chinese name meaning “dwell in peace”. The name came from a...",
    "publishedAt": "2025-08-09T01:30:07.000Z",
    "fetchedAt": "2025-08-09T02:26:38.886Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3aafa6d9"
  },
  {
    "id": "business-insider-3aeae664",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "OpenAI fans plead case to Sam Altman for GPT-4o's return",
    "url": "https://www.businessinsider.com/upgrade-chatgpt-5-met-with-frustration-tears-gpt4o-reddit-altman-2025-8",
    "summary": "Sam Altman came under fire after replacing GPT-4o with GPT-5, and will now bring it back after overwhelming requests.",
    "fullContent": "Sam Altman came under fire after replacing GPT-4o with GPT-5, and will now bring it back after overwhelming requests.",
    "publishedAt": "2025-08-09T01:28:38.000Z",
    "fetchedAt": "2025-08-09T02:26:36.309Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3aeae664"
  },
  {
    "id": "thehindubusinessline-c6d01a6",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "US Defence Chief Hegseth shares video urging end to women’s right to vote",
    "url": "https://www.thehindubusinessline.com/news/world/us-defence-chief-hegseth-shares-video-urging-end-to-womens-right-to-vote/article69912407.ece",
    "summary": "Critics, including progressive evangelical leader Doug Pagitt, called the endorsement “very disturbing.”",
    "fullContent": "Critics, including progressive evangelical leader Doug Pagitt, called the endorsement “very disturbing.”",
    "publishedAt": "2025-08-09T01:21:17.000Z",
    "fetchedAt": "2025-08-09T02:26:36.408Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "c6d01a6"
  },
  {
    "id": "zerohedge-10a530d7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "'Far From Frantic': How Active Has The 2025 Atlantic Hurricane Season Been?",
    "url": "https://www.zerohedge.com/weather/far-frantic-how-active-has-2025-atlantic-hurricane-season-been",
    "summary": "'Far From Frantic': How Active Has The 2025 Atlantic Hurricane Season Been? Atlantic hurricane season officially spans from June to November, but only a sliver of total activity usually occurs before August.",
    "fullContent": "'Far From Frantic': How Active Has The 2025 Atlantic Hurricane Season Been? Atlantic hurricane season officially spans from June to November, but only a sliver of total activity usually occurs before August. That makes early-season developments a useful pulse check on what may lie ahead. So far, as Visual Capitalist shows in the chart below, 2025’s pulse is steady but far from frantic. A Measured Start to 2025 The graphic above, created by USAFacts using National Oceanic and Atmospheric Administration (NOAA) data, plots every Atlantic system since 2015 by the month it formed and the strongest category it reached. Green dots denote tropical storms, blue dots Category 1–2 hurricanes, and purple dots Category 3+ “major” hurricanes. So far in 2025, the dots are sparse: four storms, none exceeding tropical-storm strength. By early August a typical season averages three named storms, so this year is slightly ahead of the curve. That said, it’s far calmer than 2020, which was the early-season outlier. Below is a detailed look at every Atlantic storm (2015-2025) and its peak intensity: Storm Name Month Year Classification Andrea June 2025 Tropical storm Barry June 2025 Tropical storm Chantal July 2025 Tropical storm Dexter August 2025 Tropical storm Alberto June 2024 Tropical Storm Beryl June-July 2024 Hurricane Chris June-July 2024 Tropical Storm Debby August 2024 Hurricane Ernesto August 2024 Hurricane Francine September 2024 Hurricane Gordon September 2024 Tropical Storm Eight (PTC) August 2024 Potential Tropical Cyclone Helene September 2024 Hurricane Isaac September-October 2024 Hurricane Joyce September-October 2024 Tropical Storm Kirk September-October 2024 Hurricane Leslie October 2024 Hurricane Milton October 2024 Hurricane Nadine October 2024 Tropical Storm Oscar October 2024 Hurricane Patty October-November 2024 Tropical Storm Rafael October-November 2024 Hurricane Sara November 2024 Tropical Storm Arlene June 2023 Tropical Storm Bret June 2023 Tropical Storm Cindy June-July 2023 Tropical Storm Don July 2023 Hurricane Emily August 2023 Tropical Storm Franklin August 2023 Hurricane Gert August-September 2023 Tropical Storm Harold August 2023 Tropical Storm Idalia August 2023 Hurricane Jose August-September 2023 Tropical Storm Katia September 2023 Tropical Storm Lee September 2023 Hurricane Margot September 2023 Tropical Storm Nigel September 2023 Hurricane Ophelia September 2023 Tropical Storm Philippe September-October 2023 Tropical Storm Rina September-October 2023 Tropical Storm Sean October 2023 Tropical Storm Tammy October 2023 Hurricane Vince October 2023 Tropical Storm Whitney November 2023 Tropical Storm Alex June 2022 Hurricane Bonnie June-July 2022 Tropical Storm Colin July 2022 Tropical Storm Danielle September 2022 Hurricane Earl September 2022 Hurricane Fiona September 2022 Hurricane Gaston September 2022 Tropical Storm Hermine September 2022 Tropical Storm Ian September 2022 Hurricane Julia October 2022 Hurricane Karl October 2022 Tropical Storm Lisa October-November 2022 Hurricane Martin November 2022 Hurricane Nicole November 2022 Hurricane Ana May 2021 Tropical Storm Bill June 2021 Tropical Storm Claudette June 2021 Tropical Storm Danny June 2021 Hurricane Elsa June-July 2021 Hurricane Fred August 2021 Tropical Storm Grace August 2021 Hurricane Henri August 2021 Hurricane Ida August 2021 Hurricane Julian August-September 2021 Tropical Storm Kate August-September 2021 Tropical Storm Larry September 2021 Hurricane Mindy September 2021 Tropical Storm Nicholas September 2021 Hurricane Odette September 2021 Tropical Storm Peter September 2021 Hurricane Rose September 2021 Hurricane Sam September-October 2021 Hurricane Teresa September 2021 Tropical Storm Victor September-October 2021 Hurricane Wanda October-November 2021 Tropical Storm Arthur May 2020 Tropical Storm Bertha May 2020 Tropical Storm Cristobal June 2020 Tropical Storm Dolly June 2020 Tropical Storm Edouard July 2020 Tropical Storm Fay July 2020 Tropical Storm Gonzalo July 2020 Hurricane Hanna July 2020 Hurricane Isaias July-August 2020 Hurricane Josephine August 2020 Tropical Storm Kyle August 2020 Tropical Storm Laura August 2020 Hurricane Marco August 2020 Hurricane Nana September 2020 Hurricane Omar September 2020 Tropical Storm Paulette September 2020 Hurricane Rene September 2020 Tropical Storm Sally September 2020 Hurricane Teddy September 2020 Hurricane Vicky September 2020 Tropical Storm Wilfred September 2020 Tropical Storm Alpha September 2020 Subtropical Storm Beta September 2020 Hurricane Gamma October 2020 Tropical Storm Delta October 2020 Hurricane Epsilon October 2020 Hurricane Zeta October 2020 Hurricane Eta November 2020 Hurricane Theta November 2020 Tropical Storm Iota November 2020 Hurricane Andrea May 2019 Subtropical Storm Barry July 2019 Hurricane Chantal August 2019 Tropical Storm Dorian August-September 2019 Hurricane Erin August 2019 Tropical Storm Fernand September 2019 Tropical Storm Gabrielle September 2019 Tropical Storm Humberto September 2019 Hurricane Imelda September 2019 Tropical Storm Jerry September 2019 Hurricane Karen September 2019 Tropical Storm Lorenzo September-October 2019 Hurricane Melissa November 2019 Tropical Storm Nestor October 2019 Tropical Storm Olga October 2019 Tropical Storm Pablo October 2019 Hurricane Rebekah October 2019 Tropical Storm Sebastien November 2019 Tropical Storm Alberto May 2018 Subtropical Storm Beryl July 2018 Hurricane Chris July 2018 Hurricane Debby August 2018 Tropical Storm Ernesto August 2018 Tropical Storm Florence August-September 2018 Hurricane Gordon September 2018 Tropical Storm Helene September 2018 Hurricane Isaac September 2018 Hurricane Joyce September 2018 Tropical Storm Kirk September-October 2018 Tropical Storm Leslie September-November 2018 Hurricane Michael October 2018 Hurricane Nadine October 2018 Tropical Storm Oscar October-November 2018 Hurricane Arlene April 2017 Tropical Storm Bret June 2017 Tropical Storm Cindy June 2017 Tropical Storm Don July 2017 Tropical Storm Emily July-August 2017 Tropical Storm Franklin August 2017 Hurricane Gert August 2017 Hurricane Harvey August 2017 Hurricane Irma August-September 2017 Hurricane Jose September 2017 Hurricane Katia September 2017 Hurricane Lee September 2017 Hurricane Maria September 2017 Hurricane Nate October 2017 Hurricane Ophelia October 2017 Hurricane Philippe October 2017 Tropical Storm Rina November 2017 Tropical Storm Alex January 2016 Hurricane Bonnie May-June 2016 Tropical Storm Colin June 2016 Tropical Storm Danielle June 2016 Tropical Storm Earl August 2016 Hurricane Fiona August 2016 Hurricane Gaston August 2016 Hurricane Hermine August-September 2016 Hurricane Ian September 2016 Tropical Storm Julia September 2016 Tropical Storm Karl September 2016 Tropical Storm Lisa September 2016 Tropical Storm Matthew September-October 2016 Hurricane Nicole October 2016 Hurricane Otto November 2016 Hurricane Ana May 2015 Tropical Storm Bill June 2015 Tropical Storm Claudette July 2015 Tropical Storm Danny August 2015 Hurricane Erika August 2015 Tropical Storm Fred August-September 2015 Hurricane Grace September 2015 Tropical Storm Henri September 2015 Tropical Storm Ida September 2015 Hurricane Joaquin September-October 2015 Hurricane Kate November 2015 Hurricane Where Storms Hit Home The county-level map below shades areas that have endured at least one bout of 39 mph winds since 2015. The deepest purples hug the Gulf Coast, Florida peninsula, and the Outer Banks, but inland regions from Georgia’s wiregrass to eastern North Carolina also light up, evidence that wind impacts reach far beyond shorelines. For perspective on how damaging these systems can be, see our ranking of the costliest hurricanes to hit the U.S. Looking Ahead Climatology shows the first hurricane typically spins up in early to mid-August, with major-category hurricanes following later that month. Warm sea-surface temperatures and a likely transition toward neutral ENSO conditions could still unlock the ingredients for rapid intensification. In short: a quiet opening is no guarantee of a quiet finish. As peak season approaches, preparedness remains key for coastal communities. Explore our companion visualization, Visualizing the Typical Atlantic Hurricane Season, and hundreds of other bite-sized data stories. Tyler Durden Fri, 08/08/2025 - 21:20",
    "publishedAt": "2025-08-09T01:20:00.000Z",
    "fetchedAt": "2025-08-09T09:42:10.232Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "10a530d7"
  },
  {
    "id": "wsj-world-news-33bf0178",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Putin Tells U.S. He&#x2019;ll Halt War in Exchange for Eastern Ukraine",
    "url": "https://www.wsj.com/world/putin-russia-ukraine-ceasefire-proposal-0021453b",
    "summary": "The proposal prompted talk of a summit with the Russian leader, with President Trump later saying a meeting would take place in Alaska on Aug. 15.",
    "fullContent": "The proposal prompted talk of a summit with the Russian leader, with President Trump later saying a meeting would take place in Alaska on Aug. 15.",
    "publishedAt": "2025-08-09T01:19:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.853Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "33bf0178"
  },
  {
    "id": "thehindubusinessline-19c22540",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Trump to meet Putin in Alaska on Aug 15 in push for Ukraine peace",
    "url": "https://www.thehindubusinessline.com/news/world/trump-to-meet-putin-in-alaska-on-aug-15-in-push-for-ukraine-peace/article69912401.ece",
    "summary": "Trump suggested a possible “territory swap” as part of a deal, raising European fears of sidelining Ukraine.",
    "fullContent": "Trump suggested a possible “territory swap” as part of a deal, raising European fears of sidelining Ukraine",
    "publishedAt": "2025-08-09T01:07:40.000Z",
    "fetchedAt": "2025-08-09T02:26:36.408Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19c22540"
  },
  {
    "id": "wsj-markets-main-65bff64b",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Stock Market News, Aug. 8, 2025: Gold Pares Gains; Dow Rises",
    "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-08-08-2025?mod=rss_markets_main",
    "summary": "White House said it would clarify tariffs on the precious metal.",
    "fullContent": "White House said it would clarify tariffs on the precious metal",
    "publishedAt": "2025-08-09T01:07:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "65bff64b"
  },
  {
    "id": "scmp-business-18abb7bd",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong must be ‘careful’ before barring lawyers from meeting clients in jail",
    "url": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3321279/hong-kong-must-be-very-careful-banning-lawyers-meeting-clients-jail?utm_source=rss_feed",
    "summary": "Hong Kong authorities should be “very careful” before they resort to banning certain lawyers from meeting their clients in custody under revised prison rules, the head of the city’s Bar Association has said.",
    "fullContent": "Hong Kong authorities should be “very careful” before they resort to banning certain lawyers from meeting their clients in custody under revised prison rules, the head of the city’s Bar Association has said. In an interview with the Post, senior counsel Jose-Antonio Maurellet added that some members of the professional body had also expressed concerns over the revised prison rules, which will tighten visiting criteria for specific lawyers. At the centre of contention is an amendment which allows...",
    "publishedAt": "2025-08-09T01:00:23.000Z",
    "fetchedAt": "2025-08-09T02:26:38.886Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18abb7bd"
  },
  {
    "id": "thehindubusinessline-4a9da6ca",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Shaping character, building futures",
    "url": "https://www.thehindubusinessline.com/opinion/shaping-character-building-futures/article69910737.ece",
    "summary": "Residential schools preserve cherished traditions and values while adapting to contemporary realities.",
    "fullContent": "Residential schools preserve cherished traditions and values while adapting to contemporary realities",
    "publishedAt": "2025-08-09T01:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.408Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4a9da6ca"
  },
  {
    "id": "zerohedge-4329cb79",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "DOJ Moves To Unseal Exhibits From Epstein, Maxwell Grand Jury Investigations",
    "url": "https://www.zerohedge.com/political/doj-moves-unseal-exhibits-epstein-maxwell-grand-jury-investigations",
    "summary": "DOJ Moves To Unseal Exhibits From Epstein, Maxwell Grand Jury Investigations Authored by Jack Phillips via The Epoch Times, The Department of Justice (DOJ) on Friday asked a federal court to unseal grand jury exhibits from the investigations into sex traffickers Jeffrey...",
    "fullContent": "DOJ Moves To Unseal Exhibits From Epstein, Maxwell Grand Jury Investigations Authored by Jack Phillips via The Epoch Times, The Department of Justice (DOJ) on Friday asked a federal court to unseal grand jury exhibits from the investigations into sex traffickers Jeffrey Epstein and Ghislaine Maxwell. In a submission to U.S. District Judge Richard Berman and fellow U.S. District Judge Paul Engelmayer, the DOJ said it wants grand jury exhibits in the two cases unsealed with redactions to keep the identities of their victims private. Earlier this week, the DOJ asked the judges to unseal grand jury transcripts in order to compare those documents with the public record. “As there are parties whose names appear in the grand jury exhibits but did not appear in the grand jury transcripts, the Government is undertaking to notify such parties to the extent their names appear in grand jury exhibits that were not publicly admitted at the Maxwell trial (and they were not already notified in connection with the request to unseal the grand jury transcripts),” the Justice Department’s attorneys wrote. The latest request relates to the 2019 criminal case that was brought against Epstein, which was later dropped after he was found dead in a New York City jail cell, as well as the criminal case against Maxwell. She was convicted on child sex trafficking charges in 2021 and is currently serving a 20-year prison sentence in a federal facility. Friday’s filing by the government also said that some of the evidence in the Epstein and Maxwell cases may overlap with exhibits that were released to the public when Maxwell went on trial. Also, the DOJ said that it will later submit sealed submissions to clarify what sections of the Epstein and Maxwell grand jury exhibits have already been made available to the public. The government has also compared the exhibits against the trial record and civil complaints that were filed by certain victims, the court filing said. It’s not clear what the exhibits may include or when they could be unsealed. The Epstein grand jury met twice in 2019, on June 18 and July 2 of that year, the DOJ letter said on Aug. 4. Meanwhile, the Maxwell grand jury met three times, on June 29 and July 8 of 2020, and on March 29, 2021, according to the letter. That letter had also asked for the release of the five grand jury transcripts and told the judges that the DOJ may also request the unsealing of grand jury exhibits. The agency said it wants several more days to craft arguments for that request. Epstein’s death was officially ruled a suicide by hanging. Previously, in 2008, Epstein was sentenced to 13 months in work custody for procuring a child for prostitution and sex trafficking. Tyler Durden Fri, 08/08/2025 - 20:55",
    "publishedAt": "2025-08-09T00:55:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.985Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4329cb79"
  },
  {
    "id": "techmeme-1e0b8c68",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: Trump's World Liberty Financial is seeking to raise $1.5B to launch a publicly traded crypto treasury company that would hold its WLFI token and cash (Fortune)",
    "url": "http://www.techmeme.com/250808/p29#a250808p29",
    "summary": "Fortune: Sources: Trump's World Liberty Financial is seeking to raise $1.5B to launch a publicly traded crypto treasury company that would hold its WLFI token and cash — Eric Trump (left) and Donald Trump Jr. on stage in May at the Bitcoin 2025 conference in Las Vegas.",
    "fullContent": "Fortune: Sources: Trump's World Liberty Financial is seeking to raise $1.5B to launch a publicly traded crypto treasury company that would hold its WLFI token and cash — Eric Trump (left) and Donald Trump Jr. on stage in May at the Bitcoin 2025 conference in Las Vegas.",
    "publishedAt": "2025-08-09T00:45:02.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1e0b8c68"
  },
  {
    "id": "techmeme-2c1ece50",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: Trump's World Liberty Financial is seeking to raise $1.5B to launch a publicly traded crypto treasury company that would hold its WLFI token and cash (Fortune)",
    "url": "http://www.techmeme.com/250808/p29#a250808p29",
    "summary": "Fortune: Sources: Trump's World Liberty Financial is seeking to raise $1.5B to launch a publicly traded crypto treasury company that would hold its WLFI token and cash — The Trump family business World Liberty Financial is planning to announce a crypto treasury company, say...",
    "fullContent": "Fortune: Sources: Trump's World Liberty Financial is seeking to raise $1.5B to launch a publicly traded crypto treasury company that would hold its WLFI token and cash — The Trump family business World Liberty Financial is planning to announce a crypto treasury company, say three investors who have seen parts of the deal.",
    "publishedAt": "2025-08-09T00:45:02.000Z",
    "fetchedAt": "2025-08-10T02:52:49.963Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "2c1ece50"
  },
  {
    "id": "nyt-business-486cc730",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Trump Attack on Intel’s C.E.O. Could Compound Factory Struggles",
    "url": "https://www.nytimes.com/2025/08/08/business/trump-intel-ceo-ohio.html",
    "summary": "The challenges in Ohio highlight the risks that federal and state officials took when they financially backed Intel, a once-powerful force in chip manufacturing.",
    "fullContent": "The challenges in Ohio highlight the risks that federal and state officials took when they financially backed Intel, a once-powerful force in chip manufacturing.",
    "publishedAt": "2025-08-09T00:39:49.000Z",
    "fetchedAt": "2025-08-09T02:26:36.613Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "486cc730"
  },
  {
    "id": "nse-online-announcements-5057a23b",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Centrum Capital Limited",
    "url": "https://nsearchives.nseindia.com/corporate/CENTRUM_09082025003837_BSENSEAGMPROCEEDINGS2025_Final.pdf",
    "summary": "Centrum Capital Limited has informed the Exchange about General Updates |SUBJECT: General Updates.",
    "fullContent": "Centrum Capital Limited has informed the Exchange about General Updates |SUBJECT: General Updates",
    "publishedAt": "2025-08-09T00:39:11.000Z",
    "fetchedAt": "2025-08-09T02:35:23.644Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "5057a23b"
  },
  {
    "id": "nse-online-announcements-2ec79653",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Centrum Capital Limited",
    "url": "https://nsearchives.nseindia.com/corporate/CENTRUM_09082025003610_BSENSEAGMPROCEEDINGS2025_Final.pdf",
    "summary": "Centrum Capital Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 08, 2025. Further, the company has submitted the Exchange a copy of Srutinizers report along with voting results. |SUBJECT: Shareholders meeting.",
    "fullContent": "Centrum Capital Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 08, 2025. Further, the company has submitted the Exchange a copy of Srutinizers report along with voting results. |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-09T00:36:40.000Z",
    "fetchedAt": "2025-08-09T02:35:23.644Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "2ec79653"
  },
  {
    "id": "nse-online-announcements-5ee0dfa8",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Blue Coast Hotels Limited",
    "url": "https://nsearchives.nseindia.com/corporate/BLUECOAST_09082025003514_Newspaper_Publications_prior_AGM_Notice_for_Email_Registeration.pdf",
    "summary": "Blue Coast Hotels Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication.",
    "fullContent": "Blue Coast Hotels Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-09T00:35:30.000Z",
    "fetchedAt": "2025-08-09T02:35:23.644Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "5ee0dfa8"
  },
  {
    "id": "nyt-business-314bd14c",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Thousands of Dollars Worth of Labubus Stolen From California Store",
    "url": "https://www.nytimes.com/2025/08/08/us/labubu-dolls-stolen-california.html",
    "summary": "Demand for the trendy dolls, elf-like creatures with nine-tooth grins, has people lining up for hours to buy them.",
    "fullContent": "Demand for the trendy dolls, elf-like creatures with nine-tooth grins, has people lining up for hours to buy them.",
    "publishedAt": "2025-08-09T00:30:54.000Z",
    "fetchedAt": "2025-08-09T02:26:36.612Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "314bd14c"
  },
  {
    "id": "zerohedge-7e1c3a50",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Social Security Insolvency Projected 6 Months Sooner, Chief Actuary Says",
    "url": "https://www.zerohedge.com/political/social-security-insolvency-projected-6-months-sooner-chief-actuary-says",
    "summary": "Social Security Insolvency Projected 6 Months Sooner, Chief Actuary Says The Social Security trust funds are projected to run out about six months earlier than previously estimated, according to a new analysis from the program’s chief actuary. Letters sent on Aug. 5 to Sen.",
    "fullContent": "Social Security Insolvency Projected 6 Months Sooner, Chief Actuary Says The Social Security trust funds are projected to run out about six months earlier than previously estimated, according to a new analysis from the program’s chief actuary. Letters sent on Aug. 5 to Sen. Ron Wyden (D‑Ore.) and Rep. Steven Horsford (D‑Nev.) say the combined Old‑Age and Survivors Insurance (OASI) and Disability Insurance (DI) funds are now expected to be depleted in the first quarter of 2034, rather than the third quarter of that year as in the most recent trustees’ report. The 2025 trustees’ report, released in June, had already moved up the combined depletion date by one year—from 2035 in the prior report to 2034—reflecting worsening demographics and legislative changes. Under the new analysis carried out in response to requests from Wyden and Horsford, the One Big Beautiful Bill Act accelerates that timeline further by about six months. As Tom Ozimek reports for The Epoch Times, the actuary’s letter attributes the earlier depletion to income‑tax provisions in the law, which make lower tax rates enacted in 2017 permanent and temporarily expand deductions for older Americans. It estimates the changes will reduce revenue from taxing Social Security benefits and increase program costs by about $168.6 billion through 2034, worsening the program’s 75‑year actuarial deficit from 3.82 percent to 3.98 percent of taxable payroll. When viewed separately, the OASI fund—which pays retirement and survivor benefits—is now forecast to run dry in the fourth quarter of 2032, roughly three months earlier than the previous estimate of the first quarter of 2033. The DI fund, by contrast, remains solvent through the end of the 75-year forecast window. However, because the two funds are often assessed together to reflect total benefit obligations, the combined reserves are still expected to be exhausted by early 2034. The actuary’s office said the analysis covers only the tax‑related provisions and will serve as a baseline for the 2026 trustees’ report, which will incorporate updated data and assumptions. In particular, the forthcoming trustees’ report will also include proposals intended to extend the solvency of Social Security. Wyden, the top Democrat on the Senate Finance Committee, said the actuary’s findings confirm earlier warnings that recent Republican tax and spending policies are straining the program. The White House did not respond to a request for comment. The Trump administration has said its tax policy will stimulate economic growth and expand the tax base, mitigating the fiscal effects of the One Big Beautiful Bill Act without raising tax rates. A White House Council of Economic Advisers paper from May stated that the permanent extension of the 2017 Tax Cuts and Jobs Act and business incentives in the bill would boost capital investment, wages, and job growth, strengthening government revenue streams over time. Proposals to Shore Up the Program Democrats have largely focused on raising payroll taxes for higher earners to close the funding gap. The Social Security tax currently applies to 6.2 percent of wages up to $176,100 in 2025, and income above that level is exempt. The wage base is adjusted annually for inflation by the Social Security Administration. A proposal introduced in 2023 by Sens. Bernie Sanders (I‑Vt.) and Elizabeth Warren (D‑Mass.)—known as the Social Security Expansion Act—would apply the tax to earnings above $250,000 and boost benefits for some groups. Proponents say the measure would keep the program solvent through 2096, though conservative groups such as the Heritage Foundation say that it would amount to one of the largest tax increases in U.S. history and risk broader economic harm. Republican plans have taken a different approach, focusing on changes to benefits and eligibility rather than new taxes. A blueprint released last spring by the Republican Study Committee—the largest group of conservatives in the House—called for gradually raising the retirement age, adjusting benefit formulas, and limiting certain spousal and dependent benefits for high‑income retirees. Some analysts, such as those at Brookings, have suggested that any lasting fix will likely require a mix of tax increases and benefit adjustments, phased in gradually to give workers and retirees time to plan. They note that previous solvency deals, such as the 1983 reforms, combined measures from both parties to extend the program’s life for decades. Tyler Durden Fri, 08/08/2025 - 20:30",
    "publishedAt": "2025-08-09T00:30:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.986Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7e1c3a50"
  },
  {
    "id": "ndtv-profit-rss-b0e2013",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Saturday Bank Holiday: Are Banks Open Or Closed Today, August 9?",
    "url": "https://www.ndtvprofit.com/nation/saturday-bank-holiday-are-banks-open-or-closed-today-august-9",
    "summary": "All scheduled commercial banks in India remain closed on the second and fourth Saturdays of every month. However, digital banking services remain available for the general public.",
    "fullContent": "All scheduled commercial banks in India remain closed on the second and fourth Saturdays of every month. However, digital banking services remain available for the general public.",
    "publishedAt": "2025-08-09T00:30:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.275Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "b0e2013"
  },
  {
    "id": "ndtv-profit-rss-9a25eef",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Trump Tariffs: Don't See Significant Impact On Business, Says Nadir Godrej",
    "url": "https://www.ndtvprofit.com/economy-finance/trump-tariffs-dont-see-significant-impact-on-business-says-nadir-godrej",
    "summary": "'I think we are determined not to yield too much and live with it if we have to,' says Godrej.",
    "fullContent": "'I think we are determined not to yield too much and live with it if we have to,' says Godrej.",
    "publishedAt": "2025-08-09T00:30:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.275Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "9a25eef"
  },
  {
    "id": "et-markets-160d4418",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "VC funds lock in specialists to vet cybersafety bets",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/vc-funds-lock-in-specialists-to-vet-cybersafety-bets/articleshow/123199557.cms",
    "summary": "With the rise of AI and data security concerns, venture capital funds are increasingly relying on cybersecurity specialists to evaluate potential investments. The complex and technical nature of the sector demands domain expertise beyond general technology knowledge.",
    "fullContent": "With the rise of AI and data security concerns, venture capital funds are increasingly relying on cybersecurity specialists to evaluate potential investments. The complex and technical nature of the sector demands domain expertise beyond general technology knowledge. Funds are either building dedicated teams or bringing in specialists to assess opportunities in this rapidly growing field.",
    "publishedAt": "2025-08-09T00:30:00.000Z",
    "fetchedAt": "2025-08-09T09:42:08.939Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "160d4418"
  },
  {
    "id": "nse-online-announcements-68f0255b",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Blue Coast Hotels Limited",
    "url": "https://nsearchives.nseindia.com/corporate/BLUECOAST_09082025002803_Newspaper_Publications_BM_Financials.pdf",
    "summary": "Blue Coast Hotels Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication.",
    "fullContent": "Blue Coast Hotels Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-09T00:28:27.000Z",
    "fetchedAt": "2025-08-09T02:35:23.644Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "68f0255b"
  },
  {
    "id": "nyt-business-4428a637",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Trump Is Removing Billy Long as the I.R.S. Head 2 Months After He Was Confirmed",
    "url": "https://www.nytimes.com/2025/08/08/us/politics/trump-billy-long-irs-commissioner.html",
    "summary": "Billy Long, a former Republican congressman, will no longer serve as the tax agency’s head. Treasury Secretary Scott Bessent will oversee the agency as acting commissioner.",
    "fullContent": "Billy Long, a former Republican congressman, will no longer serve as the tax agency’s head. Treasury Secretary Scott Bessent will oversee the agency as acting commissioner.",
    "publishedAt": "2025-08-09T00:27:22.000Z",
    "fetchedAt": "2025-08-09T02:26:36.613Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4428a637"
  },
  {
    "id": "nyt-economy-4428a637",
    "sourceId": "nyt-economy",
    "sourceName": "NYT Economy",
    "title": "Trump Is Removing Billy Long as the I.R.S. Head 2 Months After He Was Confirmed",
    "url": "https://www.nytimes.com/2025/08/08/us/politics/trump-billy-long-irs-commissioner.html",
    "summary": "Billy Long, a former Republican congressman, will no longer serve as the tax agency’s head. Treasury Secretary Scott Bessent will oversee the agency as acting commissioner.",
    "fullContent": "Billy Long, a former Republican congressman, will no longer serve as the tax agency’s head. Treasury Secretary Scott Bessent will oversee the agency as acting commissioner.",
    "publishedAt": "2025-08-09T00:27:22.000Z",
    "fetchedAt": "2025-08-09T02:26:36.608Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "4428a637"
  },
  {
    "id": "bloomberg-business-youtube-433ffb7",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "S&P Set For Best Week Since June As Gold Prices Spike | The Close 8/8/2025",
    "url": "https://www.youtube.com/watch?v=iz2Zz-gcxk0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T00:21:22.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "433ffb7"
  },
  {
    "id": "nse-online-announcements-7f9ece29",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "The Andhra Pradesh Mineral Development Corporation Limited",
    "url": "https://nsearchives.nseindia.com/corporate/APMDC_09082025001931_INTIMATION.pdf",
    "summary": "Disclosure under Regulation 57(4) |SUBJECT: Disclosure under Regulation 57(4)",
    "fullContent": "Disclosure under Regulation 57(4) |SUBJECT: Disclosure under Regulation 57(4)",
    "publishedAt": "2025-08-09T00:20:57.000Z",
    "fetchedAt": "2025-08-09T02:35:23.644Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "7f9ece29"
  },
  {
    "id": "techmeme-4f838f9e",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: Periodic Labs, which is building AI for material science, is raising $200M led by a16z, valuing the company at $1B before the investment (Kate Clark/Bloomberg)",
    "url": "http://www.techmeme.com/250808/p28#a250808p28",
    "summary": "Kate Clark / Bloomberg: Sources: Periodic Labs, which is building AI for material science, is raising $200M led by a16z, valuing the company at $1B before the investment — Venture firm Andreessen Horowitz has agreed to lead a $200 million investment in Periodic Labs, a new...",
    "fullContent": "Kate Clark / Bloomberg: Sources: Periodic Labs, which is building AI for material science, is raising $200M led by a16z, valuing the company at $1B before the investment — Venture firm Andreessen Horowitz has agreed to lead a $200 million investment in Periodic Labs, a new startup building artificial intelligence &hellip;",
    "publishedAt": "2025-08-09T00:15:02.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4f838f9e"
  },
  {
    "id": "bloomberg-business-youtube-3ced8077",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "President Trump Confirms Meeting With Putin | Balance of Power: Late Edition 8/08/2025",
    "url": "https://www.youtube.com/watch?v=tJiGIchnLhA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T00:06:04.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3ced8077"
  },
  {
    "id": "nse-online-announcements-33324721",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "AU Small Finance Bank Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SUMIT1_08082025235722_Submisson_AGM_Proceedings.pdf",
    "summary": "AU Small Finance Bank Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "AU Small Finance Bank Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-09T00:05:04.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "33324721"
  },
  {
    "id": "techmeme-4157231a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Capacity, which uses AI to automate contact center support, raised $92.6M, including a $42.6M Series D and $50M in debt, bringing its total raised to $155M+ (Kay Aloha Villamor/The SaaS News)",
    "url": "http://www.techmeme.com/250808/p27#a250808p27",
    "summary": "Kay Aloha Villamor / The SaaS News: Capacity, which uses AI to automate contact center support, raised $92.6M, including a $42.6M Series D and $50M in debt, bringing its total raised to $155M+ — Capacity, a St.",
    "fullContent": "Kay Aloha Villamor / The SaaS News: Capacity, which uses AI to automate contact center support, raised $92.6M, including a $42.6M Series D and $50M in debt, bringing its total raised to $155M+ — Capacity, a St. Louis, Missouri-based AI-powered support automation platform for contact centers, has raised over $92.6 million in funding &hellip;",
    "publishedAt": "2025-08-09T00:05:02.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4157231a"
  },
  {
    "id": "zerohedge-186d72e9",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Doug Casey Responds To The Toughest Questions Facing Libertarians & Anarcho-Capitalists",
    "url": "https://www.zerohedge.com/political/doug-casey-responds-toughest-questions-facing-libertarians-anarcho-capitalists",
    "summary": "Doug Casey Responds To The Toughest Questions Facing Libertarians & Anarcho-Capitalists Via InternationalMan.com, International Man: Today, we’ll explore some of the most common criticisms of libertarianism and anarcho-capitalism. Imagine two tribes.",
    "fullContent": "Doug Casey Responds To The Toughest Questions Facing Libertarians & Anarcho-Capitalists Via InternationalMan.com, International Man: Today, we’ll explore some of the most common criticisms of libertarianism and anarcho-capitalism. Imagine two tribes. One is cohesive and tightly knit. The other promotes hyper-individualism. Which is likely to win in a conflict? Doug Casey: There’s nothing wrong with forming cohesive groups. Humans have always been tribal because it’s conducive to survival. Many hands make light work. And specialization and division of labor—which is critical for progress—is only possible with a group. The problem is whether the group is voluntary or coercive in nature. And you’re right. In a war, the tribe structured like a military unit has some advantages over a loose group of rugged individualists. But its only advantage is in war, which is something to be avoided at almost any cost. Why, then, do humans usually default to collectivism instead of libertarianism? Unfortunately, the institution of the family, which is the foundation of society, inadvertently sets a bad example. That’s because the family—by its very nature—is authoritarian and socialistic. The parents call the shots and provide free food and shelter, while the kids get into the habit early of having things provided for them. They give according to their ability and receive according to their needs, a Marxist ideal. So perhaps the family, which is a good thing, paradoxically gets people off on the wrong foot. Worse, in the real world, the arguments for liberty and individualism are all intellectual. They’re logical, they make sense—but most people don’t reason. The average person doesn’t live in an intellectual world; he lives in an emotional world. He acts according to what he feels, not what he thinks. He does what feels right without thinking about the consequences—even the immediate and direct ones, let alone the indirect and delayed ones. Reason is often used to justify emotions. Those are two major reasons—and there are lots of others—why socialism has more appeal than capitalism, not to mention libertarianism and anarcho-capitalism. The socialistic habits we learn with the family are reinforced by emotions, feelings, and, oftentimes, irrational assumptions. Unlike libertarianism, socialism promises something for nothing, the prospect of automatic security, and a perpetual free lunch. Socialism sounds better to those who haven’t got critical thinking skills. That’s a real problem, and a cause for pessimism about the future of humanity. The problem is compounded by the nature of politics, which brings out the worst in people. When you’re trying to influence “the masses,” emotion works 100 times better than reason. Worse yet, the people who are drawn to politics want power and want to manipulate others. Politics naturally attracts criminal personalities. It’s almost genetically guaranteed that individualists, AnCaps, and libertarians have the odds stacked against them. International Man: How, then, do you respond to critics who argue that libertarianism and anarcho-capitalism are impractical, utopian fantasies? Doug Casey: Well, you can look at this from two points of view—the practical and the moral. In primitive times, it was possible for a central power to dictate how much food would cost, how much laborers would be paid, and what the rules were in every area of life. It was counterproductive, but it was possible because things were very simple, unlike today’s world, with billions of people and trillions of transactions taking place every day. However, central authorities and socialism are at odds with a technological society. Collectivism is unworkable on any scale larger than a family, as the Soviets and the Maoists proved. It turned out that, in the real world, communism was the utopian fantasy. More importantly, any system other than radical libertarianism is immoral. I won’t discuss property rights at length here, but suffice it to say that your primary possession is your own body. And why should anybody else have a right to tell you what you must or must not do with your own body? That includes how you use it, what you ingest, what you think, what you say, and how you use your other possessions. Every person is a sovereign being. Unfortunately, humans’ innate character flaws and ingrained psychological tendencies cause them to do self-destructive things like trying to replicate the family on a giant scale, by creating the institution of the State. International Man: How do you respond to those who argue that libertarianism and anarcho-capitalism are, at best, irrelevant? And at worst, tools used by powerful interests to atomize individuals, making them easier to control and dominate? Doug Casey: Politicians are disinclined to treat people as individuals. They try to control and dominate by forcing individuals to become parts of a collective. Some say libertarianism is irrelevant because so few people understand its principles. And even if they do understand them, they don’t put them into effect. But libertarianism cyclically expands and contracts. For instance, the reason that America was unique in world history is that it was the first country ever founded on the principles of libertarianism. And those principles are responsible for its immense success. But over America’s history, sometimes those principles grow, and sometimes they fade. Libertarianism is basically a belief in the non-aggression principle and the limiting of force. Anarcho-capitalism goes beyond libertarianism because it doesn’t believe in the existence of the State as an entity, as an institution. And 50 years ago, the term “anarcho-capitalism” didn’t even exist. Now it’s widely discussed. The president of Argentina is an anarcho-capitalist, and the country is being radically transformed. Speaking as an Ancap myself, I’d like to see not just 200, but eight billion sovereign nations in the world. The key is to develop institutions and accepted ways of thinking that emphasize cooperation, not coercion, in everything. International Man: Many libertarians and anarcho-capitalists argue that fully privatizing all property would effectively solve the migrant and border issue. Critics, however, say this vision is unrealistic and not a serious solution, claiming it ultimately serves as cover for open-border advocacy and worsens the situation in practice. How do you respond to that criticism? Doug Casey: Moving the U.S. toward pure libertarianism—anarcho-capitalism—is by far the best solution to the border issue. Much better than walls and border guards checking to see if “your papers are in order.” If 100% of the U.S. were privately owned, with no exceptions, it would be up to the owner of that property to decide whether any given person or group could use it or trespass on it. The real problem is the welfare systems of the U.S. In the 19th century, there was immense immigration to the U.S. But there was zero government support. Arrivals were immediately responsible for feeding, clothing, and housing themselves—or they would, frankly, starve. Immigrants knew that. As a result, the U.S. drew the best and most enterprising people. Today, however, migrants are quite aware of the immense welfare systems available at the local, State, and national levels, in addition to what’s provided by NGOs, which are basically maintained with tax dollars, directly or indirectly. There are networks that actively facilitate the travel and upkeep of the migrants. If welfare were abolished, we wouldn’t draw these kinds of people. The argument can be made that George Soros might use his billions to purposely import them to property that he owns. But there they would have to stay; it’s a straw man argument. Without a government to support them, migrants would be discouraged. Of course, they could steal for a living. But thieves could expect to be treated harshly, perhaps with extreme prejudice. Ultimately, you can’t keep people from coming or going. And why should you? Groups have migrated throughout world history. But the best way to maintain stability is with 100% private property, not a reliance on political gimmicks. Politicians can be corrupted and bribed. In fact, that’s why many get into politics. Ancaps rely on the market, not politicos, bureaucrats, and storm troopers, to maintain stability. International Man: Libertarianism and anarcho-capitalism emphasize individual liberty and voluntary exchange, but critics argue they offer little guidance on deeper ethical or moral responsibilities beyond the non-aggression principle. How do you see these philosophies addressing complicated questions of ethics and morality in real-world situations? Doug Casey: Ancaps don’t intend to address issues of ethics and morality. Those things are settled by religion and philosophy. Libertarianism and ancapism are mainly concerned with how society can best protect itself from the initiation of force and fraud. It doesn’t really matter what philosophy or religion individuals are partial to, as long as they don’t initiate violence against each other. Remember, there are just two rules: Do all that you say you’re going to do, and don’t impinge upon other people or their property. With only two laws, you don’t need a legislature. And ignorance of the law is truly no excuse. Beyond that, you can believe or do whatever you’d like. The fact of the matter is that birds of a feather naturally flock together. People form into groups based on whatever is important to them. For some, it’s their race. For some, it’s their religion. For some, it’s their way of thinking. None of that matters as long as they don’t aggress against other individuals or other groups. There’s much more to be said about these things. I urge you to read “The Market for Liberty.” It’s a very short book. But one that can totally change how you see the world. * * * Economic turmoil isn’t a question of if—but when. Most will panic. The prepared will not only survive but come out ahead. We’ve put together a free special report revealing practical steps to protect your assets, secure your lifestyle, and uncover opportunities that emerge when the system breaks down. Download your Guide to Surviving and Thriving During an Economic Collapse now—free of charge. Tyler Durden Fri, 08/08/2025 - 20:05",
    "publishedAt": "2025-08-09T00:05:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.986Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "186d72e9"
  },
  {
    "id": "ndtv-profit-youtube-56f0508e",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Israel Gaza News | Israel Announces Plan To Retake Gaza City In Another Escalation Of The War",
    "url": "https://www.youtube.com/watch?v=iSr-bhCVkpM",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T00:03:33.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "56f0508e"
  },
  {
    "id": "yahoo-finance-19e367c",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Spending for Executive Protection Is on the Rise",
    "url": "https://www.barrons.com/articles/spending-for-executive-protection-is-on-the-rise-359c4fa7?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T00:02:00.000Z",
    "fetchedAt": "2025-08-10T09:42:18.261Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19e367c"
  },
  {
    "id": "nse-online-announcements-1a9e1ef1",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Reliance Infrastructure Limited",
    "url": "https://nsearchives.nseindia.com/corporate/RELINFRA_09082025000023_Rinfravotingresults08082025.pdf",
    "summary": "Reliance Infrastructure Limited has informed the Exchange regarding voting results of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "Reliance Infrastructure Limited has informed the Exchange regarding voting results of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-09T00:00:50.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "1a9e1ef1"
  },
  {
    "id": "bloomberg-politics-274d6278",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Indigenous Group Wins Land Claim Over Slice of Metro Vancouver",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/indigenous-group-wins-land-claim-over-slice-of-metro-vancouver",
    "summary": "An Indigenous group won claim to hundreds of acres of metropolitan Vancouver after a years-long trial and landmark judgment at British Columbia’s supreme court.",
    "fullContent": "An Indigenous group won claim to hundreds of acres of metropolitan Vancouver after a years-long trial and landmark judgment at British Columbia’s supreme court.",
    "publishedAt": "2025-08-09T00:00:46.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "274d6278"
  },
  {
    "id": "nse-online-announcements-5d4d341b",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Reliance Power Limited",
    "url": "https://nsearchives.nseindia.com/corporate/RPOWER_08082025235942_Rpower_Letter_to_SE_Voting_Results_AGM_2025.pdf",
    "summary": "Reliance Power Limited has submitted the Exchange a copy Srutinizers report of Annual General Meeting held on August 08, 2025. Further, the company has informed the Exchange regarding voting results. |SUBJECT: Shareholders meeting.",
    "fullContent": "Reliance Power Limited has submitted the Exchange a copy Srutinizers report of Annual General Meeting held on August 08, 2025. Further, the company has informed the Exchange regarding voting results. |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-09T00:00:38.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "5d4d341b"
  },
  {
    "id": "nse-online-announcements-69c4ed6c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Shera Energy Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SHERA_08082025235952_Recording.pdf",
    "summary": "Shera Energy Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Shera Energy Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-09T00:00:24.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "69c4ed6c"
  },
  {
    "id": "scmp-business-7a66e78e",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong needs ‘targeted law’ to tackle AI deepfake porn: Bar Association chief",
    "url": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3321257/hong-kong-needs-targeted-law-tackle-ai-deepfake-porn-bar-association-chief?utm_source=rss_feed",
    "summary": "Hong Kong should enact a “targeted law” to tackle the problem of AI-generated deepfake pornography instead of relying on legal tools designed to catch other mischief, the head of the city’s professional body for barristers has said.",
    "fullContent": "Hong Kong should enact a “targeted law” to tackle the problem of AI-generated deepfake pornography instead of relying on legal tools designed to catch other mischief, the head of the city’s professional body for barristers has said. In an interview with the Post on Thursday, Senior Counsel Jose-Antonio Maurellet, chairman of the Hong Kong Bar Association, also expressed confidence that such legislative efforts could be done “very quickly” if the government had the will to tackle the issue. The...",
    "publishedAt": "2025-08-09T00:00:08.000Z",
    "fetchedAt": "2025-08-09T02:26:38.886Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a66e78e"
  },
  {
    "id": "nse-online-announcements-4a4eb187",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Godrej Seeds & Genetics Limited",
    "url": "https://nsearchives.nseindia.com/corporate/GODREJSEEDS_08082025235956_NSEBMOUTCOME08082025RESULTSFINAL.pdf",
    "summary": "Financial Results Updates |SUBJECT: Financial Results Updates.",
    "fullContent": "Financial Results Updates |SUBJECT: Financial Results Updates",
    "publishedAt": "2025-08-09T00:00:07.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "4a4eb187"
  },
  {
    "id": "fortune-f6af774",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump crypto firm plans launch of public company that will hold family token",
    "url": "https://fortune.com/crypto/2025/08/08/donald-trump-world-liberty-financial-digital-asset-treasury-public-company/",
    "summary": "World Liberty Financial’s latest project would mimic other public firms that have amassed Bitcoin in hopes of boosting their share price.",
    "fullContent": "World Liberty Financial’s latest project would mimic other public firms that have amassed Bitcoin in hopes of boosting their share price.",
    "publishedAt": "2025-08-08T23:57:26.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "f6af774"
  },
  {
    "id": "business-insider-7cfa7f95",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Trump is burning through IRS heads at a rate of almost 1 a month. Here's who's held the job, and why they left.",
    "url": "https://www.businessinsider.com/trump-irs-commissioner-turnover-who-why-they-left-2025-8",
    "summary": "President Donald Trump's pick for IRS commissioner is moving on. Here's who else has had the job this year and why they left.",
    "fullContent": "President Donald Trump's pick for IRS commissioner is moving on. Here's who else has had the job this year and why they left.",
    "publishedAt": "2025-08-08T23:56:17.000Z",
    "fetchedAt": "2025-08-09T02:26:36.309Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7cfa7f95"
  },
  {
    "id": "bbc-business-3b34ba5a",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Beloved by bands and bank robbers, the Ford Transit turns 60",
    "url": "https://www.bbc.com/news/articles/c0j97xegz5no?at_medium=RSS&amp;at_campaign=rss",
    "summary": "The world's best-selling van has been in production since 1965.",
    "fullContent": "The world's best-selling van has been in production since 1965.",
    "publishedAt": "2025-08-08T23:50:21.000Z",
    "fetchedAt": "2025-08-09T09:42:11.378Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b34ba5a"
  },
  {
    "id": "bloomberg-markets-782342cf",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Colombian Inflation Unexpectedly Speeds Up In Setback for Petro",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombian-inflation-unexpectedly-speeds-up-in-setback-for-petro",
    "summary": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "fullContent": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "publishedAt": "2025-08-08T23:49:46.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "782342cf"
  },
  {
    "id": "bloomberg-economics-782342cf",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Colombian Inflation Unexpectedly Speeds Up In Setback for Petro",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombian-inflation-unexpectedly-speeds-up-in-setback-for-petro",
    "summary": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "fullContent": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "publishedAt": "2025-08-08T23:49:46.000Z",
    "fetchedAt": "2025-08-09T09:42:09.206Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "782342cf"
  },
  {
    "id": "bloomberg-politics-782342cf",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Colombian Inflation Unexpectedly Speeds Up In Setback for Petro",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombian-inflation-unexpectedly-speeds-up-in-setback-for-petro",
    "summary": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "fullContent": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "publishedAt": "2025-08-08T23:49:46.000Z",
    "fetchedAt": "2025-08-09T09:42:09.212Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "782342cf"
  },
  {
    "id": "bbc-business-609467f4",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Is super skinny back? UK sees rise in ad complaints over thin models",
    "url": "https://www.bbc.com/news/articles/c4gm9rygdymo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Zara, M&S and Next had ads banned over models that look \"unhealthily thin\" - is size zero making a comeback.",
    "fullContent": "Zara, M&S and Next had ads banned over models that look \"unhealthily thin\" - is size zero making a comeback",
    "publishedAt": "2025-08-08T23:47:17.000Z",
    "fetchedAt": "2025-08-09T09:42:11.378Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "609467f4"
  },
  {
    "id": "yahoo-finance-5f74195d",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Ad Tech Company Trade Desk Downgraded as Amazon, AI Reshape Digital Market",
    "url": "https://www.wsj.com/articles/ad-tech-company-trade-desk-downgraded-as-amazon-ai-reshape-digital-market-e65b020b?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:43:00.000Z",
    "fetchedAt": "2025-08-10T09:42:18.262Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5f74195d"
  },
  {
    "id": "bloomberg-business-youtube-2c1b2873",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Entry-Level Jobs at Risk, Tariffs & Textile Companies, Powering Data Centers | Wall Street Week",
    "url": "https://www.youtube.com/watch?v=Ak6ahYlz_Qo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:40:58.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2c1b2873"
  },
  {
    "id": "zerohedge-5911ebcf",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Global Food Prices Marching Higher Serves As Warning For 'Fragile States'",
    "url": "https://www.zerohedge.com/food/chart-global-food-prices-marching-higher-serves-warning",
    "summary": "Global Food Prices Marching Higher Serves As Warning For 'Fragile States' The Food and Agriculture Organization of the United Nations' Food Price Index, a global benchmark for food commodity prices, registered its highest level since early 2023 in July.",
    "fullContent": "Global Food Prices Marching Higher Serves As Warning For 'Fragile States' The Food and Agriculture Organization of the United Nations' Food Price Index, a global benchmark for food commodity prices, registered its highest level since early 2023 in July. This marks a notable inflection point after a multi-year downward trend that followed the Covid and Russia-Ukraine war price spikes. The FAO Food Price Index averaged 130.1 in July, up 1.6% from June, driven primarily by sharp increases in meat and vegetable oil prices. \"The index tracks monthly changes in the international prices of a set of globally traded food commodities. In July, price increases in the meat and vegetable oil indices more than offset declines in the cereal, dairy and sugar indices,\" FAO wrote in its monthly report. The FAO Food Price Index has undergone a significant reversal since bottoming out in early 2024, following a downturn after the price spikes during Covid and Russia's invasion of Ukraine. It is now at its highest level since February 2023, up 43% from its early Covid-era lows, and will likely remain elevated into next year. Here's a summary of the report: Headline Index: Averaged 130.1 (+1.6% MoM), driven by meat and vegetable oils. Still 18.8% below the March 2022 peak but 7.6% above July 2024. Cereals (106.5, -0.8% MoM): Wheat & sorghum prices fell on new harvests; maize & barley rose. Rice (-1.8%) declined on ample supply and weak demand. Vegetable Oils (166.8, +7.1% MoM): 3-year high. Palm oil up on strong demand; soy oil supported by biofuel sector; sunflower oil higher on Black Sea supply tightness; rapeseed oil down on new EU crop. Meat (127.3, +1.2% MoM): Record high. Bovine & ovine prices surged on China/U.S. demand; poultry edged higher as Brazil regained AI-free status; pig meat fell on oversupply & weak EU demand. Dairy (155.3, -0.1% MoM): First drop since April 2024. Butter & milk powders down on abundant supply; cheese prices up on strong Asia/Near East demand & tighter EU exports. Sugar (103.3, -0.2% MoM): Fifth monthly decline on expectations of 2025/26 production rebound (Brazil, India, Thailand), partly offset by recovering import demand. Last month's uptick signals increasing price momentum in global food markets. While the index remains well below its 160 peak in 2022, sustained upward pressure in global food prices could reignite inflationary pressures. Implications: Fragile States: A renewed price surge could spark food insecurity and social unrest in low-income, import-dependent nations. In the U.S., the Trump administration needs to place a larger emphasis on strengthening local food supply chains to mitigate external supply shocks. That means know your local rancher and farmer, as well as make plans for a backyard garden and chicken coop. Readers have been well-informed about this inflection point... Related: Global Food Prices Climb Toward Arab Spring-Era Highs Amid Trade War Turmoil Global Food Prices Are Creeping Up Again . . . Tyler Durden Fri, 08/08/2025 - 19:40",
    "publishedAt": "2025-08-08T23:40:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.986Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5911ebcf"
  },
  {
    "id": "bloomberg-markets-49b35b05",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump-Linked World Liberty Pitches a $1.5 Billion Crypto Vehicle",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-linked-world-liberty-pitches-a-1-5-billion-crypto-vehicle",
    "summary": "Big investors are being sounded out on a plan for World Liberty Financial, the Trump family-backed venture, to set up a public company that would hold its WLFI tokens, joining the boom in digital-asset treasury firms.",
    "fullContent": "Big investors are being sounded out on a plan for World Liberty Financial, the Trump family-backed venture, to set up a public company that would hold its WLFI tokens, joining the boom in digital-asset treasury firms.",
    "publishedAt": "2025-08-08T23:38:46.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49b35b05"
  },
  {
    "id": "ndtv-profit-youtube-26c1ee12",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Rules Out India Trade Talks: Who Faces The Brunt? | Trump Exposes Americans To Tariff Hurt",
    "url": "https://www.youtube.com/watch?v=Mp1v7-9Lx_Q",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:36:05.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "26c1ee12"
  },
  {
    "id": "ndtv-profit-rss-e68646e",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Happy Raksha Bandhan 2025: Wishes, Quotes, Messages, Images To Share With Your Brother Or Sister",
    "url": "https://www.ndtvprofit.com/trending/happy-raksha-bandhan-2025-wishes-quotes-messages-images-to-share-with-your-brother-or-sister",
    "summary": "Raksha Bandhan 2025: Here's a collection of heartfelt wishes, touching greetings, vibrant images and Facebook and WhatsApp statuses to make this day even more special.",
    "fullContent": "Raksha Bandhan 2025: Here's a collection of heartfelt wishes, touching greetings, vibrant images and Facebook and WhatsApp statuses to make this day even more special.",
    "publishedAt": "2025-08-08T23:30:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.275Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "e68646e"
  },
  {
    "id": "the-verge-52f0bc52",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Why Donald Trump’s environmental data purge is so much worse this time",
    "url": "https://www.theverge.com/science/757084/data-purge-climate-change-environmental-justice-trump",
    "summary": "Now that we're about halfway into the first year of President Donald Trump's second term, we can take stock of his administration's destruction of online environmental resources. It's worse than last time.",
    "fullContent": "Now that we're about halfway into the first year of President Donald Trump's second term, we can take stock of his administration's destruction of online environmental resources. It's worse than last time. It's also, seemingly, just the beginning - paving the way forward for the president's polluting agenda. A watchdog group that monitors publicly-available environmental [&#8230;]",
    "publishedAt": "2025-08-08T23:25:48.000Z",
    "fetchedAt": "2025-08-10T02:52:49.550Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "52f0bc52"
  },
  {
    "id": "yahoo-finance-91b1ba9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Inflation Is Rising, Growth Is Slowing, Stocks Are Bubbly. What Could Go Wrong?",
    "url": "https://www.barrons.com/articles/more-inflation-less-growth-and-bubbly-stocks-trouble-ahead-a17b5f8e?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:24:00.000Z",
    "fetchedAt": "2025-08-10T09:42:18.262Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "91b1ba9"
  },
  {
    "id": "bloomberg-markets-28be2055",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "S&P Set For Best Week Since June As Gold Prices Spike | The Close 8/8/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/the-close-8-8-2025-video",
    "summary": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Moneta’s Aoifinn Devitt, The City University of New York’s Paul Krugman, Interactive Brokers’ Steve...",
    "fullContent": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Moneta’s Aoifinn Devitt, The City University of New York’s Paul Krugman, Interactive Brokers’ Steve Sosnick, TD Securities’ Bart Melek , AGF Investment,'s Gregory Valliere, Flyjets’ Jessica Fisher, Comscore’s Paul Dergarabedian. (Source: Bloomberg)",
    "publishedAt": "2025-08-08T23:22:48.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "28be2055"
  },
  {
    "id": "wired-7149fbf9",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Ex-NSA Chief Paul Nakasone Has a Warning for the Tech World",
    "url": "https://www.wired.com/story/ex-nsa-chief-paul-nakasone-has-a-warning-for-the-tech-world/",
    "summary": "At the Defcon security conference in Las Vegas on Friday, Nakasone tried to thread the needle in a politically fraught moment while hinting at major changes for the tech community around the corner.",
    "fullContent": "At the Defcon security conference in Las Vegas on Friday, Nakasone tried to thread the needle in a politically fraught moment while hinting at major changes for the tech community around the corner.",
    "publishedAt": "2025-08-08T23:21:40.000Z",
    "fetchedAt": "2025-08-09T02:26:38.145Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7149fbf9"
  },
  {
    "id": "ndtv-profit-youtube-22cf8f35",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Pak Army Chief Munir To Visit US for2nd Time | Trump Backs Asim Munir's Presidential Ambitions?",
    "url": "https://www.youtube.com/watch?v=b7KL6iysF3E",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:19:33.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "22cf8f35"
  },
  {
    "id": "zerohedge-1cc2063c",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "5 Things To Know About Trump's Order Banning Political Debanking",
    "url": "https://www.zerohedge.com/personal-finance/5-things-know-about-trumps-order-banning-political-debanking",
    "summary": "5 Things To Know About Trump's Order Banning Political Debanking Authored by Kevin Stocklin via The Epoch Times, President Donald Trump’s executive order banning politicized debanking is intended to reverse what some analysts say is a trend of banks and payment services...",
    "fullContent": "5 Things To Know About Trump's Order Banning Political Debanking Authored by Kevin Stocklin via The Epoch Times, President Donald Trump’s executive order banning politicized debanking is intended to reverse what some analysts say is a trend of banks and payment services refusing service to people and companies for political, religious, or ideological reasons. Advocates against political debanking cite cases of Christians and conservatives who they say have been victims of this process. This includes allegations by Christian organizations including Tennessee-based nonprofit Indigenous Advance Ministries, as well as Sam Brownback, the chairman of the National Committee for Religious Freedom (NCRF), and the president himself. Speaking to bank executives at the World Economic Forum in January, Trump said, “I hope you start opening your bank to conservatives, because many conservatives complain that the banks are not allowing them to do business within the bank, and that included a place called Bank of America.” Many conservative groups expressed support for this executive order. “Everyone needs access to basic financial services,” Brian Knight, senior counsel at the Alliance Defending Freedom, a leading advocate against ideological debanking, told The Epoch Times. “No American should have to worry that they could lose their bank account or have a payment declined because of their religious or political beliefs.” Banks have denied that they have taken part in political debanking. “We don’t close accounts for political reasons, and we agree with President Trump that regulatory change is desperately needed,” Patricia Wexler, a spokesperson for JPMorgan Chase, told The Epoch Times in a statement. “We commend the White House for addressing this issue and look forward to working with them to get this right.” A Bank of America spokesperson told The Epoch Times in January: “We serve more than 70 million clients and we welcome conservatives. We are required to follow extensive government rules and regulations that sometimes result in decisions to exit client relationships. We never close accounts for political reasons and don’t have a political litmus test.” The Southern Poverty Law Center, a left-wing advocacy group, criticized efforts by groups including Alliance Defending Freedom, calling them “an ongoing crusade to force private businesses to adhere to conservative Christian theology, in part by spreading the false narrative that private sector banks have been dropping conservative religious clients since the Obama administration.” Trump’s executive order seeks to reorient federal regulators and law enforcement away from practices that may have supported political debanking and toward actions that will actively oppose it. Here are five key takeaways from the order. 1. Regulators Drop ‘Reputational Risk’ The order directs federal regulators to stop using criteria such as “reputational risk,” which some banks say have been used to pressure them to cancel customers whose political or religious views government officials don’t like. Some concerned shareholders say that banks that consider political views in deciding who they will serve also creates risks. One case in point, says Jerry Bowyer, CEO of Bowyer Research and an advocate for shareholders and customers against political debanking, is Trump’s allegation that several banks closed his accounts following the Jan. 6, 2021, riots at the Capitol. “Just think about that—you debanked someone who might be the President of the United States,” Bowyer told The Epoch Times. “That doesn’t sound like risk management to me; that sounds like courting risk.” “Turns out that it was,” he said. Bank regulators have already taken steps to remove “reputational risk” from their criteria. In June, the Federal Reserve announced that reputational risk will no longer be a component of its bank supervision process, and said it was working with other regulatory agencies to assist them in also dropping this criterion. 2. Investigations of Unlawful Debanking to Commence The executive order requires federal banking regulators to investigate complaints of political debanking and pass any cases on to the U.S. attorney general’s office. Penalties for violations could include fines and consent decrees, as well as reinstating any customers who were unlawfully cancelled. This could include not only persons who have been refused service for ideological reasons but also companies. Operation Choke Point, which was enacted under the Obama administration, was a case in which regulators allegedly pressured banks to refuse service to industries like gun retailers and payday lenders, treating them as high-risk entities. A more recent version of this was Citibank’s policy, which started in 2018 but ended in June of this year, to refuse banking services to gun stores that sold to customers under the age of 21, which effectively prohibited business with much of the industry. 3. Financial Privacy Also a Focus Trump’s executive order also urges a federal investigation into alleged warrantless data mining of customers’ accounts by Bank of America (BOA) to hand over information to law enforcement regarding customers who traveled to Washington D.C., shopped at sporting goods stores that sold guns like Bass Pro Shops or Cabela’s, or expressed conservative political views during the 2021 Capitol breach. In May 2023, U.S. House Judiciary Chair Jim Jordan (R-Ohio) issued a letter to BOA CEO Brian Moynihan that stated an FBI whistleblower charged that the bank “provided the FBI—voluntarily and without any legal process—with a list of individuals who had made transactions in the Washington, D.C., metropolitan area with a BoA credit or debit card between January 5 and January 7, 2021,” and highlighted customers who bought firearms with a BOA credit card. 4. SBA to Reinstate Religious Organizations Trump’s executive order also instructs the U.S. Small Business Administration (SBA) to reinstate clients who have been denied loans or other services for political reasons. Previously, the SBA had prohibited any group that was “principally engaged in teaching, instructing, counseling, or indoctrinating religion” from applying for Economic Injury Disaster Loans. The SBA ended this policy in July, in compliance with a 2016 Supreme Court decision in the case Trinity Lutheran Church v. Comer, which stated that excluding religious organizations from government programs was a violation of the First Amendment. 5. State ‘Fair Access’ Laws Several states have recently passed “fair access” banking laws that prohibit denying financial services by banks, insurance companies, and other financial institutions on political or religious grounds. Florida enacted such a law in 2023, and Tennessee did so in 2024. Similar laws have been introduced in state legislatures in Arizona, Georgia, Idaho, Indiana, Iowa, Kentucky, Louisiana, and South Dakota, according to a legal analysis by law firm Latham & Watkins. The firm stated that critics of laws against political debanking “see such initiatives as an attack on environmental, social, and corporate-governance (ESG) policies in the financial system.” Tyler Durden Fri, 08/08/2025 - 19:15",
    "publishedAt": "2025-08-08T23:15:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1cc2063c"
  },
  {
    "id": "bloomberg-politics-30758168",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Administration Threatens to Seize Valuable Harvard Patents",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-administration-threatens-to-seize-valuable-harvard-patents",
    "summary": "The Trump administration threatened to assume ownership of hundreds of millions of dollars worth of patents from Harvard University, accusing the Ivy League college of failing to comply with the law on federal research grants.",
    "fullContent": "The Trump administration threatened to assume ownership of hundreds of millions of dollars worth of patents from Harvard University, accusing the Ivy League college of failing to comply with the law on federal research grants.",
    "publishedAt": "2025-08-08T23:06:51.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "30758168"
  },
  {
    "id": "techmeme-6cd19593",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Tech trade groups CTA and CCIA back Anthropic's appeal of a court ruling allowing a copyright class action, fearing big settlements could chill AI investment (Ashley Belanger/Ars Technica)",
    "url": "http://www.techmeme.com/250808/p26#a250808p26",
    "summary": "Ashley Belanger / Ars Technica: Tech trade groups CTA and CCIA back Anthropic's appeal of a court ruling allowing a copyright class action, fearing big settlements could chill AI investment — AI industry groups are urging an appeals court to block what they say is the largest...",
    "fullContent": "Ashley Belanger / Ars Technica: Tech trade groups CTA and CCIA back Anthropic's appeal of a court ruling allowing a copyright class action, fearing big settlements could chill AI investment — AI industry groups are urging an appeals court to block what they say is the largest copyright class action ever certified.",
    "publishedAt": "2025-08-08T23:05:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6cd19593"
  },
  {
    "id": "fortune-3da141b",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Match Group&#8217;s rape problem: A lawsuit alleges that inaction by Tinder and Hinge&#8217;s owner allowed abusers to stay on the apps",
    "url": "https://fortune.com/2025/08/08/match-group-tinder-hinge-lawsuit-rape-assault-sentinel/",
    "summary": "A shareholder alleges the company \"has known… which users have been reported for drugging, assaulting, or raping their dates since at least 2016\" but did not release a promised report.",
    "fullContent": "A shareholder alleges the company \"has known… which users have been reported for drugging, assaulting, or raping their dates since at least 2016\" but did not release a promised report.",
    "publishedAt": "2025-08-08T23:04:29.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3da141b"
  },
  {
    "id": "ndtv-profit-youtube-5c0ce1c1",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Israel Gaza News | UN Calls For Immediate Halt Of Israeli Plan To Retake Gaza City",
    "url": "https://www.youtube.com/watch?v=LTx6gePNKp0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:03:28.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5c0ce1c1"
  },
  {
    "id": "bloomberg-politics-5a782d2c",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "UK Arrests Hundreds of People in Clampdown on Illegal Delivery Rider Work",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/uk-arrests-hundreds-in-clampdown-on-illegal-delivery-rider-work",
    "summary": "The UK arrested hundreds of people in a clampdown on migrants working illegally as drivers for delivery firms, as part of Prime Minister Keir Starmer’s push to stem the flow of irregular immigration.",
    "fullContent": "The UK arrested hundreds of people in a clampdown on migrants working illegally as drivers for delivery firms, as part of Prime Minister Keir Starmer’s push to stem the flow of irregular immigration.",
    "publishedAt": "2025-08-08T23:01:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5a782d2c"
  },
  {
    "id": "fortune-998a663",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Adidas stole sandal design from traditional Mexican artisans, Sheinbaum says",
    "url": "https://fortune.com/2025/08/08/adidas-stole-sandal-design-mexico-huaraches/",
    "summary": "Mexican President Claudia Sheinbaum said Adidas was already in talks with authorities in Oaxaca to provide “compensation for the people who were plagiarized.\"",
    "fullContent": "Mexican President Claudia Sheinbaum said Adidas was already in talks with authorities in Oaxaca to provide “compensation for the people who were plagiarized.\"",
    "publishedAt": "2025-08-08T23:00:28.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "998a663"
  },
  {
    "id": "scmp-business-eb41afe",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "New Hong Kong Hospital Authority chief vows to foster staff ‘speak-up’ culture",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3321281/new-hong-kong-hospital-authority-chief-vows-foster-staff-speak-culture?utm_source=rss_feed",
    "summary": "The new chief of Hong Kong’s public hospitals has vowed to foster a “speak-up” culture among staff as part of efforts to boost patient safety, while expressing hope that one day no one in the organisation will need to be a whistle-blower.",
    "fullContent": "The new chief of Hong Kong’s public hospitals has vowed to foster a “speak-up” culture among staff as part of efforts to boost patient safety, while expressing hope that one day no one in the organisation will need to be a whistle-blower. Dr Libby Lee Ha-yun, who took office as the Hospital Authority’s chief executive at the start of the month, said on Friday that she hoped services would be offered more from the patients’ perspective while further considering their opinions. She said fostering...",
    "publishedAt": "2025-08-08T23:00:07.000Z",
    "fetchedAt": "2025-08-09T02:26:38.886Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "eb41afe"
  },
  {
    "id": "wsj-markets-main-4613320a",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "A $15 Billion Herm&#xe8;s Mystery. A Sudden Death. And, Finally, Some Answers.",
    "url": "https://www.wsj.com/business/eric-freymond-nicolas-puech-hermes-lvmh-8577023f?mod=rss_markets_main",
    "summary": "The apparent suicide of a financial adviser to an Herm&#xe8;s heir marks a dramatic turn in one of the most baffling and epic financial sagas of the century.",
    "fullContent": "The apparent suicide of a financial adviser to an Herm&#xe8;s heir marks a dramatic turn in one of the most baffling and epic financial sagas of the century.",
    "publishedAt": "2025-08-08T23:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4613320a"
  },
  {
    "id": "oil-price-42a2db24",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Iran’s Crude Builds as Tankers Drift in Limbo",
    "url": "https://oilprice.com/Energy/Crude-Oil/Irans-Crude-Builds-as-Tankers-Drift-in-Limbo.html",
    "summary": "President Trump’s return to the Oval Office saw US authorities sanction Iranian traders, middlemen and infrastructure with fervent intensity, triggering a string of new legislative measures targeting Tehran’s oil revenues.",
    "fullContent": "President Trump’s return to the Oval Office saw US authorities sanction Iranian traders, middlemen and infrastructure with fervent intensity, triggering a string of new legislative measures targeting Tehran’s oil revenues. The clampdown intensified amidst the Israel-Iran crisis, with the White House extending its sanctioning spree first on Chinese refiners (mostly smaller ‘teapots’ in Shandong province) and then also on China’s port operators and midstream companies allegedly dealing with Iranian oil. With more than…",
    "publishedAt": "2025-08-08T23:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.178Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "42a2db24"
  },
  {
    "id": "bloomberg-politics-1abef6b2",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Greystar Reaches Deal in US Justice Department’s Rental Market Collusion Case",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/greystar-reaches-deal-in-doj-s-rental-market-collusion-case",
    "summary": "Greystar Real Estate Partners LLC reached a tentative settlement with the Department of Justice in an antitrust lawsuit accusing the landlord of colluding to increase rents across the US, in part, through widely used industry software.",
    "fullContent": "Greystar Real Estate Partners LLC reached a tentative settlement with the Department of Justice in an antitrust lawsuit accusing the landlord of colluding to increase rents across the US, in part, through widely used industry software.",
    "publishedAt": "2025-08-08T22:57:06.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1abef6b2"
  },
  {
    "id": "fortune-39571f8b",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump administration seeks $1 billion settlement from UCLA",
    "url": "https://fortune.com/2025/08/08/trump-administration-seeks-1-billion-settlement-from-ucla/",
    "summary": "UCLA is the first public university to be targeted by a widespread funding freeze over allegations of civil rights violations related to antisemitism and affirmative action.",
    "fullContent": "UCLA is the first public university to be targeted by a widespread funding freeze over allegations of civil rights violations related to antisemitism and affirmative action.",
    "publishedAt": "2025-08-08T22:55:07.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39571f8b"
  },
  {
    "id": "bloomberg-politics-16c5efbd",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Colombia’s Biggest Cocaine Cartel to Talk Peace With Government",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombia-s-biggest-cocaine-cartel-to-talk-peace-with-government",
    "summary": "Colombia’s biggest cocaine cartel will sit down with government negotiators as President Gustavo Petro seeks peace deals with the nation’s illegal armed groups before he leaves office next year.",
    "fullContent": "Colombia’s biggest cocaine cartel will sit down with government negotiators as President Gustavo Petro seeks peace deals with the nation’s illegal armed groups before he leaves office next year.",
    "publishedAt": "2025-08-08T22:52:13.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "16c5efbd"
  },
  {
    "id": "fortune-5800e016",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump to replace Biden Fed appointee with Stephen Miran, chair of the White House’s Council of Economic Advisers",
    "url": "https://fortune.com/2025/08/08/trump-names-stephen-miran-federal-reserve/",
    "summary": "Adriana Kugler stepped down Friday. Miran, if approved by the Senate, will serve until January 31, 2026.",
    "fullContent": "Adriana Kugler stepped down Friday. Miran, if approved by the Senate, will serve until January 31, 2026.",
    "publishedAt": "2025-08-08T22:51:34.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5800e016"
  },
  {
    "id": "wsj-markets-main-34cfc5b2",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Opinion | Trump Is Right on &#x2018;Debanking&#x2019;",
    "url": "https://www.wsj.com/opinion/donald-trump-debanking-executive-order-bank-examiners-biden-obama-operation-choke-point-8396e49d?mod=rss_markets_main",
    "summary": "Regulators have abused their power to cut off political opponents.",
    "fullContent": "Regulators have abused their power to cut off political opponents.",
    "publishedAt": "2025-08-08T22:50:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.147Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "34cfc5b2"
  },
  {
    "id": "wsj-opinion-5c36aaa4",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Trump Is Right on &#x2018;Debanking&#x2019;",
    "url": "https://www.wsj.com/opinion/donald-trump-debanking-executive-order-bank-examiners-biden-obama-operation-choke-point-8396e49d",
    "summary": "Regulators have abused their power to cut off political opponents.",
    "fullContent": "Regulators have abused their power to cut off political opponents.",
    "publishedAt": "2025-08-08T22:50:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.850Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "5c36aaa4"
  },
  {
    "id": "zerohedge-3a7129b7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "How Much Power Do Data Centers Use?",
    "url": "https://www.zerohedge.com/technology/how-much-power-do-data-centers-use",
    "summary": "How Much Power Do Data Centers Use? Data center demand is rising at a break neck speed, with little signs of slowing. As the electricity consumption of AI rises, by 2028, a projected 12% of U.S. electricity demand could be driven from data centers.",
    "fullContent": "How Much Power Do Data Centers Use? Data center demand is rising at a break neck speed, with little signs of slowing. As the electricity consumption of AI rises, by 2028, a projected 12% of U.S. electricity demand could be driven from data centers. Beyond America, countries are pouring billions into AI sovereignty efforts which require data center facilities running 24/7 to power them. This graphic, via Visual Capitalist's Dorothy Neufeld, shows data center demand as a share of total power consumption, based on data from the IEA. The Boom in Data Center Demand Here is the share of each region’s total power demand that is driven by center centers: As we can see, America’s data center demand leads globally, at 8.9% of total power consumption. In Virginia, data centers account for 26% of the state’s total power consumption—or nearly triple the national average. This year, the state’s leading utility firm expects to connect 15 new data centers given surging demand. As big tech ramps up AI spending, a significant share is being funnelled into massive data centers along with the energy sources that power them. In particular, demand for nuclear is expanding at the fastest rate in decades. By comparison, data centers comprise 4.8% of the total power share in the European Union and 2.3% in China. To learn more about this topic from a global perspective, check out this graphic on the growth of data center capacity worldwide since 2005. Tyler Durden Fri, 08/08/2025 - 18:50",
    "publishedAt": "2025-08-08T22:50:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3a7129b7"
  },
  {
    "id": "bloomberg-markets-86a741",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Summer Box Office Ends On ‘Edgy’ August: Dergarabedian",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/summer-box-office-ends-on-edgy-august-dergarabedian-video",
    "summary": "Paul Dergarabedian, Comscore senior media analyst, says this August is a strong finale to a summer of good movies. He speaks with Scarlet Fu and Katie Greifeld on “The Close,” emphasizing that comedy on the big screen is making a comeback and there’s something for everyone.",
    "fullContent": "Paul Dergarabedian, Comscore senior media analyst, says this August is a strong finale to a summer of good movies. He speaks with Scarlet Fu and Katie Greifeld on “The Close,” emphasizing that comedy on the big screen is making a comeback and there’s something for everyone. (Source: Bloomberg)",
    "publishedAt": "2025-08-08T22:48:45.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "86a741"
  },
  {
    "id": "nyt-business-45a9081c",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Trump Seeks to Sell Fannie Mae and Freddie Mac Shares to Public Investors",
    "url": "https://www.nytimes.com/2025/08/08/business/trump-fannie-mae-freddie-mac-mortgages.html",
    "summary": "More than a decade after the government bailed out the mortgage giants, the Trump administration is looking for a partial stock-market exit.",
    "fullContent": "More than a decade after the government bailed out the mortgage giants, the Trump administration is looking for a partial stock-market exit.",
    "publishedAt": "2025-08-08T22:48:04.000Z",
    "fetchedAt": "2025-08-09T02:26:36.613Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45a9081c"
  },
  {
    "id": "bloomberg-markets-76f0b87a",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "FlyJets CEO On Rising Private Jet Rentals",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/flyjets-ceo-on-rising-private-jet-rentals-video",
    "summary": "Jessica Fisher, FlyJets CEO and Founder, describes FlyJets as an Airbnb for private jet bookings, where an operator or owner can list their plane and someone can book it. The company updates aircraft listings every five minutes and allows automatic booking.",
    "fullContent": "Jessica Fisher, FlyJets CEO and Founder, describes FlyJets as an Airbnb for private jet bookings, where an operator or owner can list their plane and someone can book it. The company updates aircraft listings every five minutes and allows automatic booking. She speaks with Scarlet Fu and Katie Greifeld on “The Close.” (Source: Bloomberg)",
    "publishedAt": "2025-08-08T22:46:35.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "76f0b87a"
  },
  {
    "id": "techmeme-1d806e3f",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: the US has started issuing licenses to Nvidia to export H20 chips to China following weeks of inaction, after Jensen Huang met Trump on Wednesday (Financial Times)",
    "url": "http://www.techmeme.com/250808/p25#a250808p25",
    "summary": "Financial Times: Sources: the US has started issuing licenses to Nvidia to export H20 chips to China following weeks of inaction, after Jensen Huang met Trump on Wednesday — Jensen Huang personally lobbied president after he reversed course on sale of H20 chips — The US...",
    "fullContent": "Financial Times: Sources: the US has started issuing licenses to Nvidia to export H20 chips to China following weeks of inaction, after Jensen Huang met Trump on Wednesday — Jensen Huang personally lobbied president after he reversed course on sale of H20 chips — The US commerce department &hellip;",
    "publishedAt": "2025-08-08T22:45:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1d806e3f"
  },
  {
    "id": "bloomberg-business-youtube-f234e4a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Will Meet With Putin in Alaska on August 15",
    "url": "https://www.youtube.com/watch?v=C7QhuKHxAeU",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T22:40:15.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "f234e4a"
  },
  {
    "id": "fortune-5f20e617",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump says he&#8217;ll meet Putin next Friday in Alaska to discuss Ukraine war&#8217;s end and predicts &#8216;some swapping of territories&#8217;",
    "url": "https://fortune.com/2025/08/08/trump-putin-meeting-alaska-ukraine-war-ceasefire-territory-swap/",
    "summary": "Prior to his announcing the meeting with Putin, Trump’s efforts to pressure Russia into stopping the fighting have so far delivered no progress.",
    "fullContent": "Prior to his announcing the meeting with Putin, Trump’s efforts to pressure Russia into stopping the fighting have so far delivered no progress.",
    "publishedAt": "2025-08-08T22:38:40.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5f20e617"
  },
  {
    "id": "cnbc-markets-222c8c53",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump says he will meet with Putin in Alaska on Aug. 15",
    "url": "https://www.cnbc.com/2025/08/08/trumps-russia-deadline-comes-around-with-tariffs-at-stake.html",
    "summary": "Washington's deadline for Moscow to strike a ceasefire in Ukraine was slated to expire on Friday.",
    "fullContent": "Washington's deadline for Moscow to strike a ceasefire in Ukraine was slated to expire on Friday.",
    "publishedAt": "2025-08-08T22:34:19.000Z",
    "fetchedAt": "2025-08-09T02:26:36.013Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "222c8c53"
  },
  {
    "id": "bloomberg-markets-22f8b918",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump Will Meet With Putin in Alaska on August 15",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/trump-will-meet-with-putin-in-alaska-on-august-15-video",
    "summary": "Donald Trump announced that he plans to meet with Russian President Vladimir Putin next Friday in Alaska, as the US president looks to broker a ceasefire agreement in hopes of bringing an end to the war in Ukraine. Vonnie Quinn reports.",
    "fullContent": "Donald Trump announced that he plans to meet with Russian President Vladimir Putin next Friday in Alaska, as the US president looks to broker a ceasefire agreement in hopes of bringing an end to the war in Ukraine. Vonnie Quinn reports.",
    "publishedAt": "2025-08-08T22:30:23.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "22f8b918"
  },
  {
    "id": "et-markets-1620436b",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Trump hits pause on trade talks with India, plays up tariff issue",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/trump-hits-pause-on-trade-talks-with-india-plays-up-tariff-issue/articleshow/123199509.cms",
    "summary": "Donald Trump has refused trade talks with India until tariff issues are settled. This follows the US raising tariffs on Indian imports to 50%. The US trade negotiators are still expected to visit New Delhi later this month for trade agreement talks.",
    "fullContent": "Donald Trump has refused trade talks with India until tariff issues are settled. This follows the US raising tariffs on Indian imports to 50%. The US trade negotiators are still expected to visit New Delhi later this month for trade agreement talks. An Indian official confirmed that the visit is still on schedule.",
    "publishedAt": "2025-08-08T22:30:00.000Z",
    "fetchedAt": "2025-08-09T09:42:08.939Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1620436b"
  },
  {
    "id": "the-verge-1cc2c7e8",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Ditching my phone for an LTE smartwatch was a humbling experience",
    "url": "https://www.theverge.com/gadgets/756945/smartwatch-lte-minimalist-phone",
    "summary": "Leaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens?",
    "fullContent": "Leaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens? [&#8230;]",
    "publishedAt": "2025-08-08T22:28:28.000Z",
    "fetchedAt": "2025-08-11T02:36:55.864Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1cc2c7e8"
  },
  {
    "id": "zerohedge-3c98d951",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Most COVID Lung Abnormalities Heal Over Time, New Guidelines Confirm",
    "url": "https://www.zerohedge.com/medical/most-covid-lung-abnormalities-heal-over-time-new-guidelines-confirm",
    "summary": "Most COVID Lung Abnormalities Heal Over Time, New Guidelines Confirm Authored by Rachel Ann T. Melegrito via The Epoch Times (emphasis ours), Up to half of hospitalized COVID-19 patients show lung abnormalities on chest CT scans long after the acute infection is over.",
    "fullContent": "Most COVID Lung Abnormalities Heal Over Time, New Guidelines Confirm Authored by Rachel Ann T. Melegrito via The Epoch Times (emphasis ours), Up to half of hospitalized COVID-19 patients show lung abnormalities on chest CT scans long after the acute infection is over. Many fear these changes mean lasting damage or worsening lung disease. However, new guidelines on treating long COVID confirm that lung abnormalities usually stabilize or even improve over time. Magic mine/ShutterStock “The lungs are an organ, like skin, that are in constant contact with the environment. Because of that, they have a significant amount of stem cells in reserve and cells ready for healing,” Dr. Panagis Galiatsatos, a pulmonary and critical care medicine physician and an associate professor at Johns Hopkins Medicine, told The Epoch Times. Recovery Takes Time Researchers found that in patients with lung damage following a COVID-19 infection, around 90 percent who continued to show lung abnormalities at the time of hospital discharge began to see improvements one to three years after infection. After a COVID-19 infection, roughly six in 100 people are estimated to develop persistent symptoms that can last for months to years—a condition known as long COVID. Common complaints include fatigue, joint and muscle aches, breathlessness, headaches, and difficulty concentrating, often called “brain fog.” Symptoms typically improve over time—usually within four to nine months. Lung recovery tends to follow a similar trajectory. After infection, the lungs can show changes that resemble scarring—such as inflammation, collapsed air sacs, or temporary thickening of lung tissue—but these often heal on their own, Dr. Joseph Varon, president and chief medical officer of Independent Medical Alliance, who is not one of the authors of the treatment guideline, told The Epoch Times. Based on Varon’s clinical experience, most patients with mild-to-moderate COVID-related lung issues show improvement on scans and of symptoms within three to six months. However, he noted that some people, especially older adults or those who had severe illness, can have lingering lung changes or symptoms for a year or more. In COVID-19, the early lung damage is mostly due to inflammation, not permanent destruction, he said. Once the infection clears and inflammation goes down, the lungs can start to heal, absorbing fluid and repairing tissue, a process that can take several months. “The body has the capacity to heal,” Dr. Pierre Kory, founder of Leading Edge Clinic, which treats long COVID patients, told The Epoch Times. COVID is typically an acute illness that heals over time rather than a chronic inflammatory condition—though in some cases, lingering lung inflammation or fibrosis can persist, he said. Many post-COVID lung changes seen in scans are not signs of permanent damage. They often reflect the lung’s natural healing process after inflammation, similar to what’s seen in other viral pneumonias or recovery from acute respiratory distress syndrome. Over time, these abnormalities often fade as the tissue repairs itself. Unlike chronic conditions such as interstitial lung disease, which involve ongoing triggers and progressive scarring, post-COVID changes are typically non-progressive. However, older patients who had been on mechanical ventilation or had severe or critical initial infection were more likely to have persistent lung changes, possibly due to the extent of initial lung injury. Residual Signs Versus Permanent Damage Chest CT scans often reveal lung changes long after COVID-19 infection that may look severe on imaging. These include ground glass opacities, which are hazy areas suggesting inflammation, or fibrous strands, thin bands of tissue left over from healing. However, many of these findings are residual effects from the infection, not signs of irreversible damage. “Radiologic findings often lag behind clinical recovery and must be interpreted within a broader clinical framework,” said Varon, “I have seen patients that have ‘white lungs’ for months and are doing well.” The disconnect between imaging and the actual patient condition may lead to confusion, unnecessary follow-up, or even overtreatment of long COVID. “Some patients report persistent symptoms despite near-normal imaging,” Varon said, likely due to lingering viral effects or nervous system issues rather than actual lung damage. “The key takeaway is that both lung damage and symptoms often improve—but not always in synchrony, and not always completely,” he said. That’s why an individualized, symptom-based follow-up approach remains essential in managing long COVID patients. Preventing Costly Overtreatment The new guidelines specifically address the tendency to over-interpret nonspecific findings as signs of progressive lung disease. The new consensus advises using CT only when clinically indicated, such as in patients with persistent or worsening respiratory symptoms. Mislabeling can also lead to costly treatments, repeated imaging, and even affect life insurance or disability claims. “These medications can cost up to $60,000 per year—and patients may not really need them,” Varon said. The new guidelines suggest providers request follow-up chest CT only in patients whose respiratory symptoms persist or worsen three months after infection, with those symptoms lasting at least two months and with no other identifiable cause. They also recommend low-dose protocols for follow-up imaging to reduce radiation exposure. CT was invaluable early in the pandemic, especially when RT-PCR testing was unreliable, Varon said, but its continued use in asymptomatic or mildly symptomatic long COVID patients is often unnecessary. The guidelines also urge radiologists to avoid using terms such as “fibrosis” or “interstitial lung disease,” which often imply progressive or permanent scarring, when describing nonspecific residual findings. The bigger concern, Kory said, is the tendency to over-label nonspecific findings, like ground-glass opacities or mild fibrotic changes, as definitive signs of fibrotic interstitial lung disease. “I see this in my practice every single day,” he said. “These interpretations can trigger unnecessary anxiety, inappropriate referrals, and misguided treatment plans.” Kory takes a symptom-focused approach, monitoring patients clinically and repeating imaging only if conditions worsen. “My experience in general is that yes, most things in medicine are overused, including imaging,” he said. Tyler Durden Fri, 08/08/2025 - 18:25",
    "publishedAt": "2025-08-08T22:25:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c98d951"
  },
  {
    "id": "ft-economics-401d55c4",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "US licenses Nvidia to export chips to China after CEO meets Trump",
    "url": "https://www.ft.com/content/e9c52f00-9bde-4840-801e-ba66c792df9e",
    "summary": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips.",
    "fullContent": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips",
    "publishedAt": "2025-08-08T22:22:42.000Z",
    "fetchedAt": "2025-08-09T02:26:37.268Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "401d55c4"
  },
  {
    "id": "ft-technology-401d55c4",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "US licenses Nvidia to export chips to China after CEO meets Trump",
    "url": "https://www.ft.com/content/e9c52f00-9bde-4840-801e-ba66c792df9e",
    "summary": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips.",
    "fullContent": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips",
    "publishedAt": "2025-08-08T22:22:42.000Z",
    "fetchedAt": "2025-08-09T02:26:37.183Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "401d55c4"
  },
  {
    "id": "wired-40c2a944",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Truth Social’s New AI Chatbot Is Donald Trump’s Media Diet Incarnate",
    "url": "https://www.wired.com/story/i-fear-truth-search-ai-might-be-biased-but-it-says-it-isnt/",
    "summary": "Truth Search AI appears to rely heavily on conservative outlet Fox News to answer even the most basic questions.",
    "fullContent": "Truth Search AI appears to rely heavily on conservative outlet Fox News to answer even the most basic questions.",
    "publishedAt": "2025-08-08T22:20:48.000Z",
    "fetchedAt": "2025-08-09T02:26:38.145Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "40c2a944"
  },
  {
    "id": "nyt-business-1bbe60e9",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Popular E.P.A. Database Is in Limbo Amid Science Cuts",
    "url": "https://www.nytimes.com/2025/08/08/climate/epa-database-useeio-greenhouse-gases.html",
    "summary": "The database helps companies calculate their greenhouse gas emissions. Its creator left the E.P.A. after being investigated for criticizing the Trump administration.",
    "fullContent": "The database helps companies calculate their greenhouse gas emissions. Its creator left the E.P.A. after being investigated for criticizing the Trump administration.",
    "publishedAt": "2025-08-08T22:20:46.000Z",
    "fetchedAt": "2025-08-09T02:26:36.613Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1bbe60e9"
  },
  {
    "id": "ft-economics-248b73b9",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "US foreign policy as it happened: Donald Trump to meet Vladimir Putin in Alaska and signals Ukraine may need to cede land; Armenia and Azerbaijan sign joint peace declaration",
    "url": "https://www.ft.com/content/a237d285-7033-4d46-9718-63e17b481e54",
    "summary": "US and Russian leaders to meet on August 15 in attempt to broker end to resolve war in Ukraine.",
    "fullContent": "US and Russian leaders to meet on August 15 in attempt to broker end to resolve war in Ukraine",
    "publishedAt": "2025-08-08T22:17:26.000Z",
    "fetchedAt": "2025-08-09T02:26:37.268Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "248b73b9"
  },
  {
    "id": "techmeme-49a31c7c",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Silver Lake unveils a $400M project to secure powered land for data center developers; it has secured 3GW of power and is developing sites in Texas and Georgia (Isabelle Bousquette/Wall Street Journal)",
    "url": "http://www.techmeme.com/250808/p24#a250808p24",
    "summary": "Isabelle Bousquette / Wall Street Journal: Silver Lake unveils a $400M project to secure powered land for data center developers; it has secured 3GW of power and is developing sites in Texas and Georgia — The private-equity firm is looking to bundle land parcels with power...",
    "fullContent": "Isabelle Bousquette / Wall Street Journal: Silver Lake unveils a $400M project to secure powered land for data center developers; it has secured 3GW of power and is developing sites in Texas and Georgia — The private-equity firm is looking to bundle land parcels with power availability, which it said is now the biggest obstacle to data-center development",
    "publishedAt": "2025-08-08T22:10:04.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "49a31c7c"
  },
  {
    "id": "bloomberg-markets-381b3e41",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Entry-Level Jobs at Risk, Tariffs & Textile Companies, Powering Data Centers | Wall Street Week",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/side-effects-of-ai-wall-street-week-video",
    "summary": "This week, college graduates struggle to find entry-level jobs: is AI part of the problem? And, Centerview Partners’ Blair Effron on CEOs weathering policy uncertainty, and the importance of New York's next mayor to the city's business community.",
    "fullContent": "This week, college graduates struggle to find entry-level jobs: is AI part of the problem? And, Centerview Partners’ Blair Effron on CEOs weathering policy uncertainty, and the importance of New York's next mayor to the city's business community. Plus, how will President Trump’s tariffs impact the textile industry? Later, a small town pushes back against an Amazon data center - the pros and cons the town sees in data centers. (Source: Bloomberg)",
    "publishedAt": "2025-08-08T22:07:49.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "381b3e41"
  },
  {
    "id": "wsj-markets-main-7945319b",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Trump Preparing IPO for Fannie Mae and Freddie Mac Later This Year",
    "url": "https://www.wsj.com/finance/regulation/trump-aiming-to-ipo-fannie-mae-and-freddie-mac-later-this-year-13b138cf?mod=rss_markets_main",
    "summary": "Some officials believe the offering could raise around $30 billion and value the combined firms at roughly $500 billion or more.",
    "fullContent": "Some officials believe the offering could raise around $30 billion and value the combined firms at roughly $500 billion or more.",
    "publishedAt": "2025-08-08T22:05:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7945319b"
  },
  {
    "id": "bloomberg-business-youtube-7245bd00",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Elon Musk’s Boring Company is turning into a flop #tech #shorts",
    "url": "https://www.youtube.com/shorts/KWdXD-sKtro",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T22:00:33.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7245bd00"
  },
  {
    "id": "zerohedge-50185fd6",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "​​​​​​​Gun Sales Fall Under 1 Million For First Time In Six Years; Ammo Prices Sink To Lows",
    "url": "https://www.zerohedge.com/markets/gun-sales-sink-below-1-million-first-time-six-years-ammo-prices-low-market-bust",
    "summary": "​​​​​​​Gun Sales Fall Under 1 Million For First Time In Six Years; Ammo Prices Sink To Lows After years of pandemic-fueled surges and politically driven buying sprees, the U.S. gun market is sliding deeper into a downturn.",
    "fullContent": "​​​​​​​Gun Sales Fall Under 1 Million For First Time In Six Years; Ammo Prices Sink To Lows After years of pandemic-fueled surges and politically driven buying sprees, the U.S. gun market is sliding deeper into a downturn. With Republicans controlling both Congress and the White House, fears of sweeping federal gun bans from far-left Democrats have abated, stripping away one of the industry's most reliable sales catalysts. The latest July figures from the FBI show 1.94 million National Instant Criminal Background Check System (NICS) background checks, down 4.2% from July 2024. After removing permit-related checks, the National Shooting Sports Foundation (NSSF) estimated 978,731 checks directly tied to gun sales, an 8.1% drop year-over-year and the first sub-million reading in six years. \"Summer months routinely show lower background check figures than other times of the year, and we've watched as the background check figures came down from astronomical highs several years ago,\" Mark Oliva, public affairs officer with the NSSF, told firearms website Guns.com via an emailed response. Oliva noted, \"There are factors that contribute to this, including relief of concern that politics would deny some from being able to exercise Second Amendment rights to purchase a firearm of one's choice and economic uncertainty.\" The gun panic-buying frenzy of 2020 and 2021 was never sustainable and has since ended in a complete bust for the industry. Notably, the downturn is likely to persist through President Trump's second term, given that a pro-2A administration won't infringe on gun owners, unlike the Biden-Harris regime, which aggressively did so. Nowhere is the gun bust more evident than in the decline of Smith & Wesson's shares: SWBI vs. NICS... Meanwhile, precious metals such as gold might be at an all-time high, but ammo prices are at lows... 9mm retail prices via data from Black Basin. . . . Tyler Durden Fri, 08/08/2025 - 18:00",
    "publishedAt": "2025-08-08T22:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "50185fd6"
  },
  {
    "id": "bloomberg-politics-6f4f6f2a",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "William Webster, Only Person to Lead Both The FBI and CIA, Dies at 101",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/william-webster-only-person-to-lead-fbi-and-cia-dies-at-101",
    "summary": "William Webster, the only person to lead both the Federal Bureau of Investigation and the Central Intelligence Agency and, very briefly, the first head of the US accounting oversight board, has died. He was 101.",
    "fullContent": "William Webster, the only person to lead both the Federal Bureau of Investigation and the Central Intelligence Agency and, very briefly, the first head of the US accounting oversight board, has died. He was 101.",
    "publishedAt": "2025-08-08T21:55:04.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6f4f6f2a"
  },
  {
    "id": "wsj-opinion-56cc901b",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Hamas Pulls Israel Deeper Into Gaza",
    "url": "https://www.wsj.com/opinion/israel-gaza-city-benjamin-netanyahu-hamas-59a2f40d",
    "summary": "Netanyahu takes a middle road that will satisfy nobody.",
    "fullContent": "Netanyahu takes a middle road that will satisfy nobody.",
    "publishedAt": "2025-08-08T21:42:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.850Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "56cc901b"
  },
  {
    "id": "wsj-world-news-b8d7143",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Hamas Pulls Israel Deeper Into Gaza",
    "url": "https://www.wsj.com/opinion/israel-gaza-city-benjamin-netanyahu-hamas-59a2f40d",
    "summary": "Netanyahu takes a middle road that will satisfy nobody.",
    "fullContent": "Netanyahu takes a middle road that will satisfy nobody.",
    "publishedAt": "2025-08-08T21:42:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.854Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "b8d7143"
  },
  {
    "id": "zerohedge-249e45bf",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Watch: Feds Jump Out Of Truck, Ambush Illegals At LA Home Depot",
    "url": "https://www.zerohedge.com/political/watch-feds-jump-out-truck-ambush-illegals-la-home-depot",
    "summary": "Watch: Feds Jump Out Of Truck, Ambush Illegals At LA Home Depot Via Headline USA, U.S. Border Patrol agents jumped out of the back of a rented box truck and made arrests Wednesday at a Los Angeles Home Depot store during an immigration raid that an agency official called...",
    "fullContent": "Watch: Feds Jump Out Of Truck, Ambush Illegals At LA Home Depot Via Headline USA, U.S. Border Patrol agents jumped out of the back of a rented box truck and made arrests Wednesday at a Los Angeles Home Depot store during an immigration raid that an agency official called “Operation Trojan Horse.” “For those who thought immigration enforcement had stopped in Southern California, think again,” acting U.S. Atty. Bill Essayli posted on the social platform X after the raid. “The enforcement of federal law is not negotiable and there are no sanctuaries from the reach of the federal government.” Messages were sent to the U.S. Department of Homeland Security seeking details on the raid, including how many people were arrested. U.S. Border Patrol Sector Chief Greg Bovino reposted Fox News reports of Monday’s arrests on X, calling the action “Operation Trojan Horse.” Breaking: DHS arrives in Penske trucks at a Home Depot in McArthur Park area of LA for early morning immigration enforcement. The area was filled with migrants who scattered. DHS says MS 13 has a chokehold on this area, which is one reason they’re carrying out the highly… pic.twitter.com/hTskuM9Q4l — Matt Finn (@MattFinnFNC) August 6, 2025 Photos on social media showed the moment the rear door of the rented Penske truck opened, revealing several uniformed agents with guns. A spokesperson for Penske Truck Rental said the company was looking into the use of its vehicles by federal officials, saying its regulations prohibit transporting people in truck cargo areas. “The company was not made aware that its trucks would be used in today’s operation and did not authorize this,” spokesperson Randolph P. Ryerson said in an email. “Penske will reach out to DHS and reinforce its policy to avoid improper use of its vehicles in the future.” Tyler Durden Fri, 08/08/2025 - 17:40",
    "publishedAt": "2025-08-08T21:40:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.988Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "249e45bf"
  }
]