[
  {
    "id": "bloomberg-markets-6f13229",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "China’s Great Wall Opens Brazil Car Plant, Seeks Site for Second",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/gwm-opens-first-brazil-auto-plant-and-is-already-eyeing-a-second",
    "summary": "Chinese automaker Great Wall Motor Co. may have just opened its first factory in Brazil, but is already scoping out sites for a second plant as it ramps up its ambitions in South America’s largest economy.",
    "fullContent": "Chinese automaker Great Wall Motor Co. may have just opened its first factory in Brazil, but is already scoping out sites for a second plant as it ramps up its ambitions in South America’s largest economy.",
    "publishedAt": "2025-08-17T23:32:04.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6f13229"
  },
  {
    "id": "fortune-42ced3c",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Dow futures rise as updates this week from the Fed and top retailers will test Wall Street&#8217;s big rally",
    "url": "https://fortune.com/2025/08/17/stock-market-today-dow-futures-jerome-powell-jackson-hole-walmart-earnings-tariffs/",
    "summary": "Fed minutes are due, and top retailers will report earnings in the coming week. But the main attraction will be Jerome Powell's speech on Friday.",
    "fullContent": "Fed minutes are due, and top retailers will report earnings in the coming week. But the main attraction will be Jerome Powell's speech on Friday.",
    "publishedAt": "2025-08-17T23:31:24.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "42ced3c"
  },
  {
    "id": "bloomberg-markets-300b623",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "China’s Tech Prowess Attracts Indian Tycoons as Ties Improve",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/china-s-tech-prowess-attracts-indian-tycoons-like-adani-ambani-as-ties-thaw",
    "summary": "A growing wave of Indian businesses are seeking partnerships with Chinese companies for technology transfers, a quiet effort that’s expected to see a boost as President Donald Trump’s tariff barrage nudges the longstanding Asian rivals closer.",
    "fullContent": "A growing wave of Indian businesses are seeking partnerships with Chinese companies for technology transfers, a quiet effort that’s expected to see a boost as President Donald Trump’s tariff barrage nudges the longstanding Asian rivals closer.",
    "publishedAt": "2025-08-17T23:30:00.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "300b623"
  },
  {
    "id": "techmeme-32b2b10b",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "AI is increasingly being used in hacking, with cybercriminals using AI to enhance their capabilities and cybersecurity firms using it to find vulnerabilities (Kevin Collier/NBC News)",
    "url": "http://www.techmeme.com/250817/p12#a250817p12",
    "summary": "Kevin Collier / NBC News: AI is increasingly being used in hacking, with cybercriminals using AI to enhance their capabilities and cybersecurity firms using it to find vulnerabilities — Hackers and cybersecurity companies have entered an AI arms race.",
    "fullContent": "Kevin Collier / NBC News: AI is increasingly being used in hacking, with cybercriminals using AI to enhance their capabilities and cybersecurity firms using it to find vulnerabilities — Hackers and cybersecurity companies have entered an AI arms race. — This summer, Russia's hackers put a new twist on the barrage of phishing emails sent to Ukrainians.",
    "publishedAt": "2025-08-17T23:25:01.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "32b2b10b"
  },
  {
    "id": "zerohedge-661d0579",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Witkoff Says White House Pushing To Extract 'Article 5-Like' Protections For Ukraine",
    "url": "https://www.zerohedge.com/geopolitical/european-leaders-join-mondays-zelensky-trump-meeting-want-article-5-type-security",
    "summary": "Witkoff Says White House Pushing To Extract 'Article 5-Like' Protections For Ukraine Update(1918ET): It appears that the White House is ready to push for Europe's consensus - at least at the moment (or as a starting negotiating tactic) - which is to provide non-NATO \"article 5...",
    "fullContent": "Witkoff Says White House Pushing To Extract 'Article 5-Like' Protections For Ukraine Update(1918ET): It appears that the White House is ready to push for Europe's consensus - at least at the moment (or as a starting negotiating tactic) - which is to provide non-NATO \"article 5 style security guarantees\" for a post-peace settlement Ukraine. The only problem is that of course it would be NATO countries themselves enforcing such a rule, which will be seen as a non-starter for the Kremlin. According to the latest from Trump's top envoy: Special envoy Steve Witkoff says the White House extracted critical wins from its Friday summit with Vladimir Putin in Alaska, even as President Donald Trump failed to walk away with the ceasefire he was loudly advocated for. Security guarantees offering Ukraine “Article 5-like protections” are the real prize, Witkoff told CNN’s Jake Tapper on Sunday. They’re “game-changing,” he said. But his wording is perhaps an acknowledgement that even the US adminstration knows it's mearly a goal and unlikely to be the realistic outcome. He explained Sunday in the aftermath of the Alaska summit, \"We didn’t think that we were anywhere close to agreeing to Article Five protection from the United States in legislative enshrinement within the Russian Federation, not to go after any other territory when the peace deal is codified.\" Witkoff contineud on CNN’s State of the Union, \"We got to an agreement that the United States and other European nations could effectively offer Article 5-like language to cover a security guarantee.\" But whether the Kremlin actually sees it this way is another quesiton entirely. Naturally the Trump adminsitration is going to start from its own 'maximalist' position - but at least the sides are talking and are engaged. If Moscow agrees, it will certainly seek nothing less than significant territorial concessions and political recognization of at least some of the Donbass. Still, based also on Rubio's latest media comments, the hawks in the Western alliance are continuing to run the show: \"Territories will have to be discussed, it's just a fact,\" says the Secretary of State. Rubio says \"there's no conditions that can be imposed on Ukraine\" to achieve a settlement to the war, and *Russia* may have to give up territory. Hasn't the media been screaming that Trump is shamefully scheming to force Ukraine to surrender? Rubio suggests the exact opposite pic.twitter.com/OqaPSTrdxL — Michael Tracey (@mtracey) August 17, 2025 And more, with the expected mixed messaging... The US and Russia have agreed on security guarantees for Ukraine, but the next steps depend on Kyiv, Trump’s envoy Witkoff said. He added that territorial issues will be discussed with Zelensky on Monday, and that Moscow has made concessions on five Ukrainian regions. pic.twitter.com/IjW2enmd6G — WarTranslated (@wartranslated) August 17, 2025 What would this look like on the ground in Eastern Europe? Putin has repeatedly warned that Russia will never accept NATO country troops on the ground in Ukraine, so certainly the provervbial devil will be in the details, and there's yet a long way to go for the negotiating sides. Much might also depend on the temperature in the room of the Oval Office on Monday, when Trump meets leading European leaders and Zelensky in the Oval. * * * Ahead of the planned Monday meeting between President Trump and Ukraine's Zelensky in the Oval Office, which will also have the attendance and participation of a growing list of European and NATO leaders, there's increasing talk of seeking American-supported \"Article 5-style\" security guarantees for Ukraine as part of any broader peace deal with Russia. According to CNN, citing a senior European official, the proposed plan wouldn't involve NATO directly - and would effectively remove the question of membership in the military alliance - but would aim to offer Ukraine protections similar to NATO's collective defense clause. Via The Associated Press The specifics of the proposal remain undisclosed and unclear, and there's also the practical reality and major hurdle of just how such 'guarantees' would be enforced. The Kremlin would likely balk at such a condition, given Russian leadership has said it would never allow any Western troop deployment or NATO-style force in Ukraine. There has actually for years throughout the grinding war been talk among European capitals of the idea of deploying a \"reassurance force\" in Ukraine. One thing that all the Western allies agree on at this early stage is that the initiative would never get off the ground without the United States officially backing and supporting it. And yet if the European leaders going to the White House lobby hard for this, it's almost certain this would break the negotiating process with Russia. For Moscow, assurance of permanent Ukrainian neutrality remains a top priority, and so talk of an Article-5 style system which would 'protect' Ukraine in the instance of future Russian attacks is likely to a complete non-starter as an option. But it's especially the hawks which are pushing this, and likely Moscow is going to see it as simply NATO placing its security blanket over Kiev under a different guise, or just under the cover of differing semantics. On Sunday, more and more European leaders have confirmed they will be joining Ukrainian President Zelensky on his trip to the White House on Monday. According to a BBC list, the below top officials have confirmed they will be attending: UK Prime Minister Keir Starmer Italian Prime Minister Giorgia Meloni German Chancellor Friedrich Merz Finnish President Alexander Stubb French President Emmanuel Macron Nato Secretary-General Mark Rutte European Commission President Ursula von der Leyen This comes after most leaders on this list have strongly complained that Europe and even Ukraine have been left behind, and cut out of the negotiating process. They back Zelensky who says all decisions taken without direct Ukrainian participation are 'stillborn' on arrival. President Trump's hope is that this swiftly moving process of talks which started with Putin in Alaska on Friday will lead to a final, and permanent peace settlement to end the war. But much of the entire Western establishment - whether government officials or the mainstream press - seems to want this process to fail... The bourgeois press thinks the real problem with Putin is that he just needs a good therapist pic.twitter.com/T56qpm3Cnk — Mark Ames (@MarkAmesExiled) August 17, 2025 Trump said on social media on Saturday, \"President Zelenskyy will be coming to D.C., the Oval Office, on Monday afternoon. If all works out, we will then schedule a meeting with President Putin. Potentially, millions of people's lives will be saved. Thank you for your attention to this matter!\" Tyler Durden Sun, 08/17/2025 - 19:19",
    "publishedAt": "2025-08-17T23:19:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.896Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "661d0579"
  },
  {
    "id": "zerohedge-e9b76d7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Billionaires For Socialism: The $2 Billion \"Grassroots\" Operation Behind Zohran Mamdani",
    "url": "https://www.zerohedge.com/political/billionaires-socialism-2-billion-grassroots-operation-behind-zohran-mamdani",
    "summary": "Billionaires For Socialism: The $2 Billion \"Grassroots\" Operation Behind Zohran Mamdani Submitted by Jason Curtis Anderson of One City Rising, How the Working Families Party sells itself as \"grassroots\" — with IRS-documented, publicly admitted \"common control\" revealing it's...",
    "fullContent": "Billionaires For Socialism: The $2 Billion \"Grassroots\" Operation Behind Zohran Mamdani Submitted by Jason Curtis Anderson of One City Rising, How the Working Families Party sells itself as \"grassroots\" — with IRS-documented, publicly admitted \"common control\" revealing it's really a Soros-financed political money washer. In New York politics, there's one machine that towers above the rest. No, not the Democratic Party—it's the Working Families Party, the most powerful minor party in America. Its name sounds wholesome enough—who doesn't support \"working families\"? But behind that branding lies a $2 billion tax-exempt laundromat that's anything but local, grassroots, or honest. Take Zohran Mamdani, their current belle of the ball. Easy answer: Zohran Mandani is the product of a grassroots washing syndicate of 501c3 and 501c4 entities funded by George Soros and Silicon Valley billionaires. He is their manufactured product. Receipts ➡️ https://t.co/GrF1LkVo3H https://t.co/4MXlJyiOAq — Sam E. Antar (@SamAntar) August 17, 2025 After winning his race, he announced on NBC: \"I don't think we should have billionaires.\" Hilarious considering Mamdani's \"grassroots\" revolution was fueled by over $2 million in PAC and organizational spending, much of it courtesy of the very billionaire class he allegedly opposes. Zohran Mamdani: \"I don't think we should have billionaires because it is so much money in a moment of such inequality.\"pic.twitter.com/LOoNw4w6dF — Joe Rogan Podcast News (@joeroganhq) July 1, 2025 This is the theater of modern politics: denounce wealth while being powered by it. And the actors know their audience. They've learned that if you slap \"grassroots\" on the packaging, voters won't check the label. But let's check it anyway. The money trail revealed in Sam Antar's breaking report is straightforward enough. Soros donates to the Open Society Institute, a $4.5 billion \"charity\" that enjoys generous tax deductions. OSI then transfers millions to other \"charities\" like Tides Foundation, which mysteriously claims to run a $350 million operation with zero employees. From there, the money \"converts\" into political cash: Tides passes funds to the Working Families Organization, a 501(c)(4), which then wires millions to PACs that bankroll candidates like Mamdani. What you have is billionaire money dressed up in \"working families\" clothing, masquerading as the will of the people while being anything but. And don't take my word for it. These groups openly admit to \"common control\" and \"shared staff\" across their charities and political arms. In plain English: the same people make decisions for both sides of the ledger. One day they're signing checks for the \"charity,\" the next for the political arm. The IRS explicitly forbids this. Charities must operate \"exclusively\" for charitable purposes. The moment they cross into political campaigning, their exemptions should be revoked. Auditors have already blown the whistle. Deloitte and Withum both flagged \"significant deficiencies\" and \"common officers\" across these supposedly separate entities. The IRS has a simple doctrine for this: substance over form. If it looks like a duck, quacks like a duck, and flaps like a duck, it doesn't matter if the paperwork calls it a horse. The numbers are staggering. Soros's network alone controls $5.57 billion in assets, generating untaxed returns. If properly taxed, that would mean roughly $450 million a year back to American taxpayers. Instead, the money is siphoned into a political machine that signals to the public that it represents them while pushing the Open Societies agenda. Meanwhile, the watchdogs were compromised. Larry Moskowitz, a 15-year WFP veteran, sat on the New York City Campaign Finance Board (CFB) while these schemes played out. A senior staffer at the same agency, David Duhalde, the former deputy director of the DSA, also worked at the CFB while his organization ran someone for mayor. In other words, the referees were not only wearing the team jersey—they were helping write the playbook. And so you see things that are mathematically impossible: same-day circular transactions, PACs that pay for services with money they never had, taxpayer matching funds generated by coordinated activities that should have been disqualified. In any other setting, this would be called fraud. In politics, but when progressives control the government agencies, it's called \"movement-building.\" It's all part of a larger hypocrisy. The WFP rails against billionaires while being funded by them. It preaches \"democracy\" while short-circuiting the rules designed to protect it. And it claims to stand for working families while serving as the cash pipeline for radicals whose agenda—abolishing capitalism, police, borders, and private property—would make working families' lives unrecognizable. This is the great genius of the modern left: to run what is essentially a billionaire-backed, tax-exempt machine while insisting it's \"grassroots.\" It's not just dishonest—it's corrosive. Because when billionaires can buy socialism tax-free, when oversight boards are stacked with partisans, and when voters are told they're seeing a bottom-up revolution while it's actually a top-down operation, democracy becomes little more than political theater. The IRS has more than enough evidence. Over a thousand pages of filings, audits, and disclosures show the same thing: systematic tax fraud, documented in their own paperwork. The question is whether anyone in Washington has the courage to act. If this were a conservative network, there would be hearings, front-page outrage, and high-profile perp walks. Instead, because the machine flies a progressive banner, it gets a pass. Billionaires for socialism—what a joke. But the laugh's on us, and the bill is north of $450 million a year. Working Families? Please. This is a billionaire racket. And unless the IRS acts, it will keep laundering tax-exempt dollars into political power, one \"grassroots\" revolution at a time. Tyler Durden Sun, 08/17/2025 - 19:15",
    "publishedAt": "2025-08-17T23:15:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.897Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "e9b76d7"
  },
  {
    "id": "fortune-5496e23a",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Today&#8217;s speed limits grew out of studies on rural roads from the 1930s and 1940s. Now states are looking to change guidelines",
    "url": "https://fortune.com/2025/08/17/speed-limits-guidelines-states-road-highway-safety-85-percent-rule/",
    "summary": "The 85% rule suggests a road’s posted speed should be tied to the 15th-fastest vehicle out of every 100 traveling it in free-flowing traffic.",
    "fullContent": "The 85% rule suggests a road’s posted speed should be tied to the 15th-fastest vehicle out of every 100 traveling it in free-flowing traffic.",
    "publishedAt": "2025-08-17T23:11:16.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5496e23a"
  },
  {
    "id": "bbc-business-a7ad801",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Should Europe wean itself off US tech?",
    "url": "https://www.bbc.com/news/articles/c3dpr2zkny0o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
    "fullContent": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
    "publishedAt": "2025-08-17T23:03:19.000Z",
    "fetchedAt": "2025-08-18T02:33:35.387Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "a7ad801"
  },
  {
    "id": "bloomberg-economics-4000b7bb",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "UK House Prices Drop £11,000 During Summer Lull, Rightmove Says",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/uk-house-prices-drop-11-000-during-summer-lull-rightmove-says",
    "summary": "UK home prices are almost £11,000 ($14,900) cheaper than three months ago, with sellers competing for attention during the market’s summer lull.",
    "fullContent": "UK home prices are almost £11,000 ($14,900) cheaper than three months ago, with sellers competing for attention during the market’s summer lull.",
    "publishedAt": "2025-08-17T23:01:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.214Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "4000b7bb"
  },
  {
    "id": "bloomberg-politics-636bfa5a",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Uneasy US Allies Set to Plead With Trump to Stand Behind Ukraine",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/uneasy-us-allies-set-to-plead-with-trump-to-stand-behind-ukraine",
    "summary": "Ukraine President Volodymyr Zelenskiy and his European allies arrive in Washington on Monday anxious to find out what Donald Trump committed to at his summit with Vladimir Putin and apprehensive that he’ll force Kyiv into making unpalatable concessions.",
    "fullContent": "Ukraine President Volodymyr Zelenskiy and his European allies arrive in Washington on Monday anxious to find out what Donald Trump committed to at his summit with Vladimir Putin and apprehensive that he’ll force Kyiv into making unpalatable concessions.",
    "publishedAt": "2025-08-17T23:00:02.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "636bfa5a"
  },
  {
    "id": "bloomberg-markets-5fd4b3c4",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "A 200% Stock Surge Makes Leapmotor China’s Next EV Rising Star",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/a-200-stock-surge-makes-leapmotor-china-s-next-ev-rising-star",
    "summary": "Zhejiang Leapmotor Technology Co., once a fringe player in China’s electric-vehicle industry, is beating all its startup rivals by sales and stock gains this year and analysts say there’s more to come.",
    "fullContent": "Zhejiang Leapmotor Technology Co., once a fringe player in China’s electric-vehicle industry, is beating all its startup rivals by sales and stock gains this year and analysts say there’s more to come.",
    "publishedAt": "2025-08-17T23:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5fd4b3c4"
  },
  {
    "id": "oil-price-61667931",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "U.S. LNG: Record Exports, Rising Prices, and a Looming Problem",
    "url": "https://oilprice.com/Energy/Natural-Gas/US-LNG-Record-Exports-Rising-Prices-and-a-Looming-Problem.html",
    "summary": "U.S. LNG exports so far this year have smashed yet another record, prices are on the rise without sapping demand, and the outlook remains robust. But there’s a hitch: pipelines. Exports of liquefied natural gas from the United States between January and August this year went...",
    "fullContent": "U.S. LNG exports so far this year have smashed yet another record, prices are on the rise without sapping demand, and the outlook remains robust. But there’s a hitch: pipelines. Exports of liquefied natural gas from the United States between January and August this year went up by 22% from the first eight months of 2024, Reuters’ Gavin Maguire reported this week, citing data from Kpler as showing exports reached 69 million tons. This was 12.4 million tons more than U.S. LNG producers exported last year. The report also noted that domestic…",
    "publishedAt": "2025-08-17T23:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.214Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "61667931"
  },
  {
    "id": "bloomberg-markets-6226d047",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Stocks, Futures Edge Up Ahead of Ukraine Talks: Markets Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/asia-set-for-cautious-open-ahead-of-ukraine-talks-markets-wrap",
    "summary": "Asian stocks posted a modest gain as investors looked to Donald Trump’s talks with Ukrainian President Volodymyr Zelenskiy for direction before adding exposure.",
    "fullContent": "Asian stocks posted a modest gain as investors looked to Donald Trump’s talks with Ukrainian President Volodymyr Zelenskiy for direction before adding exposure.",
    "publishedAt": "2025-08-17T22:42:44.000Z",
    "fetchedAt": "2025-08-18T02:33:32.696Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6226d047"
  },
  {
    "id": "bloomberg-markets-358e742f",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "BlueScope FY Earnings Weighed by Global Steel Capacity Glut",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/bluescope-fy-earnings-weighed-by-global-steel-capacity-glut",
    "summary": "BlueScope Steel Ltd.’s full-year underlying profit falls 51%, as a surplus of global steel capacity continued to weigh on prices and higher costs ate into margins.",
    "fullContent": "BlueScope Steel Ltd.’s full-year underlying profit falls 51%, as a surplus of global steel capacity continued to weigh on prices and higher costs ate into margins.",
    "publishedAt": "2025-08-17T22:40:20.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "358e742f"
  },
  {
    "id": "zerohedge-5fcdce01",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Obama Judge Blocks Trump's Bid To End Child Detention Policy Seen As Fueling Illegal Immigration",
    "url": "https://www.zerohedge.com/political/obama-judge-blocks-trumps-bid-end-child-detention-policy-seen-fueling-illegal-immigration",
    "summary": "Obama Judge Blocks Trump's Bid To End Child Detention Policy Seen As Fueling Illegal Immigration Authored by Tom Ozimek via The Epoch Times (emphasis ours), A federal judge has rejected the Trump administration’s effort to end a decades-old settlement that sets standards for...",
    "fullContent": "Obama Judge Blocks Trump's Bid To End Child Detention Policy Seen As Fueling Illegal Immigration Authored by Tom Ozimek via The Epoch Times (emphasis ours), A federal judge has rejected the Trump administration’s effort to end a decades-old settlement that sets standards for the treatment of children in immigration custody, rebuffing the government’s arguments that the agreement obstructs its crackdown on illegal immigration. Border Patrol apprehends illegal immigrants who have just crossed the Rio Grande from Mexico near McAllen, Texas, on April 18, 2019. Charlotte Cuthbertson/The Epoch Times U.S. District Judge Dolly Gee (Obama Appointee) of the Central District of California said in an Aug. 15 order that the administration had not shown grounds to terminate the Flores Settlement Agreement (FSA), first signed in 1997, which limits how long and under what conditions children can be held in Border Patrol facilities. Government lawyers argued in court filings in May that the pact is an “intrusive regime” that prevents officials from detaining families through the full course of removal proceedings and encourages illegal immigrants to cross the border with children knowing they will be released quickly. US District Judge Dolly Gee “The FSA itself has changed the immigration landscape by removing some of the disincentives for families to enter the U.S. unlawfully,“ they wrote. ”Unlawful family migration barely existed in 1997.” The FSA requires that minors be transferred out of Border Patrol holding cells within about 72 hours, and placed in licensed shelters or released to family whenever possible. A 2015 court order—also by Gee—extended those rules to children arriving with parents, creating a practical 20-day cap on family detention since the government lacks licensed long-term family facilities. That limit, government attorneys and the Department of Homeland Security (DHS) have argued, makes it almost impossible to detain family units together for the full length of immigration proceedings, which can stretch for weeks or months. President Donald Trump sought to end the FSA during his first term—which was blocked by Gee in 2019—and that effort was revived when he was reelected for a second term, in part on a promise to crack down on illegal immigration. Administration officials have repeatedly blamed the FSA for fueling surges of illegal immigration and have argued that both the DHS and Health and Human Services (HHS) are currently in “substantial compliance” with the agreement, and “further continuation of the FSA is no longer equitable or in the public interest.” Last week, Gee held a hearing with advocates of illegal immigrant children in federal custody and Trump administration attorneys. Advocates urged the judge to keep the FSA in place, pointing to reports of poor conditions in Texas family detention centers and calling for expanded independent monitoring. Government attorneys argued that the FSA hampered the administration’s immigration enforcement efforts, with the judge describing those and other arguments in favor of ending the FSA as “déjà vu,” with her Aug. 15 order echoing the same sentiment. “There is nothing new under the sun regarding the facts or the law,” she wrote, calling the government’s motion a repeat of prior failed attempts. Gee added that while federal agencies have improved conditions in some facilities, “to suggest that the agreement should be abandoned because some progress has been made is nonsensical.” Gee’s ruling leaves the Flores settlement in place, meaning that the Trump administration remains bound by the 72-hour transfer rule and 20-day limit on family detention. The Epoch Times has reached out to DHS for comment on the ruling. The Associated Press contributed to this report. Tyler Durden Sun, 08/17/2025 - 18:40",
    "publishedAt": "2025-08-17T22:40:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.897Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5fcdce01"
  },
  {
    "id": "bloomberg-markets-4ea2820b",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "NAB Sorry for Mispaying Bank Staff, Takes $85 Million Hit",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/national-australia-bank-profit-steady-on-business-loan-growth",
    "summary": "National Australia Bank Ltd. said staff payment errors will cost it another A$130 million ($85 million), the latest stain on one of the nation’s top banks that’s grappled for years with problems of underpaying employees.",
    "fullContent": "National Australia Bank Ltd. said staff payment errors will cost it another A$130 million ($85 million), the latest stain on one of the nation’s top banks that’s grappled for years with problems of underpaying employees.",
    "publishedAt": "2025-08-17T22:10:01.000Z",
    "fetchedAt": "2025-08-18T02:33:32.696Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ea2820b"
  },
  {
    "id": "zerohedge-39b75124",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "\"Learn To Code\" Propaganda Turned Out To Be Terrible Advice",
    "url": "https://www.zerohedge.com/ai/learn-code-propaganda-turned-out-be-terrible-advice",
    "summary": "\"Learn To Code\" Propaganda Turned Out To Be Terrible Advice For about a decade, big tech firms, the government, and corporate media outlets pushed endless streams of propaganda at young people to \"learn to code,\" luring them with promises of six-figure salaries and job security.",
    "fullContent": "\"Learn To Code\" Propaganda Turned Out To Be Terrible Advice For about a decade, big tech firms, the government, and corporate media outlets pushed endless streams of propaganda at young people to \"learn to code,\" luring them with promises of six-figure salaries and job security. That hype fueled a boom in computer science majors, with the number of undergraduates more than doubling since 2014. But the coding-boom narrative has since collapsed, and a growing number of computer science graduates are finding few opportunities - some even ending up in fast-food jobs at chains like Chipotle. \"Learn to code\" actually turned out to be very terrible advice. Take the corporate media news matrix: According to Bloomberg data, the story count of \"learn to code\" exploded between 2015 and early 2021. Post 2021, those stories have dramatically subsided as reality sets in, and layoffs at major tech companies like Amazon and Microsoft, combined with the rapid adoption of AI coding tools, have left many graduates unable to land jobs, according to The New York Times. Data via Bloomberg... \"The rhetoric was, if you just learned to code, work hard, and get a computer science degree, you can get six figures for your starting salary,\" Manasi Mishra, now 21, who was quoted by the NYT. Mishra said in a viral TikTok video this summer that \"I just graduated with a computer science degree, and the only company that has called me for an interview is Chipotle.\" The NYT pointed out that unemployment among computer science and engineering grads has risen as high as 7.5%, which is more than double that of art history or biology majors. In a recent questionnaire, the NYT asked recent college grads from the Universities of Maryland, Texas, and Washington, as well as private schools like Cornell and Stanford, about their job searches. Some respondents said the tech industry had \"gaslit\" them about their career pathways, while others described the experience as \"bleak,\" \"disheartening,\" or \"soul-crushing.\" Zach Taylor, who earned a computer science degree from Oregon State University in 2023, told NYT he applied to 5,762 tech jobs. He said this effort only resulted in 13 job interviews and no full-time job offers. He called the whole job search game \"the most demoralizing experience I have ever had to go through.\" \"Computing graduates are feeling particularly squeezed because tech firms are embracing A.I. coding assistants, reducing the need for some companies to hire junior software engineers,\" the outlet said, adding, \"The trend is evident in downtown San Francisco, where billboard ads for A.I. tools like CodeRabbit promise to debug code faster and better than humans.\" Yet, is the terrible job market for computer science majors really because of the proliferation of AI, or is there another problem? Already a well-understood issue among readers... UBS: do NOT learn to code pic.twitter.com/SQUlN27h4z — zerohedge (@zerohedge) February 4, 2024 There may be a confluence of issues, perhaps some AI, but what about big tech firms outsourcing jobs to cheap foreign labor - something the NYT article did not mention... Us: \"you guys sent all the rural jobs overseas\" Them: \"lol, move to the city & learn to code\" Us: \"okay\" Them: \"LMAO, H-1Bs go BRRRRRRR\" pic.twitter.com/2fDoqj1Vc8 — Jolly Roger (@Totally_Brandon) August 11, 2025 . . . Tyler Durden Sun, 08/17/2025 - 18:05",
    "publishedAt": "2025-08-17T22:05:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.897Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39b75124"
  },
  {
    "id": "bloomberg-markets-40273def",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Steady as Focus Shifts to Zelenskiy Meet After Putin Summit",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/latest-oil-market-news-and-analysis-for-aug-18",
    "summary": "Oil steadied as traders turned their attention to Donald Trump’s meeting with Volodymyr Zelenskiy on Monday, with the Ukrainian leader facing US pressure to reach a peace deal with Russia that involves ceding territory.",
    "fullContent": "Oil steadied as traders turned their attention to Donald Trump’s meeting with Volodymyr Zelenskiy on Monday, with the Ukrainian leader facing US pressure to reach a peace deal with Russia that involves ceding territory.",
    "publishedAt": "2025-08-17T22:04:18.000Z",
    "fetchedAt": "2025-08-18T02:33:32.696Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "40273def"
  },
  {
    "id": "marketwatch-5b9fe1e2",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Walmart and rivals report earnings, for the clearest look yet at tariffs&#x2019; impact on consumers. Will CEOs talk about the elephant in the room?",
    "url": "https://www.marketwatch.com/story/walmart-and-rivals-report-for-the-clearest-look-at-the-consumer-yet-will-ceos-talk-about-the-elephant-in-the-room-c17d9f55?mod=mw_rss_topstories",
    "summary": "The nation&#x2019;s biggest retailer reports results on Thursday as signs emerge that U.S. tariffs could be nudging prices higher.",
    "fullContent": "The nation&#x2019;s biggest retailer reports results on Thursday as signs emerge that U.S. tariffs could be nudging prices higher.",
    "publishedAt": "2025-08-17T21:36:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.430Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5b9fe1e2"
  },
  {
    "id": "novara-media-youtube-5ef2758c",
    "sourceId": "novara-media-youtube",
    "sourceName": "Novara Media YouTube",
    "title": "How The British Created The Crisis in Palestine | Ash Sarkar Meets William Dalrymple",
    "url": "https://www.youtube.com/watch?v=t8nPARlUj1U",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T21:33:15.000Z",
    "fetchedAt": "2025-08-18T02:34:00.764Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5ef2758c"
  },
  {
    "id": "bloomberg-markets-39dbabaf",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "A2 Milk to Buy New Zealand Formula Plant to Target China Growth",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/a2-milk-to-buy-new-zealand-formula-plant-to-target-china-growth",
    "summary": "A2 Milk Co. has agreed to buy a New Zealand infant formula plant as it targets more growth in China.",
    "fullContent": "A2 Milk Co. has agreed to buy a New Zealand infant formula plant as it targets more growth in China.",
    "publishedAt": "2025-08-17T21:23:53.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39dbabaf"
  },
  {
    "id": "fortune-7d9c119c",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Air Canada flight attendants defy return-to-work order, forcing airline to delay plans to resume flights",
    "url": "https://fortune.com/2025/08/17/air-canada-strike-flight-attendants-union-defy-return-to-work-order-flights/",
    "summary": "The shutdown of Canada’s largest airline early Saturday was impacting about 130,000 people a day. Air Canada operates around 700 flights per day.",
    "fullContent": "The shutdown of Canada’s largest airline early Saturday was impacting about 130,000 people a day. Air Canada operates around 700 flights per day.",
    "publishedAt": "2025-08-17T21:09:25.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d9c119c"
  },
  {
    "id": "bloomberg-politics-6ef1ab9a",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump’s Peace-Deal Demands Leave Zelenskiy With Only Bad Options",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/trump-s-peace-deal-demands-leave-zelenskiy-with-only-bad-options",
    "summary": "Volodymyr Zelenskiy finds himself in an impossible bind: risk Donald Trump’s wrath or accept a quick deal to end Russia’s war in Ukraine by paying the disastrous price of ceding territory for vague security guarantees that could see Moscow come back stronger in a few years’ time.",
    "fullContent": "Volodymyr Zelenskiy finds himself in an impossible bind: risk Donald Trump’s wrath or accept a quick deal to end Russia’s war in Ukraine by paying the disastrous price of ceding territory for vague security guarantees that could see Moscow come back stronger in a few years’ time.",
    "publishedAt": "2025-08-17T21:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6ef1ab9a"
  },
  {
    "id": "oil-price-8117c7a",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Energy Dividend Aristocrats Shine Amid Market Uncertainty",
    "url": "https://oilprice.com/Energy/Energy-General/Energy-Dividend-Aristocrats-Shine-Amid-Market-Uncertainty.html",
    "summary": "With U.S. markets trading close to record highs, many investors are now turning to dividend-paying stocks as they try to balance growth and income. Dividend investing provides a predictable and reliable source of cash flow that can complement other forms of income.",
    "fullContent": "With U.S. markets trading close to record highs, many investors are now turning to dividend-paying stocks as they try to balance growth and income. Dividend investing provides a predictable and reliable source of cash flow that can complement other forms of income. Dividend stocks can also help protect your portfolio when the stock market loses steam, with predictions of a market crash growing. Studies have shown that dividend-paying stocks tend to hold up much better during market downturns, with an interesting study finding that they declined…",
    "publishedAt": "2025-08-17T21:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.214Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "8117c7a"
  },
  {
    "id": "cnbc-tv18-youtube-c764ad4",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Rahul Gandhi Padyatra Live from Sasaram : Bihar में SIR के खिलाफ राहुल की पद यात्रा | Tejashwi Yadav",
    "url": "https://www.youtube.com/watch?v=kdQ73Mu-__g",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T20:56:46.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "c764ad4"
  },
  {
    "id": "zerohedge-209e460f",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Judge Expands Restraining Order Against Beto O'Rourke Over Alleged 'Beto Bribes'",
    "url": "https://www.zerohedge.com/political/judge-expands-restraining-order-against-beto-orourke-over-alleged-beto-bribes",
    "summary": "Judge Expands Restraining Order Against Beto O'Rourke Over Alleged 'Beto Bribes' A Texas judge has tightened the legal vise on former U.S. Rep. Beto O’Rourke, slapping him and his political group, Powered by People, with an expanded restraining order that also ropes in ActBlue...",
    "fullContent": "Judge Expands Restraining Order Against Beto O'Rourke Over Alleged 'Beto Bribes' A Texas judge has tightened the legal vise on former U.S. Rep. Beto O’Rourke, slapping him and his political group, Powered by People, with an expanded restraining order that also ropes in ActBlue and any banks handling their funds. The move came Saturday after Attorney General Ken Paxton filed an urgent motion a day earlier, accusing O’Rourke’s outfit of funneling cash to Democrats who fled the state to derail redistricting votes. Eight days ago, a district court first barred O’Rourke’s group from raising or distributing money to the runaway lawmakers. But the Democrat firebrand thumbed his nose at the order - holding rallies, posting fundraising videos online, and defiantly declaring, “Still here, still raising and rallying to stop the steal of 5 congressional seats in Texas.” That open defiance pushed Paxton to seek contempt charges. In an amended filing, he demanded Powered by People’s charter be revoked, blasting O’Rourke for “deceptively fundraising and handing out ‘Beto Bribes’” to lawmakers in exchange for abandoning their posts. O’Rourke and Powered by People \"have deceived donors, bought off Texas politicians, and unlawfully assisted runaway Democrats in avoiding arrest,” Paxton charged, adding that the court should “throw Beto behind bars” and shut the group down, Just the News reports. The AG’s complaint went further - accusing the organization of steering donations into luxury perks like private jets, swanky hotels, and fine dining “disconnected from any legitimate legislative purpose.\" According to the amended complaint, \"O’Rourke and Powered by People are directing consumers to political fundraising platforms, such as ActBlue, for the express political purpose of ‘fight[ing]’ Republicans and protecting Democratic seats from ‘corrupt republicans,’ meanwhile the funds are actually being used for lavish personal expenditures (i.e. travel on private jets, luxury hotel accommodations, and fine dining that is disconnected from, and has no legitimate purpose relating to, their legislative positions).\" Judge Megan Fahey agreed the state faced “imminent harm,” expanding the order through Sept. 5 and setting a Sept. 2 hearing on a possible injunction. She ruled the fundraising violated Texas consumer protection laws, saying it “harms Texas consumers” and that freezing the cash flow was in the public interest. Paxton wasted no time in declaring victory: “His fraudulent attempt to pad the pockets of the rogue cowards abandoning Texas has been stopped, and now the court has rightly frozen his ability to continue to send money outside of Texas. The cabal of Democrats who have colluded together to scam Texans and derail our Legislature will face the full force of the law, starting with Robert Francis O’Rourke.” Still, O’Rourke showed no signs of backing down. On Saturday he headlined another rally in Austin, thanking supporters “in this fight for Texas” and boasting that more than $1 million had already been donated to the Texas Legislative Black Caucus, the Texas House Democratic Caucus, and the Mexican American Legislative Caucus during the special session. Tyler Durden Sun, 08/17/2025 - 16:55",
    "publishedAt": "2025-08-17T20:55:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.897Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "209e460f"
  },
  {
    "id": "fortune-5561c92f",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Fed Chair Jerome Powell may seriously disappoint Wall Street at Jackson Hole",
    "url": "https://fortune.com/2025/08/17/jerome-powell-jackson-hole-speech-preview-fed-rate-cuts-tariffs-inflation-jobs/",
    "summary": "\"It will be difficult for policymakers to tease out one-off tariff effects from longer-lasting inflationary pressures.\"",
    "fullContent": "\"It will be difficult for policymakers to tease out one-off tariff effects from longer-lasting inflationary pressures.\"",
    "publishedAt": "2025-08-17T20:44:20.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5561c92f"
  },
  {
    "id": "techmeme-265f8646",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Interview with Trent Brunson, R&D director at cybersecurity firm Trail of Bits, which won $3M and 2nd place in DARPA's AI Cyber Challenge, behind Team Atlanta (Patrick Howell O'Neill/Bloomberg)",
    "url": "http://www.techmeme.com/250817/p11#a250817p11",
    "summary": "Patrick Howell O'Neill / Bloomberg: Interview with Trent Brunson, R&D director at cybersecurity firm Trail of Bits, which won $3M and 2nd place in DARPA's AI Cyber Challenge, behind Team Atlanta — Last week, the Pentagon's long AI Cyber Challenge, or AIxCC, came to a head...",
    "fullContent": "Patrick Howell O'Neill / Bloomberg: Interview with Trent Brunson, R&D director at cybersecurity firm Trail of Bits, which won $3M and 2nd place in DARPA's AI Cyber Challenge, behind Team Atlanta — Last week, the Pentagon's long AI Cyber Challenge, or AIxCC, came to a head onstage in Las Vegas.",
    "publishedAt": "2025-08-17T20:35:25.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "265f8646"
  },
  {
    "id": "wsj-opinion-547c4a9d",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "What Kind of Peace in Ukraine?",
    "url": "https://www.wsj.com/opinion/what-kind-of-peace-in-ukraine-russia-summit-trump-putin-f5daf72f",
    "summary": "A good or bad agreement may depend on the quality of Western security guarantees.",
    "fullContent": "A good or bad agreement may depend on the quality of Western security guarantees.",
    "publishedAt": "2025-08-17T20:24:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "547c4a9d"
  },
  {
    "id": "wsj-world-news-72515c7f",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | What Kind of Peace in Ukraine?",
    "url": "https://www.wsj.com/opinion/what-kind-of-peace-in-ukraine-russia-summit-trump-putin-f5daf72f",
    "summary": "A good or bad agreement may depend on the quality of Western security guarantees.",
    "fullContent": "A good or bad agreement may depend on the quality of Western security guarantees.",
    "publishedAt": "2025-08-17T20:24:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.296Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "72515c7f"
  },
  {
    "id": "wsj-opinion-7c0a8050",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Phantom Patients of ObamaCare",
    "url": "https://www.wsj.com/opinion/the-phantom-patients-of-obamacare-d875e2ae",
    "summary": "Nearly 12 million enrollees don&#x2019;t bother to use their subsidized insurance. Health insurers get the benefit.",
    "fullContent": "Nearly 12 million enrollees don&#x2019;t bother to use their subsidized insurance. Health insurers get the benefit.",
    "publishedAt": "2025-08-17T20:22:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "7c0a8050"
  },
  {
    "id": "wsj-opinion-161be02d",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Sean O&#x2019;Brien Has a Credit Card for You",
    "url": "https://www.wsj.com/opinion/sean-obrien-has-a-credit-card-for-you-4e2a0789",
    "summary": "The Teamsters offer a &#x2018;privilege&#x2019; card with, er, sky-high interest rates.",
    "fullContent": "The Teamsters offer a &#x2018;privilege&#x2019; card with, er, sky-high interest rates.",
    "publishedAt": "2025-08-17T20:21:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "161be02d"
  },
  {
    "id": "zerohedge-2a87a6db",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "We Got Some Data, But It Didn't Change Peoples' Minds",
    "url": "https://www.zerohedge.com/markets/we-got-some-data-it-didnt-change-peoples-minds",
    "summary": "We Got Some Data, But It Didn't Change Peoples' Minds Submitted By Peter Tchir of Academy Securities I did not know refried beans are not, in fact, fried twice, but it still seemed like a decent working title for a report where we will highlight what we’ve learned on the...",
    "fullContent": "We Got Some Data, But It Didn't Change Peoples' Minds Submitted By Peter Tchir of Academy Securities I did not know refried beans are not, in fact, fried twice, but it still seemed like a decent working title for a report where we will highlight what we’ve learned on the topics we covered in last weekend’s Tariffs, AI and ProSec. The Alaska Summit largely met Academy’s Geopolitical Intelligence Group’s cautious predictions. It didn’t end up with new, tougher sanctions, nor did it wind up with a ceasefire. It seems to have set the stage for Zelensky to meet with President Trump, maybe to set up a trilateral meeting in the future? Probably not going to matter much to markets unless we get some leaks that a lot more was agreed to behind the scenes than was let on at the press conference. Academy had a busy Friday on Bloomberg TV (6:00 mark), Bloomberg Radio (9:45 mark), and Tom Keene’s Single Best Idea podcast. We covered a variety of topics with a lot of good feedback on our takes on both radio and TV (it helps when the news flow fits right into your narratives – the war in Ukraine, ProSec (Production for Security), the Fed, jobs, and inflation). Let’s zip through a few things we learned this week that are impacting our outlook on the three main themes that we have been focused on. Inflation The only thing I’m “certain” about after the inflation data this week is that the data is confusing. Separate from all of our usual arguments and complains (Owners’ Equivalent Rent, etc.), it is extremely difficult to judge the “steady state” of the economy when corporations (and even individuals) have been altering their behavior to first get ahead of tariffs and then to deal with the evolving tariff rates. Teasing out what was pulled forward, or what was delayed, is extremely difficult. That “issue” also makes it even more difficult than usual to gain a lot of useful information from consumer spending. Academy did get a nice and a “fun” quote in the FT after the PPI release, which we view as a relatively 2nd tier report in terms of providing a lot of useful insight into the direction that inflation is headed. Sad to say, but the assessment here is that we got some data, but it didn’t change peoples’ minds. You could cherry pick what you wanted to back almost any narrative. Most of us (I believe) are left with our inflation outlooks intact as the data just wasn’t compelling enough to change outlooks. Electricity We published a report on A “New” Interesting Chart – Electricity CPI Inflation. The response was quite extraordinary, and we have a deluge of material to go through that clients thought would be helpful in thinking about the electricity industry (trying to get away from the natural word association of energy = oil, to energy = electricity/power more broadly). This theme has implications for AI/Data Centers, but also possibly manufacturing as a whole. Not to mention the consumer element. While this is something that we have been talking about for some time, it feels like we have underestimated just how important (even crucial) this is, and we haven’t done enough to figure out how great the opportunities are. Yes, a lot has been priced in (XLU, a utility ETF, is up more than QQQ YTD and over the past year), which as a contrarian by nature would give me pause, as it seems like this story might not even be close to being played out. My concern is that we thought we were thinking about this at the varsity level, but it may have been only at the JV or even freshman level. We are going to be spending more time digging into this for the opportunities and for the risks. ProSec and Sovereign Wealth Until someone gives us a better acronym or name for our National Production for National Security theme, we are going to try to get ProSec to catch on. It might be a losing battle (it really isn’t that catchy ), but we haven’t given up just yet. The Intel news was the biggest news in this space on the week. The Intel CEO first seemed to be in the President’s doghouse last week, then moved to having an “interesting” story this week, then transitioned to a potential investment in Intel by the U.S. government. We continue to believe that the government will take action to spur domestic growth (and some element of control) over industries crucial to national security (chips, pharma, biotech, and many commodities, and more importantly, the processed or refined versions of those commodities). The accelerated depreciation dovetails well with these attempts. MP organized an investment with funds from Department of Defense. They were also able to borrow at presumably favorable rates as part of the DOD’s efforts to get them more capital. This is an investment and if it turns out to be a good one, then the American public will benefit from this ownership (rather than via subsidies or other methods that largely accrue to the receivers). The “chatter” is that if an investment is to be made, it could possibly come from funds allocated to the CHIPS Act. While subsidies, etc. and other provisions of the CHIPS Act helped the company, little went to benefit the entire nation. The CHIPS Act also had a lot of rules about how companies could behave if they wanted the CHIPS Act money, something that dramatically slowed demand for that money. The intangible costs seemed high to many in the industry. An investment (and presumably a push on the debt side, like the MP deal) could provide capital that can be used more efficiently by the beneficiary, while at the same time, giving American taxpayers the possibility to benefit from the upside of the investment (if it turns out to be a good one). The “template” for what this administration wants to do on the ProSec side of things seems to be developing and could be very interesting. The two deals (one that was done and one that is just in discussion) are interesting, but are a bit “ad hoc.” To truly develop the template, the government is likely going to need something akin to a Sovereign Wealth Fund to make these types of deals programmatic rather than a one off (if that is truly the direction we are headed). I see no problem with a nation that is in debt having investments as part of the asset side of the equation. To a large degree, investments (rather than subsidies or handouts) seem better for the taxpayer, but some of the latter are likely going to be required to enable this style on a greater scale – across many more areas of national security importance. Expect positives in this arena and in the closely associated arena of DEREGULATION More Than National Security Last weekend we briefly discussed a more “altruistic” benefit (that the jobs in these areas will seem more “secure” to their holders). Letting those working feel more content (assuming job security makes most people more content as they have fewer things to worry about). Could it even have a “sense of pride” instilled into it? Yeah, now we are going full “rose-colored” glasses, but there may be something to the “intangible” benefits of industry around security. Too Much Control? OK, just to prove that the T-Report hasn’t been replaced by a pod (attempted reference to Invasion of the Body Snatchers, where the ending with Donald Sutherland’s character turning on them still creeps me out), we need to bring up this subject, which is lurking in the background. This administration, to some extent, seems to be getting more directly involved in things that can have an immediate effect on the bottom line and the future of companies (or industries). Direct Investments. What control will be exerted? Will any special benefits be received? Can tariff policy be altered to help? What is the impact, if any, on competitors that don’t receive government investment? Special Export “Charges.” Paying a few to sell certain goods to certain countries may help balance corporate needs with national security interests. But that could also be a slippery slope. Industry or even company specific tariffs. It isn’t that difficult to see that while well-crafted policies can drive the turnaround in domestic manufacturing the administration wants, it could also become a very difficult world for CEOs to navigate. I’m not lying awake at night worrying about this, but it is certainly something that causes my “Spidey- sense” to tingle. We might not have addressed it, but it felt like the two previous sections needed a counterbalance. Quick Crypto Corner In our work, we’ve been thinking that Ethereum would benefit the most from the current push on stablecoins prompted by regulation and the GENIUS ACT. It is “modular” and can be part of many projects. Institutions seem to prefer it to Solana for example. It has a “use” case, very different than Bitcoin, which currently seems to have a “scarcity” and governments are back to the case of printing money. We should continue to see active trading in crypto as new products are developed and launched. Products that provide ACCESS should continue to do well. Anything from stablecoins designed for various audiences (some stablecoins may wind up “specializing” in a certain type of investor, for example). Certain products have limited or no ability to pass on either interest from holdings or revenue/fees from “staking.” Solutions to those issues will likely be met with demand. You see this in the ETF flows as well, where since the end of June inflows into ETH ETFs have outstripped inflows into Bitcoin ETFs, though both have done well. Definitely an area of renewed excitement and growth as investors and companies try to take advantage of the landscape that this administration has created, not just the traditional crypto community, but also potentially new entrants – anything from startups to household names. Expect more on this, and the “concept” we laid out in Crypto Privateers is getting more, rather than less, interest as people have taken Academy up on our offer to discuss or brainstorm what to do about crypto crime, especially from Nation State/Nation State-Sponsored criminals. The Bond Market Look for the bond market to continue to move towards pricing in 3, or maybe 4 cuts. One interesting thing about how the search for potential candidates is being conducted is that the market is exposed to interview after interview of prominent figures who are all advocating for rate cuts. I think that is an interesting approach and while inflation may make that difficult, my belief is that the job market will nudge the Fed along faster than is currently being priced in. The long end will continue to struggle as it has to price in uncertainty about the quality of data or the willingness of the Fed, going forward, to treat data in the way it had been treated in the past. Not necessarily a bad thing as we try to ignore “garbage data” and focus on where the puck is going, not where it has been, but that could cause longer dated yields to remain stubbornly high, relative to front end yields. Which leads me to what I think is the next obvious question – what will the Fed do if 10s (or 30s) stay higher than where the administration thinks they should be? The admin has had goals of getting 10s to a 3 handle, so couldn’t we see versions of Operation Twist done to achieve that goal? Lots to be done before we get to something like true yield curve control, but people seem so fixated on whether people would cut or not, and not interested enough on what future potential Fed picks would do with policy to impact the longer end of the yield curve. Seriously, if we want lower mortgage rates, the admin will need to do something on 10s and I expect cuts alone won’t get us there as the risk premium will grow. Not sure I’m at the point of “pounding the table” that flatteners are interesting here, but I think that we may be getting to that point. Equities Largely unchanged from last week. Be careful on many of the high-flyers as a lot of good is priced in and there is some resistance, at least in the narrative, starting to develop. Look for companies that can benefit from ProSec to do well, and after the news around INTC this week, expect the search for those types of companies to intensify as it could be a catalyst to “unlock” value – which often seems difficult to unlock. Finally, my fears remain that the smaller and less well-capitalized companies (many private) will have more difficulty navigating the tariffs, as much as I’d like to see them break out and take over the leadership of the market. Bottom Line The Central Banks may push back on cuts a bit at Jackson Hole, but I don’t think markets will believe it for long. It all still comes down to growth, what is priced in, and you have our thoughts on that. For those in the corporate debt market, presumably it will be a bit slower in the last two weeks of August than it has been, but spreads are tight, demand is strong, and yields are at decent levels, so there may be very little rest this summer for corporate bond investors. It is a bit scary how quickly Labor Day (and the “official” end of summer) is approaching since it hasn’t felt very quiet or dull at all! Tyler Durden Sun, 08/17/2025 - 16:20",
    "publishedAt": "2025-08-17T20:20:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.899Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2a87a6db"
  },
  {
    "id": "wsj-opinion-19d0a462",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Coming Robot Home Invasion",
    "url": "https://www.wsj.com/opinion/the-coming-robot-home-invasion-82ff1218",
    "summary": "What I want is a device to clean up late after a dinner party so&#xa0;I can go to bed.",
    "fullContent": "What I want is a device to clean up late after a dinner party so&#xa0;I can go to bed.",
    "publishedAt": "2025-08-17T20:19:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "19d0a462"
  },
  {
    "id": "wsj-opinion-5508db17",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Don&#x2019;t Bomb Mexico, Mr. President",
    "url": "https://www.wsj.com/opinion/dont-bomb-mexico-mr-president-75bcc45f",
    "summary": "There are better ways of fighting the drug cartels&#x2014;and Claudia Sheinbaum will help.",
    "fullContent": "There are better ways of fighting the drug cartels&#x2014;and Claudia Sheinbaum will help.",
    "publishedAt": "2025-08-17T20:18:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "5508db17"
  },
  {
    "id": "wsj-world-news-77c91107",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Don&#x2019;t Bomb Mexico, Mr. President",
    "url": "https://www.wsj.com/opinion/dont-bomb-mexico-mr-president-75bcc45f",
    "summary": "There are better ways of fighting the drug cartels&#x2014;and Claudia Sheinbaum will help.",
    "fullContent": "There are better ways of fighting the drug cartels&#x2014;and Claudia Sheinbaum will help.",
    "publishedAt": "2025-08-17T20:18:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.296Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "77c91107"
  },
  {
    "id": "wsj-opinion-26cab4f5",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Will E.J. Antoni Raise Your Taxes?",
    "url": "https://www.wsj.com/opinion/will-e-j-antoni-raise-your-taxes-77170e73",
    "summary": "That&#x2019;s what will happen if he produces overly optimistic inflation numbers.",
    "fullContent": "That&#x2019;s what will happen if he produces overly optimistic inflation numbers.",
    "publishedAt": "2025-08-17T20:15:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "26cab4f5"
  },
  {
    "id": "wsj-opinion-64f60c54",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "AI Won&#x2019;t Replace Historians",
    "url": "https://www.wsj.com/opinion/ai-wont-replace-historians-3b68751c",
    "summary": "A chatbot can summarize existing knowledge. New knowledge requires the spark of human creativity.",
    "fullContent": "A chatbot can summarize existing knowledge. New knowledge requires the spark of human creativity.",
    "publishedAt": "2025-08-17T20:14:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "64f60c54"
  },
  {
    "id": "wsj-opinion-2b410616",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Time to Shut Down the Failed U.N. Lebanon Mission",
    "url": "https://www.wsj.com/opinion/time-to-shut-down-the-failed-u-n-lebanon-mission-7075a0ff",
    "summary": "The U.S. should veto the Security Council resolution to extend Unifil&#x2019;s mandate.",
    "fullContent": "The U.S. should veto the Security Council resolution to extend Unifil&#x2019;s mandate.",
    "publishedAt": "2025-08-17T20:10:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "2b410616"
  },
  {
    "id": "wsj-world-news-17c3e8b4",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Time to Shut Down the Failed U.N. Lebanon Mission",
    "url": "https://www.wsj.com/opinion/time-to-shut-down-the-failed-u-n-lebanon-mission-7075a0ff",
    "summary": "The U.S. should veto the Security Council resolution to extend Unifil&#x2019;s mandate.",
    "fullContent": "The U.S. should veto the Security Council resolution to extend Unifil&#x2019;s mandate.",
    "publishedAt": "2025-08-17T20:10:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.296Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "17c3e8b4"
  },
  {
    "id": "marketwatch-512c01c9",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "How safe are cruise-ship water slides? A recent incident on a Royal Caribbean sailing raises concerns.",
    "url": "https://www.marketwatch.com/story/how-safe-are-cruise-ship-water-slides-a-recent-incident-on-a-royal-caribbean-sailing-begs-the-question-7c565d82?mod=mw_rss_topstories",
    "summary": "The slides are an increasingly popular attraction on many of the mega vessels operated by cruise lines.",
    "fullContent": "The slides are an increasingly popular attraction on many of the mega vessels operated by cruise lines.",
    "publishedAt": "2025-08-17T20:06:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.430Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "512c01c9"
  },
  {
    "id": "marketwatch-4e189345",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Investors are plowing into homebuilder stocks. Will Jackson Hole prove them wrong?",
    "url": "https://www.marketwatch.com/story/investors-are-plowing-into-homebuilder-stocks-will-jackson-hole-prove-them-wrong-adff93ec?mod=mw_rss_topstories",
    "summary": "Previously unloved stocks are making a big comeback before Jackson Hole, the Federal Reserve&#x2019;s annual summer economic summit.",
    "fullContent": "Previously unloved stocks are making a big comeback before Jackson Hole, the Federal Reserve&#x2019;s annual summer economic summit",
    "publishedAt": "2025-08-17T20:03:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.430Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4e189345"
  },
  {
    "id": "bloomberg-markets-4e012b5f",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Advent Seeks to Buy Swiss Chipmaker U-blox in $1.3 Billion Deal",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/advent-seeks-to-buy-swiss-chipmaker-u-blox-in-1-3-billion-deal",
    "summary": "Advent International offered to buy U-blox Holding AG, a Swiss maker of positioning chips, in a deal valued at about 1.05 billion Swiss francs ($1.3 billion).",
    "fullContent": "Advent International offered to buy U-blox Holding AG, a Swiss maker of positioning chips, in a deal valued at about 1.05 billion Swiss francs ($1.3 billion).",
    "publishedAt": "2025-08-17T19:58:17.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4e012b5f"
  },
  {
    "id": "zerohedge-6877075e",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Trump Pushing For Summit With Putin & Zelensky Next Friday",
    "url": "https://www.zerohedge.com/geopolitical/trump-pushing-summit-putin-zelensky-next-friday",
    "summary": "Trump Pushing For Summit With Putin & Zelensky Next Friday President Trump has stated in the wake of the historic Alaska summit that he and Russian President Vladimir Putin had a productive meeting, but they were unable to reach an agreement on a ceasefire or peace deal for...",
    "fullContent": "Trump Pushing For Summit With Putin & Zelensky Next Friday President Trump has stated in the wake of the historic Alaska summit that he and Russian President Vladimir Putin had a productive meeting, but they were unable to reach an agreement on a ceasefire or peace deal for Ukraine. \"We didn't get there\" on a ceasefire, Trump described. And yet there appears to be real momentum this time, coming out of Alaska. Ukrainian President Zelensky is meanwhile set to arrive in Washington Monday to discuss peace in the Oval Office. Of course, talks didn't go so well last time - and there's likely to be persisting tensions - given that the conflict, as explained by Putin on Friday, would never have happened if Trump had been president, something which Trump himself has long asserted. Trump had told European leaders in a post-summit call that he's now seeking a trilateral summit with Putin and Zelensky as soon as next Friday, according to sources in Axios. \"I think the meeting was a 10,” Trump said in a post-summit interview with Fox News. \"In the sense, we got along great, and it’s good when two big powers get along, especially when they’re nuclear powers. We’re No. 1 and they’re No. 2 in the world.\" Trump speaks by phone with Ukrainian President Volodymyr Zelensky aboard Air Force One on Saturday. Official WH photo And yet Putin's firm conditions make such a trilateral summit unlikely at such a near date - also given the Russian president has in the recent past made clear he would only meet with Zelensky if the two were ready to sign a deal, or essentially already at the goal line. The Kremlin has still maintained that Zelensky doesn't have legal legitimacy, given the cancelation of elections in Ukraine and extension far past his term expiration. According to more from Axios, this is where things stand in terms of Putin's demands, based on admin sources: They said Putin had demanded that Ukraine cede two of the four regions to which Russia has laid claim (Donetsk and Luhansk), and freeze the front lines in the other two (Kherson and Zaporizhzhia). Russia controls nearly all of Luhansk, but only about three-quarters of Donetsk. Putin presented his willingness to stop pushing forward in Kherson and Zaporizhzhia as a concession, in exchange for Ukraine withdrawing from Donetsk, one source briefed on the call said. In reality, Russia hasn't made any progress in those areas for some time. A Ukrainian source said the U.S. side had the impression Putin was willing to negotiate over the small slivers of the Sumy and Kharkiv regions under Russian control. If it is accurate that Putin is only demanding full political recognition for the Russian Federation over just two of the territories, this suggests Moscow is willing to make compromise - or at least have substantial top level discussions - to end the war, thought Western pundits are still calling these 'maximalist' demands. The hawks certainly don't want to entertain this. That real negotiations involving Putin, Trump, and Zelensky are opening up based on these aggressive White House diplomatic moves is a very positive development toward final settlement - though plenty of immense hurdles remain. For staters, with Zelensky headed back to D.C., his European backers are doing everything to ensure it is only Ukraine's maximum demands which are recognized. Rules-Based International Order: One set of rules for me, another set of rules for you pic.twitter.com/cTwp8TzVnJ — Glenn Diesen (@Glenn_Diesen) August 17, 2025 The popular X commentator Russian Markets points out the \"Germans are in panic as Zelensky goes alone to meet Trump, so all the EU leaders together with NATO’s chief are preparing to answer the questions Trump will put to Zelensky. So, do you see who is truly at war with Russia?\" As it stands, Zelensky has repeatedly assured his population and allies that Ukraine won't cede an inch of territory, and he's still not even offered political recognition of Crimea as Russia's. What Russia could permanently come away with if a final settlement is reached on the Kremlin's terms. Institute for the Study of War So a lot will be known by Monday after Zelensky's Oval Office visit - given he's going to have to bring some compromise to the table which is substantial, if there are hopes of finally ending the war. The question also remains: is Trump ready to exert the necessary pressure, and also push back against the hawks in Europe and in Congress? Tyler Durden Sun, 08/17/2025 - 15:45",
    "publishedAt": "2025-08-17T19:45:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.899Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6877075e"
  },
  {
    "id": "zerohedge-4c312774",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Health Care System To Pay More Than $1 Million To Settle COVID-19 Vaccine Mandate Case",
    "url": "https://www.zerohedge.com/covid-19/health-care-system-pay-more-1-million-settle-covid-19-vaccine-mandate-case",
    "summary": "Health Care System To Pay More Than $1 Million To Settle COVID-19 Vaccine Mandate Case Authored by Zachary Stieber via The Epoch Times (emphasis ours), A health care system that operates hospitals and clinics in two states has agreed to pay more than $1 million to settle...",
    "fullContent": "Health Care System To Pay More Than $1 Million To Settle COVID-19 Vaccine Mandate Case Authored by Zachary Stieber via The Epoch Times (emphasis ours), A health care system that operates hospitals and clinics in two states has agreed to pay more than $1 million to settle allegations it discriminated against religious employees. A COVID-19 vaccine is administered in Illinois on Sept. 9, 2022. Scott Olson/Getty Images Mercyhealth, which operates in Illinois and Wisconsin, reached the settlement after years of pre-litigation negotiations, following an investigation by the U.S. Equal Employment Opportunity Commission (EEOC). The probe found evidence that Mercyhealth engaged in discrimination by denying employees religious exemptions to its COVID-19 vaccine mandate. Mercyhealth also fired the workers, or lowered their wages, and discriminated against other workers by denying them a chance to even request religious accommodation, instead terminating them or withholding pay, according to the EEOC. “At the start of my tenure as acting chair of the EEOC, I committed to focusing our agency’s resources to address the very real problem of religious discrimination, and this resolution is just the beginning,” EEOC Acting Chair Andrea Lucas said in a statement. “This is an example of what our agency can accomplish when we work with employers to ensure that the doors of our workplaces are equally open to religious employees.” If a settlement was not reached, then Mercyhealth could have faced lawsuits alleging violations of Title VII of the Civil Rights Act of 1964. The law states in part that an employer cannot “fail or refuse to hire or to discharge any individual, or otherwise to discriminate against any individual with respect to his compensation, terms, conditions, or privileges of employment, because of such individual’s race, color, religion, sex, or national origin.” The settlement features back pay and damages to the workers and former workers who were affected. Mercyhealth has also agreed to re-distribute its policies, train personnel on how to handle religious accommodation requests, and report to the EEOC about the requests and decisions on system-wide vaccination programs. A Mercyhealth spokesperson confirmed that a settlement was reached. “Mercyhealth respects the religious beliefs and practices of its employees,” Kara Sankey, vice president of clinical operations and chief nursing officer for Mercyhealth, told The Epoch Times in an emailed statement Sankey said that the health system had lots of work to do during the COVID-19 pandemic, “while doing its best to protect the health and safety of its patients and employees and complying with federal rules requiring all hospital staff receive vaccinations.” She added: “The balancing of these critical goals could not be achieved without the dedication of our doctors and staff in times of significant personal risk, and Mercyhealth appreciates the work and assistance of the Equal Employment Opportunity Commission in resolving these remaining disputes. The process permits Mercyhealth to demonstrate its long-held commitment to employee rights and to close another chapter in its work during the pandemic.” Tyler Durden Sun, 08/17/2025 - 15:10",
    "publishedAt": "2025-08-17T19:10:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.900Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c312774"
  },
  {
    "id": "cnbc-tv18-youtube-71435fae",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "NDA Vice President Candiate Announcement LIVE : CP Radhakrishnan NDA के उपराष्ट्रपति उम्मीदवार |",
    "url": "https://www.youtube.com/watch?v=qQQPoBBX4mg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T19:02:48.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "71435fae"
  },
  {
    "id": "cnbc-tv18-youtube-2374e036",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Rahul Gandhi Vs Election Commission News : राहुल का नाम लिए बिना चुनाव आयोग का निशाना | Vote Chori",
    "url": "https://www.youtube.com/watch?v=In06SCoZ8OI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T19:00:24.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2374e036"
  },
  {
    "id": "bloomberg-markets-3298b1df",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "CEO Pay at FTSE 100 Firms Hit a Record High, Study Says",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/ceo-pay-at-ftse-100-firms-hit-a-record-high-study-says",
    "summary": "Annual pay for bosses of FTSE 100 companies hit a record high for the third consecutive year.",
    "fullContent": "Annual pay for bosses of FTSE 100 companies hit a record high for the third consecutive year.",
    "publishedAt": "2025-08-17T19:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3298b1df"
  },
  {
    "id": "oil-price-7705b20b",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "China Races to Dominate Latin America’s EV Market",
    "url": "https://oilprice.com/Energy/Energy-General/China-Races-to-Dominate-Latin-Americas-EV-Market.html",
    "summary": "As China continues to grow its electric vehicle (EV) industry, it has expanded to several new markets in recent years, opening multiple production and assembly plants across Latin America. Chinese EV companies now offer a wide variety of EV models at competitive prices, making...",
    "fullContent": "As China continues to grow its electric vehicle (EV) industry, it has expanded to several new markets in recent years, opening multiple production and assembly plants across Latin America. Chinese EV companies now offer a wide variety of EV models at competitive prices, making them well-suited to the Latin American market, with a growing uptake of Chinese EVs being seen in Brazil and Mexico. However, while its Latin America prospects might be good, developing successful nearshoring activities for the United States market is less certain due to…",
    "publishedAt": "2025-08-17T19:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.214Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "7705b20b"
  },
  {
    "id": "honest-broker-7de56d2b",
    "sourceId": "honest-broker",
    "sourceName": "The Honest Broker",
    "title": "How I Learned to Stop Worrying About Short-Term Results in My Career",
    "url": "https://www.honest-broker.com/p/how-i-learned-to-stop-worrying-about",
    "summary": "I won't make that mistake again",
    "fullContent": "I won't make that mistake again",
    "publishedAt": "2025-08-17T18:55:50.000Z",
    "fetchedAt": "2025-08-18T02:37:24.811Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "7de56d2b"
  },
  {
    "id": "business-insider-7505591e",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Here's how Figma's founders inspired an early investor",
    "url": "https://www.businessinsider.com/figma-founders-dylan-field-evan-wallace-early-investor-terrance-rohan-2025-8",
    "summary": "Terrence Rohan, managing director of the Otherwise Fund, was one of Figma's first backers. He spoke to BI about the traits he looks for in a founder.",
    "fullContent": "Terrence Rohan, managing director of the Otherwise Fund, was one of Figma's first backers. He spoke to BI about the traits he looks for in a founder.",
    "publishedAt": "2025-08-17T18:47:35.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7505591e"
  },
  {
    "id": "et-markets-548ba738",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Axis, Bandhan, Sammaan Capital tweak A/c practices to rewrite books",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bandhan-sammaan-capital-tweak-a/c-practices-to-rewrite-books/articleshow/123352811.cms",
    "summary": "The revised accounting policy helped Sammaan Capital's report ?661.6 crore gains. In contrast, Axis Bank, which tightened its policy, made additional provisioning of ?614 crore, impacting its earnings.",
    "fullContent": "The revised accounting policy helped Sammaan Capital's report ?661.6 crore gains. In contrast, Axis Bank, which tightened its policy, made additional provisioning of ?614 crore, impacting its earnings. Bandhan Bank implemented procedural changes in the collection of dues, which led to marginal rise in stressed loans, although it did not immediately impact its earnings.",
    "publishedAt": "2025-08-17T18:44:52.000Z",
    "fetchedAt": "2025-08-18T02:33:32.682Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "548ba738"
  },
  {
    "id": "cnbc-tv18-youtube-408fcba1",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "\"Bihar Elections में America के राष्ट्रपति वोट डालने आएंगे\"EC | Rahul | PM Modi | BJP #bhaiyajikahin",
    "url": "https://www.youtube.com/shorts/tIeHsJ9rq74",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:37:13.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "408fcba1"
  },
  {
    "id": "cnbc-tv18-youtube-5f84d082",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "मुंबई में बिल्डिंग की सीढ़ी ढही, तीन घायल #mumbai #shorts",
    "url": "https://www.youtube.com/shorts/HG7X53tbSg8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:35:46.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5f84d082"
  },
  {
    "id": "cnbc-tv18-youtube-52c9b9a3",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Top News LIVE : 18 August की खबरें| C. P. Radhakrishnan | Election Commission | Modi | Rahul Gandhi",
    "url": "https://www.youtube.com/watch?v=lzgK53SQuwo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:35:37.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "52c9b9a3"
  },
  {
    "id": "cnbc-tv18-youtube-7fff94f1",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "'दास्तान-ए-राहुल' क्या है? EC |Rahul Gandhi | PM Modi | BJP | Bihar Elections #bhaiyajikahin #shorts",
    "url": "https://www.youtube.com/shorts/9NEWTc5lra8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:35:17.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7fff94f1"
  },
  {
    "id": "zerohedge-744f0e31",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Sam Altman Quietly Taps Top Democrat Operatives To Help ChatGPT Plot For-Profit",
    "url": "https://www.zerohedge.com/ai/sam-altman-quietly-taps-top-democrat-operatives-help-chatgpt-plot-profit",
    "summary": "Sam Altman Quietly Taps Top Democrat Operatives To Help ChatGPT Plot For-Profit In his quest to see ChatGPT dominate the LLM race, OpenAI CEO Sam Altman is tapping veteran Democrat operatives \"who are well-connected to the Democratic establishment\" to grease the gears with...",
    "fullContent": "Sam Altman Quietly Taps Top Democrat Operatives To Help ChatGPT Plot For-Profit In his quest to see ChatGPT dominate the LLM race, OpenAI CEO Sam Altman is tapping veteran Democrat operatives \"who are well-connected to the Democratic establishment\" to grease the gears with California politicians in his quest to restructure and eventually go public, Politico reports. Left to right: Debbie Mesloh, Chris Lehane, Brian Brokaw, Ronnie Chatterji, Marisa Moret, Sam Altman, Ann O'Leary, Daniel Zingale, Peter Ragone, Laphonza Butler | Illustration by Claudine Hellmuth/POLITICO (source images via Francis Chung/POLITICO, Drew Altizer Photography, Linkedin, Rob Bennett/Office of Mayor de Blasio, Duke University, Georgetown University, San Francisco Bar, U.S. Senate) via Politico The political insiders include \"Bill Clinton’s former spin doctor Chris Lehane to Kamala Harris’ one-time bestie Debbie Mesloh and ex-Sen. Laphonza Butler,\" who OpenAI has quietly hired to effectively lobby for the company. It’s a notable deviation at a time when much of Silicon Valley is more focused on staffing up to chase influence in Republican-controlled Washington. And it’s among the most aggressive pushes to date from a tech company into Sacramento and other corridors of power in a state that birthed the industry, yet where firms had long been reluctant to engage directly at the levels of other major sectors. According to the report, OpenAI sees California as vital for its global ambitions - as well as a planned corporate makeover that California's Attorney General can shut down. \"Since the stakes are so high here for their profit, they’re willing to spend what it takes to get their way with the California attorney general,\" said Orson Aguilar, president of the nonprofit LatinoProsperity and prominent critic of OpenAI’s business transformation plans within the state, adding \"They’re bringing in some very big guns to make their case.\" At the heart of their campaign is OpenAI’s bid to change its business model, which is facing a lawsuit from Musk — the company’s co-founder turned rival — as well as an investigation by California Attorney General Rob Bonta. Central to the approach is sniffing out any potential whiff of Musk — a divisive figure to Californians and the omnipresent boogeyman in OpenAI’s righteous, dare they contend, underdog quest — when new criticisms arise, POLITICO’s reporting shows. -Politico OpenAI was founded as a nonprofit - with the stated goal of ensuring human-like AI benefits all of humanity, while Altman and crew now believe that the only way to keep up with the industry's explosive (and profitable) growth, is to restructure - a move which requires permission from Democrat regulators. To that end, Altman's new fleet of Democrat lobbyists are messaging that the company can still be a force for good, while batting away accusations from critics who argue that OpenAI has put profit over mission. As leverage, OpenAI has hinted that if they don't get their way they'll simply leave the state. \"That’s a question that folks should be thinking about because I do think that we want to be here,\" said OpenAI's chief global affairs officer, Chris Lehane. \"So I’m hoping folks make the right decision.\" Politico interviewed two dozen people who have worked with OpenAI or its new political hires, as well as those who have demanded answers from the company's controversial business moves. The outlet found that recent recruits have 'drawn on tactics from the campaign trail and from warding off political scandals,' including raising doubts about critics, and roping in minority activists - such as Dolores Huerta, who co-founded the United Farm Workers with César Chávez. The Operatives Chris Lehane Lehane, known in Democratic circles as the “master of disaster,” built his reputation in the Clinton White House managing crises like the Monica Lewinsky scandal and later served as Al Gore’s press secretary. He went on to run billionaire Tom Steyer’s political operations before moving into tech at Airbnb in 2015. Lehane popularized the phrase “vast right-wing conspiracy” when defending the Clintons. It referred to how the internet age has allowed fringe theories to pass up to the masses, but was often used by the politicians he represented to cast themselves as the victim of a shadowy cabal. -Politico Now leading OpenAI’s political strategy, Lehane has modeled its global affairs team on a campaign operation, dividing staff into communications, policy, and field roles. His approach emphasizes shaping a public narrative alongside substantive policy. Peter Ragone Ragone has long-running ties to Gavin Newsom, stretching back to his San Francisco mayor days. An experienced Democratic Party operative, he’s spent time in the office of former New York Mayor Bill de Blasio and has informally advised Newsom as governor. A longtime ally of Lehane from the 1990s, Ragone is a political operative with deep ties to Gavin Newsom and Bill de Blasio. He worked damage control during de Blasio’s clash with the NYPD after the 2014 officer killings, and earlier helped Newsom weather scandal over an affair. Ragone also advised billionaire Rick Caruso’s failed LA mayoral run and is close to Lt. Gov. Eleni Kounalakis. His interest in tech policy predates his work at OpenAI, where he now applies his political relationship-mapping skills. Marisa Moret Moret, formerly chief of staff to San Francisco’s city attorney when Kamala Harris was DA, has long worked alongside Lehane. She served as his deputy at Airbnb and now reprises that role at OpenAI. Her legal and political background complements Lehane’s campaign-style strategy, making her a key lieutenant in navigating both regulatory and reputational challenges. Ann O’Leary O’Leary, Newsom’s first chief of staff and co-director of Hillary Clinton’s 2016 transition, now works as an attorney at Jenner & Block. She is central to OpenAI’s legal defense in probes led by California AG Rob Bonta and Delaware AG Kathleen Jennings. Her role involves both regulatory navigation and opposition research, including drawing comparisons between OpenAI’s critics and Elon Musk. Brian Brokaw & Dan Newman Brian Brokmaw This duo of consultants, both Newsom veterans, bring campaign and PR expertise to OpenAI. They’ve advised on controversial initiatives like the California Forever tech city project, and maintain ties with political heavyweights from Bonta to San Francisco Mayor Daniel Lurie. They also managed fundraising for Lurie’s successful mayoral bid. At OpenAI, they shape public messaging and help manage political headwinds around AI regulation and corporate scrutiny. Laphonza Butler Personally appointed by Newsom to replace the late Sen. Dianne Feinstein, Butler is a seasoned labor leader and political strategist. She previously advised Kamala Harris and consulted for firms like Uber and Airbnb, overlapping with Lehane and Moret. Now advising OpenAI, Butler brings her labor background, political connections, and campaign experience into the company’s growing political operation. Debbie Mesloh A longtime friend and political consultant to Kamala Harris from her San Francisco DA days, Mesloh is helping OpenAI navigate critics of its restructuring plans. She has engaged civic groups and, alongside Moret, previewed restructuring panels to community leaders, working to soften opposition and build support for OpenAI’s moves. The Plan & The Opposition According to the report, Lehane - who made waves teaching Silicon Valley how to play politics - will have to dance around the company's nonprofit status. Lehane will tell you OpenAI wants to share its riches with California and grow there. Part of his mission is to lay out the stakes for the world’s fourth-largest economy if it leaves. He recently wrote directly to Newsom in a letter first reported by POLITICO, petitioning the state to change course on AI regulations or risk losing its place as the home of innovation. OpenAI has heard pitches from state leaders across the U.S. looking to lure it away. Companies like Oracle and Musk’s Tesla, SpaceX and X Corp. have moved their headquarters to Texas while retaining a California presence. -Politico He faces fierce opposition from none other than Elon Musk, along with respected California-based charities, a group of the company's former employees, leading academics, Nobel laureates, and others - all of whom are lining up against the restructuring - and have cited concerns that OpenAI's new corporate structure will put financial interests away from the company's charitable mission, which began in 2015 when the company was founded by a nonprofit by a group, including Musk, who believed that this was the most responsible way to deploy such powerful technology. OpenAI originally set out last year to convert into a for-profit organization, but changed course in May amid scrutiny from state officials. The updated plan — to turn its for-profit arm into a public benefit corporation that the nonprofit controls as a stakeholder — is turning out to be no quick feat either and still requires the blessing of the attorneys general in both California and Delaware, not to mention key investor Microsoft. Changing the structure of its for-profit arm would also eliminate the current capped-profit model. -Politico Meanwhile, OpenAI has until the end of the year if they want $20 billion dangled by SoftBank - which set the deadline, however California decisionmakers don't seem to be in a huge rush - with Bonta having hired outside help to go through OpenAI's financials for his investigation. Bonta's office has met with OpenAI execs, including hief Strategy Officer Jason Kwon, head of U.S. and Canada policy Chan Park, deputy general counsel Che Chang and associate general counsel Nora Puckett, Politico continues. OpenAI claims that the meeting was unrelated to the restructuring and said nothing further. Listening Tour? As part of the lobbying strategy, OpenAI has been on a 'listening tour' to give people the impression they'll still be responsible stewards of AI technology - with Lehane waxing poetic over listening to the other side. \"You can’t just be against everything,\" he once told the AirBnB board. \"You have to be for something.\" To this end, OpenAI earlier this year formed an advisory commission which includes former Newsom adviser Daniel Zingale - who has been crisscrossing California to hold meetings with different community groups to 'listen' (and gin up support). According to Politico, Lehane tapping Zingale (who is not an official employee) to chart a path forward for a multibillion-dollar nonprofit is just one more method to shift the public narrative in his favor. Read the rest here... Tyler Durden Sun, 08/17/2025 - 14:35",
    "publishedAt": "2025-08-17T18:35:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.900Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "744f0e31"
  },
  {
    "id": "cnbc-tv18-youtube-5df8eda",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "\"आपको बोलने का अधिकार है, मेरे कान पर चिल्लाने का नहीं\" EC | Rahul | Bihar Elections #bhaiyajikahin",
    "url": "https://www.youtube.com/shorts/nqou45Prthk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:34:30.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5df8eda"
  },
  {
    "id": "ndtv-profit-youtube-b5cb27d",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Spain Continues To Battle Major Wildfires, Especially In Northwestern Galicia Region",
    "url": "https://www.youtube.com/shorts/BIUxiH7F3u4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:34:19.000Z",
    "fetchedAt": "2025-08-18T02:33:42.082Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "b5cb27d"
  },
  {
    "id": "et-markets-2e68ec77",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Taxman sets out to draw up a crypto code",
    "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/does-india-needs-new-law-on-virtual-digital-assets-cbdt-asks-cryptocurrency-players/articleshow/123352817.cms",
    "summary": "Not only are crypto gains taxed at the income tax rate of 30% (unlike the lower capital gains tax on stock profits), VDA traders can't offset profits with losses to lower the tax outgo. Many high-street banks are reluctant to offer accounts dedicated to pay or receive funds...",
    "fullContent": "Not only are crypto gains taxed at the income tax rate of 30% (unlike the lower capital gains tax on stock profits), VDA traders can't offset profits with losses to lower the tax outgo. Many high-street banks are reluctant to offer accounts dedicated to pay or receive funds from crypto trades following central bank senior officials occasionally voicing their reservations on VDAs. Besides, there is no clarity under RBI rules and the Foreign Exchange Management Act (FEMA) on whether residents can buy and sell cryptos on offshore platforms.",
    "publishedAt": "2025-08-17T18:33:59.000Z",
    "fetchedAt": "2025-08-18T02:33:32.683Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2e68ec77"
  },
  {
    "id": "cnbc-tv18-youtube-69ff4a47",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "\"लफ्फाजी करने के लिए PM बने हैं\" | #biharelection2025 #pawankhera #biharsir #shorts",
    "url": "https://www.youtube.com/shorts/jJ9dEfPC9uY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:33:25.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "69ff4a47"
  },
  {
    "id": "cnbc-tv18-youtube-6041ea2d",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "\"हम आवाज उठाएंगे...\" EC | Rahul Gandhi | PM Modi | BJP | Bihar Elections #bhaiyajikahin #shorts",
    "url": "https://www.youtube.com/shorts/7qgLhXKjMUY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:32:35.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6041ea2d"
  },
  {
    "id": "cnbc-tv18-youtube-2d85edbe",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "“भाजपा नेता आज बोल रहे थे” | #biharelection2025 #pawankhera #biharsir #shorts",
    "url": "https://www.youtube.com/shorts/9bvtfF2a9us",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:31:55.000Z",
    "fetchedAt": "2025-08-18T02:33:39.076Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2d85edbe"
  },
  {
    "id": "cnbc-markets-7e6be32f",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "White House envoy claims Russia agreed to 'Article 5-like' security guarantees for Ukraine",
    "url": "https://www.cnbc.com/2025/08/17/trump-putin-steve-witkoff-ukraine-security-guarantees.html",
    "summary": "Special Envoy Steve Witkoff's remarks come just days after President Donald Trump met in Alaska with the Russian president to discuss ending the war in Ukraine.",
    "fullContent": "Special Envoy Steve Witkoff's remarks come just days after President Donald Trump met in Alaska with the Russian president to discuss ending the war in Ukraine.",
    "publishedAt": "2025-08-17T18:31:36.000Z",
    "fetchedAt": "2025-08-18T02:33:32.679Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7e6be32f"
  },
  {
    "id": "marginal-revolution-740d1a19",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "What do intelligence analysts do?",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/what-do-intelligence-analysts-do.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-do-intelligence-analysts-do",
    "summary": "The people who are really good understand sourcing and how important it is for critical thinking. The education should be focused on helping people recognize and refute bullshit. Step one is the critical thinking necessary to say, &#8220;This makes no sense,&#8221; or...",
    "fullContent": "The people who are really good understand sourcing and how important it is for critical thinking. The education should be focused on helping people recognize and refute bullshit. Step one is the critical thinking necessary to say, &#8220;This makes no sense,&#8221; or &#8220;This is just fluff.&#8221; The people who are professionally trained to be really [&#8230;] The post What do intelligence analysts do? appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-17T18:24:07.000Z",
    "fetchedAt": "2025-08-18T02:33:33.891Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "740d1a19"
  },
  {
    "id": "techmeme-4326355f",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "How Chinese streaming giants iQiyi and Tencent are gaining on Netflix in Southeast Asia through original productions and free, ad-supported services (Nikkei Asia)",
    "url": "http://www.techmeme.com/250817/p10#a250817p10",
    "summary": "Nikkei Asia: How Chinese streaming giants iQiyi and Tencent are gaining on Netflix in Southeast Asia through original productions and free, ad-supported services — BANGKOK/SHANGHAI — Chinese streaming services are catching up with American rivals in the Southeast Asian market,...",
    "fullContent": "Nikkei Asia: How Chinese streaming giants iQiyi and Tencent are gaining on Netflix in Southeast Asia through original productions and free, ad-supported services — BANGKOK/SHANGHAI — Chinese streaming services are catching up with American rivals in the Southeast Asian market, with giants iQiyi &hellip;",
    "publishedAt": "2025-08-17T18:10:01.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4326355f"
  },
  {
    "id": "ndtv-profit-youtube-6b89380c",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Indonesia Marks 80th Anniversary Of Its Independence With A Grand Ceremony And A Public Festival",
    "url": "https://www.youtube.com/watch?v=0NvuWBCOfb8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T18:09:27.000Z",
    "fetchedAt": "2025-08-18T02:33:42.082Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6b89380c"
  },
  {
    "id": "zerohedge-7734bb02",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Trump Says He Will Push For Release Of Pro-Democracy Hong Kong Media Tycoon Jimmy Lai",
    "url": "https://www.zerohedge.com/geopolitical/trump-says-he-will-push-release-pro-democracy-hong-kong-media-tycoon-jimmy-lai",
    "summary": "Trump Says He Will Push For Release Of Pro-Democracy Hong Kong Media Tycoon Jimmy Lai Authored by Bill Pan via The Epoch Times (emphasis ours), President Donald Trump has said he would do what he can to help secure the release of Hong Kong media tycoon Jimmy Lai, who has been...",
    "fullContent": "Trump Says He Will Push For Release Of Pro-Democracy Hong Kong Media Tycoon Jimmy Lai Authored by Bill Pan via The Epoch Times (emphasis ours), President Donald Trump has said he would do what he can to help secure the release of Hong Kong media tycoon Jimmy Lai, who has been imprisoned since late 2020 for his role in the city’s pro-democracy protests. A prison van believed to be carrying Jimmy Lai arrives at the West Kowloon Magistrates' Courts building, where the founder of the now-defunct pro-democracy newspaper Apple Daily is set to take the witness stand for the first time in his national security collusion trial, in Hong Kong on Nov. 20, 2024. Tyrone Siu/Reuters Speaking on Aug. 14 on Fox News Radio’s “The Brian Kilmeade Show,” Trump said he had urged China to free Lai during his previous administration and is willing to raise the issue again, should he meet with Chinese leader Xi Jinping in the future. “I’m going to be bringing it up—I’ve already brought it up—and I’m going to do everything I can to save him,” Trump said, calling the self-made millionaire a “respected guy” and a “good guy.” Lai, 77, was arrested in August 2020 in the aftermath of mass protests against Hong Kong’s national security law, widely seen as the Chinese Communist Party’s (CCP’s) attempt to clamp down on dissent and erode the city’s autonomy. Lai is the founder of Apple Daily, a now-defunct tabloid newspaper long known for sensational headlines and paparazzi photographs. Yet during the height of Hong Kong’s pro-democracy protests, when many legacy outlets in Hong Kong amplified the CCP’s narrative, Apple Daily stood out as a rare voice openly critical of Beijing’s agenda and outspoken in its solidarity with the protesters. The company was forced to shut down in June 2021, after the authorities raided its headquarters, froze its assets, and arrested its senior editors. Since his arrest, Lai has been charged with multiple offenses under the national security law, including conspiracy to “collude with foreign forces,” which could land him in prison for life. He also faces a charge under a colonial-era statute for conspiracy to publish “seditious material,” stemming from numerous Apple Daily op-eds carrying his byline. Lai has pleaded not guilty to all charges. Lai’s trial on alleged national security offences has been repeatedly delayed. It was set to resume in Hong Kong later this month, but was postponed again because of his health condition. On Aug. 14, a panel of three Hong Kong judges adjourned the proceedings to allow time for prison authorities to outfit Lai with a heart monitor and provide medication. This came after his lawyer reported he had suffered heart palpitations. Trump, whose July 2020 order ended the United States’ historical policy of treating Hong Kong as a separate entity from China, acknowledged that the topic would be sensitive for Xi. “You could also understand [Chinese leader] Xi would not be exactly thrilled by doing it,” he said on “The Brian Kilmeade Show.” “It was a very nasty period of time in the history of China. I mean, it was a really nasty period of time with all of that being said. “We'll see what we can do ... we’re going to do everything we can.” Liu Pengyu, spokesperson for the Chinese Embassy in Washington, accused Lai of having been “a key orchestrator and participant in anti-China, destabilizing activities in Hong Kong.” Lai has long rejected accusations of advocating separatism. The British rule of Hong Kong, lasting from 1841 to 1997, holds a unique place in the so-called century of humiliation narrative the CCP forged to justify its authority. After the handover, the city retained significant autonomy and freedoms, but over the decades, Beijing has steadily encroached on those rights, portraying dissenters as separatists allegedly backed by “foreign forces.” Tyler Durden Sun, 08/17/2025 - 14:00",
    "publishedAt": "2025-08-17T18:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.901Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7734bb02"
  },
  {
    "id": "business-insider-96e66c4",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "3 tips for employees to manage their health from EY's chief well-being officer",
    "url": "https://www.businessinsider.com/3-tips-employees-in-tough-job-environment-ey-wellbeing-officer-2025-8",
    "summary": "EY's chief well-being officer shared 3 tips for employees to take charge of their health in a tough job environment.",
    "fullContent": "EY's chief well-being officer shared 3 tips for employees to take charge of their health in a tough job environment.",
    "publishedAt": "2025-08-17T17:51:07.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "96e66c4"
  },
  {
    "id": "wsj-youtube-65c7e713",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "EU Leaders Will Join Zelensky to Meet With Trump in Washington | WSJ News",
    "url": "https://www.youtube.com/watch?v=30PpheUcLJw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T17:48:41.000Z",
    "fetchedAt": "2025-08-18T02:34:03.925Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "65c7e713"
  },
  {
    "id": "dwarkesh-patel-youtube-4771c48f",
    "sourceId": "dwarkesh-patel-youtube",
    "sourceName": "Dwarkesh Patel YouTube",
    "title": "The Myth of China's Solar Moat – Casey Handmer",
    "url": "https://www.youtube.com/watch?v=g1q5PJKz0C8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T17:30:10.000Z",
    "fetchedAt": "2025-08-18T02:33:54.598Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4771c48f"
  },
  {
    "id": "fortune-7a06f3ed",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "We still aren&#8217;t sure what&#8217;s going on with tariffs and inflation — or what will happen next",
    "url": "https://fortune.com/2025/08/17/tariffs-inflation-pass-through-consumers-businesses-cpi-fed-rate-cuts/",
    "summary": "\"Despite this firmness, the tariff pass-through effect on consumer prices arguably has been less bad than expected so far.\"",
    "fullContent": "\"Despite this firmness, the tariff pass-through effect on consumer prices arguably has been less bad than expected so far.\"",
    "publishedAt": "2025-08-17T17:26:55.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a06f3ed"
  },
  {
    "id": "zerohedge-5206bbfc",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "\"The Anti-MAGA\": Blood-Soaked Bush Family Plots Revival Of Political Dynasty",
    "url": "https://www.zerohedge.com/political/anti-maga-blood-soaked-bush-family-plots-revival-political-dynasty",
    "summary": "\"The Anti-MAGA\": Blood-Soaked Bush Family Plots Revival Of Political Dynasty The Bush family, whose neoconservative war-hawk policies dragged America into catastrophic Middle East quagmires costing trillions and countless lives, is plotting a brazen political comeback, even as...",
    "fullContent": "\"The Anti-MAGA\": Blood-Soaked Bush Family Plots Revival Of Political Dynasty The Bush family, whose neoconservative war-hawk policies dragged America into catastrophic Middle East quagmires costing trillions and countless lives, is plotting a brazen political comeback, even as voters from all sides have rejected their reckless globalist agenda. Jonathan S. Bush, cousin of former President George W. Bush and nephew of former President George H. W. Bush is gearing up for a potential run for Maine’s governor, according to Newsweek, in a move that reeks of dynasty revival despite the family’s tarnished legacy. Despite George P. Bush’s humiliating 2022 defeat in the Texas attorney general GOP primary, Jonathan, a former health care executive, is testing the waters with an exploratory committee and a new nonprofit, “Maine for Keeps,” aimed at tackling the state’s economic and housing woes. The Bangor Daily News reported that George W. Bush and former Florida Governor Jeb Bush rolled out the red carpet for their cousin at a swanky Kennebunkport fundraiser this week. Jonathan S Bush According to Brandon Rottinghouse, a University of Houston political science professor, Bush-style politics are \"like the anti-MAGA\" and that the \"tone and issue profile of most modern Republicans are different from the Bush family politics,\" adding \"Republican primary audiences are now conditioned to a more aggressive breed of conservatism, one district from the Bush family political legacy.\" Meanwhile, Ronald Schmidt, professor of political science at the University of Southern Maine, told Newsweek that there are still Republicans in the state who would support a Bush. \"There are still Republicans in Maine who have fond memories of the Bush family, and some who support an idea of moderate, or at least non-Trumpish, conservatism who could well be open to such a candidate, and there are Republicans who hope to follow Trump's political path. I don't think it's been established yet which faction is stronger,\" he said, adding that Mainers \"like the image of themselves as independents.\" * * * You can support ZeroHedge with the purchase of a high-quality, sharp, ZeroHedge Multitool. Click pic... add to cart... enjoy Multitool! Satisfaction guaranteed or your money back. Colby College political science professor Dan Shea told Newsweek the state’s Republicans are split down the middle. “Republicans in state are really roughly divided between the more Bush-like traditional Republican, the more Yankee Republican, and the Trump-LePage Republican. My best guess is about 50-50,” Shea said. The professor didn’t mince words about the Kennebunkport fundraiser, warning it could backfire with Maine’s salt-of-the-earth rural voters. “That he would have a fundraiser with just a handful of people in Kennebunkport, that doesn't play particularly well to much of rural Maine,” Shea jabbed. “Kennebunkport is very distinct. It's very different.” When pressed on his gubernatorial ambitions, Bush’s team dodged with a bland statement: “He's been fortunate to receive the support and counsel of Mainers from all over the state and all walks of life, and especially proud to have his family standing strongly by his side.” This Bush resurgence comes as no surprise, but it could once again stir up bad blood with former President Donald Trump, who’s long clashed with the family’s establishment brand. Trump torched George W. Bush’s legacy in 2016, hammering him over the Iraq War debacle and the 2008 financial meltdown and crushed Jeb Bush’s 2016 campaign. George W. reportedly branded Trump a “blowhard” and griped about his \"Make America Great Again\" agenda , keeping his distance during Trump’s presidency while subtly knocking policies like the Muslim travel ban. With Maine’s GOP base still fired up by Trump’s populist energy, Jonathan Bush’s bid could be a long shot for a family desperate to claw back relevance. Tyler Durden Sun, 08/17/2025 - 13:25",
    "publishedAt": "2025-08-17T17:25:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.901Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5206bbfc"
  },
  {
    "id": "ndtv-profit-rss-6e8e6bf6",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "BJP Announces CP Radhakrishnan As NDA's Vice Presidential Candidate",
    "url": "https://www.ndtvprofit.com/elections/bjp-announces-cp-radhakrishnan-as-ndas-vice-presidential-candidate",
    "summary": "The vice-presidential election, necessitated by the resignation of incumbent Jagdeep Dhankhar last month, is scheduled for Sept. 9.",
    "fullContent": "The vice-presidential election, necessitated by the resignation of incumbent Jagdeep Dhankhar last month, is scheduled for Sept. 9.",
    "publishedAt": "2025-08-17T17:19:03.105Z",
    "fetchedAt": "2025-08-18T02:33:35.289Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6e8e6bf6"
  },
  {
    "id": "ft-economics-446ae4e1",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "Fed chair Powell to fight his corner at Jackson Hole",
    "url": "https://www.ft.com/content/b21334f1-0bdc-4113-b5b4-31a9d7a220a3",
    "summary": "Bankers gather in Wyoming, European heads fly to Washington for vital Ukraine war peace talks, big box retailers report.",
    "fullContent": "Bankers gather in Wyoming, European heads fly to Washington for vital Ukraine war peace talks, big box retailers report",
    "publishedAt": "2025-08-17T17:15:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.918Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "446ae4e1"
  },
  {
    "id": "wsj-world-news-4e3196bc",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "European Leaders to Back Zelensky in Washington, Hoping to Counter Putin",
    "url": "https://www.wsj.com/world/europe/european-leaders-to-back-zelensky-in-washington-hoping-to-counter-putin-2a82aaa4",
    "summary": "The Europeans expect President Trump to pressure the Ukrainian leader to accept concessions outlined by the Russian president in Alaska.",
    "fullContent": "The Europeans expect President Trump to pressure the Ukrainian leader to accept concessions outlined by the Russian president in Alaska.",
    "publishedAt": "2025-08-17T17:11:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.295Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "4e3196bc"
  },
  {
    "id": "project-syndicate-69677957",
    "sourceId": "project-syndicate",
    "sourceName": "Project Syndicate",
    "title": "Trump’s Alaska Folly",
    "url": "https://www.project-syndicate.org/commentary/trump-foreign-policy-fantasy-ended-at-alaska-summit-by-timothy-snyder-2025-08",
    "summary": "US President Donald Trump believes that foreign leaders can be dealt with like Americans, with fantastic promises and obnoxious bullying. But the empty offer of a “beautiful” future does not move dictators like Vladimir Putin, who has in mind his own specific, atrocity-filled...",
    "fullContent": "US President Donald Trump believes that foreign leaders can be dealt with like Americans, with fantastic promises and obnoxious bullying. But the empty offer of a “beautiful” future does not move dictators like Vladimir Putin, who has in mind his own specific, atrocity-filled future for Ukraine.",
    "publishedAt": "2025-08-17T17:06:53.000Z",
    "fetchedAt": "2025-08-18T02:33:34.266Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "69677957"
  },
  {
    "id": "bloomberg-business-youtube-6f717f9a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Politicians Descended on the Iowa State Fair",
    "url": "https://www.youtube.com/shorts/X7ZlevFmPEo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T17:01:45.000Z",
    "fetchedAt": "2025-08-18T02:33:45.089Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6f717f9a"
  },
  {
    "id": "wocomo-docs-youtube-7da7a9fb",
    "sourceId": "wocomo-docs-youtube",
    "sourceName": "Wocomo Docs YouTube",
    "title": "The Colorado River, From The Rocky Mountains To Mexico: A Wild Geological Epic Across The USA",
    "url": "https://www.youtube.com/watch?v=wuDZQTJ0DW4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T17:01:11.000Z",
    "fetchedAt": "2025-08-18T02:34:16.403Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7da7a9fb"
  },
  {
    "id": "oil-price-6424cb",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Rystad Energy Reveals Surprising Oil Resource Trends",
    "url": "https://oilprice.com/Energy/Crude-Oil/Rystad-Energy-Reveals-Surprising-Oil-Resource-Trends.html",
    "summary": "Rystad Energy’s latest research shows the global amount of discovered, recoverable oil resources has increased by 5 billion barrels over the past year, even though 30 billion barrels were produced globally in 2024.",
    "fullContent": "Rystad Energy’s latest research shows the global amount of discovered, recoverable oil resources has increased by 5 billion barrels over the past year, even though 30 billion barrels were produced globally in 2024. This net increase was driven primarily by the delineation of upside potential in Argentina’s Vaca Muerta play and the Permian Delaware basin in Texas and New Mexico. Global recoverable oil resources, including estimates for undiscovered fields, stabilized at approximately 1.5 trillion barrels. The most significant revision…",
    "publishedAt": "2025-08-17T17:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.214Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "6424cb"
  },
  {
    "id": "wsj-opinion-37bce9f9",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "A Trump-Biden Mind Meld on Price Controls",
    "url": "https://www.wsj.com/opinion/a-trump-biden-mind-meld-on-price-controls-rebate-payments-drugs-e3147426",
    "summary": "The Republican&#x2019;s ambition is to force prices even lower than the IRA.",
    "fullContent": "The Republican&#x2019;s ambition is to force prices even lower than the IRA.",
    "publishedAt": "2025-08-17T16:56:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "37bce9f9"
  },
  {
    "id": "wsj-opinion-497ee4cb",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Readers Debate Blinken on a Palestinian State",
    "url": "https://www.wsj.com/opinion/readers-debate-blinken-on-a-palestinian-state-israel-hamas-gaza-432a12b6",
    "summary": "I&#x2019;d like there be a Palestinian state that lives in peace with Israel, too. But on the showing of the past century, this is a little like wishing that tigers would become house pets.",
    "fullContent": "I&#x2019;d like there be a Palestinian state that lives in peace with Israel, too. But on the showing of the past century, this is a little like wishing that tigers would become house pets.",
    "publishedAt": "2025-08-17T16:56:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "497ee4cb"
  },
  {
    "id": "wsj-world-news-765eb9ed",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Readers Debate Blinken on a Palestinian State",
    "url": "https://www.wsj.com/opinion/readers-debate-blinken-on-a-palestinian-state-israel-hamas-gaza-432a12b6",
    "summary": "I&#x2019;d like there be a Palestinian state that lives in peace with Israel, too. But on the showing of the past century, this is a little like wishing that tigers would become house pets.",
    "fullContent": "I&#x2019;d like there be a Palestinian state that lives in peace with Israel, too. But on the showing of the past century, this is a little like wishing that tigers would become house pets.",
    "publishedAt": "2025-08-17T16:56:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.296Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "765eb9ed"
  },
  {
    "id": "wsj-opinion-341619c6",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Case for the Atom Bomb Doesn&#x2019;t Persuade",
    "url": "https://www.wsj.com/opinion/the-case-for-the-atom-bomb-doesnt-persuade-roberts-churchill-nuclear-war-660f6097",
    "summary": "The bombing of Hiroshima on Aug. 6, 1945, and Nagasaki three days later, was, on any application of just-war principles, immoral.",
    "fullContent": "The bombing of Hiroshima on Aug. 6, 1945, and Nagasaki three days later, was, on any application of just-war principles, immoral.",
    "publishedAt": "2025-08-17T16:55:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "341619c6"
  },
  {
    "id": "zerohedge-4c8cbc77",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Texas Is Preparing To Cut Off Power To Data Centers During Grid Emergencies",
    "url": "https://www.zerohedge.com/energy/texas-preparing-cut-power-data-centers-during-grid-emergencies",
    "summary": "Texas Is Preparing To Cut Off Power To Data Centers During Grid Emergencies By Georg Rute of UtilityDive Texas is preparing to cut off power to data centers during grid emergencies — a sign of just how strained the system has become.",
    "fullContent": "Texas Is Preparing To Cut Off Power To Data Centers During Grid Emergencies By Georg Rute of UtilityDive Texas is preparing to cut off power to data centers during grid emergencies — a sign of just how strained the system has become. Over the Fourth of July, deadly floods swept across central Texas, disrupting infrastructure and causing widespread outages. Meanwhile, the Electric Reliability Council of Texas (ERCOT) has already seen multiple price spikes and conservation alerts — not because there wasn’t enough power, but because we couldn’t move it where it was needed. These aren’t isolated events. It’s not just a Texas problem. Just days after the shutoff planning was announced, the U.S. Department of Energy warned that blackout risks across the country could rise 100-fold by 2030. All of this points to a deeper vulnerability: We’re still running the grid with tools and assumptions built for a different era — one with fewer storms, slower load growth and no massive data centers. Texas’s new normal demands smarter, faster and more adaptive grid operations. Long-term infrastructure investments are critical, but they won’t arrive in time to manage the next three summers. Texas has made real progress in building new generation capacity, especially in solar, storage and wind. But the wires that carry that power haven’t changed. More importantly, the way we operate the grid hasn’t evolved to match the demands of either changing weather patterns or electrical load growth. Texas generates far more power than the next 2 or 3 states COMBINED. And we’re rapidly adding much MORE power. Also our grid is more resilient than ever. Since I signed power reform laws no Texan has lost power from the ERCOT grid. We are best positioned for the future. https://t.co/kRopH5cGDk — Greg Abbott (@GregAbbott_TX) December 14, 2024 Now, surging demand from industrial expansion, electrification and AI data centers is doubling the strain. ERCOT’s own projections show that power demand in Texas may nearly double by 2030. And, other regions aren’t immune. The Midcontinent Independent System Operator recently green-lit a $22 billion transmission buildout to relieve rising congestion. The California Independent System Operator saw renewable curtailments surge nearly 30% last year. The PJM Interconnection anticipates 3% to 4% annual peak load growth through 2035 driven by data centers and expects up to 70 GW of demand over the next 15 years. Nationally, U.S. demand is projected to climb about 16% in five years — a pace not seen since the 1980s. That means more stress on an already-congested transmission system — one still being managed with decades-old assumptions about heat, wind and demand. Those assumptions no longer hold. And in a hotter, stormier Texas, they’re becoming dangerous. The case for operational intelligence Utilities around the world are taking a different approach — one that doesn’t require waiting 10 years to build new lines. In Europe, software-based tools like hardware-free dynamic line ratings, or DLR, and hyperlocal weather forecasting are safely increasing the amount of power that can flow through existing lines. These tools don’t involve new hardware or major infrastructure. They use data — from satellites, LiDAR scans, and thousands of weather stations — to help operators see where and when extra capacity is available and plan accordingly. I’ve helped implement this approach with national grid operators overseas. In Estonia and Finland, for example, we applied AI-driven DLR across 7,000 miles of transmission lines — many in hilly, forested regions like much of America. The result: up to 40% more capacity on lines that, by traditional standards, were considered maxed out. The same physics apply here. A mild breeze — just four miles per hour — can cool power lines enough to boost capacity by 30%. But grid operators typically don’t have access to sufficiently accurate weather forecasts. As a result they assume the worst-case weather at all times, just in case. That means we’re leaving megawatts stranded every day, even during critical hours and emergencies. Load flexibility shouldn’t be the only emergency tool Demand-side management is essential. But we shouldn’t have to shut down critical infrastructure just to survive a summer heat wave. If we can increase visibility into grid conditions, forecast congestion earlier, and bring in more power from further away, we can avoid triggering firm load shed in the first place. Shutting off industrial loads like data centers should be a last resort — not the default backup plan. This isn’t a call to stop building new lines or power generators. We need them. But they won’t arrive in time to handle the surging load coming in the next few years. What we can do now is operate smarter with software-based operational intelligence — to reduce curtailment, ease congestion and lower consumer costs. It’s not political. It’s practical. And it’s proven. ERCOT has long served as a proving ground for U.S. grid innovation. But today, it’s also the canary in the coal mine. What Texas does next will shape how the rest of the country prepares for what’s coming. Tyler Durden Sun, 08/17/2025 - 12:50",
    "publishedAt": "2025-08-17T16:50:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.901Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4c8cbc77"
  },
  {
    "id": "bloomberg-business-youtube-3803ca78",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Inside the US-China Showdown Over AI Chips",
    "url": "https://www.youtube.com/shorts/0SQLfrXRWyQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T16:40:40.000Z",
    "fetchedAt": "2025-08-18T02:33:45.089Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3803ca78"
  },
  {
    "id": "business-insider-45944686",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Elon Musk urged businesses to ditch Delaware. Nevada saw an opportunity.",
    "url": "https://www.businessinsider.com/nevada-delaware-corporate-law-2025-8",
    "summary": "Delaware has long been the obvious first choice location for a company to incorporate. That's changing, and Nevada sees an opportunity.",
    "fullContent": "Delaware has long been the obvious first choice location for a company to incorporate. That's changing, and Nevada sees an opportunity.",
    "publishedAt": "2025-08-17T16:39:35.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45944686"
  },
  {
    "id": "bloomberg-business-youtube-6448861f",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump-Putin Meeting - what we learned #war #ukraine",
    "url": "https://www.youtube.com/shorts/JTDRVpollk8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T16:35:00.000Z",
    "fetchedAt": "2025-08-18T02:33:45.089Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "6448861f"
  },
  {
    "id": "ndtv-profit-rss-75ac8f32",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Kabira Speaks: Safety Is No Less Risky",
    "url": "https://www.ndtvprofit.com/opinion/safety-is-no-less-risky",
    "summary": "'The investor’s chief problem — and even his worst enemy — is likely to be himself' – Benjamin Graham.",
    "fullContent": "'The investor’s chief problem — and even his worst enemy — is likely to be himself' – Benjamin Graham.",
    "publishedAt": "2025-08-17T16:29:47.522Z",
    "fetchedAt": "2025-08-18T02:33:35.289Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "75ac8f32"
  },
  {
    "id": "ndtv-profit-rss-773dcd52",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Yamuna Water Level Crosses Warning Mark In Delhi",
    "url": "https://www.ndtvprofit.com/nation/yamuna-water-level-crosses-warning-mark-in-delhi",
    "summary": "The Old Railway Bridge serves as a key observation point for tracking the river's flow and potential flood risks.",
    "fullContent": "The Old Railway Bridge serves as a key observation point for tracking the river's flow and potential flood risks.",
    "publishedAt": "2025-08-17T16:23:39.152Z",
    "fetchedAt": "2025-08-18T02:33:35.289Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "773dcd52"
  },
  {
    "id": "ndtv-profit-rss-645bb0fe",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "UP Gets Its First Green Hydrogen Plant; Second In The Country",
    "url": "https://www.ndtvprofit.com/business/up-gets-its-first-green-hydrogen-plant-second-in-the-country",
    "summary": "Green hydrogen is hydrogen gas produced by splitting water into hydrogen and oxygen using electricity produced through renewable energy sources.",
    "fullContent": "Green hydrogen is hydrogen gas produced by splitting water into hydrogen and oxygen using electricity produced through renewable energy sources.",
    "publishedAt": "2025-08-17T16:22:30.609Z",
    "fetchedAt": "2025-08-18T02:33:35.289Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "645bb0fe"
  },
  {
    "id": "thehindubusinessline-7a583574",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Cars, ACs, daily-use items to cost less under proposed GST review",
    "url": "https://www.thehindubusinessline.com/economy/cars-acs-daily-use-items-to-cost-less-under-proposed-gst-review/article69944473.ece",
    "summary": "GST rationalisation expected before Deepavali, subject to Council approval.",
    "fullContent": "GST rationalisation expected before Deepavali, subject to Council approval",
    "publishedAt": "2025-08-17T16:17:24.000Z",
    "fetchedAt": "2025-08-18T02:33:33.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a583574"
  },
  {
    "id": "ndtv-profit-rss-212bbeb3",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Steel Makers Hail Commerce Ministry For Recommending Safeguard Duty On Flat Steel Imports",
    "url": "https://www.ndtvprofit.com/business/steel-makers-hail-commerce-ministry-for-recommending-safeguard-duty-on-flat-steel-imports",
    "summary": "The DGTR has recommended final imposition of a safeguard duty on imports of certain flat steel products for three years to protect domestic manufacturers from sudden jump in the inbound shipments.",
    "fullContent": "The DGTR has recommended final imposition of a safeguard duty on imports of certain flat steel products for three years to protect domestic manufacturers from sudden jump in the inbound shipments.",
    "publishedAt": "2025-08-17T16:16:53.291Z",
    "fetchedAt": "2025-08-18T02:33:35.289Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "212bbeb3"
  },
  {
    "id": "zerohedge-54bc2a57",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Israel Bombs Power Plant Near Yemeni Capital After Houthi Ballistic Missile Launch",
    "url": "https://www.zerohedge.com/geopolitical/israel-bombs-power-plant-near-yemeni-capital-after-houthi-ballistic-missile-launch",
    "summary": "Israel Bombs Power Plant Near Yemeni Capital After Houthi Ballistic Missile Launch The Israeli navy launched strikes on a key power plant near Yemen’s capital, Sanaa, on Sunday. The Israeli military claimed the facility was being used by Houthi forces but did not provide...",
    "fullContent": "Israel Bombs Power Plant Near Yemeni Capital After Houthi Ballistic Missile Launch The Israeli navy launched strikes on a key power plant near Yemen’s capital, Sanaa, on Sunday. The Israeli military claimed the facility was being used by Houthi forces but did not provide evidence. The assault comes in the wake of the latest Houthi ballistic missile attack which targeted Tel Aviv's Ben Gurion airport, but which was reportedly intercepted and caused no damage or casualties. Houthi-affiliated Al Masirah TV said the new Israeli assault caused damage to generators at the Hezyaz power station and triggered a fire, which was soon after successfully contained. Screenshot from Al Masirah TV, via France24 The Israeli military (IDF) described the attack as a response to ongoing Houthi missile and drone launches on Israel, which have persisted in parallel to IDF expanded operations inside the Gaza Strip. A Sunday statement said Israeli forces \"struck... deep inside Yemen, targeting an energy infrastructure site that served the Houthi terrorist regime\" in an area of Sanaa, with without naming the specific site. These \"strikes were conducted in response to repeated attacks\" by the Iran-allied Shia militant group. Israel has off and on for months bombed various parts of Yemen’s infrastructure, including the critical port of Hodeidah and the country’s main international airport. These Israeli operations in Yemen have stepped-up after last spring the US withdrew from active Red Sea operations. Trump essentially declared mission accomplished, announced ceasefire, and called the US Navy away from the very costly (in terms of missiles and bombs expended) and risky mission. Currently, Houthi leadership has still vowed to attack alleged Israeli-linked ships in the Red Sea and Gulf of Aden. Foreign ships bound for Israeli ports have also been put on notice. International shipping transit routes have long ago been forced to adjust, taking longer and costlier routes to avoid the Red Sea, and also to the financial detriment of Egypt and its Suez canal. Neither Israel nor the Western allies have been able to do anything about this, and some observers have expressed awe that a group of largely poor Islamist militants in sandals have been able to inflict such punishment and an effective blockade on global shipping and Israeli and Western companies. Israeli Chief of Staff: We will continue striking until Hamas is defeated, placing the issue of the hostages at the forefront of our priorities. — First Squawk (@FirstSquawk) August 17, 2025 And given that Israel is actually expanding offensive operations into southern Gaza once again, and against Gaza City, the Red Sea conflict won't wind down anytime soon. Ceasefire efforts based in Doha have clearly failed at this point. Tyler Durden Sun, 08/17/2025 - 12:15",
    "publishedAt": "2025-08-17T16:15:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.901Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "54bc2a57"
  },
  {
    "id": "ndtv-profit-rss-27dd0a39",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "US, Russia Agreed On Ukraine Security Pledges, Witkoff Says",
    "url": "https://www.ndtvprofit.com/world/us-russia-agreed-on-ukraine-security-pledges-witkoff-says",
    "summary": "It remains unclear what kind of security guarantees are being discussed with Putin, and Rubio offered less certainty about the topic than Witkoff did.",
    "fullContent": "It remains unclear what kind of security guarantees are being discussed with Putin, and Rubio offered less certainty about the topic than Witkoff did.",
    "publishedAt": "2025-08-17T16:14:31.322Z",
    "fetchedAt": "2025-08-18T02:33:35.290Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "27dd0a39"
  },
  {
    "id": "ndtv-profit-rss-1ddda8a1",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Trump Tariffs Impact: 'Not A Reason To Sell Indian Equities,' Says Jefferies' Chris Wood — Here's Why",
    "url": "https://www.ndtvprofit.com/markets/trump-tariffs-impact-not-a-reason-to-sell-indian-equities-says-jefferies-chris-wood-heres-why",
    "summary": "India is better positioned compared to the emerging markets in the context of global trade and US-China tensions, Jefferies said in a GREED & Fear note.",
    "fullContent": "India is better positioned compared to the emerging markets in the context of global trade and US-China tensions, Jefferies said in a GREED & Fear note.",
    "publishedAt": "2025-08-17T16:04:19.406Z",
    "fetchedAt": "2025-08-18T02:33:35.290Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1ddda8a1"
  },
  {
    "id": "doomsday-machines-cbcae8b",
    "sourceId": "doomsday-machines",
    "sourceName": "Doomsday Machines",
    "title": "Wasteland Wrap-up #38",
    "url": "https://doomsdaymachines.net/p/wasteland-wrap-up-38",
    "summary": "A big update about my plans for the next year",
    "fullContent": "A big update about my plans for the next year...!",
    "publishedAt": "2025-08-17T16:03:57.000Z",
    "fetchedAt": "2025-08-18T02:39:29.078Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "cbcae8b"
  },
  {
    "id": "bloomberg-politics-59a78a42",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trade Partners Grow Restless Waiting for Trump’s Tariff Breaks",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/trade-partners-grow-restless-waiting-for-trump-s-tariff-breaks",
    "summary": "UK Prime Minister Keir Starmer declared at a Jaguar Land Rover factory in May that his world-leading trade deal with President Donald Trump included a cut in US tariffs on British steel to zero.",
    "fullContent": "UK Prime Minister Keir Starmer declared at a Jaguar Land Rover factory in May that his world-leading trade deal with President Donald Trump included a cut in US tariffs on British steel to zero.",
    "publishedAt": "2025-08-17T16:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "59a78a42"
  },
  {
    "id": "ndtv-profit-rss-258f8c3d",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Trade Setup For Aug. 18: Nifty Faces Resistance At 24,660",
    "url": "https://www.ndtvprofit.com/markets/trade-setup-for-aug-18-nifty-faces-resistance-at-24660",
    "summary": "For short-term traders, 24,500 will act as a key support zone, says Amol Athawale of Kotak Securities.",
    "fullContent": "For short-term traders, 24,500 will act as a key support zone, says Amol Athawale of Kotak Securities.",
    "publishedAt": "2025-08-17T15:58:02.407Z",
    "fetchedAt": "2025-08-18T02:33:35.290Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "258f8c3d"
  },
  {
    "id": "techmeme-677f938a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "NYC-based Protege, which prepares and sells real-world datasets like lab results and sports footage for AI training, raised a $25M Series A led by Footwork (Natasha Mascarenhas/The Information)",
    "url": "http://www.techmeme.com/250817/p9#a250817p9",
    "summary": "Natasha Mascarenhas / The Information: NYC-based Protege, which prepares and sells real-world datasets like lab results and sports footage for AI training, raised a $25M Series A led by Footwork — Companies like Scale AI and Surge have proven there's a market for human-labeled...",
    "fullContent": "Natasha Mascarenhas / The Information: NYC-based Protege, which prepares and sells real-world datasets like lab results and sports footage for AI training, raised a $25M Series A led by Footwork — Companies like Scale AI and Surge have proven there's a market for human-labeled data, like professionals' answers to complex math or law questions &hellip;",
    "publishedAt": "2025-08-17T15:55:01.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "677f938a"
  }
]