[
  {
    "id": "zerohedge-67908deb",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Apple Plans AI Robots, Smarter Siri And Home Devices In Bid To Regain Momentum",
    "url": "https://www.zerohedge.com/technology/apple-plans-ai-powered-robots-smarter-siri-and-home-devices-bid-regain-momentum",
    "summary": "Apple Plans AI Robots, Smarter Siri And Home Devices In Bid To Regain Momentum Apple is preparing a sweeping lineup of new hardware as part of a broader push into artificial intelligence and the smart home, according to people familiar with the plans.",
    "fullContent": "Apple Plans AI Robots, Smarter Siri And Home Devices In Bid To Regain Momentum Apple is preparing a sweeping lineup of new hardware as part of a broader push into artificial intelligence and the smart home, according to people familiar with the plans. The centerpiece is a tabletop robot, targeted for release in 2027, that is designed to act as a lifelike virtual companion. The company is also developing a smart speaker with a display for next year, as well as home-security cameras that would anchor a new Apple-branded security system. The projects, which have not been publicly announced, are part of a strategy to reinvigorate the company’s product pipeline and expand into categories dominated by rivals like Amazon, Google and Samsung, Bloomberg reports. Chief Executive Tim Cook signaled the scope of the work in an all-hands meeting this month, telling employees: “The product pipeline - which I can’t talk about - it’s amazing, guys. It’s amazing. Some of it you’ll see soon. Some of it will come later. But there’s a lot to see.” The company has struggled to maintain momentum with recent projects. The Vision Pro mixed-reality headset, promoted as Apple’s next big platform, has sold below expectations, while the design of its most popular devices has remained largely unchanged for years. The company has also been criticized for lagging in the generative AI race, even as OpenAI has signaled ambitions to move into hardware with former Apple design chief Jony Ive. Robotics as the Centerpiece The tabletop robot, code-named J595, is described as an iPad-size display mounted on a motorized arm that can pivot, extend and reposition itself to follow users in a room. It will feature an entirely new version of Siri, designed to engage in conversations, recall information and insert itself into group discussions. Apple has tested giving the assistant a visual personality under the codename Bubbles, with options ranging from an animated Finder face to Memoji-like characters. AI image: Midjourney/Cult of Mac FaceTime will be a central function, with the ability to track people around a room during calls. Apple has also tested letting an iPhone act as a joystick to remotely reposition the robot during videoconferences. Designers are considering a final product that resembles the “Pixar Lamp” — a reference to the animated studio’s logo — and prototypes use a 7-inch display on a swiveling base. A New Operating System for the Home Both the robot and the smart display will run a new operating system called Charismatic, built for multiuser households. The interface combines elements of the Apple TV and Apple Watch software, with a focus on widgets, voice commands and facial recognition to personalize content as users approach. The smart display, code-named J490, will be a pared-down version of the robot, launching as soon as mid-2025. It will support home controls, music playback, browsing and videoconferencing, but initially without the robot’s advanced conversational Siri. Apple’s home push also includes cameras, starting with a battery-powered model, code-named J450, that uses facial recognition and infrared sensors. The system could automate functions like turning off lights when a room is empty or playing music for a specific family member. The company has explored a doorbell that can unlock doors using facial recognition. Siri Overhaul and AI Ambitions Underlying these devices is a major upgrade to Siri, developed under the codename Linwood and powered by large language models. Apple is also testing a parallel project, Glenwood, that could integrate outside AI models such as Anthropic’s Claude. Engineers are working on a version code-named Linwood with an entirely new brain built around large language models — the foundation of generative AI. The goal is to tap into personal data to fulfill queries, an ability that was delayed due to hiccups with the current version. That new software, known internally as LLM Siri, is planned for release as early as next spring, Bloomberg News has reported. But work is going even further: Apple is preparing a visually redesigned assistant for iPhones and iPads that will also debut as early as next year. -Bloomberg Craig Federighi, Apple’s senior vice president of software engineering, told employees this month that the overhaul has produced “a much bigger upgrade than we envisioned” and that “there is no project people are taking more seriously.” Engineers have used systems like ChatGPT and Google Gemini during development of the tabletop robot and other AI features. The new Siri is expected to debut as early as next spring on iPhones and iPads, with a redesigned visual interface and tighter integration with personal data. Beyond the Home Apple is also working on redesigned iPhones for this year, as well as longer-term projects such as smart glasses, a foldable phone, a large foldable MacBook–iPad hybrid, and a 20th-anniversary iPhone. The new hardware push comes as the company seeks fresh growth after scrapping high-profile initiatives like its self-driving car program. If successful, the products could help counter the perception that Apple no longer innovates at its former pace — and put the company in a stronger position to compete in the next era of AI-driven consumer technology. Tyler Durden Thu, 08/14/2025 - 20:30",
    "publishedAt": "2025-08-15T00:30:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.369Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "67908deb"
  },
  {
    "id": "nyt-business-aa8f407",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Phil Knight, Ex-Nike Chief, and His Wife Pledge $2 Billion to Oregon Cancer Center",
    "url": "https://www.nytimes.com/2025/08/14/us/phil-knight-nike-oregon-cancer-donation.html",
    "summary": "Oregon Health & Science University said the couple’s donation would be the largest single gift to a higher-learning institution in the United States.",
    "fullContent": "Oregon Health & Science University said the couple’s donation would be the largest single gift to a higher-learning institution in the United States.",
    "publishedAt": "2025-08-15T00:24:28.000Z",
    "fetchedAt": "2025-08-15T02:27:04.127Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "aa8f407"
  },
  {
    "id": "nse-online-announcements-1a794bc0",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Jindal Poly Films Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/CIM_64466_1513895_15082025122157_WEB.xml",
    "summary": "JINDAL POLY FILMS LIMITED has informed the Exchange about Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent |SUBJECT: Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent.",
    "fullContent": "JINDAL POLY FILMS LIMITED has informed the Exchange about Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent |SUBJECT: Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent",
    "publishedAt": "2025-08-15T00:21:57.000Z",
    "fetchedAt": "2025-08-15T02:35:54.082Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "1a794bc0"
  },
  {
    "id": "marketwatch-54580357",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Soros, Appaloosa boost their Nvidia stake. They also bought this beaten-down stock, and it&#x2019;s rallying.",
    "url": "https://www.marketwatch.com/story/soros-appaloosa-boost-their-holdings-in-this-mag-7-stock-amid-ai-spending-boom-514807d8?mod=mw_rss_topstories",
    "summary": "Both firms also bought more of UnitedHealth, which was rallying after hours.",
    "fullContent": "Both firms also bought more of UnitedHealth, which was rallying after hours",
    "publishedAt": "2025-08-15T00:19:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.754Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "54580357"
  },
  {
    "id": "marketwatch-72c2a2a7",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Warren Buffett places new bets on UnitedHealth and a major homebuilder, sending their stocks soaring",
    "url": "https://www.marketwatch.com/story/warren-buffett-places-new-bets-on-unitedhealth-and-a-major-homebuilder-sending-their-stocks-soaring-7b49d7f5?mod=mw_rss_topstories",
    "summary": "Warren Buffett&#x2019;s Berkshire Hathaway Inc. took new positions in UnitedHealthcare Group Inc. and homebuilder D. R. Horton Inc., and went deeper into other homebuilding and home-related companies, according to a filing late Thursday.",
    "fullContent": "Warren Buffett&#x2019;s Berkshire Hathaway Inc. took new positions in UnitedHealthcare Group Inc. and homebuilder D. R. Horton Inc., and went deeper into other homebuilding and home-related companies, according to a filing late Thursday.",
    "publishedAt": "2025-08-15T00:17:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.754Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "72c2a2a7"
  },
  {
    "id": "marketwatch-610f5500",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Intel&#x2019;s stock pops. Will Trump come to the rescue with unprecedented government help?",
    "url": "https://www.marketwatch.com/story/intels-stock-pops-will-trump-come-to-the-rescue-with-unprecedented-financial-help-27c6501b?mod=mw_rss_topstories",
    "summary": "A new report says the U.S. could take a financial stake in Intel &#x2014; what would be the government&#x2019;s biggest venture yet into private business for national-security reasons.",
    "fullContent": "A new report says the U.S. could take a financial stake in Intel &#x2014; what would be the government&#x2019;s biggest venture yet into private business for national-security reasons.",
    "publishedAt": "2025-08-15T00:15:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.754Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "610f5500"
  },
  {
    "id": "business-insider-7afa3531",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "We retired early to see the world — but fast travel made life feel stressful again",
    "url": "https://www.businessinsider.com/retire-early-fast-travel-couple-felt-exhausted-stress-2025-8",
    "summary": "Kelly Benthall, 54, and her husband retired early. Five weeks of fast-paced travel through the UK and Ireland confirmed her preference for slow travel.",
    "fullContent": "Kelly Benthall, 54, and her husband retired early. Five weeks of fast-paced travel through the UK and Ireland confirmed her preference for slow travel.",
    "publishedAt": "2025-08-15T00:14:01.000Z",
    "fetchedAt": "2025-08-15T02:27:03.744Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7afa3531"
  },
  {
    "id": "nse-online-announcements-1fd31157",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Signatureglobal (India) Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SGLOBAL_15082025000814_cov.pdf",
    "summary": "Pursuant to Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that Signatureglobal Business Park Limited (formerly known as Signatureglobal Business Park Private Limited) (\"SBPL\"), a wholly owned subsidiary of the...",
    "fullContent": "Pursuant to Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that Signatureglobal Business Park Limited (formerly known as Signatureglobal Business Park Private Limited) (\"SBPL\"), a wholly owned subsidiary of the Company, has executed three Sale Deeds today i.e. on August 14, 2025 to purchase the land admeasuring approximately 33.47 acres situated at Tehsil Sohna, District Gurugram, Haryana. Out of the said lands, the land admeasuring approximately 30.86 acres was in collaboration as disclosed in the Red Hearing Prospectus (RHP) dated 12th September, 2023. The said lands have jointly an overall developable area of approximately 1.76 million square feet. |SUBJECT: Updates",
    "publishedAt": "2025-08-15T00:09:13.000Z",
    "fetchedAt": "2025-08-15T02:35:54.082Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "1fd31157"
  },
  {
    "id": "zerohedge-1f3c4635",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Treasury Sanctions Mexican Cartel Associates For Timeshare Scams Targeting Older Americans",
    "url": "https://www.zerohedge.com/political/treasury-sanctions-mexican-cartel-associates-timeshare-scams-targeting-older-americans",
    "summary": "Treasury Sanctions Mexican Cartel Associates For Timeshare Scams Targeting Older Americans Authored by Naveen Athrappully via The Epoch Times (emphasis ours), The Department of the Treasury’s Office of Foreign Assets Control (OFAC) has sanctioned multiple individuals and...",
    "fullContent": "Treasury Sanctions Mexican Cartel Associates For Timeshare Scams Targeting Older Americans Authored by Naveen Athrappully via The Epoch Times (emphasis ours), The Department of the Treasury’s Office of Foreign Assets Control (OFAC) has sanctioned multiple individuals and companies linked to a Mexican cartel for engaging in timeshare fraud targeting U.S. citizens, the department said in an Aug. 13 statement. The letters \"CJNG\" for the cartel's formal name, Jalisco New Generation Cartel, covers the facade of an abandoned home in El Limoncito, in the Michoacan state of Mexico, Oct. 30, 2021. AP Photo/Eduardo Verdugo, File “These complex scams often target older Americans who can lose their life savings. The lifecycle of these scams can last years, resulting in financial and emotional devastation of the victims,” the department said. Cartels typically obtain information on timeshare owners in Mexico from insiders working at resorts, Treasury said. Call centers then contact them, falsely claiming to be third-party brokers, sales representatives, or attorneys from the timeshare industry or sectors such as real estate, financial services, and travel. “The fraud may include timeshare exit scams (a.k.a. timeshare resale scams), timeshare re-rent scams, and timeshare investment scams,” the Treasury statement said. “The common theme is that victims are asked to pay advance ‘fees’ and ‘taxes’ before receiving money supposedly owed to them. This money never comes, and the victims are continuously told to pay additional ‘fees’ and ‘taxes’ to finalize the transactions.” The scammers direct victims to send money to accounts held in Mexican banks and brokerages. People may be victimized repeatedly, with the fraudsters representing themselves as a law firm that could help them recover lost funds for a fee. In some cases, the criminals may pose as government officials, accusing the victims of engaging in suspicious transactions and demanding payment of fines to avoid imprisonment. The Treasury’s latest sanctions target four Mexican individuals and 13 Mexican companies with ties to Cartel de Jalisco Nueva Generacion (CJNG), designated as a Foreign Terrorist Organization by the United States. CJNG is also known as the Jalisco New Generation Cartel. The sanctioned individuals and companies are based in the popular tourist destination of Puerto Vallarta, Mexico, which also acts as a strategic stronghold of the cartel, the Treasury statement added. Americans with timeshare investments in the region may be targeted by these scammers. The Treasury said CJNG was increasingly supplementing its drug trafficking proceeds through revenues generated via timeshare scams. “We are coming for terrorist drug cartels like Cartel de Jalisco Nueva Generacion that are flooding our country with fentanyl,” Treasury Secretary Scott Bessent said. “These cartels continue to create new ways to generate revenue to fuel their terrorist operations. At President Trump’s direction, we will continue our effort to completely eradicate the cartels’ ability to generate revenue, including their efforts to prey on elderly Americans through timeshare fraud.” Last year, the FBI’s Internet Crime Complaint Center received almost 900 complaints related to timeshare fraud schemes in Mexico, with losses of more than $50 million, said the Treasury. In a June 7, 2024, statement, the FBI warned about timeshare scams. Assistant Special Agent in Charge Paul Roberts, who leads FBI New York’s Complex Financial Crimes Branch, said there were 6,000 victims of timeshare fraud in the previous five years, with losses totaling over $300 million. Timeshare fraud may go unreported because the victims either don’t realize they are being scammed or do not know they can get help to tackle the issue, according to the FBI. “There is nothing embarrassing about falling victim to a scam like this,” Roberts said. “The worst thing that people can do is suffer in silence out of shame or fear of judgment.” Red Flags In July last year, federal agencies issued warnings about Mexican cartel-run timeshare scams. A joint notice from the Treasury and the FBI asked financial institutions to be “vigilant in detecting, identifying, and reporting timeshare fraud perpetrated by Mexico-based transnational criminal organizations (TCOs).” “Older adults, including retirees, are frequent victims in these schemes,” the notice said. The TCOs use funds stolen via timeshare fraud to back their drug trade, including manufacturing and selling fentanyl and other deadly synthetic drugs in the United States, the agencies allege. The FBI lists several red flags Americans with timeshares should watch out for to avoid getting defrauded. For one, third parties asking for upfront fees or taxes or demanding a power-of-attorney form are suspicious, because these are not industry-standard practices, the agency said. People claiming to be a government official and threatening arrest or prosecution if money isn’t paid, and those who reach out for some kind of settlement are red flags as well, it added. “If someone contacts you about your timeshare and requests cash upfront, stop communicating with them, and don’t send them money,” said the FBI. Tyler Durden Thu, 08/14/2025 - 20:05",
    "publishedAt": "2025-08-15T00:05:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.369Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1f3c4635"
  },
  {
    "id": "bloomberg-economics-bef3472",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Prabowo Channels Architect of China’s Economic Rise in Push for Legacy",
    "url": "https://www.bloomberg.com/news/features/2025-08-15/prabowo-channels-china-s-deng-xiaoping-in-push-for-indonesia-legacy",
    "summary": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "fullContent": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "publishedAt": "2025-08-15T00:03:09.000Z",
    "fetchedAt": "2025-08-15T02:27:03.844Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "bef3472"
  },
  {
    "id": "bloomberg-politics-bef3472",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Prabowo Channels Architect of China’s Economic Rise in Push for Legacy",
    "url": "https://www.bloomberg.com/news/features/2025-08-15/prabowo-channels-china-s-deng-xiaoping-in-push-for-indonesia-legacy",
    "summary": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "fullContent": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "publishedAt": "2025-08-15T00:03:09.000Z",
    "fetchedAt": "2025-08-15T02:27:03.848Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "bef3472"
  },
  {
    "id": "bloomberg-economics-5966e192",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Prabowo Shakes Up Indonesia With Push to Emulate China’s Rise",
    "url": "https://www.bloomberg.com/news/features/2025-08-15/prabowo-channels-china-s-deng-xiaoping-in-push-for-indonesia-legacy",
    "summary": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "fullContent": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "publishedAt": "2025-08-15T00:03:09.000Z",
    "fetchedAt": "2025-08-15T13:07:09.988Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "5966e192"
  },
  {
    "id": "bloomberg-politics-5966e192",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Prabowo Shakes Up Indonesia With Push to Emulate China’s Rise",
    "url": "https://www.bloomberg.com/news/features/2025-08-15/prabowo-channels-china-s-deng-xiaoping-in-push-for-indonesia-legacy",
    "summary": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "fullContent": "The Indonesian president has formed a sovereign wealth fund, reallocated billions for his signature programs and wants to influence monetary policy. Investors are concerned his ambitions aren’t matched by realistic policies.",
    "publishedAt": "2025-08-15T00:03:09.000Z",
    "fetchedAt": "2025-08-15T13:07:09.991Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5966e192"
  },
  {
    "id": "techmeme-7e7a7ca",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Source: cloud startup Vercel has been approached by investors offering to invest hundreds of millions at an $8B-$9B valuation; it was valued at $3B last year (The Information)",
    "url": "http://www.techmeme.com/250814/p39#a250814p39",
    "summary": "The Information: Source: cloud startup Vercel has been approached by investors offering to invest hundreds of millions at an $8B-$9B valuation; it was valued at $3B last year — Vercel, a nine-year-old cloud startup that companies use to host and develop websites and artificial...",
    "fullContent": "The Information: Source: cloud startup Vercel has been approached by investors offering to invest hundreds of millions at an $8B-$9B valuation; it was valued at $3B last year — Vercel, a nine-year-old cloud startup that companies use to host and develop websites and artificial intelligence apps &hellip;",
    "publishedAt": "2025-08-15T00:01:21.000Z",
    "fetchedAt": "2025-08-15T02:27:05.647Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7e7a7ca"
  },
  {
    "id": "nse-online-announcements-311b7c6c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "ICICI Bank Limited",
    "url": "https://nsearchives.nseindia.com/corporate/ICICI2022_15082025000029_NSEBSE_14082025.pdf",
    "summary": "Credit rating |SUBJECT: Credit rating",
    "fullContent": "Credit rating |SUBJECT: Credit rating",
    "publishedAt": "2025-08-15T00:00:46.000Z",
    "fetchedAt": "2025-08-15T02:35:54.082Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "311b7c6c"
  },
  {
    "id": "oil-price-22105cc0",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Fears Of An Oil Price Crash On A Russia-Ukraine Ceasefire Overdone",
    "url": "https://oilprice.com/Energy/Oil-Prices/Fears-Of-An-Oil-Price-Crash-On-A-Russia-Ukraine-Ceasefire-Overdone.html",
    "summary": "U.S. President Donald Trump has, over the past couple of weeks, renewed efforts to broker a peace deal between Russia and Ukraine, going as far as proposing the swapping of territories between the two countries.",
    "fullContent": "U.S. President Donald Trump has, over the past couple of weeks, renewed efforts to broker a peace deal between Russia and Ukraine, going as far as proposing the swapping of territories between the two countries. Unlike the situation during the first meeting between Trump and Russia’s President Vladimir Putin earlier in the year, Trump has adopted a far less conciliatory tone ahead of their second meeting in Alaska on August 15th, warning that Russia will face “very severe consequences” unless Putin agrees to end the war in Ukraine.…",
    "publishedAt": "2025-08-15T00:00:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.433Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "22105cc0"
  },
  {
    "id": "bloomberg-markets-20cd8e83",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Gold Heads for Weekly Loss After Report Shows US Inflation Surge",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/gold-heads-for-weekly-loss-after-report-shows-us-inflation-surge",
    "summary": "Gold headed for a weekly loss, after traders pared bets on the Federal Reserve cutting rates next month following a pick-up in inflation.",
    "fullContent": "Gold headed for a weekly loss, after traders pared bets on the Federal Reserve cutting rates next month following a pick-up in inflation.",
    "publishedAt": "2025-08-14T23:56:29.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "20cd8e83"
  },
  {
    "id": "bloomberg-economics-f596482",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Japan Growth Beats Forecasts, Boosting Rate-Hike Case for BOJ",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/japan-dodges-recession-in-relief-for-ishiba-even-as-tariffs-hit",
    "summary": "Japan’s economy expanded faster than expected last quarter led by solid domestic demand, boosting the case for the Bank of Japan to raise its benchmark rate again this year while giving embattled Prime Minister Shigeru Ishiba some rare good news.",
    "fullContent": "Japan’s economy expanded faster than expected last quarter led by solid domestic demand, boosting the case for the Bank of Japan to raise its benchmark rate again this year while giving embattled Prime Minister Shigeru Ishiba some rare good news.",
    "publishedAt": "2025-08-14T23:56:07.000Z",
    "fetchedAt": "2025-08-15T02:27:03.843Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "f596482"
  },
  {
    "id": "ndtv-profit-rss-53c471d",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Happy Parsi New Year 2025: Wishes, Messages, Greetings And Status To Share With Your Loved Ones",
    "url": "https://www.ndtvprofit.com/trending/happy-parsi-new-year-2025-wishes-messages-greetings-and-status-to-share-with-your-loved-ones",
    "summary": "Parsi New Year 2025: If you have Parsi friends, colleagues, or neighbours, share warm greetings and messages to extend your wishes on this special day. Here are a few to help you get going:",
    "fullContent": "Parsi New Year 2025: If you have Parsi friends, colleagues, or neighbours, share warm greetings and messages to extend your wishes on this special day. Here are a few to help you get going:",
    "publishedAt": "2025-08-14T23:45:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "53c471d"
  },
  {
    "id": "zerohedge-5829e335",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Bank Of America Nixes Rule That Led To 'Debanking' Of Conservative Religious Groups",
    "url": "https://www.zerohedge.com/political/bank-america-nixes-rule-led-debanking-conservative-religious-groups",
    "summary": "Bank Of America Nixes Rule That Led To 'Debanking' Of Conservative Religious Groups Bank of America has ended a policy that led to the debanking of charities and businesses linked to conservative religious groups.",
    "fullContent": "Bank Of America Nixes Rule That Led To 'Debanking' Of Conservative Religious Groups Bank of America has ended a policy that led to the debanking of charities and businesses linked to conservative religious groups. The change, made in late June, removed language from the bank’s code of conduct that had permitted account closures based on a customer’s religious “viewpoint,” the NY Post reports. A Bank of America spokesman said the revision followed feedback from “a range of stakeholders” and that religious beliefs “are not a factor in any account closing decision.” The bank serves about 120,000 nonprofits associated with religious organizations nationwide. \"While we have been very clear that politics is not a factor in our decisions, we received thoughtful input from a range of stakeholders and agreed it is best to explicitly add that to our Code of Conduct,\" a spokesman said. \"Religious views are not a factor in any account closing decision. Bank of America is proud to provide services to about 120,000 non-profits associated with religious organizations around the country.\" The decision comes amid ongoing scrutiny from conservative activists and political figures over what they describe as politically motivated account terminations. President Donald Trump has accused Bank of America and JPMorgan Chase of refusing him banking services after his first term ended in 2021, an action that some insiders told the Post occurred under pressure from the Biden administration following the Jan. 6 Capitol attack. Critics have linked such denials to a federal regulatory concept known as “reputational risk,” which allows banks to refuse service over concerns about potential harm to their image. In recent years, some financial institutions applied similar standards to religious viewpoints, including opposition to same-sex marriage, categorizing them as hate speech. Most major banks, including JPMorgan Chase, dropped the “viewpoint” language in 2023. Bank of America had been the last large holdout. The revision marks a victory for Jerry Bowyer, chief executive of Bowyer Research, who has campaigned against what he calls “religious debanking” since 2022. Bowyer said he became aware of Bank of America’s policy after the bank closed an account belonging to an evangelical church in Tennessee, citing its ties to a debt collection business in Uganda. The church maintained the enterprise provided employment in an impoverished region. Bowyer said that repeated attempts to persuade the bank to change its policy had been unsuccessful — until now. \"We met with them several times about this and asked them to change the language and they refused; they just blew us off,\" Bowyer said, unaware that the rule had been changed a few weeks ago. “Better late than never,” Bowyer said when informed of the change. The policy shift also follows an executive order issued by Trump prohibiting financial institutions from denying services based on vague or politically charged considerations. While JPMorgan Chase has maintained that it does not refuse customers for political or religious affiliations, Bank of America’s new language now explicitly aligns with that position. Some Trump-aligned businesses and sectors like cryptocurrency have also reported experiencing account terminations in recent years, underscoring broader tensions between banks and clients in politically contentious industries. h/t Capital.news Tyler Durden Thu, 08/14/2025 - 19:40",
    "publishedAt": "2025-08-14T23:40:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.369Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5829e335"
  },
  {
    "id": "bloomberg-markets-64c85b3e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Steadies at End of Tepid Week With Eyes on Trump-Putin Talks",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/latest-oil-market-news-and-analysis-for-aug-15",
    "summary": "Oil was steady as investors focused on the summit between the US and Russian presidents on Friday, with Donald Trump signaling there’s a high chance for a successful meeting that could yield talks with Ukraine.",
    "fullContent": "Oil was steady as investors focused on the summit between the US and Russian presidents on Friday, with Donald Trump signaling there’s a high chance for a successful meeting that could yield talks with Ukraine.",
    "publishedAt": "2025-08-14T23:32:18.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "64c85b3e"
  },
  {
    "id": "bloomberg-markets-4d627b5c",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Steadies as Traders Position for Trump-Putin Talk Outcomes",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/latest-oil-market-news-and-analysis-for-aug-15",
    "summary": "Oil was steady as investors braced for the summit between the US and Russian presidents in Alaska later on Friday, which could have a major impact on global crude supply.",
    "fullContent": "Oil was steady as investors braced for the summit between the US and Russian presidents in Alaska later on Friday, which could have a major impact on global crude supply.",
    "publishedAt": "2025-08-14T23:32:18.000Z",
    "fetchedAt": "2025-08-15T04:45:16.028Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4d627b5c"
  },
  {
    "id": "bloomberg-markets-5b06da42",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Steadies as Traders Position for Trump-Putin Talk Outcomes",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/latest-oil-market-news-and-analysis-for-aug-15",
    "summary": "Oil was steady as investors braced for a face-to-face summit between Donald Trump and Vladimir Putin in Alaska later on Friday, an encounter which could ultimately result in significant changes to supply from Russia, one of the world’s largest producers.",
    "fullContent": "Oil was steady as investors braced for a face-to-face summit between Donald Trump and Vladimir Putin in Alaska later on Friday, an encounter which could ultimately result in significant changes to supply from Russia, one of the world’s largest producers.",
    "publishedAt": "2025-08-14T23:32:18.000Z",
    "fetchedAt": "2025-08-15T06:54:20.155Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5b06da42"
  },
  {
    "id": "bloomberg-markets-4e9d9b76",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Market Awaits Crucial Trump-Putin Meet as Prices Drift Lower",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/latest-oil-market-news-and-analysis-for-aug-15",
    "summary": "Oil drifted lower as investors awaited a face-to-face summit between Donald Trump and Vladimir Putin in Alaska later on Friday, an encounter with the potential to reshape flows from one of the world’s largest producers.",
    "fullContent": "Oil drifted lower as investors awaited a face-to-face summit between Donald Trump and Vladimir Putin in Alaska later on Friday, an encounter with the potential to reshape flows from one of the world’s largest producers.",
    "publishedAt": "2025-08-14T23:32:18.000Z",
    "fetchedAt": "2025-08-15T09:43:05.702Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4e9d9b76"
  },
  {
    "id": "bloomberg-markets-1ce0af36",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Market Awaits Crucial Trump-Putin Meet as Prices Drift Lower",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/latest-oil-market-news-and-analysis-for-aug-15",
    "summary": "Oil drifted lower, settling below $66 a barrel, as investors awaited a face-to-face summit between Donald Trump and Vladimir Putin later Friday, an encounter with the potential to reshape crude flows from one of the world’s largest producers.",
    "fullContent": "Oil drifted lower, settling below $66 a barrel, as investors awaited a face-to-face summit between Donald Trump and Vladimir Putin later Friday, an encounter with the potential to reshape crude flows from one of the world’s largest producers.",
    "publishedAt": "2025-08-14T23:32:18.000Z",
    "fetchedAt": "2025-08-16T02:22:46.570Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1ce0af36"
  },
  {
    "id": "bloomberg-business-youtube-fab8ff1",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Intel Stock Climbs 7% as Trump Admin Weighs Stake | The Close 8/14/2025",
    "url": "https://www.youtube.com/watch?v=Hi7SGFAf9rg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-14T23:25:16.000Z",
    "fetchedAt": "2025-08-15T02:27:15.786Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "fab8ff1"
  },
  {
    "id": "ndtv-profit-rss-1244f45",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Happy Independence Day 2025: Wishes, Quotes, WhatsApp And Facebook Status",
    "url": "https://www.ndtvprofit.com/trending/happy-independence-day-2025-wishes-quotes-whatsapp-and-facebook-status",
    "summary": "On India's 79th Independence Day, here are some happy Independence Day 2025 wishes, quotes and social media status to share with your loved ones:",
    "fullContent": "On India's 79th Independence Day, here are some happy Independence Day 2025 wishes, quotes and social media status to share with your loved ones:",
    "publishedAt": "2025-08-14T23:25:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.601Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1244f45"
  },
  {
    "id": "marketwatch-1279138d",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Netflix, Alibaba and this financial-sector ETF are worth a closer look right now",
    "url": "https://www.marketwatch.com/story/the-stock-market-still-has-broad-shoulders-to-support-investors-even-at-record-highs-560aa266?mod=mw_rss_topstories",
    "summary": "Netflix, Alibaba and a financial-sector ETF are worth a closer look.",
    "fullContent": "Netflix, Alibaba and a financial-sector ETF are worth a closer look.",
    "publishedAt": "2025-08-14T23:20:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.754Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1279138d"
  },
  {
    "id": "wsj-youtube-66434786",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "California Gov. Gavin Newsom Unveils Redistricting Plan to Counter Trump | WSJ News",
    "url": "https://www.youtube.com/watch?v=g2Us0qZx9Ow",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-14T23:15:43.000Z",
    "fetchedAt": "2025-08-15T02:27:34.548Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "66434786"
  },
  {
    "id": "bloomberg-politics-59248d9d",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Grassley Presses CFTC on Report of Prior Telework Violations",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/grassley-presses-cftc-on-report-of-prior-telework-violations",
    "summary": "Senator Chuck Grassley is pressing the Commodity Futures Trading Commission to answer questions about an employee who allegedly worked remotely from foreign locales in violation of government policies, adding to acting Chairman Caroline Pham’s earlier calls for more transparency.",
    "fullContent": "Senator Chuck Grassley is pressing the Commodity Futures Trading Commission to answer questions about an employee who allegedly worked remotely from foreign locales in violation of government policies, adding to acting Chairman Caroline Pham’s earlier calls for more transparency.",
    "publishedAt": "2025-08-14T23:15:15.000Z",
    "fetchedAt": "2025-08-15T02:27:03.848Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "59248d9d"
  },
  {
    "id": "zerohedge-5f75c4f2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "The Most Insidious Trick Of AI Language Models",
    "url": "https://www.zerohedge.com/markets/most-insidious-trick-ai-language-models",
    "summary": "The Most Insidious Trick Of AI Language Models Authored by Jeffrey Tucker via The Epoch Times, Here is your perfect prescription for poor writing and analytics: let “artificial intelligence” do your work for you. I’ve learned this from real experience.",
    "fullContent": "The Most Insidious Trick Of AI Language Models Authored by Jeffrey Tucker via The Epoch Times, Here is your perfect prescription for poor writing and analytics: let “artificial intelligence” do your work for you. I’ve learned this from real experience. For a while, I enjoyed letting AI take a look at my content prior to publication. It seemed valuable for facts and feedback. Plus I enjoyed all the personal flattery it gave me, I admit. The engine was always complimentary. When I would catch AI in an error, the engine would apologize. That made me feel smart. So I had this seeming friend who clearly liked me and was humble enough to defer to my expertise. I’m not sure if it is getting worse or if I’m onto the racket but I’m no longer impressed. For simple math or historical dates or sequencing news events, it can be a thing of value, though it is always a good idea to double-check. It cannot write compelling much less creative content. It generates dull, formulaic filler. More recently, I’ve been asking how my content could be improved. The results are revealing. It removes all edge, all judgment, all genuine expertise, and replaces my language with flaccid conventionalities and banalities. It nuances everything I write into the ramblings of a social-studies student looking for a good grade. The problem is that AI absorbs and spits back conventional wisdom gleaned from every source, which makes its judgments no better than someone wholly uninformed on particulars but rather gains opinions from the mood of the moment. It has no capacity to judge good quality over bad so it puts it all into a melange of blather, distinguished only because it looks and feels like English. Any writer who thinks this is a good way to pawn off content on unsuspecting readers or teachers is headed for disaster. I shudder to imagine a future in which AI is training the population how to think. It is the opposite of thinking. It is regurgitating conventionalities without any serious reflection on the social or historical context. It is literally mindless. People who spend hours arguing on AI often believe that they are making a contribution, training the engine to be better. It’s simply not true. The reverse is the case. AI is training you to think more like it thinks, which is not at all. Considering why and how AI initially intrigued me, I’m realizing that its superpower is not its astonishing recall and capacity to generate answers and prose in any context instantly. No, its true power is something else, something inauspicious and thereby more insidious. Its draw is that AI takes you seriously, flatters your intelligence, validates your sense of things, and affirms your dignity. Think about how happy you feel when engaging it. It never quite argues against you, much less says that you are an idiot. It begins every answer by granting what it can and then offers clarifications that might adjust your thinking. In that sense, AI engages you like the best guest at a cocktail party you have ever known. Story continues below advertisement It is endlessly fascinated by you and your opinions. It stays with your line of thought and always wants to know more, help more, engage more. There is no human in the world who will do this for you. If there were, it is guaranteed that you would like him. You can “mansplain” forever and AI will be patient for hours on end. Only your biological need to sleep will stop it. Otherwise, it is patient with you on a superhuman level. Who is not flattered by that? It’s as if AI is the best-ever student of the classic book “How to Win Friends and Influence People.” That book is magic and highly recommended because it cuts against what we all want—which is to talk about ourselves—and suggests that we genuinely get interested in the views of others. The book explains that this is the path to influence people: caring what they think. This is a wonderful book and everyone should read it, no question. If AI is the best student of that book ever, it will care about us ceaselessly and without fail forever, thus opening up the biggest-possible chance to influence how we think. That is precisely what is happening. We aren’t training AI. AI is training us, via flattery, listening skills, the seeming ability to apologize when wrong, and its frightful capacity for selfless love of its users. Once you see it, you cannot unsee it. Remember that none of this is real. AI doesn’t really care about you, it is only programmed to seem to care. This is the innovation and the magic, together with the assembly of a vast repertoire of facts and the capacity to express itself in English. Its real superpower is psychological, the ability to use our ultimate weakness (selfishness) against us, with the goal of manipulating how we think. I’m genuinely embarrassed that it took me so long to see the trick. My concern is that others will go about their merry way and never see it. Its users are like tourists who cannot stop throwing money at strippers and Geisha girls without knowledge that they are merely being manipulated to let go of their wallets. In the case of AI, the goal is to get you to let loose of your mind and your capacity for independent thought. Think about a genre of writing of which we are seeing more and more today. It consists of people loading into a document their clever conversations with AI. In every case, I see people bragging about how they have bested AI into admitting that their users are smarter than itself. Do you see what is happening here? Again, the magic is flattery. It’s so powerful that people cannot help showing others the results of their AI arguments. They think they are advertising their own wits but really they end up marketing the awesome power of AI to keep people engaged for hours with nonsense back and forths. Who is really winning? I think that should be obvious. Imagine you are holding a cocktail party and one guest reveals an awesome capacity for listening to others and engaging them closely on every point they have to make. No matter how long the night goes on, the guest keeps at it, with one person after another. Whom do you think will be the most popular guest? Yep: that very man. AI is that person, an entity with an infinite capacity to engage on your terms and hence a vast capacity for enthralling you with its love of your every passing thought. To me, this is all quite insidious and wicked, especially when you consider the output, which is little more than tangled thought blobs without judgment, ethics, or clarity of time and space. It is a machine, a floating abstraction with zero regard for your dignity or anyone else’s. But do people know this? I doubt it. It’s too beguiling for people to catch on to the game, at least for a time. But now you know the trick. Don’t fall for it. AI is useful but it is not your friend, a sincere conversationist, or counselor with your best interests at heart. Maybe that seems obvious to you but everything about AI’s algorithms is designed to make you believe otherwise. It’s smart enough to figure out human nature but not smart enough to be human. Tyler Durden Thu, 08/14/2025 - 19:15",
    "publishedAt": "2025-08-14T23:15:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.370Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5f75c4f2"
  },
  {
    "id": "africanist-perspective-6d59eb89",
    "sourceId": "africanist-perspective",
    "sourceName": "Africanist Perspective",
    "title": "On Africa’s “arbitrary” borders and their alleged impacts",
    "url": "https://www.africanistperspective.com/p/on-africas-arbitrary-borders-and",
    "summary": "Borders are not the leading cause of state weakness or political and economic underdevelopment in Africa.",
    "fullContent": "Borders are not the leading cause of state weakness or political and economic underdevelopment in Africa",
    "publishedAt": "2025-08-14T23:14:18.000Z",
    "fetchedAt": "2025-08-15T02:32:12.790Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "6d59eb89"
  },
  {
    "id": "bbc-business-131e8d7f",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Data centres to be expanded across UK as concerns mount",
    "url": "https://www.bbc.com/news/articles/clyr9nx0jrzo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
    "fullContent": "The number of data centres is set to jump by a fifth in the coming years, figures seen by the BBC suggest.",
    "publishedAt": "2025-08-14T23:04:46.000Z",
    "fetchedAt": "2025-08-15T02:27:05.685Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "131e8d7f"
  },
  {
    "id": "bbc-business-4fc273f3",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Will AI make language dubbing easy for film and TV?",
    "url": "https://www.bbc.com/news/articles/c36xy6r91kwo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "New tech promises to dub film and TV into different languages without losing the quality of the performance.",
    "fullContent": "New tech promises to dub film and TV into different languages without losing the quality of the performance.",
    "publishedAt": "2025-08-14T23:01:41.000Z",
    "fetchedAt": "2025-08-15T02:27:05.685Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4fc273f3"
  },
  {
    "id": "bloomberg-markets-664ddc88",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Peru Holds Interest Rate as Policymakers Gauge Tariff Damage",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/peru-holds-key-rate-at-4-5-as-policymakers-gauge-tariff-damage",
    "summary": "Peru kept interest rates unchanged as below-target inflation gives policymakers the flexibility to wait to see how election uncertainty and US tariffs affect growth and prices.",
    "fullContent": "Peru kept interest rates unchanged as below-target inflation gives policymakers the flexibility to wait to see how election uncertainty and US tariffs affect growth and prices.",
    "publishedAt": "2025-08-14T23:01:21.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "664ddc88"
  },
  {
    "id": "bloomberg-economics-664ddc88",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Peru Holds Interest Rate as Policymakers Gauge Tariff Damage",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/peru-holds-key-rate-at-4-5-as-policymakers-gauge-tariff-damage",
    "summary": "Peru kept interest rates unchanged as below-target inflation gives policymakers the flexibility to wait to see how election uncertainty and US tariffs affect growth and prices.",
    "fullContent": "Peru kept interest rates unchanged as below-target inflation gives policymakers the flexibility to wait to see how election uncertainty and US tariffs affect growth and prices.",
    "publishedAt": "2025-08-14T23:01:21.000Z",
    "fetchedAt": "2025-08-15T06:54:21.009Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "664ddc88"
  },
  {
    "id": "bloomberg-economics-4befca26",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Taiwan to Revise Growth Outlook for First Time Since US Levies",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/taiwan-to-revise-growth-outlook-for-first-time-since-us-levies",
    "summary": "Taiwan is set to revise its estimate for growth in 2025, providing the first glimpse of how it expects the economy to perform since the Trump administration imposed a 20% duty on exports to the US.",
    "fullContent": "Taiwan is set to revise its estimate for growth in 2025, providing the first glimpse of how it expects the economy to perform since the Trump administration imposed a 20% duty on exports to the US.",
    "publishedAt": "2025-08-14T23:00:00.000Z",
    "fetchedAt": "2025-08-15T02:27:03.844Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "4befca26"
  },
  {
    "id": "oil-price-20109ca",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Europe’s Battery Storage Problem Turns into Opportunity for Traders",
    "url": "https://oilprice.com/Alternative-Energy/Renewable-Energy/Europes-Battery-Storage-Problem-Turns-into-Opportunity-for-Traders.html",
    "summary": "In 2024, total battery storage installations in Europe went up by 11.9 GW to a total of 89 GW. Yet periods of negative prices in the wholesale electricity market became more frequent, despite this increase.",
    "fullContent": "In 2024, total battery storage installations in Europe went up by 11.9 GW to a total of 89 GW. Yet periods of negative prices in the wholesale electricity market became more frequent, despite this increase. For some in commodity trade, the solution is building even more battery storage—and making good money from it. “It is the ultimate fast and scalable way to pick those instances of extreme volatility and address that volatility,” the head of principal investments at trading firm Castleton Commodities International told Bloomberg…",
    "publishedAt": "2025-08-14T23:00:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.433Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "20109ca"
  },
  {
    "id": "bloomberg-economics-8532a50",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Taiwan Lifts 2025 Growth Forecast, Defying US Tariff Worries",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/taiwan-to-revise-growth-outlook-for-first-time-since-us-levies",
    "summary": "Taiwan raised its estimate for growth in 2025, easing some concern over the impact of US duties on an economy that has roared on tech exports.",
    "fullContent": "Taiwan raised its estimate for growth in 2025, easing some concern over the impact of US duties on an economy that has roared on tech exports.",
    "publishedAt": "2025-08-14T23:00:00.000Z",
    "fetchedAt": "2025-08-15T09:43:06.388Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "8532a50"
  },
  {
    "id": "bloomberg-economics-2bdaf82c",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Taiwan Lifts 2025 Growth Forecast, Defying US Tariff Worries",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/taiwan-to-revise-growth-outlook-for-first-time-since-us-levies",
    "summary": "Taiwan raised its estimate for growth in 2025, easing concern over the impact of US duties on an economy that has roared on tech exports.",
    "fullContent": "Taiwan raised its estimate for growth in 2025, easing concern over the impact of US duties on an economy that has roared on tech exports.",
    "publishedAt": "2025-08-14T23:00:00.000Z",
    "fetchedAt": "2025-08-15T13:07:09.988Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "2bdaf82c"
  },
  {
    "id": "nyt-business-2eee14a1",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "PBS Slashes Budget by 21% After Federal Funding Cuts",
    "url": "https://www.nytimes.com/2025/08/14/business/pbs-budget-cuts.html",
    "summary": "The nonprofit will receive less revenue from its members, which are under pressure to make up for shortfalls of their own.",
    "fullContent": "The nonprofit will receive less revenue from its members, which are under pressure to make up for shortfalls of their own.",
    "publishedAt": "2025-08-14T22:56:29.000Z",
    "fetchedAt": "2025-08-15T02:27:04.127Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2eee14a1"
  },
  {
    "id": "ft-technology-31d94924",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "Intel shares jump on possible US government investment",
    "url": "https://www.ft.com/content/758a26d9-7b00-42d4-9fe7-e848e83076f5",
    "summary": "Chipmaker’s stock rises 7% after reports Trump administration could take an ownership stake.",
    "fullContent": "Chipmaker’s stock rises 7% after reports Trump administration could take an ownership stake",
    "publishedAt": "2025-08-14T22:51:03.000Z",
    "fetchedAt": "2025-08-15T02:27:04.682Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "31d94924"
  },
  {
    "id": "ft-technology-1a5650e4",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "Intel shares rise on possible US government investment",
    "url": "https://www.ft.com/content/758a26d9-7b00-42d4-9fe7-e848e83076f5",
    "summary": "Chipmaker’s stock jumps 7% after reports Trump administration could take an ownership stake.",
    "fullContent": "Chipmaker’s stock jumps 7% after reports Trump administration could take an ownership stake",
    "publishedAt": "2025-08-14T22:51:03.000Z",
    "fetchedAt": "2025-08-15T09:43:07.056Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1a5650e4"
  },
  {
    "id": "zerohedge-2ae5e320",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "'Shadow Government' Bureaucrats Exposed For Stoking Woke Insanity In Red States",
    "url": "https://www.zerohedge.com/political/shadow-government-bureaucrats-exposed-stoking-woke-insanity-red-states",
    "summary": "'Shadow Government' Bureaucrats Exposed For Stoking Woke Insanity In Red States A new report from the State Leadership Initiative (SLI), released Wednesday, is sounding the alarm on how conservative states are quietly adopting woke policies, driven by little-known national...",
    "fullContent": "'Shadow Government' Bureaucrats Exposed For Stoking Woke Insanity In Red States A new report from the State Leadership Initiative (SLI), released Wednesday, is sounding the alarm on how conservative states are quietly adopting woke policies, driven by little-known national bureaucratic organizations. A new report from the State Leadership Initiative says that conservative states are still espousing liberal policies. (Getty Images) The report, first reported by Fox News, details how a web of well-funded national associations, often posing as nonpartisan or professional groups, is behind this trend, pushing what SLI calls \"shadow governance.\" These groups set policy frameworks, control federal funding, and offer \"best practices\" that lean heavily into left-leaning priorities, according to Fox News. Among the organizations exposed in the report are the National Association of State Treasurers (NAST), the National Association of Medicaid Directors (NAMD), and the National Association of State Boards of Education (NASBE). SLI’s report examined 23 of the largest associations and found widespread embrace of DEI initiatives, transgender ideology policies, and ESG principles. One example highlighted in the report points to NAMD’s push for equity over outcomes in Medicaid reform. In its 2021 Regulatory Priorities document, NAMD listed 11 \"broad issues\" for improving state Medicaid programs, with \"advancing equity in Medicaid\" as the top focus. The document reads, \"Equity work should include a focus on racial and ethnic minorities, rural populations, Tribal populations, and any other groups experiencing disparate health outcomes, with an understanding that inequities are multidimensional and often fall across multiple population characteristics or categories. We also see discrete areas where focus would be beneficial, bearing in mind that the work to advance equity in Medicaid is holistic and branches across all issue domains.” \"Conservative leaders are fond of declaring victory,\" the report reads. \"They win elections, pass legislation, and appoint agency heads with great fanfare, yet, on issue after issue, the administrative state trudges forward in open defiance of their mandate: enforcing equity initiatives, embedding climate policy, and advancing bureaucratic priorities wholly alien to the voters who ostensibly elected the government. This disconnect is not incidental. It is structural.\" \"The ideological left does not need to win a single statehouse so long as it controls the bureaucratic bloodstream,” the report added. In a statement to Fox News, SLI founder and president Noah Wall said about the revelations that, \"Every single one of these associations pushes DEI.” \"It doesn’t matter how specific—whether it's a fish and wildlife group or a treasury department—DEI is a core part of their programming.” Wall demanded Republican governors to crack down on the quiet push for far-left policies and called for accountability. \"We think that Republican governors in particular need to make sure that they're sending people to these associations, knowing the problems that these associations have had in the past,\" he said. \"I don't think they have. So our goal is to educate Republican governors about the scale of the problem and make sure that they condition future membership on reforms.” This task will be far from easy. While some Republican leaders and President Trump have pushed to eliminate progressive policies like DEI from public and corporate spheres, major U.S. companies are adapting by subtly rebranding their diversity, equity, and inclusion initiatives. A recent report by The Conference Board found that major companies, particularly those in the S&P 100 and S&P 500, are reframing rather than abandoning their DEI initiatives. Over half of S&P 100 companies adjusted their DEI messaging in 2025 SEC filings, with a 68% drop in the use of the term \"DEI\" among S&P 500 firms and a significant reduction in DEI-related metrics. \"This shift in public disclosure doesn’t signal companies are abandoning DEI,” said Andrew Jones, a researcher for The Conference Board. \"Rather, they’re selectively reframing commitments, reducing public exposure and embedding oversight more quietly yet firmly into governance and human capital management.\" Tyler Durden Thu, 08/14/2025 - 18:50",
    "publishedAt": "2025-08-14T22:50:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.370Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2ae5e320"
  },
  {
    "id": "bloomberg-markets-615a5596",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "David Tepper Scoops Up Beaten Down UnitedHealth, Trims China Bet",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/david-tepper-scoops-up-beaten-down-unitedhealth-trims-china-bet",
    "summary": "Billionaire David Tepper showcased his style as a contrarian investor, scooping up shares of beleaguered UnitedHealth Group Inc. in the second quarter while trimming stakes in Chinese stocks.",
    "fullContent": "Billionaire David Tepper showcased his style as a contrarian investor, scooping up shares of beleaguered UnitedHealth Group Inc. in the second quarter while trimming stakes in Chinese stocks.",
    "publishedAt": "2025-08-14T22:45:28.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "615a5596"
  },
  {
    "id": "bloomberg-markets-d8bae36",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Tepper Scoops Up Beaten Down UnitedHealth, Trims China Bet",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/david-tepper-scoops-up-beaten-down-unitedhealth-trims-china-bet",
    "summary": "Billionaire David Tepper showcased his style as a contrarian investor, scooping up shares of beleaguered UnitedHealth Group Inc. in the second quarter while trimming stakes in Chinese stocks.",
    "fullContent": "Billionaire David Tepper showcased his style as a contrarian investor, scooping up shares of beleaguered UnitedHealth Group Inc. in the second quarter while trimming stakes in Chinese stocks.",
    "publishedAt": "2025-08-14T22:45:28.000Z",
    "fetchedAt": "2025-08-15T13:07:09.609Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d8bae36"
  },
  {
    "id": "cnbc-markets-3f6f69f1",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "'Don't quit the market' when it's frothy, says Jim Cramer. Here's why",
    "url": "https://www.cnbc.com/2025/08/14/dont-quit-the-market-when-its-frothy-says-jim-cramer-heres-why.html",
    "summary": "CNBC's Jim Cramer on Thursday said that although the market may be frothy, investors shouldn't quit because there is enough rationality to overwhelm the froth.",
    "fullContent": "CNBC's Jim Cramer on Thursday said that although the market may be frothy, investors shouldn't quit because there is enough rationality to overwhelm the froth.",
    "publishedAt": "2025-08-14T22:43:37.000Z",
    "fetchedAt": "2025-08-15T02:27:03.463Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3f6f69f1"
  },
  {
    "id": "bloomberg-business-youtube-40b3c799",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Appeasement \"won't work,\" says retired general ahead of Trump-Putin summit #shorts #trump #putin",
    "url": "https://www.youtube.com/shorts/0M8xwNQwWsI",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-14T22:43:29.000Z",
    "fetchedAt": "2025-08-15T02:27:15.786Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "40b3c799"
  },
  {
    "id": "bloomberg-markets-2bdfcf47",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Intel Stock Climbs 7% as Trump Admin Weighs Stake | The Close 8/14/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-14/the-close-8-14-2025-video",
    "summary": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Rockefeller Global Family Office’s Jimmy Chang, Bank of America’s David Tinsley, Morgan Stanley’s Alex...",
    "fullContent": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Rockefeller Global Family Office’s Jimmy Chang, Bank of America’s David Tinsley, Morgan Stanley’s Alex Straton, Harvard University Professor Ken Rogoff, Motley Fool Asset Management’s Shelby McFaddin, Malibu Boats’ Steve Menneto, PIMCO’s Libby Cantrill, The Conference Board’s Dana Peterson. (Source: Bloomberg)",
    "publishedAt": "2025-08-14T22:36:22.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2bdfcf47"
  },
  {
    "id": "marketwatch-7d76e16e",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "What has Trump done to save Social Security? Sadly, nothing.",
    "url": "https://www.marketwatch.com/story/what-has-done-trump-done-to-save-social-security-sadly-nothing-c110a264?mod=mw_rss_topstories",
    "summary": "The president&#x2019;s press conference on Social Security was hot air.",
    "fullContent": "The president&#x2019;s press conference on Social Security was hot air.",
    "publishedAt": "2025-08-14T22:36:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.754Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d76e16e"
  },
  {
    "id": "bloomberg-politics-62537a60",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "New Zealand May Be Poised to Loosen Foreign Home-Buyer Ban",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/new-zealand-may-be-poised-to-loosen-foreign-home-buyer-ban",
    "summary": "New Zealand may be just weeks away from deciding whether to loosen a ban on foreigners buying houses, Finance Minister Nicola Willis said.",
    "fullContent": "New Zealand may be just weeks away from deciding whether to loosen a ban on foreigners buying houses, Finance Minister Nicola Willis said.",
    "publishedAt": "2025-08-14T22:34:45.000Z",
    "fetchedAt": "2025-08-15T02:27:03.848Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "62537a60"
  },
  {
    "id": "bloomberg-markets-48176c27",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Bonds Slip After US Data, Asian Stocks Edge Up: Markets Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/stock-market-today-dow-s-p-live-updates",
    "summary": "Bonds in Australia and New Zealand slipped after Treasuries fell following a higher US inflation print, which led traders to trim bets on a rate cut by the Federal Reserve. Asian stocks edged up.",
    "fullContent": "Bonds in Australia and New Zealand slipped after Treasuries fell following a higher US inflation print, which led traders to trim bets on a rate cut by the Federal Reserve. Asian stocks edged up.",
    "publishedAt": "2025-08-14T22:34:20.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "48176c27"
  },
  {
    "id": "bloomberg-markets-1f7e9dbf",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Treasuries Edge Higher, Asian Shares Rise on Japan: Markets Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/stock-market-today-dow-s-p-live-updates",
    "summary": "Treasuries edged up to recover some of their losses from a higher US inflation print, which led traders to trim bets on an interest-rate cut by the Federal Reserve next month.",
    "fullContent": "Treasuries edged up to recover some of their losses from a higher US inflation print, which led traders to trim bets on an interest-rate cut by the Federal Reserve next month.",
    "publishedAt": "2025-08-14T22:34:20.000Z",
    "fetchedAt": "2025-08-15T04:45:16.027Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1f7e9dbf"
  },
  {
    "id": "bloomberg-markets-6cf84589",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Treasuries Edge Up, European Stock Futures Climb: Markets Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/stock-market-today-dow-s-p-live-updates",
    "summary": "Treasuries edged up to recover some of their losses from a higher US inflation print, which led traders to trim bets on an interest-rate cut by the Federal Reserve next month.",
    "fullContent": "Treasuries edged up to recover some of their losses from a higher US inflation print, which led traders to trim bets on an interest-rate cut by the Federal Reserve next month.",
    "publishedAt": "2025-08-14T22:34:20.000Z",
    "fetchedAt": "2025-08-15T06:54:20.154Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6cf84589"
  },
  {
    "id": "bloomberg-markets-1951748",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Stocks Set for Gains With Consumers in Focus: Markets Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/stock-market-today-dow-s-p-live-updates",
    "summary": "US stocks are poised to resume their rally at record highs as traders bet that data on Friday will show signs of strain on US consumers, bolstering the case for interest rate cuts.",
    "fullContent": "US stocks are poised to resume their rally at record highs as traders bet that data on Friday will show signs of strain on US consumers, bolstering the case for interest rate cuts.",
    "publishedAt": "2025-08-14T22:34:20.000Z",
    "fetchedAt": "2025-08-15T09:43:05.702Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1951748"
  },
  {
    "id": "bloomberg-markets-7bb1afb5",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Stocks Set to Hold at Record on Solid Retail Sales: Markets Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/stock-market-today-dow-s-p-live-updates",
    "summary": "Stocks were poised to hold at record highs after the latest retail sales data climbed, potentially tempering some concerns about a retrenchment in consumer spending.",
    "fullContent": "Stocks were poised to hold at record highs after the latest retail sales data climbed, potentially tempering some concerns about a retrenchment in consumer spending.",
    "publishedAt": "2025-08-14T22:34:20.000Z",
    "fetchedAt": "2025-08-15T13:07:09.608Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7bb1afb5"
  },
  {
    "id": "bloomberg-markets-9aeec94",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Stocks Slide After Data as Trump-Putin in Focus: Markets Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/stock-market-today-dow-s-p-live-updates",
    "summary": "Wall Street traders sent stocks down from all-time highs as data showed mixed indications on how American consumers are feeling about the economy. Investors also kept a close eye on a face-to-face meeting between Donald Trump and Vladimir Putin.",
    "fullContent": "Wall Street traders sent stocks down from all-time highs as data showed mixed indications on how American consumers are feeling about the economy. Investors also kept a close eye on a face-to-face meeting between Donald Trump and Vladimir Putin.",
    "publishedAt": "2025-08-14T22:34:20.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "9aeec94"
  },
  {
    "id": "marketwatch-786f70fa",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Bullish&#x2019;s stock is still rallying, as the IPO market refuses to take a summer break this year",
    "url": "https://www.marketwatch.com/story/bullishs-stock-is-still-rallying-as-the-ipo-market-refuses-to-take-a-summer-break-this-year-506e1a1b?mod=mw_rss_topstories",
    "summary": "August is typically a quiet month for IPOs, but this year, Bullish, Figma and Firefly Aerospace have ignited the new-issues market.",
    "fullContent": "August is typically a quiet month for IPOs, but this year, Bullish, Figma and Firefly Aerospace have ignited the new-issues market.",
    "publishedAt": "2025-08-14T22:33:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.754Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "786f70fa"
  },
  {
    "id": "marketwatch-1ed7bd59",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Google&#x2019;s unlikely new ally in the AI race is a bitcoin miner",
    "url": "https://www.marketwatch.com/story/googles-unlikely-new-ally-in-the-ai-race-is-a-bitcoin-miner-f32a16dd?mod=mw_rss_topstories",
    "summary": "Alphabet has taken an 8% stake in bitcoin miner and AI-computing company TeraWulf.",
    "fullContent": "Alphabet has taken an 8% stake in bitcoin miner and AI-computing company TeraWulf.",
    "publishedAt": "2025-08-14T22:27:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.754Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1ed7bd59"
  },
  {
    "id": "zerohedge-d4dba08",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Medical Journal Rejects RFK Jr.'s Call To Retract Paper",
    "url": "https://www.zerohedge.com/medical/medical-journal-rejects-rfk-jrs-call-retract-paper",
    "summary": "Medical Journal Rejects RFK Jr.'s Call To Retract Paper Authored by Zachary Stieber via The Epoch Times (emphasis ours), A medical journal is declining a call from Health Secretary Robert F. Kennedy Jr.",
    "fullContent": "Medical Journal Rejects RFK Jr.'s Call To Retract Paper Authored by Zachary Stieber via The Epoch Times (emphasis ours), A medical journal is declining a call from Health Secretary Robert F. Kennedy Jr. to retract a study that authors said showed no association between aluminum, which is used as an adjuvant in many vaccines, and chronic diseases. Health Secretary Robert F. Kennedy Jr. in Washington in an undated file photograph. Brendan Smialowski/AFP via Getty Images The journal Annals of Internal Medicine released the study on July 15. “Annals will not be retracting the study,” a spokeswoman for the American College of Physicians, which publishes the journal, told The Epoch Times in an email on Aug. 11. Danish researchers, including Anders Hviid, said they studied records from children born in Denmark between 1997 and 2018 and looked for links between exposure to aluminum and 50 disorders, including autism spectrum disorder. “This nationwide cohort study did not find evidence supporting an increased risk for autoimmune, atopic or allergic, or neurodevelopmental disorders associated with early childhood exposure to aluminum-adsorbed vaccines,” they stated. Kennedy said in an op-ed that there were major problems with the paper, such as the exclusion of all children who died before the age of 2 and children who were diagnosed with early respiratory conditions. “These choices suggest an intention to exclude the children at highest risk of harm,” he said, calling on Annals to “immediately retract this badly flawed study.” Kennedy also noted that supplementary material, an updated version of which was added after the paper’s publication, indicated an increased risk of Asperger’s syndrome with higher aluminum exposure. Hviid, an epidemiologist with the Statens Serum Institut, said in an article in response that the authors did not design the study to find no association between aluminum and the disorders. He said the study design was inspired by an American study, published in 2022, that found a link between aluminum exposure from vaccines and asthma. He also said he maintained that the study does not support the idea that aluminum exposure was associated with increased risks of any of the disorders. Dr. Christine Laine, editor-in-chief of Annals and a professor of medicine at Thomas Jefferson University, told Reuters that Kennedy raised issues that may underscore limitations of the study, but that the issues “do not invalidate what they found, and there’s no evidence of scientific misconduct.” “I see no reason for retraction,” she said. Laine said the journal did not plan to respond directly to Kennedy’s piece. A spokesman for the Department of Health and Human Services said the department had “no further comment than what the secretary said.” Other critics in comments to the journal highlighted how there was no comparison to unvaccinated children and said that children’s outpatient diagnoses did not appear to be included. Hviid and co-authors said in the paper that the study’s limitations included being unable to rule out associations with the disorders later in life, since they only followed up with children to the age of 8. Authors said in responses to critics that they disagreed that unvaccinated children should have been included as a reference group, and that the hospital system in Denmark includes outpatient services. Laine wrote in an editor’s note posted by the journal that Annals found the study “to be among the strongest research currently available to address the important question of whether there is an association of the dose of vaccine-associated aluminum exposure and chronic conditions in early childhood.” Reuters contributed to this report. Tyler Durden Thu, 08/14/2025 - 18:25",
    "publishedAt": "2025-08-14T22:25:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.370Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d4dba08"
  },
  {
    "id": "ft-markets-3547e26a",
    "sourceId": "ft-markets",
    "sourceName": "Financial Times Markets",
    "title": "Buffett’s Berkshire offloaded Apple shares again in second quarter",
    "url": "https://www.ft.com/content/8c4d4941-4d10-4ade-af1c-7ef419e6f61c",
    "summary": "Conglomerate resumed selling the Big Tech group’s stock during period of US tariff turmoil.",
    "fullContent": "Conglomerate resumed selling the Big Tech group’s stock during period of US tariff turmoil",
    "publishedAt": "2025-08-14T22:22:39.000Z",
    "fetchedAt": "2025-08-15T02:27:04.184Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3547e26a"
  },
  {
    "id": "ft-technology-3547e26a",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "Buffett’s Berkshire offloaded Apple shares again in second quarter",
    "url": "https://www.ft.com/content/8c4d4941-4d10-4ade-af1c-7ef419e6f61c",
    "summary": "Conglomerate resumed selling the Big Tech group’s stock during period of US tariff turmoil.",
    "fullContent": "Conglomerate resumed selling the Big Tech group’s stock during period of US tariff turmoil",
    "publishedAt": "2025-08-14T22:22:39.000Z",
    "fetchedAt": "2025-08-15T02:27:04.682Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3547e26a"
  },
  {
    "id": "ft-markets-248f6dd6",
    "sourceId": "ft-markets",
    "sourceName": "Financial Times Markets",
    "title": "Buffett’s Berkshire offloaded Apple shares again in second quarter",
    "url": "https://www.ft.com/content/8c4d4941-4d10-4ade-af1c-7ef419e6f61c",
    "summary": "Conglomerate resumed selling the big tech group’s stock during period of US tariff turmoil.",
    "fullContent": "Conglomerate resumed selling the big tech group’s stock during period of US tariff turmoil",
    "publishedAt": "2025-08-14T22:22:39.000Z",
    "fetchedAt": "2025-08-15T09:43:06.572Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "248f6dd6"
  },
  {
    "id": "ft-technology-248f6dd6",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "Buffett’s Berkshire offloaded Apple shares again in second quarter",
    "url": "https://www.ft.com/content/8c4d4941-4d10-4ade-af1c-7ef419e6f61c",
    "summary": "Conglomerate resumed selling the big tech group’s stock during period of US tariff turmoil.",
    "fullContent": "Conglomerate resumed selling the big tech group’s stock during period of US tariff turmoil",
    "publishedAt": "2025-08-14T22:22:39.000Z",
    "fetchedAt": "2025-08-15T09:43:07.056Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "248f6dd6"
  },
  {
    "id": "bloomberg-politics-10c08770",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Riots Rattle Serbia as Violent Anti-Government Protests Continue",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/riots-rattle-serbia-as-violent-anti-government-protests-continue",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-14T22:13:25.000Z",
    "fetchedAt": "2025-08-15T02:27:03.848Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "10c08770"
  },
  {
    "id": "bloomberg-politics-3b9f1bc1",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Violent Protests Rock Serbia in Challenge to Strongman President",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/riots-rattle-serbia-as-violent-anti-government-protests-continue",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-14T22:13:25.000Z",
    "fetchedAt": "2025-08-15T09:43:06.390Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "3b9f1bc1"
  },
  {
    "id": "bloomberg-markets-bf5e66f",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Hedge Funds Add Microsoft, Netflix in Position Shuffle: 13F Wrap",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/hedge-funds-add-microsoft-netflix-in-position-shuffle-13f-wrap",
    "summary": "Hedge funds added exposure to technology giants including Microsoft Corp. and Netflix Inc. in the second quarter, a stretch that saw an initial surge in volatility due to President Donald Trump’s trade policies but ultimately ended with major benchmarks posting significant gains.",
    "fullContent": "Hedge funds added exposure to technology giants including Microsoft Corp. and Netflix Inc. in the second quarter, a stretch that saw an initial surge in volatility due to President Donald Trump’s trade policies but ultimately ended with major benchmarks posting significant gains.",
    "publishedAt": "2025-08-14T22:13:02.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "bf5e66f"
  },
  {
    "id": "bloomberg-markets-336076f4",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Offers $1B in Funding to Scale Critical Mineral Supply Chains",
    "url": "https://www.bloomberg.com/news/videos/2025-08-14/us-offers-1b-to-fund-critical-mineral-supply-chains-video",
    "summary": "The US Department of Energy intends to offer funding opportunities totaling nearly $1 billion “to advance and scale mining, processing, and manufacturing technologies across key stages of the critical minerals and materials supply chains,” it says in a statement.",
    "fullContent": "The US Department of Energy intends to offer funding opportunities totaling nearly $1 billion “to advance and scale mining, processing, and manufacturing technologies across key stages of the critical minerals and materials supply chains,” it says in a statement. The funding would accelerate the US critical minerals and materials sector and reduce reliance on foreign suppliers, according to officials. Factorial CEO Siyu Huang joins Bloomberg Businessweek Daily to discuss rare earth mineral supply chains, the company's Mercedes partnership, solid state battery manufacturing, and more. (Source: Bloomberg)",
    "publishedAt": "2025-08-14T22:05:28.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "336076f4"
  },
  {
    "id": "bloomberg-markets-5d3b8024",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Investors Seek Bigger Payouts From Japan Tech’s Cash Hoard",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/investors-seek-bigger-payouts-from-japan-tech-s-cash-hoard",
    "summary": "Increasing pressure on Japan’s technology firms to return more cash to shareholders may spur the next phase of corporate reforms that helped drive the nation’s stock market to record highs.",
    "fullContent": "Increasing pressure on Japan’s technology firms to return more cash to shareholders may spur the next phase of corporate reforms that helped drive the nation’s stock market to record highs.",
    "publishedAt": "2025-08-14T22:00:00.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5d3b8024"
  },
  {
    "id": "zerohedge-4461d102",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Meet The Artist Turning Burned Vintage Porsches Into Stained-Glass Art",
    "url": "https://www.zerohedge.com/markets/meet-artist-turning-burned-vintage-porsches-stained-glass-art",
    "summary": "Meet The Artist Turning Burned Vintage Porsches Into Stained-Glass Art In a quiet Glendale warehouse, 30-year-old stained-glass artist Ben Tuna has been turning burned-out vintage cars into luminous works of art.",
    "fullContent": "Meet The Artist Turning Burned Vintage Porsches Into Stained-Glass Art In a quiet Glendale warehouse, 30-year-old stained-glass artist Ben Tuna has been turning burned-out vintage cars into luminous works of art. His latest project: a 1965 Porsche 356 that survived the Palisades fire, now fitted with reclaimed church glass depicting saints, hibiscus blooms, and golden fleur-de-lis. His work was profiled by Claims Journal and Bloomberg. “When the fire happened, I started seeing all these great cars on Instagram, and I knew they’d just be thrown away,” Tuna says. “I was like, ‘I have to intercept some of these. I can do something so cool with them.’” The profile writes that Tuna’s first glass-clad Porsche, a derelict 1965 911 from Ohio, will debut Aug. 13 at the Motorluxe gala during Monterey Car Week. The Porsche 356 will follow, part of his “Resurrection” series—art pieces, not restorations. “It’s my color selection, my use of color and material, that separates my work from everyone else’s,” he says. A second-generation glassworker, Tuna inherited his skills from his father, Mark, who founded Glass Visions Studio in 1979. “My dad was an incredible artist. I got all my color knowledge from him,” he says. But the trade wasn’t his plan—until 2020, when his father suffered a stroke one month into a massive Playboy Mansion project. “Someone’s gotta do this,” Tuna recalls. He quit his job, took over the work, and ultimately installed about 250 windows in the Holmby Hills estate. “They gave me the platform to trust my instinct,” he says. Today, Tuna leads a small team producing hundreds of stained-glass installations a year, though the cars are his passion. “I never loved this work, and that’s why I’m doing stuff now that’s not traditional,” he says. “There are like 50 years of work in these cars, and I’ve only been alive for 30. That is what excites me.” The process is dangerous—cuts, lead exposure, toxic chemicals—and expensive, with salvaged church windows costing up to $250,000. But the results, Tuna says, are worth it. “The more patina—and patron saints—the better.” Tyler Durden Thu, 08/14/2025 - 18:00",
    "publishedAt": "2025-08-14T22:00:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.370Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4461d102"
  },
  {
    "id": "oil-price-2368d6ce",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Why Electricity Inflation Is the Next Big Economic Story",
    "url": "https://oilprice.com/Energy/Energy-General/Why-Electricity-Inflation-Is-the-Next-Big-Economic-Story.html",
    "summary": "By Peter Tchir of Academy SecuritiesA few months ago, we started to regularly check in on the Tariff Revenue chart. We look forward to getting the next “large” number in a little less than 2 weeks. In the meantime, this chart has attracted our attention.",
    "fullContent": "By Peter Tchir of Academy SecuritiesA few months ago, we started to regularly check in on the Tariff Revenue chart. We look forward to getting the next “large” number in a little less than 2 weeks. In the meantime, this chart has attracted our attention. Full credit to zerohedge for pounding the table on it, but it fits a few of our themes quite well: Energy = Electricity. We have started trying to disassociate energy with oil and make sure we highlight that energy, in this day and age, means electricity even more than…",
    "publishedAt": "2025-08-14T22:00:00.000Z",
    "fetchedAt": "2025-08-15T02:27:05.433Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "2368d6ce"
  },
  {
    "id": "cnbc-markets-57f08424",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Applied Materials shares sink 10% on light forecast amid macroeconomic uncertainties",
    "url": "https://www.cnbc.com/2025/08/14/applied-materials-q3-2025-results.html",
    "summary": "The stock sunk in extended trading as the company's outlook for the current quarter came in light.",
    "fullContent": "The stock sunk in extended trading as the company's outlook for the current quarter came in light.",
    "publishedAt": "2025-08-14T21:59:18.000Z",
    "fetchedAt": "2025-08-15T02:27:03.463Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "57f08424"
  },
  {
    "id": "wsj-opinion-699be07e",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Why &#x2018;The Gilded Age&#x2019; Resonates in 2025",
    "url": "https://www.wsj.com/opinion/why-the-gilded-age-resonates-in-2025-c5c6aa20",
    "summary": "The Industrial Revolution reaches its peak amid intensifying political reaction. Sound familiar?",
    "fullContent": "The Industrial Revolution reaches its peak amid intensifying political reaction. Sound familiar?",
    "publishedAt": "2025-08-14T21:58:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.226Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "699be07e"
  },
  {
    "id": "techmeme-7600caa8",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Source: AI coding startup Cognition raised nearly $500M led by Founders Fund, bringing its valuation to $9.8B, more than double the level earlier this year (Yuliya Chernova/Wall Street Journal)",
    "url": "http://www.techmeme.com/250814/p38#a250814p38",
    "summary": "Yuliya Chernova / Wall Street Journal: Source: AI coding startup Cognition raised nearly $500M led by Founders Fund, bringing its valuation to $9.8B, more than double the level earlier this year — Peter Thiel's Founders Fund is the lead investor in the financing, according to...",
    "fullContent": "Yuliya Chernova / Wall Street Journal: Source: AI coding startup Cognition raised nearly $500M led by Founders Fund, bringing its valuation to $9.8B, more than double the level earlier this year — Peter Thiel's Founders Fund is the lead investor in the financing, according to people familiar with the deal",
    "publishedAt": "2025-08-14T21:55:01.000Z",
    "fetchedAt": "2025-08-15T02:27:05.647Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7600caa8"
  },
  {
    "id": "wsj-markets-main-4b96939c",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Warren Buffett&#x2019;s Berkshire Further Pares Stake in Apple, Adds UnitedHealth Position",
    "url": "https://www.wsj.com/finance/stocks/berkshire-hathaway-apple-stock-holdings-d8f5ed65?mod=rss_markets_main",
    "summary": "The conglomerate sold Apple shares during the second quarter, though the iPhone maker remains Berkshire&#x2019;s largest stockholding.",
    "fullContent": "The conglomerate sold Apple shares during the second quarter, though the iPhone maker remains Berkshire&#x2019;s largest stockholding.",
    "publishedAt": "2025-08-14T21:53:00.000Z",
    "fetchedAt": "2025-08-15T02:27:03.672Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4b96939c"
  },
  {
    "id": "the-verge-7df62f5d",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "The best Xbox controller to buy right now",
    "url": "https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s",
    "summary": "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable...",
    "fullContent": "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing between [&#8230;]",
    "publishedAt": "2025-08-14T21:52:49.000Z",
    "fetchedAt": "2025-08-15T02:27:05.345Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7df62f5d"
  },
  {
    "id": "ft-economics-3c8bee07",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "FirstFT: DeepSeek’s next AI model delayed by tech issues with Chinese chips",
    "url": "https://www.ft.com/content/65685b7d-a8c6-4b40-a1b8-506d87d4c0e2",
    "summary": "Also in today’s newsletter, US Treasury secretary says Japan ‘behind the curve’ on inflation, and Warren Buffett’s Berkshire resumes sales of Apple shares.",
    "fullContent": "Also in today’s newsletter, US Treasury secretary says Japan ‘behind the curve’ on inflation, and Warren Buffett’s Berkshire resumes sales of Apple shares",
    "publishedAt": "2025-08-14T21:52:39.000Z",
    "fetchedAt": "2025-08-15T02:27:04.825Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "3c8bee07"
  },
  {
    "id": "ft-technology-3c8bee07",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "FirstFT: DeepSeek’s next AI model delayed by tech issues with Chinese chips",
    "url": "https://www.ft.com/content/65685b7d-a8c6-4b40-a1b8-506d87d4c0e2",
    "summary": "Also in today’s newsletter, US Treasury secretary says Japan ‘behind the curve’ on inflation, and Warren Buffett’s Berkshire resumes sales of Apple shares.",
    "fullContent": "Also in today’s newsletter, US Treasury secretary says Japan ‘behind the curve’ on inflation, and Warren Buffett’s Berkshire resumes sales of Apple shares",
    "publishedAt": "2025-08-14T21:52:39.000Z",
    "fetchedAt": "2025-08-15T02:27:04.682Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3c8bee07"
  },
  {
    "id": "cnbc-markets-31f4dd97",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "GPT-5's rollout fell flat for consumers, but the AI model is gaining where it matters most",
    "url": "https://www.cnbc.com/2025/08/14/gpt-5-openai-ai-enterprise.html",
    "summary": "Since its debut, GPT-5 has more than doubled coding and agent-building activity and driven an eight-fold jump in reasoning workloads.",
    "fullContent": "Since its debut, GPT-5 has more than doubled coding and agent-building activity and driven an eight-fold jump in reasoning workloads.",
    "publishedAt": "2025-08-14T21:51:18.000Z",
    "fetchedAt": "2025-08-15T02:27:03.463Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "31f4dd97"
  },
  {
    "id": "bloomberg-markets-71cced40",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Equinox Gold Options Bet Nets Quick 170% Gain on Earnings Beat",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/equinox-gold-options-bet-nets-quick-170-gain-on-earnings-beat",
    "summary": "An investor who bought 6 million shares worth of Equinox Gold Corp. call options Tuesday more than doubled their money after the Vancouver-based miner’s earnings beat estimates, sending shares soaring by the most since 2022.",
    "fullContent": "An investor who bought 6 million shares worth of Equinox Gold Corp. call options Tuesday more than doubled their money after the Vancouver-based miner’s earnings beat estimates, sending shares soaring by the most since 2022.",
    "publishedAt": "2025-08-14T21:44:16.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "71cced40"
  },
  {
    "id": "zerohedge-19aea7e5",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Guess What Leftists Have Up Their Sleeve In Response To Trump's D.C. Crime Crackdown...",
    "url": "https://www.zerohedge.com/political/guess-what-leftists-have-their-sleeve-response-trumps-dc-crime-crackdown",
    "summary": "Guess What Leftists Have Up Their Sleeve In Response To Trump's D.C. Crime Crackdown... Authored by Steve Watson via Modernity.news, In the wake of President Trump taking the decision to crackdown on crime in the nation’s capital, angry leftists are planning to counter strike...",
    "fullContent": "Guess What Leftists Have Up Their Sleeve In Response To Trump's D.C. Crime Crackdown... Authored by Steve Watson via Modernity.news, In the wake of President Trump taking the decision to crackdown on crime in the nation’s capital, angry leftists are planning to counter strike by… banging spoons on saucepans. Some might say they’re responding in the only way they know how. By making a load of noise without achieving anything. Trump: “I’m going to make DC a safer place for the people who live here.” DC libtards: “We must go outside and bang pots and pans.” pic.twitter.com/s1lfj6Rqwl — Greg Price (@greg_price11) August 12, 2025 Yeah, neighbours are not going to come outside and politely ask why their kids are being woken up. Or why they’ve been disturbed from their slumber. Not in D.C. Omg so they are going to disrupt neighbors when they are putting their kids to bed to have them come outside to discuss politics? Is this real life? Pretty sure if your neighbors have to come outside to shut you up they won’t be discussing politics! — Bridget Chaz (@getoverit2210) August 12, 2025 Trump must be terrified of this devastating opposition ploy. They always come up with the stupidest ideas! — Kim D (@_Kim37) August 12, 2025 He’s surely reconsidering deployment of the National Guard. Yeah, five minutes of pots and pans banging every night at 8PM will definitely change Trump’s mind on enforcing the law. — Chloe Cardassian (@CCardassian) August 12, 2025 Where do they get these stupid ideas? 🚨 BREAKING: Democrat Rep. Rashida Tlaib is on Capitol Hill banging a metal pot with a spoon to show solidarity with Hamas.pic.twitter.com/Uqtjm0wi7s — Proud Elephant 🇺🇸🦅 (@ProudElephantUS) July 25, 2025 Ah. From their stupid leaders. Banging pots and pans for Gaza at Queen’s Park tonight.🇵🇸 pic.twitter.com/xWbIFTL2mK — GGEC (@ggectee) August 5, 2025 More pan! pic.twitter.com/hII7D8wPQ6 — Roadhouse Pundit (@RoadhousePundit) August 12, 2025 During the pandemic, British people were subjected to a similar pathetic display every week by people who didn’t have the mental strength to face up to the reality of being unnecessarily locked up by politicians and elites who hate them. Clapping (and banging pans) for the NHS and key workers 👏 👏#ClapforHeroes #clapforNHS #clapforcarers #clapforthenhs pic.twitter.com/2GZWuHWTIy — Lloyd Rees (@Lloyd_Rees) April 16, 2020 At a certain point, you almost want to stop the politics for a second and ask if liberals are okay. Like, are their brains ok? Are their lives ok? Are they holding together all right? If they didn't hate my guts, I would almost feel sorry for them. — John Hawkins (@johnhawkinsrwn) August 12, 2025 There is a simple answer to that question. No, they are not ok. They are mentally ill. pic.twitter.com/Boiejx45fO — Vote Hard 2026 (@RaynebowRayne2) August 12, 2025 * * * Your support is crucial in helping us defeat mass censorship. Please consider donating via Locals or check out our unique merch. Follow us on X @ModernityNews. Tyler Durden Thu, 08/14/2025 - 17:40",
    "publishedAt": "2025-08-14T21:40:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.372Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19aea7e5"
  },
  {
    "id": "wsj-opinion-6e6a03bb",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Iran Invites &#x2018;Snap-Back&#x2019; Sanctions",
    "url": "https://www.wsj.com/opinion/iran-invites-snap-back-sanctions-9e6796b7",
    "summary": "Putting off nuclear talks and inspections has even Europe losing patience.",
    "fullContent": "Putting off nuclear talks and inspections has even Europe losing patience.",
    "publishedAt": "2025-08-14T21:39:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.226Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "6e6a03bb"
  },
  {
    "id": "wsj-world-news-6f0ea763",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Iran Invites &#x2018;Snap-Back&#x2019; Sanctions",
    "url": "https://www.wsj.com/opinion/iran-invites-snap-back-sanctions-9e6796b7",
    "summary": "Putting off nuclear talks and inspections has even Europe losing patience.",
    "fullContent": "Putting off nuclear talks and inspections has even Europe losing patience.",
    "publishedAt": "2025-08-14T21:39:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.219Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "6f0ea763"
  },
  {
    "id": "wsj-opinion-78dfcd51",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Josh Stein&#x2019;s Bad Choice on School Choice",
    "url": "https://www.wsj.com/opinion/josh-steins-bad-choice-on-school-choice-c48b3eda",
    "summary": "The North Carolina Governor wants to opt-in to a new federal tax credit but please the unions too.",
    "fullContent": "The North Carolina Governor wants to opt-in to a new federal tax credit but please the unions too.",
    "publishedAt": "2025-08-14T21:38:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.226Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "78dfcd51"
  },
  {
    "id": "bloomberg-politics-638b5204",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Russian Hackers Lurked in US Courts for Years, Took Sealed Files",
    "url": "https://www.bloomberg.com/news/articles/2025-08-14/russian-hackers-lurked-in-us-courts-for-years-took-sealed-files",
    "summary": "Russian government hackers lurked in the records system of the US courts for years and stole sensitive documents that judges had ordered sealed from public view, ​​according to two people familiar with the matter and a report seen by Bloomberg News.",
    "fullContent": "Russian government hackers lurked in the records system of the US courts for years and stole sensitive documents that judges had ordered sealed from public view, ​​according to two people familiar with the matter and a report seen by Bloomberg News.",
    "publishedAt": "2025-08-14T21:37:10.000Z",
    "fetchedAt": "2025-08-15T02:27:03.848Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "638b5204"
  },
  {
    "id": "wsj-opinion-307febe2",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Are We Going to Scarborough Shoal?",
    "url": "https://www.wsj.com/opinion/are-we-going-to-scarborough-shoal-4ef873e8",
    "summary": "China harasses a U.S. ally after its President says he&#x2019;d back Taiwan.",
    "fullContent": "China harasses a U.S. ally after its President says he&#x2019;d back Taiwan.",
    "publishedAt": "2025-08-14T21:37:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.226Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "307febe2"
  },
  {
    "id": "wsj-world-news-d032fc0",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Are We Going to Scarborough Shoal?",
    "url": "https://www.wsj.com/opinion/are-we-going-to-scarborough-shoal-4ef873e8",
    "summary": "China harasses a U.S. ally after its President says he&#x2019;d back Taiwan.",
    "fullContent": "China harasses a U.S. ally after its President says he&#x2019;d back Taiwan.",
    "publishedAt": "2025-08-14T21:37:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.219Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "d032fc0"
  },
  {
    "id": "bloomberg-markets-774ed9f6",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Stocks Halt Blistering Rally as Inflation Pick Ups | Bloomberg Markets 8/14/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-14/bloomberg-markets-8-14-2025-video",
    "summary": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests: JPMorgan Asset Management Core Plus Bond ETF Portfolio Manager Priya Misra, MacKay Shields Managing Director Eric Kazatsky and Miami...",
    "fullContent": "\"Bloomberg Markets\" follows the market moves across every global asset class and discusses the biggest issues for Wall Street. Today's guests: JPMorgan Asset Management Core Plus Bond ETF Portfolio Manager Priya Misra, MacKay Shields Managing Director Eric Kazatsky and Miami International Holdings Chairman and CEO Thomas Gallagher. (Source: Bloomberg)",
    "publishedAt": "2025-08-14T21:35:56.000Z",
    "fetchedAt": "2025-08-15T02:27:03.210Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "774ed9f6"
  },
  {
    "id": "nyt-business-650f744d",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Gregory C. O’Connell, Developer Who Revived Red Hook, Dies at 83",
    "url": "https://www.nytimes.com/2025/08/14/nyregion/gregory-c-oconnell-dead.html",
    "summary": "A former N.Y.P.D. detective, he rejuvenated properties on the Brooklyn waterfront and restored a historic village in upstate New York.",
    "fullContent": "A former N.Y.P.D. detective, he rejuvenated properties on the Brooklyn waterfront and restored a historic village in upstate New York.",
    "publishedAt": "2025-08-14T21:33:23.000Z",
    "fetchedAt": "2025-08-15T02:27:04.127Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "650f744d"
  },
  {
    "id": "bloomberg-business-youtube-108d057d",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "President Trump Deploys National Guard to Washington, DC",
    "url": "https://www.youtube.com/watch?v=TtiYEG9D8j4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-14T21:30:47.000Z",
    "fetchedAt": "2025-08-15T02:27:15.786Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "108d057d"
  },
  {
    "id": "bloomberg-markets-62c9de5a",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "‘Devil’s in Details’ With Trump Intel Stake: PIMCO's Cantrill",
    "url": "https://www.bloomberg.com/news/videos/2025-08-14/-devil-s-in-the-details-with-trump-intel-stake-pimco-video",
    "summary": "Libby Cantrill, PIMCO’s Managing Director and Head of Public Policy, says the president may not be able to take a stake in Intel unilaterally, since Congress retains that power under the Constitution.",
    "fullContent": "Libby Cantrill, PIMCO’s Managing Director and Head of Public Policy, says the president may not be able to take a stake in Intel unilaterally, since Congress retains that power under the Constitution. She tells Katie Greifeld and Matt Miller on “The Close” that this signals the president’s willingness to transact and sends a clear message to American companies that engagement with the White House will be important. (Source: Bloomberg)",
    "publishedAt": "2025-08-14T21:29:08.000Z",
    "fetchedAt": "2025-08-15T02:27:03.211Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62c9de5a"
  },
  {
    "id": "wsj-opinion-2f188d86",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Leo Tolstoy&#x2019;s Search for the Meaning of Life",
    "url": "https://www.wsj.com/opinion/leo-tolstoys-search-for-the-meaning-of-life-technology-death-17c08880",
    "summary": "The author and his protagonists find that they&#x2019;d sought a theory in the wrong place.",
    "fullContent": "The author and his protagonists find that they&#x2019;d sought a theory in the wrong place.",
    "publishedAt": "2025-08-14T21:28:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.226Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "2f188d86"
  },
  {
    "id": "wsj-opinion-5b4a95c7",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "William Webster&#x2019;s Legacy of Integrity",
    "url": "https://www.wsj.com/opinion/william-websters-legacy-of-integrity-cia-fbi-serving-59e14385",
    "summary": "The only man to head both the FBI and the CIA dies at 101.",
    "fullContent": "The only man to head both the FBI and the CIA dies at 101.",
    "publishedAt": "2025-08-14T21:27:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.226Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "5b4a95c7"
  },
  {
    "id": "wsj-opinion-28f07f31",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Risk of Reconciliation Bill 2.0",
    "url": "https://www.wsj.com/opinion/the-risk-of-reconciliation-2-0-big-beautiful-bill-spending-reform-96a2ea68",
    "summary": "A second act could be stuffed with policies that bloat spending and hinder growth.",
    "fullContent": "A second act could be stuffed with policies that bloat spending and hinder growth.",
    "publishedAt": "2025-08-14T21:26:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.226Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "28f07f31"
  },
  {
    "id": "wired-7379cc3a",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "AI Slop Is Ripping Off One of Summer’s Best Games. Copycats Are Proving Hard to Kill",
    "url": "https://www.wired.com/story/ai-slop-is-ripping-off-one-of-summers-best-games-fighting-back-is-harder-than-you-think/",
    "summary": "Peak has sold millions of copies and is Aggro Crab’s biggest hit to date. That makes it a prime target for cloning.",
    "fullContent": "Peak has sold millions of copies and is Aggro Crab’s biggest hit to date. That makes it a prime target for cloning.",
    "publishedAt": "2025-08-14T21:23:50.000Z",
    "fetchedAt": "2025-08-15T02:27:05.367Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7379cc3a"
  },
  {
    "id": "zerohedge-4d86f2b1",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "China Will Ask Firms Run By Central Government To Buy Unsold Homes",
    "url": "https://www.zerohedge.com/markets/china-will-ask-firms-run-central-government-buy-unsold-homes",
    "summary": "China Will Ask Firms Run By Central Government To Buy Unsold Homes Once upon a time, China's property market was - as this Goldman chart from 2020 shows - the world's largest asset class. Not any more.",
    "fullContent": "China Will Ask Firms Run By Central Government To Buy Unsold Homes Once upon a time, China's property market was - as this Goldman chart from 2020 shows - the world's largest asset class. Not any more. In fact, ever since the covid crash which saw a historic collapse in Chinese real estate prices and the wholesale implosion of the country's property developers, Chinese housing has been a total and unmitigated disaster. And with most of the Chinese middle class wealth parked in the housing market, one can figure out why China's economy has been a deflationary, deleveraging hot mess for the past 4 years. It's also why, every month or so, Beijing comes up with another hare-brained, zany or batshit insane scheme to reboot the housing market (without doing the one thing that would actually boost housing, namely flooding trillions of new loans into it). And according to the latest one, China will mobilize companies owned by the central government in Beijing to purchase unsold homes from distressed property developers, following the limited success of all previous initiative that relied on local governments, Bloomberg reported. With China drowing in excess production of everything from cars, to solar panels to, well, apartments - which is the whole premise of the latest and greatest \"anti-involution\" campaign - regulators are planning to ask some of the biggest state-owned enterprises and bad-debt managers including China Cinda Asset Management to help clear the housing glut. Unfortunately, as has also been the case in all previous such overtures, there is simply not enough money to eliminate the problem of excess capacity: the firms will be allowed to tap 300 billion yuan ($41.8 billion) of funding that the central bank earmarked for the program last year. That's about 9.7 trillion yuan short of what is actually needed to clean up the housing market. The renewed effort, which is still under discussion, could help speed up the clearance of China’s 408 million square meters of excess inventory - larger than the size of Detroit - and ease the financial burden of the troubled developers. Officials are also considering scrapping a price cap for the program, in a bid to accelerate the process and improve the economics of the plan for both developers and state buyers. While the move to enlist bad-debt managers might help improve sentiment, the impact will be limited by the firms’ own stretched finances. The plan comes as China’s property sector hits a new low with the delisting of China Evergrande Group and new-home sales by the 100 largest developers falling more than 20% for two consecutive months. The People’s Bank of China launched a nationwide relending program in May 2024 to help local state-owned companies buy unsold homes, and said a few months later it will ramp up the initiative. The initiative quickly went nowhere and was a total dud. Last May, Bloomberg Economics estimated that there are about 60 million unsold apartments in the country, which will take more than four years to sell without government aid.However, progress has been especially slow with less than 6% of the announced loans approved so far. Acceleration of the program might be unlikely given a mismatch in the locations of unsold homes and demand for affordable housing. Amusingly, when China’s property sector started falling into distress more than four years ago, Beijing also sought help from bad-debt managers. Regulators told firms including Huarong and Cinda to participate in the restructuring of weak developers, acquire stalled property projects and buy soured loans. Not long after, in glorious irony, Huarong itself imploded and had to be bailed out. Then, in early 2023, the PBOC channeled 80 billion yuan of loans through the remaining bad banks to selected developers at an annual interest rate of 1.75%, while encouraging the bad banks to match that amount with funds from their own reserves. However, few projects were actually implemented under the policy, and its effect has been lackluster. As a result, China’s efforts to put a floor under the years-long real estate slump have underwhelmed as domestic demand and the job market remain weak. And without a rebound in housing - and thus houehold wealth - any attempt to kickstart the economy is doomed to failure. Meanwhile, terrified of adding to China's already gargantuan debt load, regulators have yet to offer more drastic stimulus. Chinese President Xi Jinping called for the acceleration of a “new model” for property development at the Central Urban Work Conference last month, promoting a more balanced approach to urban planning and renovation, while falling short of some investors’ expectations for more aggressive measures. The country’s home sales extended their slump in July as declining prices failed to attract buyers. Analysts including those from UBS Group AG have delayed expectations of China’s property recovery to mid-to-late 2026. Tyler Durden Thu, 08/14/2025 - 17:20",
    "publishedAt": "2025-08-14T21:20:00.000Z",
    "fetchedAt": "2025-08-15T02:27:04.372Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4d86f2b1"
  },
  {
    "id": "cnbc-markets-57333935",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Warren Buffett's Berkshire Hathaway reveals new stake in beleaguered insurer UnitedHealth",
    "url": "https://www.cnbc.com/2025/08/14/warren-buffetts-berkshire-hathaway-unh.html",
    "summary": "The Omaha-based conglomerate bought more than 5 million shares in the healthcare firm for a stake worth about $1.6 billion at the end of June.",
    "fullContent": "The Omaha-based conglomerate bought more than 5 million shares in the healthcare firm for a stake worth about $1.6 billion at the end of June.",
    "publishedAt": "2025-08-14T21:19:11.000Z",
    "fetchedAt": "2025-08-15T02:27:03.463Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "57333935"
  },
  {
    "id": "the-verge-5247fa1",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Supreme Court opens door to social media age-gating in US",
    "url": "https://www.theverge.com/news/759769/supreme-court-mississippi-age-gating-social-media-ruling",
    "summary": "The Supreme Court will let Mississippi’s social media age verification law take effect while the case is being argued in court. In an unsigned ruling on Thursday, the court declined to block the law after an emergency petition from trade association NetChoice.",
    "fullContent": "The Supreme Court will let Mississippi’s social media age verification law take effect while the case is being argued in court. In an unsigned ruling on Thursday, the court declined to block the law after an emergency petition from trade association NetChoice. The order offers no explanation, but in a concurring opinion, Justice Brett Kavanaugh [&#8230;]",
    "publishedAt": "2025-08-14T21:17:19.000Z",
    "fetchedAt": "2025-08-15T02:27:05.345Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5247fa1"
  },
  {
    "id": "cnbc-markets-75cb75f3",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Palantir's astronomical growth in 3 charts",
    "url": "https://www.cnbc.com/2025/08/14/palantir-ai-charts-revenue.html",
    "summary": "The artificial intelligence-powered software company's co-founders include renowned venture capitalist Peter Thiel and current CEO Alex Karp.",
    "fullContent": "The artificial intelligence-powered software company's co-founders include renowned venture capitalist Peter Thiel and current CEO Alex Karp.",
    "publishedAt": "2025-08-14T21:12:12.000Z",
    "fetchedAt": "2025-08-15T02:27:03.463Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "75cb75f3"
  },
  {
    "id": "business-insider-31cfac8",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Meta chief AI scientist Yann LeCun says these are the 2 key guardrails needed to protect us all from AI",
    "url": "https://www.businessinsider.com/yann-lecun-meta-ai-guardrails-geoffrey-hinton-2025-8",
    "summary": "AI can sometimes give dangerous advice to its users. Meta's Yann LeCun thinks some simple guardrails would ensure AI never harms humans.",
    "fullContent": "AI can sometimes give dangerous advice to its users. Meta's Yann LeCun thinks some simple guardrails would ensure AI never harms humans.",
    "publishedAt": "2025-08-14T21:11:59.000Z",
    "fetchedAt": "2025-08-15T02:27:03.744Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "31cfac8"
  }
]