[
  {
    "id": "cnbc-tv18-youtube-22254dda",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Trump Putin Meeting Live Update: ट्रंप-पुतिन की मुलाकात रही बेनतीजा! | Russia Ukraine War |Zelenskyy",
    "url": "https://www.youtube.com/watch?v=BI8FHqTveFM",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T02:07:02.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "22254dda"
  },
  {
    "id": "bloomberg-politics-587530e",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump to Hold Off Hiking China Tariffs Over Russia Oil Purchases",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/trump-to-hold-off-hiking-china-tariffs-over-russia-oil-purchases",
    "summary": "US President Donald Trump said he will hold off on raising tariffs on Chinese goods over the country’s purchases of Russian oil, citing progress he said was made with Vladimir Putin toward ending the war in Ukraine.",
    "fullContent": "US President Donald Trump said he will hold off on raising tariffs on Chinese goods over the country’s purchases of Russian oil, citing progress he said was made with Vladimir Putin toward ending the war in Ukraine.",
    "publishedAt": "2025-08-16T02:05:45.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "587530e"
  },
  {
    "id": "nse-online-announcements-19925e16",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Integrated Personnel Services Limited",
    "url": "https://nsearchives.nseindia.com/corporate/IPSL_16082025020010_Voting_Result.pdf",
    "summary": "Integrated Personnel Services Limited has submitted the Exchange a copy Voting Result of Extraordinary General Meeting held on August 14, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "Integrated Personnel Services Limited has submitted the Exchange a copy Voting Result of Extraordinary General Meeting held on August 14, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-16T02:01:55.000Z",
    "fetchedAt": "2025-08-16T02:31:45.238Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "19925e16"
  },
  {
    "id": "nse-online-announcements-737f5dc2",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Integrated Personnel Services Limited",
    "url": "https://nsearchives.nseindia.com/corporate/IPSL_16082025015719_Voting_Result.pdf",
    "summary": "Integrated Personnel Services Limited has submitted the Exchange a copy Srutinizers report of Extraordinary General Meeting held on August 14, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "Integrated Personnel Services Limited has submitted the Exchange a copy Srutinizers report of Extraordinary General Meeting held on August 14, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-16T01:58:00.000Z",
    "fetchedAt": "2025-08-16T02:31:45.238Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "737f5dc2"
  },
  {
    "id": "cnbc-tv18-youtube-14cd7167",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Kishtwar Cloud Burst Rescue Operation Live : बादल फटने से मचा कहर, मौत का आंकड़ा 60 के पार | Weather",
    "url": "https://www.youtube.com/watch?v=OFLdpsafA0c",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:52:43.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "14cd7167"
  },
  {
    "id": "techmeme-10ecdbf2",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Roblox plans to restrict unrated experiences to devs, automatically remove servers with violative content, and limit some social hangouts to verified 17+ users (Matt Kaufman/Roblox Corporate)",
    "url": "http://www.techmeme.com/250815/p24#a250815p24",
    "summary": "Matt Kaufman / Roblox Corporate: Roblox plans to restrict unrated experiences to devs, automatically remove servers with violative content, and limit some social hangouts to verified 17+ users — Expanding Policies to Help Younger Users Have Better Experiences on Roblox — Today...",
    "fullContent": "Matt Kaufman / Roblox Corporate: Roblox plans to restrict unrated experiences to devs, automatically remove servers with violative content, and limit some social hangouts to verified 17+ users — Expanding Policies to Help Younger Users Have Better Experiences on Roblox — Today we're making several important updates &hellip;",
    "publishedAt": "2025-08-16T01:50:02.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "10ecdbf2"
  },
  {
    "id": "ndtv-profit-youtube-2e28b67",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Press Conference | \"No Deal Until A Deal\": Trump, Putin End \"Productive\" Talks With No Results",
    "url": "https://www.youtube.com/watch?v=_oHHy63kOhg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:49:10.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2e28b67"
  },
  {
    "id": "wsj-youtube-3c967276",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "Trump and Putin Fail to Reach Deal on Ukraine During Alaska Summit | WSJ News",
    "url": "https://www.youtube.com/watch?v=Wz4ChYcDwzQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:48:37.000Z",
    "fetchedAt": "2025-08-16T02:23:18.577Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3c967276"
  },
  {
    "id": "wsj-world-news-52b4a64a",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Trump Rolled Out the Red Carpet for Putin. He Got Little in Return.",
    "url": "https://www.wsj.com/world/russia/trump-putin-summit-ends-without-breakthrough-7406d667",
    "summary": "The meeting between the U.S. president and the Russian leader didn&#x2019;t appear to yield any breakthroughs.",
    "fullContent": "The meeting between the U.S. president and the Russian leader didn&#x2019;t appear to yield any breakthroughs.",
    "publishedAt": "2025-08-16T01:48:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.779Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "52b4a64a"
  },
  {
    "id": "zerohedge-d39890e",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Deep Throat For The Deep State",
    "url": "https://www.zerohedge.com/political/deep-throat-deep-state",
    "summary": "Deep Throat For The Deep State Authored by Sasha Gong via American Greatness, By any normal standard, the recent filing from Voice of America (VOA) Director Michael Abramowitz - alleging the U.S. Agency for Global Media (USAGM) is trying to fire him illegally - should have...",
    "fullContent": "Deep Throat For The Deep State Authored by Sasha Gong via American Greatness, By any normal standard, the recent filing from Voice of America (VOA) Director Michael Abramowitz - alleging the U.S. Agency for Global Media (USAGM) is trying to fire him illegally - should have been a Beltway bombshell. Instead, it barely rippled the news cycle. That’s convenient for the people who prefer the U.S. government’s vast international broadcasting complex to remain a black box, opaque, unaccountable, and - most importantly - under their control. I remember the last time a VOA director was shown the door. On January 20, 2021, less than two hours after Joe Biden took office, Robert Reilly told me over the phone, “The guards are escorting me out of the building right now.” That same day, the new administration swept out Trump appointees across the USAGM—VOA, RFE/RL, RFA, and MBN—leadership, included—and dissolved boards on the spot. Media outlets applauded, framing it as a restoration of “experienced journalists.” The subtext was unmistakable: the right people were back in charge. Here’s the problem. “Back in charge” at VOA under Biden did not mean neutral, mission-driven journalism beamed to the world. It meant a taxpayer-funded megaphone that echoed the ruling party’s priorities while targeting Donald Trump and his voters. Programming celebrated progressive policies, blurred the line between reporting and advocacy on immigration, and, in multiple languages, provided content that critics say veered into how-to guides for navigating U.S. benefits. When your transmitter reaches 45 language services, the line between domestic influence and foreign broadcasting doesn’t just blur—it disappears. At the center of the current drama is Michael Abramowitz, a former Washington Post editor tapped by then–USAGM chief Amanda Bennett. To Trump supporters, Abramowitz represents continuity with Washington’s media-political nexus; to his defenders, he’s a credentialed professional trying to keep politics out. Both can be true in Washington—and that’s precisely why the structure matters more than the personality. Donald Trump understood VOA’s strategic value. After his 2024 victory, he named Kari Lake, an experienced broadcaster, to lead VOA and redirect it to its core mission: telling America’s story credibly, not carrying any administration’s water. Instead, she ran headlong into a new maze of “reforms” installed during Biden’s tenure. Agency directors could no longer be removed by the CEO; ultimate authority now rested with a seven-member International Broadcasting Advisory Board (including the Secretary of State), whose members meet sporadically and require Senate confirmation—a process famous for taking forever when the minority decides it should. Another tweak eliminated the ability to appoint an interim CEO; the VOA director—inevitably a holdover—would automatically act in the role. Translation: permanent government beats elected government every time. This wasn’t a policy debate about programming standards. It was a procedural encirclement—belt-and-suspenders bureaucracy designed to outlast elections. If you think that’s too cynical, ask Michael Pack, Trump’s first-term USAGM nominee, who waited three and a half years for confirmation. Or ask Kari Lake, who arrived in Washington prepared to lead VOA and discovered she first had to run the gauntlet of a never-ending confirmation calendar. Trump adjusted. If the front door was barricaded, he’d use a side entrance—naming Lake a special adviser with a mandate to unwind a “defunct” agency (Hillary Clinton’s word, not his). That move triggered the present standoff with Abramowitz, who, according to staff accounts and his own legal filing, decided he would not step aside, would not facilitate reforms, and would instead force a legal-political confrontation that keeps the old machine humming. This is not a small fight. USAGM’s $1-billion apparatus shapes how hundreds of millions abroad understand America. If it becomes a domestically resonant propaganda arm—soft power turned inward—then we’ve crossed a line the charter was designed to prevent. And suppose its leadership can be insulated from electoral accountability by clever rule changes and Senate slow-walking. In that case, the “administrative state” has discovered yet another pressure point where it can outlast voters. The fix is simple in principle: restore electoral accountability while preserving the VOA Charter’s editorial independence, set firm timelines for Senate confirmation so nominations can’t be buried by delay, and re-center VOA on its core mission of telling America’s story abroad—measured annually by independent audits. Elections must have operational consequences, and the public should be able to see if the agency is living up to its mandate. Critics will object that giving a president more control risks politicizing coverage. That objection arrives decades too late. The choice isn’t between politicization and purity; it’s between politicization hidden inside an unaccountable bureaucracy and politicization constrained by law, sunlight, and elections. I’ll take the latter. Abramowitz’s lawsuit is not the story—it’s the symptom. The disease is a governing class that prefers to win by rule change rather than persuasion. If the people cannot change the direction of their own government media through the ballot box, then the “deep state” isn’t a conspiracy theory. It’s a workflow. Kari Lake promised to make VOA programming fairer, sharper, and more recognizably American. Let her try—or defeat her vision in the open, not by burying it in process. Sunlight, not stalemate, is the real test of confidence. If USAGM’s defenders believe in their product, they should welcome both. Tyler Durden Fri, 08/15/2025 - 21:45",
    "publishedAt": "2025-08-16T01:45:00.000Z",
    "fetchedAt": "2025-08-16T09:40:37.300Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d39890e"
  },
  {
    "id": "cnbc-tv18-youtube-5011987b",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Trump Putin Meeting Update News Live : पुतिन और ट्रंप के बीच युद्धविराम पर नहीं बनी बात | Zelenskyy",
    "url": "https://www.youtube.com/watch?v=K7_tr1XveFw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:35:15.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5011987b"
  },
  {
    "id": "bloomberg-politics-5f5ceb23",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Philippines, Australia Kick Off Drills Near South China Sea",
    "url": "https://www.bloomberg.com/news/articles/2025-08-16/philippines-australia-kick-off-drills-near-south-china-sea",
    "summary": "The Philippines and Australia have started their largest ever joint military exercises as tensions continue in the South China Sea.",
    "fullContent": "The Philippines and Australia have started their largest ever joint military exercises as tensions continue in the South China Sea.",
    "publishedAt": "2025-08-16T01:29:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5f5ceb23"
  },
  {
    "id": "cnbc-tv18-youtube-10f38089",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Aar Paar With Amish Devgan LIVE : PM Modi Speech | Donald Trump | US Tariff | 79th Independence Day",
    "url": "https://www.youtube.com/watch?v=Z_fID4sJBsQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:25:13.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "10f38089"
  },
  {
    "id": "zerohedge-7d5a2f48",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "U.S. SOUTHCOM Deploying 4,000 Troops To Latin American Waters As Counter-Narco-Terror Operations Loom",
    "url": "https://www.zerohedge.com/military/us-southcom-deploying-4000-troops-latin-american-waters-counter-narco-terror-operations",
    "summary": "U.S. SOUTHCOM Deploying 4,000 Troops To Latin American Waters As Counter-Narco-Terror Operations Loom The Trump administration is preparing for a large force projection across the Latin American and Caribbean theater. U.S.",
    "fullContent": "U.S. SOUTHCOM Deploying 4,000 Troops To Latin American Waters As Counter-Narco-Terror Operations Loom The Trump administration is preparing for a large force projection across the Latin American and Caribbean theater. U.S. Southern Command (SOUTHCOM) will deploy 4,000 Marines and sailors to counter narco-terrorist cartels. The move aims to enhance hemispheric defense and deter or limit Chinese activity in the region, particularly around critical infrastructure and trade chokepoints. The news of this first comes from CNN, citing unnamed officials who stated: The deployment of the Iwo Jima Amphibious Ready Group (ARG) and the 22nd Marine Expeditionary Unit to US Southern Command, which has not been previously reported, is part of a broader repositioning of military assets to the SOUTHCOM area of responsibility that has been underway over the last three weeks, one of the officials said. A nuclear-powered attack submarine, additional P8 Poseidon reconnaissance aircraft, several destroyers and a guided-missile cruiser are also being allocated to US Southern Command as part of the mission, the officials said. A third person familiar with the matter said the additional assets are “aimed at addressing threats to US national security from specially designated narco-terrorist organizations in the region.” While the deployment is intended primarily as a deterrent, it gives SOUTHCOM prepositioning and allows Trump broad military options if he orders action against narco-terrorists. Officials note the Marines aren’t trained for drug interdiction and would need Coast Guard support. The incoming buildup follows a Pentagon directive making border security, counter-narcotics, and protection of the Panama Canal top priorities. The deployment shifts U.S. assets from earlier Northern Command border operations to a sustained SOUTHCOM presence. Last week, The New York Times reported that Trump issued a directive authorizing the Pentagon to conduct direct military operations against certain Latin American drug cartels. Shortly afterward, Mexican President Claudia Sheinbaum rejected the future presence of U.S. military forces on her soil. By Wednesday evening, open source intelligence analysts posted flight tracking data of a General Atomics MQ-9 Reaper spy drone operated by U.S. Customs and Border Protection (CBP) that flew deep into Mexico. The broader move here by the Trump administration is clear: Enhance hemispheric defense through counter-narcotics operations and maritime security. The second objective is to deter and limit Chinese activity in the region. By making moves to secure the Western Hemisphere, the Trump administration plans to disrupt command-and-control nodes between China and Latin American drug cartels that have waged irregular chemical warfare on the American people through the fentanyl crisis. Source: Heritage Foundation It might only be a matter of time before the U.S. Department of the Treasury moves to target Mexican and Chinese banks. Tyler Durden Fri, 08/15/2025 - 21:20",
    "publishedAt": "2025-08-16T01:20:00.000Z",
    "fetchedAt": "2025-08-16T09:40:37.300Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d5a2f48"
  },
  {
    "id": "wsj-opinion-306a1917",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "No Ukraine Cease-Fire From Putin",
    "url": "https://www.wsj.com/opinion/no-ukraine-cease-fire-from-putin-9a1164bc",
    "summary": "The Russian gets his photo-op but makes no apparent concessions at his summit with Trump.",
    "fullContent": "The Russian gets his photo-op but makes no apparent concessions at his summit with Trump.",
    "publishedAt": "2025-08-16T01:15:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "306a1917"
  },
  {
    "id": "wsj-world-news-23f6dc7",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | No Ukraine Cease-Fire From Putin",
    "url": "https://www.wsj.com/opinion/no-ukraine-cease-fire-from-putin-9a1164bc",
    "summary": "The Russian gets his photo-op but makes no apparent concessions at his summit with Trump.",
    "fullContent": "The Russian gets his photo-op but makes no apparent concessions at his summit with Trump.",
    "publishedAt": "2025-08-16T01:15:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "23f6dc7"
  },
  {
    "id": "fortune-62ae03da",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Waymo experimenting with generative AI, but exec says LiDAR and radar sensors important to self-driving safety &#8216;under all conditions&#8217;",
    "url": "https://fortune.com/2025/08/15/waymo-srikanth-thirumalai-interview-ai4-conference-las-vegas-lidar-radar-self-driving-safety-tesla/",
    "summary": "Waymo is experimenting with generative AI, but its current approach is a stark contrast to one of its newer rivals, Tesla.",
    "fullContent": "Waymo is experimenting with generative AI, but its current approach is a stark contrast to one of its newer rivals, Tesla.",
    "publishedAt": "2025-08-16T01:12:08.000Z",
    "fetchedAt": "2025-08-16T02:22:49.893Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62ae03da"
  },
  {
    "id": "ndtv-profit-youtube-60eca0da",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Press Conference | Trump-Putin Summit Ends Without Concrete Deal",
    "url": "https://www.youtube.com/watch?v=vvQHAFkhgjg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:11:24.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "60eca0da"
  },
  {
    "id": "ndtv-profit-youtube-2bf1eed",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Press Conference | Trump Says: Made 'Headway' But There Is No Deal Until There's A Deal",
    "url": "https://www.youtube.com/shorts/gOGJVVO6HPQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:00:50.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2bf1eed"
  },
  {
    "id": "scmp-business-790d6fe9",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Smoke grenades, live animals delivered to Hong Kong? How sellers evade crackdown",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3322062/smoke-grenades-live-animals-delivered-hong-kong-how-sellers-evade-crackdown?utm_source=rss_feed",
    "summary": "Smoke grenades, live animals and fresh meat are among the heavily regulated items readily available on mainland Chinese e-commerce sites for delivery to Hong Kong despite an official crackdown, the Post has found.",
    "fullContent": "Smoke grenades, live animals and fresh meat are among the heavily regulated items readily available on mainland Chinese e-commerce sites for delivery to Hong Kong despite an official crackdown, the Post has found. Listings on Taobao and Pinduoduo have been subject to increased scrutiny following the arrest last month of a 13-year-old Hongkonger who allegedly bought smoke grenades online. Sources earlier said that the boy had bought the three smoke grenades for HK$92 (US$11.70) on Pinduoduo on...",
    "publishedAt": "2025-08-16T01:00:23.000Z",
    "fetchedAt": "2025-08-16T02:22:50.133Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "790d6fe9"
  },
  {
    "id": "bloomberg-business-youtube-c72cb6",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Is the property bubble in #Dubai about to burst? #house #realestate #luxury #shorts",
    "url": "https://www.youtube.com/shorts/BRwtvExVbgg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:00:14.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "c72cb6"
  },
  {
    "id": "bloomberg-business-youtube-1e60bd66",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Could a Fed rate cut be premature? #shorts #fed #trump #powell #ratecut",
    "url": "https://www.youtube.com/shorts/3dzaj4Hf5FU",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T01:00:09.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1e60bd66"
  },
  {
    "id": "wsj-markets-main-73858c94",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Spotting Clouds in a Carefree Summer Market",
    "url": "https://www.wsj.com/finance/stocks/spotting-clouds-in-a-carefree-summer-market-a71a5c58?mod=rss_markets_main",
    "summary": "On a sunny summer&#x2019;s day, you might think of going to the beach. Or you might list the things that ought to be worrying investors, and mostly aren&#x2019;t. Your scribe chose the latter.",
    "fullContent": "On a sunny summer&#x2019;s day, you might think of going to the beach. Or you might list the things that ought to be worrying investors, and mostly aren&#x2019;t. Your scribe chose the latter.",
    "publishedAt": "2025-08-16T01:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.037Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "73858c94"
  },
  {
    "id": "common-reader-7ed904bf",
    "sourceId": "common-reader",
    "sourceName": "The Common Reader",
    "title": "Arlington travel notes",
    "url": "https://www.commonreader.co.uk/p/arlington-travel-notes",
    "summary": "",
    "fullContent": "Some initial observations",
    "publishedAt": "2025-08-16T00:59:01.000Z",
    "fetchedAt": "2025-08-16T02:25:37.573Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "7ed904bf"
  },
  {
    "id": "cnbc-tv18-youtube-5aedfb4e",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Janmashtami 2025: घर-घर पधारेंगे बाल गोपाल, जय नंदलाल | Mathura | Vrindavan | Iskon Temple | Delhi",
    "url": "https://www.youtube.com/watch?v=1x0SFQH8lKc",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:55:41.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5aedfb4e"
  },
  {
    "id": "zerohedge-7f14d76a",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Why The Government Is Not The Answer To Urban Planning",
    "url": "https://www.zerohedge.com/political/why-government-not-answer-urban-planning",
    "summary": "Why The Government Is Not The Answer To Urban Planning Via SchiffGold.com, City planning is a task that is often seen as a unique realm of governmental necessity. The existence of externalities means that the market could create extremely sub optimal outcomes when creating a...",
    "fullContent": "Why The Government Is Not The Answer To Urban Planning Via SchiffGold.com, City planning is a task that is often seen as a unique realm of governmental necessity. The existence of externalities means that the market could create extremely sub optimal outcomes when creating a city. For example, a house with a messy front yard hurts everyone, but the people in this house might have little incentive to clean up. A network of streets might not benefit its creator as much as the people who use it. While there are certainly some examples where the government intervening can be very helpful for most people, there are also many circumstances where government intervention is actually the key to a city’s demise. The importance of city planning is so great that it truly cannot be the decision of any one individual. Governmental city planning has many wins, but even more losses, not as a result of any specific government’s choices, but as a result of the institution’s inherent inability to capture information. The first problem with governmental urban planning is that they cannot effectively gather information on what people want. It would be uncommon for them to even run surveys on individual preferences. Beyond this, preferences themselves fluctuate. Predicting people’s preferences far into the future is almost impossible, and even more impossible for cash-strapped governments. People often cannot predict even their own preferences, so even if this information was to be gathered, there is no guarantee it would remain true. This harms city planning practically in the example of deciding how walkable a city will be versus how much it will allow people to live in the suburbs and commute in. The usefulness of a city is derived from how well it fulfills the preferences of its residents. People who try to make city planning a science don’t account for the fact that the exact same city would be a success or failure, depending entirely on the people who live within it. The second problem with government driven urban planning is that there is an extremely poorly-functioning feedback loop. Governments obscure their understanding of their own successes because they typically benchmark against other cities. They can only see their actions in conjunction with so many other environmental factors that it is difficult to disentangle the results of their policy and what would have happened anyways. The problem with benchmarking against other cities is that the inherently different environmental, social and legislative conditions of each city mean that a success for one city would truly be a failure for another city. However, there is too much pressure for urban planners to compare between fundamentally different cities. Sometimes a city will view itself as a failure and take drastic remedial action, but not realize that they have actually improved greatly from their previous state and would have kept proving with even less drastic action. Like anything in the study of humans, it is almost impossible to isolate factors within city planning. The relative success of a given district within a city might arise from 30 different subjective factors but also allow urban planners to falsely attribute the success to either outcome variables, or insignificant elements of the urban tapestry. A final limitation of governmental urban planning is the lackluster incentive structure. People are voted into office based on a wide variety of factors, but most often the most divisive policy points. Except for a few extreme cities, urban planning and infrastructure are not often in this list of big ticket items. While it directly affects people’s lives, they are more likely to attribute their sense of unhappiness on their commute to any policy other than the policies that actually created their roads and city structure. People like to think that things can be changed after one electoral cycle, but the problems that towns and cities face require years of complicated work in the same direction. Elected officials have the strongest incentives to satisfy the people’s desires, but the people who do most of the city planning lack this incentive as strongly. Urban planners are much more concerned with pleasing the bureaucrats and politicians who hired them then they do in developing an understanding of what the people of the city want. They are incentivized to present ideas that have worked in other places and are theoretically agreed-upon in general which leads them to creating spaces that work well in many places but not incredibly well in any one place. It is easy to tell when something has been created in this way because there are specific types of public transportation and urban spaces that seem to have been given the greenlight in the prestige-driven industry of urban planning. Tyler Durden Fri, 08/15/2025 - 20:55",
    "publishedAt": "2025-08-16T00:55:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.083Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7f14d76a"
  },
  {
    "id": "cnbc-tv18-youtube-1a5f4cfd",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Trump Putin Meeting in Alaska Live: Donald Trump and Vladimir Putin Meeting | Trump Tariff | World",
    "url": "https://www.youtube.com/watch?v=xXaQtyTCftg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:49:22.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1a5f4cfd"
  },
  {
    "id": "bloomberg-business-youtube-75406377",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump-Putin Meet in Alaska | Live Coverage on 'Balance of Power'",
    "url": "https://www.youtube.com/watch?v=oMtXshdedLs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:42:28.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "75406377"
  },
  {
    "id": "nse-online-announcements-6fb42b95",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Integrated Personnel Services Limited",
    "url": "https://nsearchives.nseindia.com/corporate/IPSL_16082025004149_Proceeding_of_EGM.pdf",
    "summary": "Integrated Personnel Services Limited has informed the Exchange regarding Proceedings of Extraordinary General Meeting held on August 14, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "Integrated Personnel Services Limited has informed the Exchange regarding Proceedings of Extraordinary General Meeting held on August 14, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-16T00:41:58.000Z",
    "fetchedAt": "2025-08-16T02:31:45.238Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "6fb42b95"
  },
  {
    "id": "thehindubusinessline-1f866e31",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Rethink India’s ‘crypto’ strategy",
    "url": "https://www.thehindubusinessline.com/opinion/rethink-indias-crypto-strategy/article69937965.ece",
    "summary": "Well-designed rupee-backed stablecoins could strengthen the rupee’s role in digital payments.",
    "fullContent": "Well-designed rupee-backed stablecoins could strengthen the rupee’s role in digital payments",
    "publishedAt": "2025-08-16T00:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.640Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1f866e31"
  },
  {
    "id": "nse-online-announcements-6341caf9",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "South West Pinnacle Exploration Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SOUTHWEST_16082025003901_presentation.pdf",
    "summary": "South West Pinnacle Exploration Limited has informed the Exchange regarding 'Updated Investor s Presentation'. |SUBJECT: Updates.",
    "fullContent": "South West Pinnacle Exploration Limited has informed the Exchange regarding 'Updated Investor s Presentation'. |SUBJECT: Updates",
    "publishedAt": "2025-08-16T00:39:59.000Z",
    "fetchedAt": "2025-08-16T02:31:45.238Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "6341caf9"
  },
  {
    "id": "ndtv-profit-youtube-2ecd1545",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Press Conference | Trump Says: Made 'Headway' But There Is No Deal Until There's A Deal",
    "url": "https://www.youtube.com/watch?v=2LjZOFZlSOQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:36:09.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2ecd1545"
  },
  {
    "id": "cnbc-tv18-youtube-702ce284",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Donald Trump and Vladimir Putin Meeting in Alaska 2025 Live: Trump Putin Meets | Trump Tariff |World",
    "url": "https://www.youtube.com/watch?v=ZeI0QijLHkw",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:33:06.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "702ce284"
  },
  {
    "id": "zerohedge-21338d65",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Putin: \"No Ukraine War If Trump Were President\"; Trump: \"No Deal Until There's A Deal\"",
    "url": "https://www.zerohedge.com/markets/history-making-summit-alaska-trump-en-route-meet-putin-everything-you-need-know",
    "summary": "Putin: \"No Ukraine War If Trump Were President\"; Trump: \"No Deal Until There's A Deal\" Update (2032ET): During a joint press conference following their multi-hour summit on ending the war in Ukraine, President Vladimir Putin said that if Donald Trump had been president in...",
    "fullContent": "Putin: \"No Ukraine War If Trump Were President\"; Trump: \"No Deal Until There's A Deal\" Update (2032ET): During a joint press conference following their multi-hour summit on ending the war in Ukraine, President Vladimir Putin said that if Donald Trump had been president in 2022, Russia would not have invaded Ukraine. This is essentially Putin blaming the Biden-Harris regime and its corrupt Deep State pals. We're sure Western corporate media will be all but silent on this new development. Putin stated: \"I'd like to remind you that in 2022, during the last contact with a previous administration, I tried to convince my previous American colleague it should not...the situation...should not be brought to the point of no return when it would come to hostilities. And I said quite directly back then that's a big mistake. Today, when President Trump saying that if he was the president back then there will be no war. And I'm quite sure it would indeed be so. I can confirm that. I think overall me and President Trump have built a very good business-like trustworthy contact. And every reason to believe moving down this path better to the end of the conflict in Ukraine.\" 🚨 BREAKING: Vladimir Putin CONFIRMS that the war in Ukraine NEVER would've happened if Trump was in office Trump was RIGHT! \"Today, when President Trump says that if he was President back [in 2022], there would be no war. And I'm quite sure that it would indeed be. I can… pic.twitter.com/glYtFFWCG5 — Nick Sortor (@nicksortor) August 15, 2025 Political commentator Rogan O'Handley emphasized on X that \"Democrat Media isn't going to like this clip, but it's true Biden and Kamala pushed for Ukraine to be added to NATO and then all hell broke loose Plus we all know Ukraine was Biden and the Deep State's money laundering playground And don't even get me started on the biolabs…\" After nearly three hours of talks, President Trump said, \"Many points were agreed to, and there are just a very few that are left,\" but gave no specifics, while Putin reiterated Russia's hard-line demands for Ukrainian territorial concessions, disarmament, NATO exclusion, and regime change in Kyiv. Both Trump and Putin seemed upbeat about finding a resolution to the war in Eastern Europe. They even shared a laugh... 🇷🇺🤝🇺🇸 Putin and Trump share a laugh after their JOINT press conference HANDSHAKE and light chatter follow Their HISTORICAL meeting is OFFICIALLY over https://t.co/eXtI2yDur0 pic.twitter.com/l7YEW8QbFF — RT (@RT_com) August 15, 2025 Before the summit, Putin was welcomed to Alaska with a red carpet, a joint limousine ride, and a B-2 bomber and fifth-generation fighter jet flyover.... The US flexes in the sky above the two negotiating leaders. pic.twitter.com/NHiKyQYWxz — James Hirsen (@thejimjams) August 15, 2025 Putin ended by inviting Trump to Moscow for a second round of talks to end the war in Ukraine. ⚡️ Putin switches to ENGLISH and invites Trump to MOSCOW for next round of talks Trump says he sees it as ‘possibly HAPPENING’ https://t.co/sLVkvyMV8Y pic.twitter.com/TKWZ3TwkZc — RT (@RT_com) August 15, 2025 Democrats today.... Democrats: “How dare Trump smile, shake hands, and have a casual conversation with Putin.” pic.twitter.com/fUq9Ef3tjB — I Meme Therefore I Am 🇺🇸 (@ImMeme0) August 15, 2025 Trumps stated earlier, \"There’s no deal until there’s a deal.\" * * * Putin began the joint press conference noting that negotiations were \"useful\" and held “in a constructive atmosphere.” Putin says there’s an agreement but Trump appears to dispute that fact, though he notes several points of alignment. The leaders didn’t spell out the points that had been agreed and those that hadn’t been. WATCH LIVE: Trump, Putin to hold news conference after talks on war in Ukrainehttps://t.co/pYHE36xFuY — Breaking911 (@Breaking911) August 15, 2025 Putin agreed with Trump that Ukraine's security must be guaranteed, and framed the agreement as a starting point for resolving the Ukraine situation, as well as restoring economic relations. “I would like to hope that the agreement we’ve reached together will help us bring closer that goal and will pave a path towards peace in Ukraine,” Putin says. “I expect that today’s agreements will be the starting point, not only for the solution of the Ukrainian issue, but also will help us bring back businesslike and pragmatic relations between Russia and the US.” He also notes that US and Russian investment and business cooperation have “tremendous potential.” Trump then spoke: “We had an extremely productive meeting and many points were agreed to. There are just a very few that are left. Some are not that significant; one is probably the most significant, but we have a very good chance of getting there. We didn’t get there but we have a very good chance of getting there.” “There’s no deal until there’s a deal,” Trump added. Trump added that he will confer with the leaders of NATO and Ukraine. “I’m going to start making a few phone calls and tell them what happened,” he said. Putin suggested the next meeting of the two leaders should be in Moscow. Trump frowned and suggested he would \"take some heat\" for that. Neither Putin nor Trump fielded any questions from reporters. * * * Update (1830ET): Discussions concluded after more than two-and-a-half hours at the summit in Alaska, marking the longest in-person meeting by Trump and Putin and offering a sign that by the US leader’s own metric the talks went well. Trump aide Dan Scavino said a three-on-three meeting was still ongoing at 1:25 p.m. Alaska time, more than two hours after reporters were ushered out of the room for the start of the formal discussions. ⚡️ Putin-Trump 3-on-3 talks have JUST ENDED https://t.co/vXOZ5S3hVb pic.twitter.com/9VZgboXCtu — RT (@RT_com) August 15, 2025 The Kremlin later said the narrow-format talks had finished. Joining the leaders in Friday’s meeting were US Secretary of State Marco Rubio and Trump special envoy Steve Witkoff, with Russian Foreign Minister Sergei Lavrov and Kremlin foreign policy aide Yuri Ushakov accompanying Putin. RT reports that Defense Minister Belousov is \"in a great mood.\" Fox News is reporting that Trump is currently holding a call with Ukrainian President Zelensky and other European leaders. Behind the scenes: Behind the scenes of Trump-Putin summit in Alaska pic.twitter.com/volHOKhZxP — RT (@RT_com) August 15, 2025 * * * Big B-2 flyover with both leaders on the tarmac, just after the handshake... Footage showing the fly-over earlier of a U.S. Air Force B-2A “Spirit” Long-Range Strategic Stealth Bomber escorted by 4 F-35 Lightning IIs as President Donald J. Trump and Russian President Vladimir Putin meet at Joint Base Elmendorf–Richardson in Anchorage, Alaska. pic.twitter.com/yDx6nQFm9u — OSINTdefender (@sentdefender) August 15, 2025 Update(1430ET): President Trump said just before landing in Anchorage that \"there's a good respect level on both sides\" - but he has also threatened to \"walk\" if things don't go well. Trump told Fox News' White House correspondent aboard Air Force One that if his meeting with Russian President Vladimir Putin doesn't go well, \"I would walk.\" According to the brief exchange: \"I mean, if it doesn't, you walk?\" Baier asked. \"I would walk, yeah,\" Trump said. But Trump also struck a tone of optimism: \"I think we're going to do very well. Our country is doing very well. We're setting records economically like we never have before, including the stock markets are all at record high,\" he said. the \"red carpet\" Trump told Fox further, \"We're taking in trillions and trillions of dollars with tariffs. We're going for a meeting with President Putin in Alaska, and I think it's going to work out very well. And if it doesn't, I'm gonna head back home real fast.\" \"Look, he's a smart guy. Been doing it for a long time, but so have I,\" Trump said of Putin. \"We get along. There's a good respect level on both sides.\" Per ABC and others: A White House official confirms President Donald Trump's meeting with Russian President Vladimir Putin will now be a three-on-three meeting. The president will be joined by White House Special Envoy Steve Witkoff and Secretary of State Marco Rubio. For the expanded working lunch, the president will be joined by Rubio, Witkoff, Defense Secretary Pete Hegseth, Treasury Secretary Scott Bessent, Commerce Secretary Howard Lutnick and White House chief of staff Susie Wiles, according to a White House official. Air Force One lands... BREAKING: President Trump has arrived at Alaska military base for summit with Putin on the Russia-Ukraine warpic.twitter.com/LdOLEy9Cjd — Insider Paper (@TheInsiderPaper) August 15, 2025 Trump warns Putin: 'very economically severe' consequences if meeting doesn't go to his liking Trump warns Putin: 'very economically severe' consequences if meeting doesn't go to his liking 'I'm not doing this for my health... I'm doing this to save a lot of lives' https://t.co/5no8dYOTbx pic.twitter.com/wlOPg8tZzt — RT (@RT_com) August 15, 2025 * * * President Trump has boarded Air Force One and is en route to Anchorage, Alaska - where what could be the most historic summit of his presidency is set to begin at 3pm Alaska time, which is 3pm eastern, and as the Russian delegation headed by Putin has already landed at Elmendorf-Richardson Air Force Base, which is venue for the talks. Trump himself has been busy trying to temper expectations, calling it a \"feel-out\" meeting and the White House elsewhere referring to a \"listening exercise\" on the Ukraine war and bilateral Moscow-Washington relations. While the consensus among Western officials and pundits is that deal to finally end the war is likely yet still far away, \"we do expect some progress in today’s meeting and a path set for further discussions,\" according to Mohit Kumar, chief European strategist at Jefferies International. \"If we move toward a peace deal, it would be positive for the European markets.\" 🚨President Trump is officially on his way to Anchorage, Alaska where he will meet with Russian President Vladimir Putin.pic.twitter.com/MHDw6NzjUx — Townhall.com (@townhallcom) August 15, 2025 Below is everything you need to know (via Newsquawk): Trump-Putin Summit in Alaska on Friday 15th August 2025; Summit to begin at 15:00 EDT/20:00 BST; Trump assigned a 25% chance the meeting will not be successful. OVERVIEW MEETING FORMAT US President Trump is to meet Russian President Putin in US territory at Elmendorf-Richardson Air Force Base near Anchorage, Alaska, on Friday, 15 August 2025. White House said US President Trump will participate in a bilateral program with the President of the Russian Federation in Alaska at 11:00AM (15:00EDT/20:00BST) and will depart Alaska at 17:45 (21:45/02:45BST). The Alaska summit will begin at 11:30 local time on Friday (20:30 BST/15:30 EDT), according to Russian Kremlin's Ushakov on Wednesday. Russian President Putin and US President Trump to have a one-on-one meeting with translators; also to have a wider meeting with delegations. US President Trump on Thursday said that he does not know if there will be a joint press conference with Russian President Putin after the Alaska meeting. Trump will have a press conference however the talks go. Russian delegation to include Russian Foreign Minister Lavrov, Advisor Ushakov, Defence Minister Belousov, Finance Minister Siluanov and Special Envoy and head of Sovereign Wealth Fund Dmitriev. The meeting will be the first time the Russian leader has set foot on US soil since 2015. Ukrainian President Zelensky is not invited to the Alaska summit. PURPOSE: The meeting aims to explore ways to end Russia’s war against Ukraine. Russia's Kremlin said the central topic is Ukraine. The sides are to discuss trade and economic cooperation where there is \"huge untapped potential\". White House spokeswoman Leavitt described it as a “listening exercise\" to hear what Putin proposes. \"At the end of that meeting, probably the first two minutes, I'll know exactly whether or not a deal can be made,\" Trump said at a White House press conference. EXPECTATIONS The White House downplayed expectations, describing the meeting as a listening exercise. President Trump called it a leel-out meeting. US President Trump on Thursday assigned a 25% chance that the first meeting (Alaska) is not successful; and said he could be more sanctions if the meeting is not successful. Trump added Have economic incentives and disincentives at his disposal for the meeting; would rather not say about specifics. Incentives/sanctions are \"very powerful\". There are no plans to sign documents on the outcome of the Alaska summit between Russia and the US, via Ifx citing the Kremlin; would be a mistake to predict the outcome of the talks. \"All in all, it is difficult to envision a smooth solution to the Russia-Ukraine war through this summit, with Moscow demanding Ukraine give up some territory, a red line for Kyiv.\" Analysts at Rane suggest the Friday summit \"risks side-lining Ukraine, fracturing Western unity and creating space for Russia to delay sanctions, consolidate battlefield gains and promote a US-Russia framework that advances Russian strategic interests.\" Markets will likely focus on several factors: the prospect of looser US sanctions on Russia. how far Russia is willing to go on concessions. any tangible progress towards a Russia-Ukraine ceasefire. TRUMP'S CALL WITH EUROPEAN LEADERS ON WEDNESDAY US President Trump held a call with European leaders and Ukrainian President Zelensky, which he said was a very good call and \"rate it a 10\", while he will meet with Russian President Putin, then will call Zelensky and European leaders. Trump said there is a good chance of a second meeting and he would like to do a second meeting almost immediately which would include Zelensky if the first meeting goes okay, but there may not be a second meeting if he feels it is inappropriate or if he does not get the answers he wants. Furthermore, he said the first meeting is finding out what they are doing and a second meeting will be more productive, but warned that Russia will face consequences if the war is not stopped. US President Trump discussed with European leaders possible locations for a meeting between Zelensky, Trump and Putin after the Alaska summit, while locations include cities in Europe and the Middle East, according to Reuters citing sources. US President Trump reportedly told those on Wednesday's call that he is willing to contribute US security guarantees for Ukraine with some conditions, via Politico citing sources; openness that helps explain the cautious European optimism. Guarantees which are seen as key by Europe and Ukraine. However, Politico caveats that Trump did not elaborate on what he meant by security guarantees, and would only make this commitment of the effort is not part of NATO. RUSSIA'S PRE-MEETING COMMENTS Russian Foreign Ministry says Moscow expects Trump's visit to Russia after Alaska summit, according to AI Arabiya. \"We have a clear position that we will present at the Alaska summit and hope to continue the dialogue\". \"We do not speculate on anything in the future and we have clear arguments and positions that we will present during the Alaska summit\". Russian President Putin said the US is making a sincere effort to find a solution for the Ukraine crisis; US are seeking agreements that are acceptable to all, via Ifx. Peace will be strengthened if at the next stage Russia and US reach agreements in the field of strategic offensive arms control. New arms agreements with US are possible. UKRAINE INVOLVEMENT President Trump said he may arrange a subsequent meeting involving Zelensky and Putin, but he dismissed Zelensky’s desire to participate directly, noting that the Ukrainian leader has ' been to a lot of meetings' without ending the war. Zelensky criticised the summit's bilateral format, warning that any peace deal must be approved in a national referendum and that the absence of Ukraine would render an agreement illegitimate. RENEWED OFFENSIVE Ukrainian President Zelensky on August 12th posted, \"We see that the Russian army is not preparing to end the war. On the contrary, they are making movements that indicate preparations for new offensive operations.” Zelensky added that Russia is moving troops from the Sumy region to Pokrovsky, Zaporizhzhia, and is preparing for a new assault at the start of September. Zelensky said the current Russian push in eastern Ukraine is timed to coincide with Trump-Putin talks. Ukrainian President Zelensky has repeatedly stated that Ukraine will not cede land. Russian President Putin reportedly appears ready to test new nuclear-armed, nuclear-powered cruise missiles even as he prepares for talks with US President Trump, according to US researchers and Western security sources cited by Reuters. Ukraine's military says it struck Russia's port Olya in the Astrakhan region on Thursday and hit a ship with drone parts and ammo from Iran. STANCES RUSSIA'S POSITION Russian President Putin is seek ng to lock in Russia's territorial gains and prevent Ukraine from joining NATO. Reports suggest Putin may have floated a ceasefire that asks Ukraine to cede much of Donetsk and to demilitarize Bloomberg reported on August 5th that the Kremlin is said to be mulling options for a concession to US President Trump that could include an air truce with Ukraine, in a bid to minimize the threat of secondary sanctions US and Russia reportedly planning Ukraine deal to cement Russ an territorial gains, according to Bloomberg (Aug 8th). Russia would halt its offensive in the Kherson and Zaporizhzhia regions of Ukraine Russian President Putin reportedly demands Ukraine cede Donetsk Lunansk and Crimea. Putin told Witkoff he would agree to a complete cease-fire if Ukraine agreed to withdraw forces from all of Ukraine s Eastern Donetsk region. UKRAINE'S POSITION Ukrainian President Zelensky said he understood that Russia wants Kyiv to pull out of Donbas and will not advance in other directions in exchange, he added that Ukraine will not pull out of Donbas as such a move would open the way for Russia to attack Dnipropetrovsk. Zaporizhzhia regions, and Kharkiv Zelensky added that territorial issues should be discussed after the ceasefire and along with security guarantees for Ukraine. In a press conference, he warned that Russia wants Ukraine to withdraw from the remaining 30% of the Donetsk region, but Ukraine's constitution prohibits surrendering territory. He also emphasized that giving up Donbas would become a springboard for future invasions; he insists Ukraine will not leave its fortifications or open an avenue for a Russian offensive. Ukraine insists on a durable ceasefire before any discussion of territorial issues. According to Politico Zelenskyy and European allies will use Wednesday's call tc push for a deal that demands a lasting ceasefire. Prior reports of softened Ukraine Stance Ukraine could agree to stop fighting and cede territory already held by Russia as pal of a European-backed plan for peace, according to The Telegraph (Aug 11th) Ukrainian President Zelensky reportedly told European leaders that they must reject any settlement produced by Trump, which sees them giving up Ukrainian land they still hold, but that Ukrainian territory in Russia's control could be on the table. This would mean freezing the frontline where it is and handing Russia de facto control of the territory it occupies EU/NATO POSITION EU and NATO leaders insist that Ukraine’s sovereignty and security guarantees are non-negotiable while analysts caution that land-swap proposals risk legitimizing aggression. NATO Secretary-Genera Rutte described the Alaska summit as a way to test Putin's seriousness and stressed that Ukraine must decide its own future he argued that only involving Ukraine and Europe will make any settlement EU Foreign Policy Chief Kallas said on August 11th that the EU will work on a 1st package of sanctions against Russia while she warned against concessions to Moscow. Germany said it will fund a USD 500m n package of military equipment and munitions Polish PM Tusk said they cannot allow the biggest powers to decide the fate of smaller countries without their participation and Russia wants to ink a reduction in NATO troops in Poland to the talks about Ukraine, while he added It will be easier for Poland's opponents to \"play us\" if we are not united. POTENTIAL SCENARIOS AND MARKET ANGLES No Deal [most likely]: Analysts consider it likely that the summit results n no ma or agreement Trump may simply gauge Put n s intentions and then coordinate with Zelenskyy and Europe. Broader sentiment will likely not be too swayed by a \"no deal\" amid low expectations heading into the meeting Limited Ceasefire [possible] This could be seen as progress toward de-escalation: on and potential easing of sanctions A \"limited ceasefire\" could be short-term negative for oil. defense stocks whilst stocks and EUR equities and EGBs could be buoyed Some analysts suggest Russia could use a limited ceasefire to regroup and delay sanctions. US-Russia Tensions Escalate [possible but not in bilateral interests] A further breakdown in relations between Moscow and Washington could see risk avers on and a rise in oil prices. Goldman Sachs: While lack of progress towards a ceasefire may lead renewed threats of secondary oil tariffs/sanctions, we see limited risk of large disruptions in Russia supply given the large volumes of Russian exports the possibility for deepening price discounts to maintain demand, and Iikely eagerness of the key buyers, India and especially China to continue energy cooperation with Russia As a reminder. US President Trump recently ordered two nuclear submarines to be \"positioned in the appropriate regions\" in response to \"highly provocative ’ comments by former Russian President Medvedev Land-Swap Proposal [possible but unlikely to be accepted]: If Trump agrees to a ceasefire that frontloads territorial concessions, analysts warn that Ukraine and Europe will reject it. Such a deal could trigger political backlash in Ukraine and may collapse due to constitutional and public opposition Short-term risk across markets amid progress toward de-escalation and potent al easing of sanctions with energy likely to slip. However, the reaction will likely fade if/when rejected by Ukraine. Comprehensive Framework [near-zero] Neither side currently appears willing to make the necessary concessions. Without Ukraine's participation on any framework is likely to faiI. Risk on. energy sold Goldman Sachs \"While a lasting peace agreement may potentially lead to a relaxation of US sanctions on Russian oil we wouldn't expect a significant short-term increase in Russian oiI supply in this scenario. The reason is that Russian production, in our view, has instead been constrained by CPEC+ quota decisions, low oi: investment, and a strong Ruble Here is what the most likely outcomes are according to a Bloomberg Markets Live poll: Source: Bloomberg HOUSE VIEWS BLOOMBERG: Bloomberg's John Authers citing Christopher Smart of the Arbroath Group says \"European defence stocks should fly on any lopsided deal that rewards Russia's aggression with oil prices likely to slump on even the whiff of looser sanctions on Russian oil... Beyond Europe, markets appear to have long since moved past the 2022 invasion, implying Friday s meeting has little potential to trigger a significant market shift. \" GOLDMAN SACHS: We don't expect the announced meeting between President Trump and President Putin, scheduled for Friday August 15 to cause a significant shift in Russian oil supply in key scenarios”. ING: If we do see some level of de-escalation, it could remove sanction risk from the oil market. This would likely drive prices lower, given the Bearish fundamentals . Tyler Durden Fri, 08/15/2025 - 20:32",
    "publishedAt": "2025-08-16T00:32:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.085Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "21338d65"
  },
  {
    "id": "zerohedge-2b4b88d0",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Putin: \"No Ukraine War If Trump Were President\"; Trump: \"No Deal Until There's A Deal\"",
    "url": "https://www.zerohedge.com/markets/history-making-summit-alaska-trump-en-route-meet-putin-everything-you-need-know",
    "summary": "Putin: \"No Ukraine War If Trump Were President\"; Trump: \"No Deal Until There's A Deal\" Update (2032ET): During a joint press conference following their multi-hour summit on ending the war in Ukraine, President Vladimir Putin said that if Donald Trump had been president in...",
    "fullContent": "Putin: \"No Ukraine War If Trump Were President\"; Trump: \"No Deal Until There's A Deal\" Update (2032ET): During a joint press conference following their multi-hour summit on ending the war in Ukraine, President Vladimir Putin said that if Donald Trump had been president in 2022, Russia would not have invaded Ukraine. This is essentially Putin blaming the Biden-Harris regime and its corrupt Deep State pals. We're sure Western corporate media will be all but silent on this new development. Putin stated: \"I'd like to remind you that in 2022, during the last contact with a previous administration, I tried to convince my previous American colleague it should not...the situation...should not be brought to the point of no return when it would come to hostilities. And I said quite directly back then that's a big mistake. Today, when President Trump saying that if he was the president back then there will be no war. And I'm quite sure it would indeed be so. I can confirm that. I think overall me and President Trump have built a very good business-like trustworthy contact. And every reason to believe moving down this path better to the end of the conflict in Ukraine.\" 🚨 BREAKING: Vladimir Putin CONFIRMS that the war in Ukraine NEVER would've happened if Trump was in office Trump was RIGHT! \"Today, when President Trump says that if he was President back [in 2022], there would be no war. And I'm quite sure that it would indeed be. I can… pic.twitter.com/glYtFFWCG5 — Nick Sortor (@nicksortor) August 15, 2025 Political commentator Rogan O'Handley emphasized on X that \"Democrat Media isn't going to like this clip, but it's true Biden and Kamala pushed for Ukraine to be added to NATO and then all hell broke loose Plus we all know Ukraine was Biden and the Deep State's money laundering playground And don't even get me started on the biolabs…\" After nearly three hours of talks, President Trump said, \"Many points were agreed to, and there are just a very few that are left,\" but gave no specifics, while Putin reiterated Russia's hard-line demands for Ukrainian territorial concessions, disarmament, NATO exclusion, and regime change in Kyiv. Both Trump and Putin seemed upbeat about finding a resolution to the war in Eastern Europe. They even shared a laugh... 🇷🇺🤝🇺🇸 Putin and Trump share a laugh after their JOINT press conference HANDSHAKE and light chatter follow Their HISTORICAL meeting is OFFICIALLY over https://t.co/eXtI2yDur0 pic.twitter.com/l7YEW8QbFF — RT (@RT_com) August 15, 2025 Before the summit, Putin was welcomed to Alaska with a red carpet, a joint limousine ride, and a B-2 bomber and fifth-generation fighter jet flyover.... The US flexes in the sky above the two negotiating leaders. pic.twitter.com/NHiKyQYWxz — James Hirsen (@thejimjams) August 15, 2025 Putin ended by inviting Trump to Moscow for a second round of talks to end the war in Ukraine. ⚡️ Putin switches to ENGLISH and invites Trump to MOSCOW for next round of talks Trump says he sees it as ‘possibly HAPPENING’ https://t.co/sLVkvyMV8Y pic.twitter.com/TKWZ3TwkZc — RT (@RT_com) August 15, 2025 Democrats today.... Democrats: “How dare Trump smile, shake hands, and have a casual conversation with Putin.” pic.twitter.com/fUq9Ef3tjB — I Meme Therefore I Am 🇺🇸 (@ImMeme0) August 15, 2025 Trumps stated earlier, \"There’s no deal until there’s a deal.\" * * * Putin began the joint press conference noting that negotiations were \"useful\" and held “in a constructive atmosphere.” Putin says there’s an agreement but Trump appears to dispute that fact, though he notes several points of alignment. The leaders didn’t spell out the points that had been agreed and those that hadn’t been. WATCH LIVE: Trump, Putin to hold news conference after talks on war in Ukrainehttps://t.co/pYHE36xFuY — Breaking911 (@Breaking911) August 15, 2025 Putin agreed with Trump that Ukraine's security must be guaranteed, and framed the agreement as a starting point for resolving the Ukraine situation, as well as restoring economic relations. “I would like to hope that the agreement we’ve reached together will help us bring closer that goal and will pave a path towards peace in Ukraine,” Putin says. “I expect that today’s agreements will be the starting point, not only for the solution of the Ukrainian issue, but also will help us bring back businesslike and pragmatic relations between Russia and the US.” He also notes that US and Russian investment and business cooperation have “tremendous potential.” Trump then spoke: “We had an extremely productive meeting and many points were agreed to. There are just a very few that are left. Some are not that significant; one is probably the most significant, but we have a very good chance of getting there. We didn’t get there but we have a very good chance of getting there.” “There’s no deal until there’s a deal,” Trump added. Trump added that he will confer with the leaders of NATO and Ukraine. “I’m going to start making a few phone calls and tell them what happened,” he said. Putin suggested the next meeting of the two leaders should be in Moscow. Trump frowned and suggested he would \"take some heat\" for that. Neither Putin nor Trump fielded any questions from reporters. * * * Update (1830ET): Discussions concluded after more than two-and-a-half hours at the summit in Alaska, marking the longest in-person meeting by Trump and Putin and offering a sign that by the US leader’s own metric the talks went well. Trump aide Dan Scavino said a three-on-three meeting was still ongoing at 1:25 p.m. Alaska time, more than two hours after reporters were ushered out of the room for the start of the formal discussions. ⚡️ Putin-Trump 3-on-3 talks have JUST ENDED https://t.co/vXOZ5S3hVb pic.twitter.com/9VZgboXCtu — RT (@RT_com) August 15, 2025 The Kremlin later said the narrow-format talks had finished. Joining the leaders in Friday’s meeting were US Secretary of State Marco Rubio and Trump special envoy Steve Witkoff, with Russian Foreign Minister Sergei Lavrov and Kremlin foreign policy aide Yuri Ushakov accompanying Putin. RT reports that Defense Minister Belousov is \"in a great mood.\" Fox News is reporting that Trump is currently holding a call with Ukrainian President Zelensky and other European leaders. Behind the scenes: Behind the scenes of Trump-Putin summit in Alaska pic.twitter.com/volHOKhZxP — RT (@RT_com) August 15, 2025 * * * Big B-2 flyover with both leaders on the tarmac, just after the handshake... Footage showing the fly-over earlier of a U.S. Air Force B-2A “Spirit” Long-Range Strategic Stealth Bomber escorted by 4 F-35 Lightning IIs as President Donald J. Trump and Russian President Vladimir Putin meet at Joint Base Elmendorf–Richardson in Anchorage, Alaska. pic.twitter.com/yDx6nQFm9u — OSINTdefender (@sentdefender) August 15, 2025 Update(1430ET): President Trump said just before landing in Anchorage that \"there's a good respect level on both sides\" - but he has also threatened to \"walk\" if things don't go well. Trump told Fox News' White House correspondent aboard Air Force One that if his meeting with Russian President Vladimir Putin doesn't go well, \"I would walk.\" According to the brief exchange: \"I mean, if it doesn't, you walk?\" Baier asked. \"I would walk, yeah,\" Trump said. But Trump also struck a tone of optimism: \"I think we're going to do very well. Our country is doing very well. We're setting records economically like we never have before, including the stock markets are all at record high,\" he said. the \"red carpet\" Trump told Fox further, \"We're taking in trillions and trillions of dollars with tariffs. We're going for a meeting with President Putin in Alaska, and I think it's going to work out very well. And if it doesn't, I'm gonna head back home real fast.\" \"Look, he's a smart guy. Been doing it for a long time, but so have I,\" Trump said of Putin. \"We get along. There's a good respect level on both sides.\" Per ABC and others: A White House official confirms President Donald Trump's meeting with Russian President Vladimir Putin will now be a three-on-three meeting. The president will be joined by White House Special Envoy Steve Witkoff and Secretary of State Marco Rubio. For the expanded working lunch, the president will be joined by Rubio, Witkoff, Defense Secretary Pete Hegseth, Treasury Secretary Scott Bessent, Commerce Secretary Howard Lutnick and White House chief of staff Susie Wiles, according to a White House official. Air Force One lands... BREAKING: President Trump has arrived at Alaska military base for summit with Putin on the Russia-Ukraine warpic.twitter.com/LdOLEy9Cjd — Insider Paper (@TheInsiderPaper) August 15, 2025 Trump warns Putin: 'very economically severe' consequences if meeting doesn't go to his liking Trump warns Putin: 'very economically severe' consequences if meeting doesn't go to his liking 'I'm not doing this for my health... I'm doing this to save a lot of lives' https://t.co/5no8dYOTbx pic.twitter.com/wlOPg8tZzt — RT (@RT_com) August 15, 2025 * * * President Trump has boarded Air Force One and is en route to Anchorage, Alaska - where what could be the most historic summit of his presidency is set to begin at 3pm Alaska time, which is 3pm eastern, and as the Russian delegation headed by Putin has already landed at Elmendorf-Richardson Air Force Base, which is venue for the talks. Trump himself has been busy trying to temper expectations, calling it a \"feel-out\" meeting and the White House elsewhere referring to a \"listening exercise\" on the Ukraine war and bilateral Moscow-Washington relations. While the consensus among Western officials and pundits is that deal to finally end the war is likely yet still far away, \"we do expect some progress in today’s meeting and a path set for further discussions,\" according to Mohit Kumar, chief European strategist at Jefferies International. \"If we move toward a peace deal, it would be positive for the European markets.\" 🚨President Trump is officially on his way to Anchorage, Alaska where he will meet with Russian President Vladimir Putin.pic.twitter.com/MHDw6NzjUx — Townhall.com (@townhallcom) August 15, 2025 Below is everything you need to know (via Newsquawk): Trump-Putin Summit in Alaska on Friday 15th August 2025; Summit to begin at 15:00 EDT/20:00 BST; Trump assigned a 25% chance the meeting will not be successful. OVERVIEW MEETING FORMAT US President Trump is to meet Russian President Putin in US territory at Elmendorf-Richardson Air Force Base near Anchorage, Alaska, on Friday, 15 August 2025. White House said US President Trump will participate in a bilateral program with the President of the Russian Federation in Alaska at 11:00AM (15:00EDT/20:00BST) and will depart Alaska at 17:45 (21:45/02:45BST). The Alaska summit will begin at 11:30 local time on Friday (20:30 BST/15:30 EDT), according to Russian Kremlin's Ushakov on Wednesday. Russian President Putin and US President Trump to have a one-on-one meeting with translators; also to have a wider meeting with delegations. US President Trump on Thursday said that he does not know if there will be a joint press conference with Russian President Putin after the Alaska meeting. Trump will have a press conference however the talks go. Russian delegation to include Russian Foreign Minister Lavrov, Advisor Ushakov, Defence Minister Belousov, Finance Minister Siluanov and Special Envoy and head of Sovereign Wealth Fund Dmitriev. The meeting will be the first time the Russian leader has set foot on US soil since 2015. Ukrainian President Zelensky is not invited to the Alaska summit. PURPOSE: The meeting aims to explore ways to end Russia’s war against Ukraine. Russia's Kremlin said the central topic is Ukraine. The sides are to discuss trade and economic cooperation where there is \"huge untapped potential\". White House spokeswoman Leavitt described it as a “listening exercise\" to hear what Putin proposes. \"At the end of that meeting, probably the first two minutes, I'll know exactly whether or not a deal can be made,\" Trump said at a White House press conference. EXPECTATIONS The White House downplayed expectations, describing the meeting as a listening exercise. President Trump called it a leel-out meeting. US President Trump on Thursday assigned a 25% chance that the first meeting (Alaska) is not successful; and said he could be more sanctions if the meeting is not successful. Trump added Have economic incentives and disincentives at his disposal for the meeting; would rather not say about specifics. Incentives/sanctions are \"very powerful\". There are no plans to sign documents on the outcome of the Alaska summit between Russia and the US, via Ifx citing the Kremlin; would be a mistake to predict the outcome of the talks. \"All in all, it is difficult to envision a smooth solution to the Russia-Ukraine war through this summit, with Moscow demanding Ukraine give up some territory, a red line for Kyiv.\" Analysts at Rane suggest the Friday summit \"risks side-lining Ukraine, fracturing Western unity and creating space for Russia to delay sanctions, consolidate battlefield gains and promote a US-Russia framework that advances Russian strategic interests.\" Markets will likely focus on several factors: the prospect of looser US sanctions on Russia. how far Russia is willing to go on concessions. any tangible progress towards a Russia-Ukraine ceasefire. TRUMP'S CALL WITH EUROPEAN LEADERS ON WEDNESDAY US President Trump held a call with European leaders and Ukrainian President Zelensky, which he said was a very good call and \"rate it a 10\", while he will meet with Russian President Putin, then will call Zelensky and European leaders. Trump said there is a good chance of a second meeting and he would like to do a second meeting almost immediately which would include Zelensky if the first meeting goes okay, but there may not be a second meeting if he feels it is inappropriate or if he does not get the answers he wants. Furthermore, he said the first meeting is finding out what they are doing and a second meeting will be more productive, but warned that Russia will face consequences if the war is not stopped. US President Trump discussed with European leaders possible locations for a meeting between Zelensky, Trump and Putin after the Alaska summit, while locations include cities in Europe and the Middle East, according to Reuters citing sources. US President Trump reportedly told those on Wednesday's call that he is willing to contribute US security guarantees for Ukraine with some conditions, via Politico citing sources; openness that helps explain the cautious European optimism. Guarantees which are seen as key by Europe and Ukraine. However, Politico caveats that Trump did not elaborate on what he meant by security guarantees, and would only make this commitment of the effort is not part of NATO. RUSSIA'S PRE-MEETING COMMENTS Russian Foreign Ministry says Moscow expects Trump's visit to Russia after Alaska summit, according to AI Arabiya. \"We have a clear position that we will present at the Alaska summit and hope to continue the dialogue\". \"We do not speculate on anything in the future and we have clear arguments and positions that we will present during the Alaska summit\". Russian President Putin said the US is making a sincere effort to find a solution for the Ukraine crisis; US are seeking agreements that are acceptable to all, via Ifx. Peace will be strengthened if at the next stage Russia and US reach agreements in the field of strategic offensive arms control. New arms agreements with US are possible. UKRAINE INVOLVEMENT President Trump said he may arrange a subsequent meeting involving Zelensky and Putin, but he dismissed Zelensky’s desire to participate directly, noting that the Ukrainian leader has ' been to a lot of meetings' without ending the war. Zelensky criticised the summit's bilateral format, warning that any peace deal must be approved in a national referendum and that the absence of Ukraine would render an agreement illegitimate. RENEWED OFFENSIVE Ukrainian President Zelensky on August 12th posted, \"We see that the Russian army is not preparing to end the war. On the contrary, they are making movements that indicate preparations for new offensive operations.” Zelensky added that Russia is moving troops from the Sumy region to Pokrovsky, Zaporizhzhia, and is preparing for a new assault at the start of September. Zelensky said the current Russian push in eastern Ukraine is timed to coincide with Trump-Putin talks. Ukrainian President Zelensky has repeatedly stated that Ukraine will not cede land. Russian President Putin reportedly appears ready to test new nuclear-armed, nuclear-powered cruise missiles even as he prepares for talks with US President Trump, according to US researchers and Western security sources cited by Reuters. Ukraine's military says it struck Russia's port Olya in the Astrakhan region on Thursday and hit a ship with drone parts and ammo from Iran. STANCES RUSSIA'S POSITION Russian President Putin is seek ng to lock in Russia's territorial gains and prevent Ukraine from joining NATO. Reports suggest Putin may have floated a ceasefire that asks Ukraine to cede much of Donetsk and to demilitarize Bloomberg reported on August 5th that the Kremlin is said to be mulling options for a concession to US President Trump that could include an air truce with Ukraine, in a bid to minimize the threat of secondary sanctions US and Russia reportedly planning Ukraine deal to cement Russ an territorial gains, according to Bloomberg (Aug 8th). Russia would halt its offensive in the Kherson and Zaporizhzhia regions of Ukraine Russian President Putin reportedly demands Ukraine cede Donetsk Lunansk and Crimea. Putin told Witkoff he would agree to a complete cease-fire if Ukraine agreed to withdraw forces from all of Ukraine s Eastern Donetsk region. UKRAINE'S POSITION Ukrainian President Zelensky said he understood that Russia wants Kyiv to pull out of Donbas and will not advance in other directions in exchange, he added that Ukraine will not pull out of Donbas as such a move would open the way for Russia to attack Dnipropetrovsk. Zaporizhzhia regions, and Kharkiv Zelensky added that territorial issues should be discussed after the ceasefire and along with security guarantees for Ukraine. In a press conference, he warned that Russia wants Ukraine to withdraw from the remaining 30% of the Donetsk region, but Ukraine's constitution prohibits surrendering territory. He also emphasized that giving up Donbas would become a springboard for future invasions; he insists Ukraine will not leave its fortifications or open an avenue for a Russian offensive. Ukraine insists on a durable ceasefire before any discussion of territorial issues. According to Politico Zelenskyy and European allies will use Wednesday's call tc push for a deal that demands a lasting ceasefire. Prior reports of softened Ukraine Stance Ukraine could agree to stop fighting and cede territory already held by Russia as pal of a European-backed plan for peace, according to The Telegraph (Aug 11th) Ukrainian President Zelensky reportedly told European leaders that they must reject any settlement produced by Trump, which sees them giving up Ukrainian land they still hold, but that Ukrainian territory in Russia's control could be on the table. This would mean freezing the frontline where it is and handing Russia de facto control of the territory it occupies EU/NATO POSITION EU and NATO leaders insist that Ukraine’s sovereignty and security guarantees are non-negotiable while analysts caution that land-swap proposals risk legitimizing aggression. NATO Secretary-Genera Rutte described the Alaska summit as a way to test Putin's seriousness and stressed that Ukraine must decide its own future he argued that only involving Ukraine and Europe will make any settlement EU Foreign Policy Chief Kallas said on August 11th that the EU will work on a 1st package of sanctions against Russia while she warned against concessions to Moscow. Germany said it will fund a USD 500m n package of military equipment and munitions Polish PM Tusk said they cannot allow the biggest powers to decide the fate of smaller countries without their participation and Russia wants to ink a reduction in NATO troops in Poland to the talks about Ukraine, while he added It will be easier for Poland's opponents to \"play us\" if we are not united. POTENTIAL SCENARIOS AND MARKET ANGLES No Deal [most likely]: Analysts consider it likely that the summit results n no ma or agreement Trump may simply gauge Put n s intentions and then coordinate with Zelenskyy and Europe. Broader sentiment will likely not be too swayed by a \"no deal\" amid low expectations heading into the meeting Limited Ceasefire [possible] This could be seen as progress toward de-escalation: on and potential easing of sanctions A \"limited ceasefire\" could be short-term negative for oil. defense stocks whilst stocks and EUR equities and EGBs could be buoyed Some analysts suggest Russia could use a limited ceasefire to regroup and delay sanctions. US-Russia Tensions Escalate [possible but not in bilateral interests] A further breakdown in relations between Moscow and Washington could see risk avers on and a rise in oil prices. Goldman Sachs: While lack of progress towards a ceasefire may lead renewed threats of secondary oil tariffs/sanctions, we see limited risk of large disruptions in Russia supply given the large volumes of Russian exports the possibility for deepening price discounts to maintain demand, and Iikely eagerness of the key buyers, India and especially China to continue energy cooperation with Russia As a reminder. US President Trump recently ordered two nuclear submarines to be \"positioned in the appropriate regions\" in response to \"highly provocative ’ comments by former Russian President Medvedev Land-Swap Proposal [possible but unlikely to be accepted]: If Trump agrees to a ceasefire that frontloads territorial concessions, analysts warn that Ukraine and Europe will reject it. Such a deal could trigger political backlash in Ukraine and may collapse due to constitutional and public opposition Short-term risk across markets amid progress toward de-escalation and potent al easing of sanctions with energy likely to slip. However, the reaction will likely fade if/when rejected by Ukraine. Comprehensive Framework [near-zero] Neither side currently appears willing to make the necessary concessions. Without Ukraine's participation on any framework is likely to faiI. Risk on. energy sold Goldman Sachs \"While a lasting peace agreement may potentially lead to a relaxation of US sanctions on Russian oil we wouldn't expect a significant short-term increase in Russian oiI supply in this scenario. The reason is that Russian production, in our view, has instead been constrained by CPEC+ quota decisions, low oi: investment, and a strong Ruble Here is what the most likely outcomes are according to a Bloomberg Markets Live poll: Source: Bloomberg HOUSE VIEWS BLOOMBERG: Bloomberg's John Authers citing Christopher Smart of the Arbroath Group says \"European defence stocks should fly on any lopsided deal that rewards Russia's aggression with oil prices likely to slump on even the whiff of looser sanctions on Russian oil... Beyond Europe, markets appear to have long since moved past the 2022 invasion, implying Friday s meeting has little potential to trigger a significant market shift. \" GOLDMAN SACHS: We don't expect the announced meeting between President Trump and President Putin, scheduled for Friday August 15 to cause a significant shift in Russian oil supply in key scenarios”. ING: If we do see some level of de-escalation, it could remove sanction risk from the oil market. This would likely drive prices lower, given the Bearish fundamentals . Tyler Durden Fri, 08/15/2025 - 20:32",
    "publishedAt": "2025-08-16T00:32:00.000Z",
    "fetchedAt": "2025-08-16T09:40:37.302Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2b4b88d0"
  },
  {
    "id": "cnbc-tv18-youtube-5e1df6a0",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Trump-Putin Meeting Live Update : Alaska में पुतिन और ट्रंप के बीच हुई बातचीत, जानें क्या हुआ? | War",
    "url": "https://www.youtube.com/watch?v=vjBkNycMx2k",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:30:53.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5e1df6a0"
  },
  {
    "id": "thehindubusinessline-32745dd7",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Coming to grips with handling stray dogs",
    "url": "https://www.thehindubusinessline.com/opinion/coming-to-grips-with-handling-stray-dogs/article69937986.ece",
    "summary": "Sterilising and vaccinating all the streeties and culling the very sick and rabid seems to be the best way forward.",
    "fullContent": "Sterilising and vaccinating all the streeties and culling the very sick and rabid seems to be the best way forward",
    "publishedAt": "2025-08-16T00:30:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.640Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "32745dd7"
  },
  {
    "id": "marketwatch-ebc4038",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Why the Trump-Putin summit is no &#x2018;magic lever&#x2019; to unleash global oil supplies",
    "url": "https://www.marketwatch.com/story/why-the-trump-putin-summit-is-no-magic-lever-to-unleash-global-oil-supplies-cf589403?mod=mw_rss_topstories",
    "summary": "The hype surrounding the historic summit Friday between U.S. President Donald Trump and Russian President Vladimir Putin makes clear that Russia &#x2014; even under global sanctions &#x2014; remains a powerhouse in the energy market.",
    "fullContent": "The hype surrounding the historic summit Friday between U.S. President Donald Trump and Russian President Vladimir Putin makes clear that Russia &#x2014; even under global sanctions &#x2014; remains a powerhouse in the energy market.",
    "publishedAt": "2025-08-16T00:30:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "ebc4038"
  },
  {
    "id": "zerohedge-954995c",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Fewer Women Are Using Birth Control Pills In The US",
    "url": "https://www.zerohedge.com/medical/fewer-women-are-using-birth-control-pills-us",
    "summary": "Fewer Women Are Using Birth Control Pills In The US Fewer women in the United States are opting for birth control pills than before, according to KFF data. Where 33 percent of women aged 18 to 49 years old said they used oral contraceptives in 2022, that had ticked down to 29...",
    "fullContent": "Fewer Women Are Using Birth Control Pills In The US Fewer women in the United States are opting for birth control pills than before, according to KFF data. Where 33 percent of women aged 18 to 49 years old said they used oral contraceptives in 2022, that had ticked down to 29 percent in 2024. As Statista's Anna Fleck reports, after male condoms, the pill is still the most commonly used form of contraception in the U.S. You will find more infographics at Statista Recently, there has been a growing number of influencers on TikTok criticizing different forms of hormonal birth control and promoting tracking fertility cycle apps instead. This goes against experts’ advice, which states that contraceptives such as the pill and IUDs are safe and effective and that risks have been exaggerated online. This is a trend that has been seen in other countries too. The BBC reports that in the United Kingdom, some women are moving away from “hormonal” products such as the pill to “natural” fertility tracking apps. While in Germany, health concerns have been cited in recent years, with younger women in particular moving away from the pill. The KFF reports that almost four in ten (39 percent) of women of reproductive age have heard something on social media about birth control in the past 12 months, including half (49 percent) of women aged 18 to 25. Meanwhile, one in seven women aged 18 to 25 said they made a change or thought about making a change to their birth control method because of something they saw or heard on social media. 2024 data shows that emergency contraception increased by 5 percentage points compared to two years prior. This brings it to 12 percent of U.S. women aged 18 to 49. Tyler Durden Fri, 08/15/2025 - 20:30",
    "publishedAt": "2025-08-16T00:30:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.086Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "954995c"
  },
  {
    "id": "the-verge-2301b194",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "The best budget smartphone you can buy",
    "url": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
    "summary": "Some of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things done, not something you want to invest a lot of time or money in.",
    "fullContent": "Some of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things done, not something you want to invest a lot of time or money in. If that’s you — and there’s no judgment here from a certifiable gadget [&#8230;]",
    "publishedAt": "2025-08-16T00:25:53.000Z",
    "fetchedAt": "2025-08-16T02:22:49.376Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "2301b194"
  },
  {
    "id": "wsj-world-news-59a5157e",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Who Was in the Room for Trump-Putin Meeting",
    "url": "https://www.wsj.com/world/who-was-in-the-room-for-trump-putin-meeting-3adf6ed2",
    "summary": "The leaders were each flanked by senior advisers for their first meeting in Alaska.",
    "fullContent": "The leaders were each flanked by senior advisers for their first meeting in Alaska.",
    "publishedAt": "2025-08-16T00:18:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.779Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "59a5157e"
  },
  {
    "id": "nyt-business-28309834",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Priscilla Presley Locked in Feud With Former Business Partners",
    "url": "https://www.nytimes.com/2025/08/15/arts/music/priscilla-presley-feud-former-business-partners.html",
    "summary": "Elvis’s ex-wife has traded lawsuits in a financial dispute with former advisers that has grown ugly with an allegation that she prematurely “pulled the plug” on her late daughter, Lisa Marie.",
    "fullContent": "Elvis’s ex-wife has traded lawsuits in a financial dispute with former advisers that has grown ugly with an allegation that she prematurely “pulled the plug” on her late daughter, Lisa Marie.",
    "publishedAt": "2025-08-16T00:16:42.000Z",
    "fetchedAt": "2025-08-16T02:22:47.574Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "28309834"
  },
  {
    "id": "bloomberg-business-youtube-3c2cbc51",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump, Putin Summit in Alaska: Full Statements",
    "url": "https://www.youtube.com/watch?v=SD7ROcIEZso",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:12:37.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3c2cbc51"
  },
  {
    "id": "zerohedge-4729dc76",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Indonesia Will Play A Key Role In Russia's Asian Balancing Act",
    "url": "https://www.zerohedge.com/geopolitical/indonesia-will-play-key-role-russias-asian-balancing-act",
    "summary": "Indonesia Will Play A Key Role In Russia's Asian Balancing Act Authored by Andrew Korybko via Substack, Indonesian President Prabowo Subianto was Putin’s guest of honor during mid-June’s St. Petersburg International Economic Forum.",
    "fullContent": "Indonesia Will Play A Key Role In Russia's Asian Balancing Act Authored by Andrew Korybko via Substack, Indonesian President Prabowo Subianto was Putin’s guest of honor during mid-June’s St. Petersburg International Economic Forum. The privilege that was bestowed upon him wasn’t surprising since bilateral ties have greatly strengthened since last year as documented here in January. Russia envisages Indonesia playing key role in its Asian balancing act, which will only grow after their newly signed strategic partnership agreement. The present piece will detail some of the forms in which this will take. To begin with, Russia helped Indonesia complete its accelerated accession to BRICS as a full-fledged member, for which Prabowo thanked Putin during their meeting and in statements to the press afterwards. The evening beforehand, Putin told the heads of international news agencies during his meeting with them that Indonesia’s nearly 300 million people enable it to play a larger role in the global economy, with the innuendo being that this will lead to it playing a greater role in global governance too. It's here where the relevance of Indonesia’s Russian-assisted accession to BRICS comes into play. Although cooperation within BRICS is purely voluntary, the group can still collectively contribute to accelerating financial multipolarity processes and then gradual reforms to global governance afterwards. Accordingly, given Indonesia’s growing economic and corresponding political weight in the world coupled with their traditionally friendly ties, Russia expects that they can cooperate more closely to this end. In pursuit of this goal, which is assessed to be the driving force behind their strategic partnership, both countries are prioritizing the comprehensive expansion of their economic, political, and military ties. From Russia’s perspective, the economic dimension can open new markets for all manner of energy and real-sector exports, closer ties with de facto ASEAN leader Indonesia can give Russia more of a presence in that bloc, and more military-technical cooperation can strengthen Indonesia’s own balancing act. About that, Indonesia multi-aligns between rival powers just like India does, and closer military-technical cooperation with Russia could help it avoid the growing zero-sum dilemma to commit to China or the US. After all, closer such cooperation with either of them could unsettle the other and lead to more pressure upon Indonesia, but China probably wouldn’t mind its Russian strategic partner supplying Indonesia with arms while the US might not overreact to this if their incipient rapprochement remains on track. As for Russia’s Asian balancing act, it aims to preemptively avert disproportionate dependence on China, some of the consequences if troubled Indo-US ties improve, and being caught in a zero-sum dilemma to commit to one over the other. Closer economic ties with Indonesia therefore help Russia hedge against trade dependence on China, closer military-technical ones could partially replace declining market share in India, and closer political ties with ASEAN can give Russia more flexibility amidst the Sino-Indo rivalry. Altogether, Russia and Indonesia play complementary roles in one another’s balancing acts, with each serving as valve of sorts from the pressure to commit to China-India and China-US respectively. Their close Soviet-era strategic cooperation before General Suharto’s mid-1960s coup serves as a nostalgic reference point for the level of relations that their contemporary leaders are eager to revive. Now is the perfect time to do so, and since there aren’t any impediments, the future of their ties looks very bright. Tyler Durden Fri, 08/15/2025 - 20:05",
    "publishedAt": "2025-08-16T00:05:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.086Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4729dc76"
  },
  {
    "id": "bloomberg-business-youtube-11b498a7",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "US Stocks Slide as Trump, Putin Hold High-Stakes Talks | The Close 8/15/2025",
    "url": "https://www.youtube.com/watch?v=HoGTCokV6i4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-16T00:04:14.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "11b498a7"
  },
  {
    "id": "cnbc-tv18-youtube-2429fa89",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Top News LIVE: 16 August की खबरें| Trump - Putin Meeting | Modi | Janmashtami | War | Russia Ukraine",
    "url": "https://www.youtube.com/watch?v=2j4kdywDddk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:57:28.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2429fa89"
  },
  {
    "id": "cnbc-tv18-youtube-121ebc5e",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Trump Putin Meeting LIVE:Alkasha में पुतिन और ट्रंप के बीच हुई Meeting, संघर्ष विराम पर नहीं बनी बात",
    "url": "https://www.youtube.com/watch?v=N8WncxK9GLs",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:54:27.000Z",
    "fetchedAt": "2025-08-16T02:22:53.554Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "121ebc5e"
  },
  {
    "id": "bloomberg-business-youtube-df836a4",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Says ‘No Deal’ Yet in ‘Productive’ Talks With Putin",
    "url": "https://www.youtube.com/watch?v=d4exNTjLONY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:41:58.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "df836a4"
  },
  {
    "id": "zerohedge-5941e79a",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Hezbollah Chief Threatens 'No Life In Lebanon' If Government Moves To Disarm It",
    "url": "https://www.zerohedge.com/geopolitical/hezbollah-chief-threatens-no-life-lebanon-if-government-moves-disarm-it",
    "summary": "Hezbollah Chief Threatens 'No Life In Lebanon' If Government Moves To Disarm It Hezbollah leader Naim Qassem has warned that if the Lebanese government moves to disarm Hezbollah, which is the large Shia militia group backed by Iran, then the whole country will suffer...",
    "fullContent": "Hezbollah Chief Threatens 'No Life In Lebanon' If Government Moves To Disarm It Hezbollah leader Naim Qassem has warned that if the Lebanese government moves to disarm Hezbollah, which is the large Shia militia group backed by Iran, then the whole country will suffer destabilization, death, and destruction. He claimed that there would be \"no life in Lebanon\" should its weapons be taken by force - which brings to mind the mass death and destruction the country experienced during the prior two-decade long Lebanese civil war of the end of the 20th century. Via AFP The United States has long exerted immense pressure on the Lebanese government of President Joseph Aoun to take away Hezbollah's weapons. These pressures have amplified in the wake of the recent Israel-Lebanon war, which subsided due to a fragile truce. This is why Qassem has accused the Lebanese government of in essence \"implementing an American-Israeli order to end the resistance, even if it leads to civil war and internal strife.\" \"The resistance will not surrender its weapons while aggression continues, occupation persists, and we will fight it… if necessary to confront this American-Israeli project no matter the cost,\" he continued, warning the government \"not to hand over the country to an insatiable Israeli aggressor or an American tyrant with limitless greed.\" Without doubt, Hezbollah has been immensely weakened since last year's assassination of longtime leader Hassan Nasrallah - and the killings of many other top and mid-level leaders. Hezbollah's abiding by the ceasefire with Israel is a reflection of this. However, the last year has seen sporadic airstrikes on southern Lebanon by Israel. The fall of Assad in Syria last December has also greatly weakened Hezbollah. Still, the group remains the single most well-armed and militarily powerful entity in the Lebanese state. It is actually stronger that the Lebanese Army. So if there is a big move to disarm Hezbollah, there's a likelihood that indeed the whole state would unravel - also at a moment the country has been experience economic collapse, and destruction due to recent Israeli bombings. The general view among regional analysts is that Hezbollah, representing the 'Shia axis', has ultimately lost at this point. This is also underscored in the fact that the Israeli army is now occupying large swathes of southern Syria - perhaps less than a dozen miles from the outskirts of Damascus. Tyler Durden Fri, 08/15/2025 - 19:40",
    "publishedAt": "2025-08-15T23:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.086Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5941e79a"
  },
  {
    "id": "bloomberg-business-youtube-381cc9e0",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Does Apple risk falling behind on AI? #shorts #apple #artificialintelligence #china",
    "url": "https://www.youtube.com/shorts/zwaA-z20ALk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:38:06.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "381cc9e0"
  },
  {
    "id": "the-verge-66cef59a",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Laura Loomer and the limits of posting everything",
    "url": "https://www.theverge.com/politics/760269/laura-loomer-deposition",
    "summary": "For all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc.",
    "fullContent": "For all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc. But the fact remains that she's the influencer responsible for getting Donald [&#8230;]",
    "publishedAt": "2025-08-15T23:36:49.000Z",
    "fetchedAt": "2025-08-16T02:22:49.376Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "66cef59a"
  },
  {
    "id": "bloomberg-business-youtube-127e88ae",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Jackson Hole Preview, Apple's AI Ambitions, Rule of Law, New Housing Investors | Wall Street Week",
    "url": "https://www.youtube.com/watch?v=fdp_gyyYfjQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T23:31:20.000Z",
    "fetchedAt": "2025-08-16T02:22:59.773Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "127e88ae"
  },
  {
    "id": "techmeme-430d5fc3",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: current and former OpenAI employees plan to sell ~$6B in stock to Thrive Capital, SoftBank, and others in a secondary sale that values OpenAI at ~$500B (Kate Clark/Bloomberg)",
    "url": "http://www.techmeme.com/250815/p23#a250815p23",
    "summary": "Kate Clark / Bloomberg: Sources: current and former OpenAI employees plan to sell ~$6B in stock to Thrive Capital, SoftBank, and others in a secondary sale that values OpenAI at ~$500B — SoftBank, Dragoneer and Thrive Capital are set to buy OpenAI shares from current and...",
    "fullContent": "Kate Clark / Bloomberg: Sources: current and former OpenAI employees plan to sell ~$6B in stock to Thrive Capital, SoftBank, and others in a secondary sale that values OpenAI at ~$500B — SoftBank, Dragoneer and Thrive Capital are set to buy OpenAI shares from current and former employees at a $500 billion valuation.",
    "publishedAt": "2025-08-15T23:25:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "430d5fc3"
  },
  {
    "id": "bloomberg-markets-3eaac003",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Stocks Slide as Trump, Putin Hold High-Stakes Talks | The Close 8/15/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/the-close-8-15-2025-video",
    "summary": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Bokeh Capital Partners’s Kim Forrest, RBC Capital Markets’ Blake Gwinn, Morningstar’s Ahmed Khan,...",
    "fullContent": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Bokeh Capital Partners’s Kim Forrest, RBC Capital Markets’ Blake Gwinn, Morningstar’s Ahmed Khan, Oliver Wyman’s Daniel Tannebaum, Kayne Anderson Rudnick’s Julie Biel, Robinhood Markets’ Steve Quirk, Pandora’s Alexander Lacik, Mimi Cheng’s Dumplings’ Marian Cheng, Fordham Global Foresight’s Tina Fordham. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T23:23:54.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3eaac003"
  },
  {
    "id": "fortune-18d15ea6",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump says &#8216;we didn&#8217;t get there&#8217; but touts progress as meeting with Putin ends without a deal to stop Ukraine war",
    "url": "https://fortune.com/2025/08/15/trump-putin-summit-alaska-ukraine-war-us-russia-sanctions/",
    "summary": "\"We had an extremely productive meeting, and many points were agreed to and there are just a very few that are left.\"",
    "fullContent": "\"We had an extremely productive meeting, and many points were agreed to and there are just a very few that are left.\"",
    "publishedAt": "2025-08-15T23:20:49.000Z",
    "fetchedAt": "2025-08-16T02:22:49.894Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18d15ea6"
  },
  {
    "id": "wsj-opinion-24b183d",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "More Justice for Elizabeth Warren",
    "url": "https://www.wsj.com/opinion/more-justice-for-elizabeth-warren-911bf317",
    "summary": "Trump wins a key victory in the effort to shrink her bureaucratic pride and joy.",
    "fullContent": "Trump wins a key victory in the effort to shrink her bureaucratic pride and joy.",
    "publishedAt": "2025-08-15T23:15:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "24b183d"
  },
  {
    "id": "zerohedge-45385e03",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Gerrymandering, Race-Pandering, & Political-Meandering",
    "url": "https://www.zerohedge.com/political/gerrymandering-race-pandering-political-meandering",
    "summary": "Gerrymandering, Race-Pandering, & Political-Meandering Authored by Arthur Schaper via American Greatness, Gerrymandering, the political practice of carving up awkward-looking legislative districts to benefit one party’s political power, has slithered into the public...",
    "fullContent": "Gerrymandering, Race-Pandering, & Political-Meandering Authored by Arthur Schaper via American Greatness, Gerrymandering, the political practice of carving up awkward-looking legislative districts to benefit one party’s political power, has slithered into the public conversation once again. Some of us remember the history behind this political practice, starting with the governor of Massachusetts, Elbridge Gerry. Democratic-Republicans want to shore up their new power in the Commonwealth of Massachusetts. Federalist opponents of the maneuver mocked one of the serpentine-like districts created by the party, christening the shape with claws, wings, and a razor-sharp mouth, calling the monstrosity “The Gerrymander.” Why has the discussion roared into the public consensus this time? It started with the Texas legislature’s efforts to redraw its state’s districts after a request from the Trump Administration to review the fairness of the districts. Yes, there is gerrymandering in Texas, but not the way that liberal reformers want to portray the problem. Consider some of the urban, Democratic Congressional districts in Texas: the 29th, 32nd, and 33rd, for example, are obscenely drawn. These contortions are examples of race pandering, or “race-mandering,” which result from the tortured misuse of the Voting Rights Act and fears of ongoing legal challenges from left-wing legal activists demanding more majority-minority districts. This kind of lawfare recently forced Alabama and Louisiana to create gerrymandered districts. Texas is not alone in this fight, either. Ohio has to redraw its Congressional districts. This opportunity could create three more Republican-leaning Congressional seats, while the Texas legislature advances a map creating five more GOP seats. Of course, Governor Abbott and the Republican leadership have floated increasing the GOP advantage to six to eight seats if absent Democrats refuse to come back to work in their vain efforts to break legislative quorums. Democrats have not helped their cause by fleeing to Illinois, whose districts are so gerrymandered that even Stephen Colbert poked fun at them. Florida Governor Ron DeSantis, who bravely pushed through a race-neutral Congressional map in 2021, netting four more GOP seats, has offered to redraw the Congressional districts yet again, in part because the state population has grown due to an increase in migration from failed blue states. DeSantis deserves credit for the current GOP-mandering effort, since he had refused weak maps from the Florida RINOs at the beginning of the decade. Indiana, Missouri, and South Carolina are also exploring more daring redistricting efforts, not just because of Trump’s leadership and Texas’s fight, but because the United States Supreme Court will be reviewing the “majority-minority” provisions in the Voting Rights Act. Democrats and liberal pundits fear that the court will strike them down entirely, wiping away the need for “majority-minority districts” and ensuring that Republicans gain more seats! Republicans are fighting back, and Democrats don’t like that the Republicans are using their tactics against them. California Governor Gavin Newsom, who is running for President even though he won’t admit it, is leading the charge, demanding that fellow Democrats start fighting with fire, although they started the fire, perfecting the art of gerrymandering under the guise of independent commissioners. Newsom urged the California legislature to reform the state’s Citizens Redistricting Commission to create more Democratic-favoring districts. The problem with this effort, though, is that Democratic-leaning states already have some of the most heavily gerrymandered districts in the country. Maryland had three Republicans as recently as 2003, but has reduced the number with creative redrawing. Illinois is the most gerrymandered state, despite relying on an independent commission. New York State tried to push through one of the most gerrymandered districts possible, but even the all-Democratic New York Supreme Court rejected the naked political grab from Albany politicians. Declining Governor Kathy Hochul wants to jump into the fray anyway. They wear their lawlessness like a dinner jacket. Even Massachusetts Governor Maura Healey jumped on the merry gerrymander bandwagon. She made a total fool of herself. All nine Congressional districts are gerrymandered to the Democrats’ advantage, since the Bay State hasn’t had a Republican Congressman since 1997. Republicans are looking good going into Election 2026, but there are rumblings against the gerrymandering sparring. Rep. Kevin Kiley (R-CA) has introduced legislation to stop the national mid-decade redistricting efforts. This effort is understandable, since Kiley will likely lose his seat should Gavin Newsom get his way. However, the country needs a strong GOP majority in both chambers to ensure lasting electoral and cultural change, and if a couple of seats get lost in California but more make up for the loss in other states, I can live with it (and I live in California). Kiley appears to be panicking unnecessarily, as there is no legal way for Newsom to push through his so-called ‘Newsom-mandering’ without significant legal retaliation. Moreover, Newsom’s efforts are not winning him support from California voters or liberal columnists. Should we be concerned about the constant political meandering caused by redistricting? Voters deserve consistency in representation. I do not agree with banning mid-decade redistricting, especially if a state’s population shifts or changes radically within a decade. Independent commissioners don’t work—they are unaccountable to the people, and still produce gerrymandered districts. California Globe dishes on this perfectly. We have already discussed Illinois, with its contorted, snake-like districts designed to force out Republican congressmen, even though they garnered 43% of the vote in the 2024 election. State legislatures should be required to draw the districts. How do we prevent the ridiculous salamander shuffle, though? If the district covers multiple counties, at least one should be placed entirely within the congressional district. If a governing county is large enough to incorporate more districts, then it should not straddle more than one other county. Municipal and geographical boundaries should be respected. No portion of a congressional district should be thinner than 20 miles. Lastly, the notion that districts are set in stone despite gerrymandering or partisan advantage is dubious in the long run. Political demographics and voting patterns change, and even well-entrenched incumbents face losses when they lose touch with voters. Nothing is static in politics. Tyler Durden Fri, 08/15/2025 - 19:15",
    "publishedAt": "2025-08-15T23:15:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.086Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45385e03"
  },
  {
    "id": "bbc-business-2474cb6a",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "'I spend £120 a month on buses': Under-22s on what free travel would mean to them",
    "url": "https://www.bbc.com/news/articles/c70xjj8746wo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "fullContent": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "publishedAt": "2025-08-15T23:06:54.000Z",
    "fetchedAt": "2025-08-16T02:22:49.862Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2474cb6a"
  },
  {
    "id": "bbc-business-7a7d639d",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "'Bus fares have cut my food budget': Under-22s on what free travel would mean to them",
    "url": "https://www.bbc.com/news/articles/c70xjj8746wo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "fullContent": "They welcome a call for under-22s in England to get free bus passes to help them into work and education.",
    "publishedAt": "2025-08-15T23:06:54.000Z",
    "fetchedAt": "2025-08-16T09:40:38.712Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a7d639d"
  },
  {
    "id": "bloomberg-politics-70a8fa6b",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Says Up to Zelenskiy to Make Deal After Summit With Putin",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/trump-says-talks-with-putin-productive-but-no-deal-made-yet",
    "summary": "US President Donald Trump called his meeting with Russian counterpart Vladimir Putin productive but indicated that a path to end the war had still not been finalized, adding that he would speak to Ukrainian President Volodymyr Zelenskiy and tell him to make a deal.",
    "fullContent": "US President Donald Trump called his meeting with Russian counterpart Vladimir Putin productive but indicated that a path to end the war had still not been finalized, adding that he would speak to Ukrainian President Volodymyr Zelenskiy and tell him to make a deal.",
    "publishedAt": "2025-08-15T23:06:40.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "70a8fa6b"
  },
  {
    "id": "bbc-business-10e13657",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Topshop returns to the High Street, but can it get its cool back?",
    "url": "https://www.bbc.com/news/articles/ckgl4w1zkypo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "For many people, the stores defined their childhood. Now they are due to come back.",
    "fullContent": "For many people, the stores defined their childhood. Now they are due to come back.",
    "publishedAt": "2025-08-15T23:05:44.000Z",
    "fetchedAt": "2025-08-16T02:22:49.862Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "10e13657"
  },
  {
    "id": "bbc-business-15127dd3",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Topshop returns to the High Street, but can it get its cool back?",
    "url": "https://www.bbc.com/news/articles/ckgl4w1zkypo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "For many, the stores defined their childhood. Now the retailer says it is reopening them, and holds its first catwalk for years today.",
    "fullContent": "For many, the stores defined their childhood. Now the retailer says it is reopening them, and holds its first catwalk for years today.",
    "publishedAt": "2025-08-15T23:05:44.000Z",
    "fetchedAt": "2025-08-16T09:40:38.712Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15127dd3"
  },
  {
    "id": "nyt-technology-65855c70",
    "sourceId": "nyt-technology",
    "sourceName": "NYT Technology",
    "title": "Judge Blocks F.T.C. Investigation of Media Matters",
    "url": "https://www.nytimes.com/2025/08/15/technology/media-matters-ftc-musk-injunction.html",
    "summary": "The agency began looking into the liberal watchdog group’s research critical of Elon Musk and his social media platform, X, in May.",
    "fullContent": "The agency began looking into the liberal watchdog group’s research critical of Elon Musk and his social media platform, X, in May.",
    "publishedAt": "2025-08-15T23:02:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.605Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "65855c70"
  },
  {
    "id": "scmp-business-183f55a3",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Chinese start-up joins NetDragon-owned Cherrypicks to push AI tech overseas",
    "url": "https://www.scmp.com/tech/tech-trends/article/3322029/chinese-start-joins-netdragon-owned-cherrypicks-push-ai-solutions-overseas?utm_source=rss_feed",
    "summary": "An AI start-up backed by the Chinese Academy of Sciences’ Institute of Automation is seeking to promote its artificial intelligence offerings outside the mainland under a strategic partnership with Cherrypicks, the firm behind Hong Kong’s Covid-19 tracking app.",
    "fullContent": "An AI start-up backed by the Chinese Academy of Sciences’ Institute of Automation is seeking to promote its artificial intelligence offerings outside the mainland under a strategic partnership with Cherrypicks, the firm behind Hong Kong’s Covid-19 tracking app. Beijing-based Zhongke WengAI, whose services are used by various Chinese ministries and state media outlets, will also jointly develop with Cherrypicks – owned by Hong Kong-listed NetDragon Websoft – enterprise AI solutions for industries...",
    "publishedAt": "2025-08-15T23:00:09.000Z",
    "fetchedAt": "2025-08-16T02:22:50.133Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "183f55a3"
  },
  {
    "id": "cnbc-markets-69829d19",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "China's booming bubble tea industry faces a test: Is it here to stay or just a fad?",
    "url": "https://www.cnbc.com/2025/08/15/chinas-bubble-tea-industry-is-it-here-to-stay-or-just-a-fad.html",
    "summary": "Market saturation at home, rising costs and intense price wars are testing the resilience of the country's bubble tea brands.",
    "fullContent": "Market saturation at home, rising costs and intense price wars are testing the resilience of the country's bubble tea brands.",
    "publishedAt": "2025-08-15T23:00:01.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "69829d19"
  },
  {
    "id": "oil-price-3f795976",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "How Much Energy Does ChatGPT’s Newest Model Consume?",
    "url": "https://oilprice.com/Energy/Energy-General/How-Much-Energy-Does-ChatGPTs-Newest-Model-Consume.html",
    "summary": "How much energy does the newest version of ChatGPT consume? No one knows for sure, but one thing is certain – it’s a whole lot. OpenAI, the company behind ChatGPT, hasn’t released any official figures for the large language model’s energy footprints, but academics are working...",
    "fullContent": "How much energy does the newest version of ChatGPT consume? No one knows for sure, but one thing is certain – it’s a whole lot. OpenAI, the company behind ChatGPT, hasn’t released any official figures for the large language model’s energy footprints, but academics are working to quantify the energy use for query – and it’s considerably higher than for previous models. There are no mandates forcing AI companies to disclose their energy use or environmental impact, so most do not offer up those kinds of statistics…",
    "publishedAt": "2025-08-15T23:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.543Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "3f795976"
  },
  {
    "id": "bloomberg-markets-13d9ff44",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Jackson Hole Preview, Apple's AI Ambitions, Rule of Law, New Housing Investors | Wall Street Week",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/new-rules-wall-street-week-video",
    "summary": "This week, the framework of the Federal Reserve Board of Governors meets signs of economic softness just ahead of the Fed's annual meeting in Jackson Hole, Wyoming. And, Apple wants to increase its AI presence, but its focus on manufacturing and the tariff environment might...",
    "fullContent": "This week, the framework of the Federal Reserve Board of Governors meets signs of economic softness just ahead of the Fed's annual meeting in Jackson Hole, Wyoming. And, Apple wants to increase its AI presence, but its focus on manufacturing and the tariff environment might pose challenges. Plus, rule of law is more than a legal concept - why businesses need it to operate in the US. And, the American dream of home ownership now belongs to small investors who are seeing opportunity in market conditions that are pricing out potential home owners. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:59:37.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "13d9ff44"
  },
  {
    "id": "wsj-youtube-1212bcd3",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "WSJ Reporter Describes Pro-Ukraine Protest in Alaska Amid Trump-Putin Summit | WSJ News",
    "url": "https://www.youtube.com/watch?v=CkVqkY_nDVo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:58:54.000Z",
    "fetchedAt": "2025-08-16T02:23:18.577Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1212bcd3"
  },
  {
    "id": "zerohedge-71d2dfa7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Joby Aviation Makes \"Aviation History\" With First Piloted eVTOL Flying In FAA-Controlled Airspace",
    "url": "https://www.zerohedge.com/technology/joby-aviation-makes-aviation-history-first-piloted-evtol-flying-faa-controlled-airspace",
    "summary": "Joby Aviation Makes \"Aviation History\" With First Piloted eVTOL Flying In FAA-Controlled Airspace Joby Aviation shares rose in premarket trading after news that one of its electric vertical takeoff and landing (eVTOL) air taxis \"successfully operated\" in highly controlled...",
    "fullContent": "Joby Aviation Makes \"Aviation History\" With First Piloted eVTOL Flying In FAA-Controlled Airspace Joby Aviation shares rose in premarket trading after news that one of its electric vertical takeoff and landing (eVTOL) air taxis \"successfully operated\" in highly controlled airspace between two California airports: Marina (OAR) and Monterey (MRY). The 12-minute, 10-nautical-mile flight of the eVTOL air taxi in Federal Aviation Administration (FAA)-controlled airspace integrated with other aircraft and demonstrated vertical takeoff, wingborne transition, and vertical landing. This is clear evidence that commercialization will happen within this decade. \"The achievement is a major step as part of Joby's commercial market readiness,\" the aviation startup wrote in a press release, adding, \"It's a critical measure of the maturity of the Company's path to commercialization as the flights also demonstrated the type of real-world service Joby intends to offer to the public.\" Joby has previously stated that commercial flights of its eVTOL air taxis will begin in early 2026, with a broader rollout of this revolutionary mode of transportation expected by 2028. Shares of Joby were up 8% in New York premarket trading. Year-to-date, the stock is up 114% as of Thursday's close. Short interest stands at about 11.5% of the float, or approximately 58 million shares, with around 1.3 days to cover. Watch: We’ve made aviation history with the first piloted eVTOL air taxi test flight between two public airports! FAA-controlled airspace. 10 nautical miles. 12 minutes (including 5 minutes in a holding pattern for air traffic spacing). Not only does it represent our flight testing and… pic.twitter.com/QFoKmbA6XP — Joby Aviation (@jobyaviation) August 15, 2025 Related: Los Angeles Announces Flying Taxis For Visitors At 'No-Car' Olympics Guess who delayed America's industry? You'll never guess... Flying Taxis Officially Lift Off - But Only In China, Thank Biden's FAA . . . Tyler Durden Fri, 08/15/2025 - 18:50",
    "publishedAt": "2025-08-15T22:50:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.087Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "71d2dfa7"
  },
  {
    "id": "bloomberg-markets-4f741309",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Retail Investors Spotted UNH Before Buffett: Robinhood",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/retail-investors-spotted-unh-before-buffett-robinhood-video",
    "summary": "Steve Quirk, Robinhood Chief Brokerage Officer, says retail investors remain cautiously optimistic and resilient, with equity and crypto volumes hitting record highs. He spoke with Scarlet Fu and Vonnie Quinn on “The Close.” (Source: Bloomberg)",
    "fullContent": "Steve Quirk, Robinhood Chief Brokerage Officer, says retail investors remain cautiously optimistic and resilient, with equity and crypto volumes hitting record highs. He spoke with Scarlet Fu and Vonnie Quinn on “The Close.” (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:48:55.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4f741309"
  },
  {
    "id": "cnbc-markets-33d6e0c2",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Tech IPOs are roaring after 'years of Prohibition' — it may be too good",
    "url": "https://www.cnbc.com/2025/08/15/tech-ipos-bullish-figma-circle-roaring-after-years-of-prohibition-.html",
    "summary": "Bullish's IPO this week is another sign that the market is swinging wide open after a prolonged dry spell.",
    "fullContent": "Bullish's IPO this week is another sign that the market is swinging wide open after a prolonged dry spell.",
    "publishedAt": "2025-08-15T22:44:18.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "33d6e0c2"
  },
  {
    "id": "bloomberg-markets-63c09ac0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Mimi Cheng’s Dumplings Expands to Whole Foods",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/mimi-cheng-s-dumplings-expands-to-whole-foods",
    "summary": "Marian Cheng, Co-Founder of Mimi Cheng’s Dumplings, says she wants to break the stereotype of Chinese food, offering fresh, Taiwanese-style dumplings. She tells Scarlet Fu and Vonnie Quinn on “The Close” that the restaurant has been open for over 10 years and now sells frozen...",
    "fullContent": "Marian Cheng, Co-Founder of Mimi Cheng’s Dumplings, says she wants to break the stereotype of Chinese food, offering fresh, Taiwanese-style dumplings. She tells Scarlet Fu and Vonnie Quinn on “The Close” that the restaurant has been open for over 10 years and now sells frozen dumplings in grocery stores. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:39:29.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "63c09ac0"
  },
  {
    "id": "bloomberg-markets-375e33a7",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Has Leverage as Trump, Putin Meet: Tannebaum",
    "url": "https://www.bloomberg.com/news/videos/2025-08-15/us-has-leverage-as-trump-putin-meet-tannebaum-video",
    "summary": "Daniel Tannebaum, Oliver Wyman Global Anti-Financial Crime Practice Leader, says a mismatch may exist between U.S. President Donald Trump and Russian President Vladimir Putin, stressing the U.S. and its Western allies have more leverage over Russia than realized.",
    "fullContent": "Daniel Tannebaum, Oliver Wyman Global Anti-Financial Crime Practice Leader, says a mismatch may exist between U.S. President Donald Trump and Russian President Vladimir Putin, stressing the U.S. and its Western allies have more leverage over Russia than realized. He tells Scarlet Fu and Vonnie Quinn on “The Close” that American businesses are reluctant to return to Russia. (Source: Bloomberg)",
    "publishedAt": "2025-08-15T22:38:44.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "375e33a7"
  },
  {
    "id": "nyt-business-444bfa4c",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "MAHA Draft Report Brings Relief to Some, Chagrin to Others",
    "url": "https://www.nytimes.com/2025/08/15/health/maha-draft-report-pesticides.html",
    "summary": "A draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped.",
    "fullContent": "A draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped.",
    "publishedAt": "2025-08-15T22:36:45.000Z",
    "fetchedAt": "2025-08-16T02:22:47.574Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "444bfa4c"
  },
  {
    "id": "wired-21a98c9f",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "9 Best Pillows (2025) Tested For Side, Back, and Stomach Sleepers",
    "url": "https://www.wired.com/gallery/best-pillows/",
    "summary": "We’ve spent over a year testing the best pillows to support your noggin, whether you snooze on your side, back, or in a tangle of blankets.",
    "fullContent": "We’ve spent over a year testing the best pillows to support your noggin, whether you snooze on your side, back, or in a tangle of blankets.",
    "publishedAt": "2025-08-15T22:36:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.335Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "21a98c9f"
  },
  {
    "id": "bloomberg-politics-504e9d3f",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Tells Fox News He Believes Xi Won’t Act on Taiwan",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/trump-tells-fox-news-he-believes-xi-won-t-act-on-taiwan-medeonhg",
    "summary": "Donald Trump said Chinese President Xi Jinping told him he would not “move on” Taiwan as long as the US president remained in office.",
    "fullContent": "Donald Trump said Chinese President Xi Jinping told him he would not “move on” Taiwan as long as the US president remained in office.",
    "publishedAt": "2025-08-15T22:34:47.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "504e9d3f"
  },
  {
    "id": "ndtv-profit-youtube-301d4b60",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Donald Trump-Vladimir Putin Meet: B-2 Bomber Hovers Over Alaska Skies",
    "url": "https://www.youtube.com/shorts/O4R0yQzrbCo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:30:39.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "301d4b60"
  },
  {
    "id": "zerohedge-dcd3b3b",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "The Death Of The Small Farm Is The Death Of Rural America",
    "url": "https://www.zerohedge.com/personal-finance/death-small-farm-death-rural-america",
    "summary": "The Death Of The Small Farm Is The Death Of Rural America Authored by Mollie Engelhart via The Epoch Times, Modern farming is destroying small communities as we move more and more toward the “go big or go home” model—thousands of acres of the same monocrop, managed by one or...",
    "fullContent": "The Death Of The Small Farm Is The Death Of Rural America Authored by Mollie Engelhart via The Epoch Times, Modern farming is destroying small communities as we move more and more toward the “go big or go home” model—thousands of acres of the same monocrop, managed by one or two people on a tractor spraying chemicals. What used to be 20 or 30 small farms—each with a household and family that supported the local restaurant, gas station, feed store, and the veterinarian who served a few counties—is now replaced by a single sprawling operation with no animals, no neighbors, and no community. Over the past decade, roughly 140,000 U.S. farms have vanished, and it’s not just those farms that have collapsed—but the entire ecosystem they supported: diners, auction barns, schools, vets, and feed stores have all felt the blow. The economic destruction radiates outward—every boarded-up business is a ripple from a missing farm. Despite this, small farms are often treated as quaint, inefficient, and economically irrelevant in the modern food system. But the numbers tell a different story. Globally, farms under 2 hectares (about 5 acres) produce around 30 to 34 percent of the world’s food, while using only about 24 percent of agricultural land. That’s not inefficiency—that’s productivity. If you expand that to farms under 5 hectares, they produce more than half of the world’s food. These farms grow a diverse range of crops and raise animals in ways that serve local and regional markets—feeding people directly, not just supplying commodity markets or overseas exports. Small farms matter because they produce food where it’s eaten, keeping supply chains short and resilient. They’re often the ones growing the vegetables at your farmers market, the eggs from down the road, the beef from a rancher you know by name. They support biodiversity, employ more people per acre, and keep profits circulating locally. Dismissing them as outdated isn’t just wrong—it’s dangerous to our food security. While most of the farms we’ve lost were small family operations, the fight to save rural America isn’t just about acreage—it’s about approach. It’s not the size of the farm that determines its value to a community, but the farming practices it uses and the relationships it sustains. A larger farm can still operate in a way that regenerates the soil, employs local people, and feeds its neighbors—if it’s run with vision and courage. That’s exactly what Will Harris has done at White Oak Pastures, his 1,250-acre family farm in Bluffton, Georgia (held by his family since 1866). In the mid-1990s, Harris made a radical break from industrial agriculture. He replaced chemical inputs and confinement feeding with rotational grazing, diversified livestock, and on-site, USDA-inspected processing facilities. White Oaks Pastures is now one of the only farms in the country with separate abattoirs for red meat and poultry. To make this transformation, Harris took an extraordinary risk—borrowing $7.5 million against the family land to build these processing plants in 2008. It was a gamble most would never dare, but it paid off. His farm now operates as a zero-waste, closed-loop agricultural ecosystem, where nothing goes to waste, and grass-fed meats, eggs, organic vegetables, and byproducts like hides are turned into artisanal goods and compost. His regenerative practices have rebuilt topsoil, captured carbon, and sparked a local economic revival. Today, White Oak Pastures employs up to 180 people, making it Clay County’s largest private employer. What was once a dying ghost town now has a general store, a restaurant, lodging, and an event center—because one man chose to bet everything on a different way forward. His example proves it’s not the scale that matters—it’s the soil health, the humane treatment of animals, the jobs created, and the way the farm integrates into the life of the town. The wake-up call is already ringing: boarded-up Main Streets, closed auction barns, veterinarians relocated to cities, feed stores shuttered, schools shrinking. And make no mistake—this is not just an economic issue. It’s a matter of national security. If we lose the ability to feed ourselves, we lose the ability to protect ourselves. Food has been a weapon in almost every war in history. Without control over our food supply, we surrender control over our future. When we allow small and mid-size farms to fail, we don’t just lose their food production—we lose the skills, the infrastructure, and the intergenerational knowledge that comes with them. We also lose the community glue they provide. Farmers don’t just grow food—they buy feed, fix equipment locally, hire the local vet, and send their kids to the local school. Multiply that by dozens of farms in a county, and you see why their disappearance hollows out whole regions. That’s why I am thrilled that Will Harris will be joining us at Sovereignty Ranch at the end of September for our Food is Medicine retreat—a gathering dedicated to restoring health, community, and resilience through the way we grow, cook, and share food. We’ll be talking about soil, nutrition, farm economics, and the urgent need to rebuild regional food systems—because the fight for our farms is the fight for our future. If you care about your country, your health, and your freedom, start now: support small farmers. Buy from them directly. Demand that your grocery stores and restaurants source from them. And most importantly—eat the small farm diet. This means real food from real farms, grown in a way that nourishes the soil and the people. Every purchase is a vote for the kind of America we want to live in. The survival of rural America—and perhaps the survival of America itself—depends on it. Views expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times or ZeroHedge. Tyler Durden Fri, 08/15/2025 - 18:25",
    "publishedAt": "2025-08-15T22:25:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.087Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "dcd3b3b"
  },
  {
    "id": "cnbc-markets-530a8cc8",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Why Bezos-backed Slate Automotive says it has cracked the code to affordable EVs",
    "url": "https://www.cnbc.com/2025/08/15/why-slate-automotive-says-it-has-cracked-the-code-to-affordable-evs.html",
    "summary": "Slate Automotive, backed by Jeff Bezos, targets EV buyers with a customizable, barebones truck under $30K, despite lost tax incentives.",
    "fullContent": "Slate Automotive, backed by Jeff Bezos, targets EV buyers with a customizable, barebones truck under $30K, despite lost tax incentives.",
    "publishedAt": "2025-08-15T22:23:27.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "530a8cc8"
  },
  {
    "id": "bloomberg-markets-6a65f10c",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "US Corporate Bond Spreads Sink to 27-Year Low as ‘FOMO’ Sets In",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/us-corporate-bond-spreads-sink-to-27-year-low-as-fomo-sets-in",
    "summary": "A key measure of US corporate-bond valuations surged to the highest level in nearly three decades as investors raced to lock in still-elevated yields amid speculation that the Federal Reserve will resume cutting interest rates next month.",
    "fullContent": "A key measure of US corporate-bond valuations surged to the highest level in nearly three decades as investors raced to lock in still-elevated yields amid speculation that the Federal Reserve will resume cutting interest rates next month.",
    "publishedAt": "2025-08-15T22:21:23.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6a65f10c"
  },
  {
    "id": "techmeme-294d7a9",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A US district court judge temporarily blocks an FTC probe into Media Matters, part of an antitrust investigation into ad boycotts, calling the probe retaliatory (Bloomberg)",
    "url": "http://www.techmeme.com/250815/p22#a250815p22",
    "summary": "Bloomberg: A US district court judge temporarily blocks an FTC probe into Media Matters, part of an antitrust investigation into ad boycotts, calling the probe retaliatory — Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information...",
    "fullContent": "Bloomberg: A US district court judge temporarily blocks an FTC probe into Media Matters, part of an antitrust investigation into ad boycotts, calling the probe retaliatory — Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information demand for documents &hellip;",
    "publishedAt": "2025-08-15T22:15:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "294d7a9"
  },
  {
    "id": "ndtv-profit-youtube-3c643296",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Putin Meet | US President Donald Trump Rules Out NATO Guarantees For Ukraine",
    "url": "https://www.youtube.com/watch?v=HB8gSiWWy7o",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:11:09.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3c643296"
  },
  {
    "id": "techmeme-79f4e2dd",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Roblox shares closed down 6.34% on Friday after the company was accused in two lawsuits of failing to sufficiently protect youngsters on its platform (Cecilia D'Anastasio/Bloomberg)",
    "url": "http://www.techmeme.com/250815/p21#a250815p21",
    "summary": "Cecilia D'Anastasio / Bloomberg: Roblox shares closed down 6.34% on Friday after the company was accused in two lawsuits of failing to sufficiently protect youngsters on its platform — Roblox Corp. shares fell more than 6% Friday after the company, which operates an online...",
    "fullContent": "Cecilia D'Anastasio / Bloomberg: Roblox shares closed down 6.34% on Friday after the company was accused in two lawsuits of failing to sufficiently protect youngsters on its platform — Roblox Corp. shares fell more than 6% Friday after the company, which operates an online video-game service popular with children &hellip;",
    "publishedAt": "2025-08-15T22:10:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "79f4e2dd"
  },
  {
    "id": "techmeme-410a9b0b",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Winklevoss twins' Gemini files for a US IPO and reports a $282.5M net loss on $67.9M revenue in H1 2025, vs. a $41.4M net loss on $73.5M revenue a year earlier (Monique Mulima/Bloomberg)",
    "url": "http://www.techmeme.com/250815/p20#a250815p20",
    "summary": "Monique Mulima / Bloomberg: Winklevoss twins' Gemini files for a US IPO and reports a $282.5M net loss on $67.9M revenue in H1 2025, vs. a $41.4M net loss on $73.5M revenue a year earlier — Gemini Space Station Inc.",
    "fullContent": "Monique Mulima / Bloomberg: Winklevoss twins' Gemini files for a US IPO and reports a $282.5M net loss on $67.9M revenue in H1 2025, vs. a $41.4M net loss on $73.5M revenue a year earlier — Gemini Space Station Inc., led by the billionaire Winklevoss twins, filed for an IPO as the cohort of crypto businesses seeking to list on public markets continues to swell.",
    "publishedAt": "2025-08-15T22:05:01.000Z",
    "fetchedAt": "2025-08-16T02:22:49.585Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "410a9b0b"
  },
  {
    "id": "ndtv-profit-youtube-431f211",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Putin Lands In Alaska | Top Moments From Vladimir Putin's Reception In Alaska",
    "url": "https://www.youtube.com/watch?v=quwMuuyh4Ys",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-15T22:02:53.000Z",
    "fetchedAt": "2025-08-16T02:22:56.665Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "431f211"
  },
  {
    "id": "zerohedge-195ca624",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "China Rushes To Buy Russian Oil As India Pulls Back",
    "url": "https://www.zerohedge.com/commodities/china-rushes-buy-russian-oil-india-pulls-back",
    "summary": "China Rushes To Buy Russian Oil As India Pulls Back While Trump has been raging in the past month at India for buying Russian oil (then processing it and reselling it to Europe at a huge markup) and slapping it with punitive tariffs in response to repeat sanctions violations,...",
    "fullContent": "China Rushes To Buy Russian Oil As India Pulls Back While Trump has been raging in the past month at India for buying Russian oil (then processing it and reselling it to Europe at a huge markup) and slapping it with punitive tariffs in response to repeat sanctions violations, he has generally ignored the fact that China has been importing glorious amounts of Russian oil as well: amounts which are only set to become even more glorious in coming weeks. And now that India is suddenly shy about funneling millions of Russian barrels with the world spotlight aimed squarely at it, Beijing is stepping up to fill the void: according to Kpler, Chinese state-owned and mega-sized private refiners are snapping up Western Russian crude cargoes for Oct. and Nov. arrival as India eases off. Previously Bloomberg reported that in hopes to appease Trump and as they hedged their bets ahead of the Trump-Putin summit, refiners in India, the world’s top importer of seaborne Russian crude, have been scouring the globe for alternative supplies. Trump has demanded that India stop purchases of cut-price crude and doubled tariffs on the country’s goods as punishment for imports he has said were fuelling “the war machine”. The move left refiners in the world’s third-largest oil consumer looking to switch up their procurement plans. India’s state processors have bought large volumes of non-Russian crude this week for prompt September-October delivery, extending a buying spree spurred by an early threat by Washington. Indian Oil Corp. and Bharat Petroleum Corp. have taken cargoes from all corners of the market including the US, but also Brazil and the Middle East. Just earlier today, Reuters reported that IOC bought another cargo of US WTI for delivery in October. These spot market purchases come on top of supplies from long-term sellers like Saudi Arabia, which is set to send about 22.5 million barrels of crude to India for September loading, traders said. India’s monthly imports from Saudi last exceeded that level in September 2024, according to data from analytics firm Kpler. And with India slowing, China has stepped up: as Bloomberg reports, Chinese refiners purchased about 13 cargoes of Urals and Varandey for October delivery, and at least two Urals cargoes for Nov., Kpler analyst Muyu Xu wrote in a report. The last time China took Varandey was Sept. 2023. Following intensified Ukrainian drone attacks, which have crippled many of its refineries and lowered domestic intakes, Russia instead moved to export 10-12 more Urals cargoes. Indeed, according to BBG, refineriies at Saratov, Novokuibyshevsk, Afipskiy, and Ryazan have fully or partially halted crude intake Still, the rise in Chinese demand for Russian oil has failed to fully offset loss of Indian demand, and Urals may be trading at $0.80/bbl premium to Dated Brent, down from $2/bbl before India scaled back buying in July. Prices are expected to fall further if India continues to eschew Russian, although with India forced to buy oil in the open market, it will likely push broader benchmark prices solidly higher in coming weeks. Tyler Durden Fri, 08/15/2025 - 18:00",
    "publishedAt": "2025-08-15T22:00:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.087Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "195ca624"
  },
  {
    "id": "cnbc-markets-467a7f41",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "OpenAI in talks to sell around $6 billion in stock at roughly $500 billion valuation",
    "url": "https://www.cnbc.com/2025/08/15/openai-6-billion-stock-500-billion-valuation.html",
    "summary": "The talks are still in early stages and the details could change.",
    "fullContent": "The talks are still in early stages and the details could change.",
    "publishedAt": "2025-08-15T21:57:35.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "467a7f41"
  },
  {
    "id": "bloomberg-politics-3ad09b84",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "FTC Reined in by Judge for Retaliating Against Media Group",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/ftc-reined-in-by-judge-for-retaliating-against-media-nonprofit",
    "summary": "Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information demand for documents from the group as part of an antitrust probe into advertising boycotts.",
    "fullContent": "Nonprofit Media Matters for America won a court order blocking a Federal Trade Commission information demand for documents from the group as part of an antitrust probe into advertising boycotts.",
    "publishedAt": "2025-08-15T21:56:17.000Z",
    "fetchedAt": "2025-08-16T02:22:47.262Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "3ad09b84"
  },
  {
    "id": "cnbc-markets-15da5d2a",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "UnitedHealth shares log best day since 2020 after Buffett's new stake is revealed",
    "url": "https://www.cnbc.com/2025/08/15/unitedhealth-shares-soar-after-warren-buffetts-new-stake-provides-a-vote-of-confidence.html",
    "summary": "The advance came after Buffett's conglomerate Berkshire Hathaway revealed a stake of 5 million shares, worth about $1.6 billion.",
    "fullContent": "The advance came after Buffett's conglomerate Berkshire Hathaway revealed a stake of 5 million shares, worth about $1.6 billion.",
    "publishedAt": "2025-08-15T21:50:52.000Z",
    "fetchedAt": "2025-08-16T02:22:46.859Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "15da5d2a"
  },
  {
    "id": "marketwatch-70bea201",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Opendoor bulls are getting what they want, and the stock is surging again",
    "url": "https://www.marketwatch.com/story/opendoor-bulls-are-getting-what-they-want-and-the-stock-is-surging-again-b99dcea2?mod=mw_rss_topstories",
    "summary": "CEO Carrie Wheeler has stepped down to the delight of institutional investors.",
    "fullContent": "CEO Carrie Wheeler has stepped down to the delight of institutional investors.",
    "publishedAt": "2025-08-15T21:49:00.000Z",
    "fetchedAt": "2025-08-16T02:22:49.921Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "70bea201"
  },
  {
    "id": "the-verge-2cd551df",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Louisiana sues Roblox for creating an environment where &#8216;child predators thrive&#8217;",
    "url": "https://www.theverge.com/news/760162/roblox-louisiana-lawsuit-child-predators-safety",
    "summary": "The state of Louisiana has filed a lawsuit against Roblox, alleging that the company has “permitted and perpetuated an online environment in which child predators thrive, directly contributing to the widespread victimization of minor children in Louisiana.",
    "fullContent": "The state of Louisiana has filed a lawsuit against Roblox, alleging that the company has “permitted and perpetuated an online environment in which child predators thrive, directly contributing to the widespread victimization of minor children in Louisiana.”&#160; Roblox sees more than 111.8 million daily active users, and it’s hugely popular with children, with users under [&#8230;]",
    "publishedAt": "2025-08-15T21:48:55.000Z",
    "fetchedAt": "2025-08-16T02:22:49.376Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "2cd551df"
  },
  {
    "id": "business-insider-4e8321cd",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I'm a psychiatrist who has treated 12 patients with 'AI psychosis' this year. Watch out for these red flags.",
    "url": "https://www.businessinsider.com/chatgpt-ai-psychosis-induced-explained-examples-by-psychiatrist-patients-2025-8",
    "summary": "A psychiatrist says he's not against clients using ChatGPT. But it can &#34;supercharge&#34; people's vulnerabilities, leading to &#34;AI psychosis.&#34;",
    "fullContent": "A psychiatrist says he's not against clients using ChatGPT. But it can &#34;supercharge&#34; people's vulnerabilities, leading to &#34;AI psychosis.&#34;",
    "publishedAt": "2025-08-15T21:47:14.000Z",
    "fetchedAt": "2025-08-16T02:22:47.144Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4e8321cd"
  },
  {
    "id": "nyt-technology-45aca78f",
    "sourceId": "nyt-technology",
    "sourceName": "NYT Technology",
    "title": "Senator Josh Hawley Begins Child Safety Inquiry Into Meta’s A.I. Bot",
    "url": "https://www.nytimes.com/2025/08/15/technology/meta-child-safety-senate-investigation.html",
    "summary": "Josh Hawley, Republican of Missouri, said he would look into whether the social media company’s artificial intelligence technology endangers children.",
    "fullContent": "Josh Hawley, Republican of Missouri, said he would look into whether the social media company’s artificial intelligence technology endangers children.",
    "publishedAt": "2025-08-15T21:46:34.000Z",
    "fetchedAt": "2025-08-16T02:22:47.605Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "45aca78f"
  },
  {
    "id": "wsj-opinion-527db420",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Real House Democratic Nightmare",
    "url": "https://www.wsj.com/opinion/the-real-house-democratic-nightmare-3002f098",
    "summary": "Democrats could lose 10 seats in 2030 as voters flee blue states.",
    "fullContent": "Democrats could lose 10 seats in 2030 as voters flee blue states.",
    "publishedAt": "2025-08-15T21:41:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "527db420"
  },
  {
    "id": "bloomberg-markets-49d6a2ae",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Winklevosses’ Gemini Files for IPO as Crypto Listings Accelerate",
    "url": "https://www.bloomberg.com/news/articles/2025-08-15/winklevoss-gemini-files-for-ipo-as-crypto-listings-accelerate",
    "summary": "Gemini Space Station Inc., led by the billionaire Winklevoss twins, filed for an IPO as the cohort of crypto businesses seeking to list on public markets continues to swell.",
    "fullContent": "Gemini Space Station Inc., led by the billionaire Winklevoss twins, filed for an IPO as the cohort of crypto businesses seeking to list on public markets continues to swell.",
    "publishedAt": "2025-08-15T21:40:08.000Z",
    "fetchedAt": "2025-08-16T02:22:46.569Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49d6a2ae"
  },
  {
    "id": "wsj-world-news-7735be9e",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "A Prison Confrontation Gives the First Glimpse in Years of a Popular Palestinian Leader",
    "url": "https://www.wsj.com/world/middle-east/a-prison-confrontation-gives-the-first-glimpse-in-years-of-a-popular-palestinian-leader-6c2665f9",
    "summary": "A far-right Israeli security minister released video of an exchange with Marwan Barghouti that the Palestinian&#x2019;s family called threatening.",
    "fullContent": "A far-right Israeli security minister released video of an exchange with Marwan Barghouti that the Palestinian&#x2019;s family called threatening.",
    "publishedAt": "2025-08-15T21:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.779Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "7735be9e"
  },
  {
    "id": "zerohedge-34a274e3",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "I Challenged Duke's DEI Dogma - And Paid With My Job",
    "url": "https://www.zerohedge.com/political/i-challenged-dukes-dei-dogma-and-paid-my-job",
    "summary": "I Challenged Duke's DEI Dogma - And Paid With My Job Authored by Dr. Kendall Conger via RealClearInvestigations, I was heartened to see my former employer, Duke University Health System, quietly reverse its commitment to woke racism this year.",
    "fullContent": "I Challenged Duke's DEI Dogma - And Paid With My Job Authored by Dr. Kendall Conger via RealClearInvestigations, I was heartened to see my former employer, Duke University Health System, quietly reverse its commitment to woke racism this year. I had joined the internal resistance to its diversity, equity, and inclusion crusade and was fired because of it. Here’s my story. Without public notice, the 38,000-employee organization scrubbed its website of the commitment to DEI it had trumpeted in 2021, when it proclaimed racism a “public health crisis,” and “equity” as its cure. Now, all such fealty to DEI has been discarded with its new 2025 statement of values. The title of its 2021 pledge to patients – “Duke Health Stands Against Racism, Bias, and Hate” – has been replaced by “Leading with Heart: Rooted in Humanity.” No doubt some of this change is due to increasing pushback to those policies: a federal civil rights lawsuit alleging pervasive racial discrimination in its hiring and admissions practices, and the Trump administration’s freezing last month of $108 million of federal monies to Duke University and Duke Health because of “the illegal use of racial preferences.” Duke Health did not respond to requests for comment. I worked at Duke for 10 years without incident before spending the last few years of my tenure battling the 2021 policy – at the cost of my job as an emergency room physician, which is now the subject of a separate lawsuit I have brought. As much as I would like to proclaim victory, I do not want this episode to get memory-holed by organizational leaders who would rather we forget the moral panic that gripped them and the price many of us paid for their destructive and divisive efforts. As the country pulls back from the pernicious ideology of DEI, there are countless other people like myself who suffered the repercussions for refusing to buckle to the madness. Lest there be any misunderstanding, let me be clear: Everyone I know is opposed to racism, bias, and hate, but Duke distorted those words to indict white doctors and nurses for complicity in the poorer health outcomes of black patients. My own form of resistance began in 2018 when Duke’s chief diversity officer gave a talk on implicit bias at a physicians’ meeting. I was shocked by what I heard. For the previous six years, I had been secluded from the world, working weekends in the ER while spending the week homeschooling my children. I was blithely unaware that academia had shifted from a love of Western civilization (a mandatory course when I was in college) to a disdain. The diversity officer told us that “society can be broken up into two groups, the oppressors (those with power - essentially, white males) and the oppressed.” With stunned incredulity, I wondered, “Who thinks like this?” One week later, and purely coincidentally, I read “The Communist Manifesto” by Karl Marx. There it lay in his opening paragraph: “The history of society is the history of class struggles…of oppressor and the oppressed.” As I continued reading, I was shocked by how similar Duke’s diversity officer sounded to the discredited 19th-century polemicist. Didn’t she know Marx seized on this confrontational construct as dynamite to obliterate the current capitalist system via the communist revolution? Although Marx held out hope for one day creating an imagined classless society, the purpose of his model was destruction. Desiring answers, I read all I could on diversity, equity, and inclusion, and the historical origins of this ideology. I expressed my concerns over the divisiveness of her ideas. “What else do you propose?” she asked me. I was prepared, and quoted social psychologist and author Jonathan Haidt: “To make a human hive, you want to make everyone feel like family. So don’t call attention to racial and ethnic differences; make them less relevant by ramping up similarity and celebrating the group’s shared values and common identity. You can make people care less about race by drowning it in a sea of similarities, shared goals, and mutual interdependencies.” Haidt’s advice seemed like common sense to me. There was an awkward, discomfited pause before she responded, “That’s not our model.” Discussion over. After the George Floyd riots in 2020, Duke’s embrace of DEI tightened. The university prepared an antiracist pledge to the community, dedicating itself to equity. It read, in part: “We commit to the elimination of racial inequities. … We recognize our own implicit biases and actively seek, listen, and respond to feedback from others as part of our personal growth and development. When confronted with racism, we always take action to speak out against it. … We are guided by science and know that excellent research and health care cannot happen without equity.” Call for Questions Before its public release, Duke asked its employees if they had any “questions or concerns” regarding the content. I knew remaining silent meant giving tacit approval to their political pursuits, and I thought it unfair of them to strong-arm our complicity, knowing most people would fear “poking the bear,” as I was warned. Not totally naïve to the danger, I spoke up. Upon questioning the pledge, I was told by an ill-informed chief medical officer (CMO) that equity did not mean “equal outcomes for groups,” as I had feared, but rather “equal distribution of resources and equal access to treatments.” However, my reading on DEI told me this was a dodge, that its advocates believed if racial groups were given equal “resources and access” then outcomes for groups necessarily would follow. The proof for “equitably distributed resources” could only be equal group outcomes. The pledge alleged “racism is a public health crisis,” an assertion that was purportedly “guided by science,” and signed by four senior-level physicians. As racism was not my observation, I asked my supervisor for the medical data supporting this audacious claim that racism was the primary driver of the unfortunate health disparities among many African Americans. He did not have the evidence, nor did he offer to find it. So, I approached the CMO. He likewise did not have the data, nor did he offer to look into it. At this juncture, I was beginning to understand this ideology as tyrannical, precariously held in place by fiat – an automatic red flag to its dubious legitimacy. Next in line was Duke Health’s vice president. My supervisor urged caution in approaching him. “Why,” I thought, “is the data a state secret?” I was redirected to the chief architect of the pledge, who sent me eight studies to read. Unconvincingly, the studies showed differences in racial outcomes without any link to implicit bias (unconscious racism) as alleged. The assumption was that unequal outcomes were proof of harbored unconscious racism. I pressed the architect: “I did not see a correlation between outcomes and unconscious racism in these studies, did you?” He conceded he did not, but there were “social science studies” linking implicit bias to unequal outcomes. I was dumbfounded and, as a physician trained in evidence-based/clinical data, I was uninterested in social science studies. I had social science studies of my own with different conclusions. The pledge misleadingly claimed to be “guided by science,” only it was not medical science. Disagreement Turns Dangerous My persistent efforts nettled Duke, and tension was growing. A nurse saw me reviewing those eight studies at work and asked what I was working on. This segued into a discussion about implicit bias. We civilly disagreed, and I assumed that was the end of the matter. I soon learned that she reported me to the ER supervisor. A few days later, my presence was requested in his office along with a human resources representative in tow. I wasn’t asked what had happened or for my side of the story. I was simply told the nurse felt my speech was “unsafe.” Instead of receiving instruction on the science of implicit bias, I received a hard lesson on how this dogma would be wielded in the workplace. It was Kafkaesque, with the conclusion predetermined, with no evidence presented to me and none asked of me. With the gravity of the proceedings sinking in, I leveled my gaze to his and inquired, “Which ideas were unsafe?” He seemed flummoxed that I asked, telling me he wasn’t prepared to discuss it. All that mattered was my expression of opinions inconsistent with Duke’s dogma. In addition, as a doctor, I had exploited a power differential with the nurse – who had initiated our conversation – leaving her, presumably, in no position to withstand a conversation with me, even though I wasn’t her supervisor. In consequence, I was forbidden to speak about or discuss the pledge in any way with anyone while on Duke property. I had been silenced. Around that time, I had reached out to the new president of Duke Raleigh Hospital regarding the subject of equity. Earlier, I had informed Duke that equity seemed like discrimination and a new form of racism in line with the work of Ibram X. Kendi, whose bestselling work, “How To be Anti-Racist,” was recommended reading. In this left-wing, social justice bible, Kendi famously claimed the “only remedy to past discrimination is present discrimination. The only remedy to present discrimination is future discrimination.” I arranged a meeting with her, indicating I had one question I wanted made official and on the books, not a passing curb-side consult. To my surprise, she brought along HR for backup. “Here is my question,” I said, “Please explain why equity is a better goal for society than equality.” In my mind, equity was the foundation upon which the whole woke edifice rested, and I wanted to know why America’s original foundation of equality, in place since 1776, was being replaced. The president never got back to me with an answer, but suggested that if others joined me, then maybe Duke would reply. She knew others would never join, and Duke would never explain itself. Since the head of HR was at my meeting with the president, I sought a substantive answer from her. Instead, she sent this: “Duke leaders have shared with you that these commitments were made after many opportunities listening to the voices of the people we serve. Our commitment is resolute.” Duke was resolute, resolute to not answering my question. I asked my supervisor why Duke was refusing to answer my concern about equity, as it seemed discriminatory by favoring certain preferred groups. He said that whenever Duke speaks with me, I share their responses with others. It was true. Was that a crime? The pledge was a public document; shouldn’t their defense of it be public as well if they were willing to provide one? I said, “Supervisor, do you hear the words coming out of your mouth? Duke does NOT want the public to know why it values equity above equality? How strange.” I decided to put equity on pause and test diversity. I wrote to the CMO, “Does diversity mean that Duke hires the best and the brightest, or is diversity a goal to be sought as an end in itself?” The response I received, minus some verbiage, was, “Diversity is a Duke value.” “Right,” I said, “but as a goal or as an accommodation of hiring the best and the brightest no matter how it looks?” He wouldn’t say. When I asked my supervisor, he responded, “My opinion is that our emergency department team should be focused on the delivery of high quality emergency medical care to anyone seeking it. This is my singular focus as medical director. Duke’s values and policies serve as a guide for me in that work and should guide all of us in our care of patients at DRAH [Duke Raleigh Hospital]. Persistent emails demanding debate are a distraction and consume time that could otherwise be better directed.” The ER Is Colorblind I wrote back to my supervisor: “It was an important question. It never occurred to me that diversity would be a goal. I thought diversity was a way of acknowledging that greatness comes in various shapes, sizes and colors, and that we should be open to it. However, the goal should be greatness and excellence, not diversity for its own sake. Priorities seem twisted. We should look for the person best fitted and capable for the job rather than looking at melanin or gonads when hiring. Merit is a better way to deliver high quality care.” (I wanted to tell him we both knew how silly these ideas were. When a patient comes into the ER struggling to breathe, bleeding out, or crashing in any way, all we think about is the algorithms in our heads for cheating death, not the physical characteristics of the person on the gurney. Every save is cause for equal celebration and reflects on our skill and training as physicians.) I shared most communications with family and co-workers so they could stay abreast of developments. My colleagues cautioned against foolhardiness and quixotic endeavors, and my family feared for our livelihood. Moreover, my wife said termination would be an embarrassment. I was counseled to keep quiet because things would turn on their own, and my meager efforts wouldn’t make a ripple. The prudent path was to keep my head down and lie low. The pendulum would swing. The confrontation with Duke brought tense moments between my wife and me. To her credit, she did become a staunch supporter as Duke showed its ineptitude. I had read “The Gulag Archipelago,” including Solzhenitsyn’s conclusion that the work camps were the result of good men holding their tongues and taking the expedient path in the face of evil. I knew the equality of individuals was the good and proper goal for society. Individuals were created equal, not groups, and imperfect equality was better than forced equity. I was convinced Solzhenitsyn was right when he said, “If one man can tell the truth, and always tell the truth, and never lie, he can bring down a tyranny.” It was clear to me that Duke was not interested in substantive diversity, only superficial diversity. Each year, we could propose a change to help improve the health system. As I could find no conservatives in leadership or on the board, I recommended a diversity of ideas by actively seeking out conservative voices for leadership positions to offset their uber-left echo-chamber. The leadership declined. Apparently, it’s not a diversity of ideas that matters, but diversity of color and genitals. I sensed most medical professionals at Duke agreed with me, so the next year I asked for an anonymous survey of the employees with this question: “Would you rather be judged and treated based on your personal and individual qualities or by your group identity?” Duke said they couldn’t do anonymous surveys. My supervisor and CMO never replied after I showed them that Duke had done so in the past. Told To Go Home I had pushed them near the breaking point, not with difficult questions, but embarrassingly simple ones. How had this whole DEI fiasco been allowed to progress this far? I showed up for work on Jan. 1, 2024, but was instead directed to a room with the president and the CMO while a security officer stood outside. Having done nothing medically or ethically wrong, I was told I was being terminated “not for cause.” The president opined, “You don’t seem surprised.” I replied, “From the first day I spoke up, I knew this was a possibility.” I was given six months’ notice. “Go home,” they said, “we have someone to cover your shift.” “I’m fine,” I said, “I don’t want anyone covering my shift.” They insisted. What bothered me more was walking back into the house and facing my wife. How would I tell her? She is strong, but this stung and needed processing. One year later, when it was time to renew my medical license through the North Carolina Medical Board, I had to answer in the affirmative that I had been terminated from a previous position. This triggered an investigation, which triggered more stress and more consultations with my lawyer. Duke listed the cause of my termination as “disruptive behavior.” However, nothing I did qualified as disruptive behavior per the board’s website. Fortunately, the Board found no violation. Finding a new job that would not require moving became difficult. Attaining employment at a new hospital as an employee was typically blocked by HR. I would interview with the medical director, and things would be fine until HR found out who I was. I eventually found a facility where I work as a contractor (not an employee), a little more than an hour’s drive from home. With twelve-hour shifts and driving back and forth, it makes for a long day. As my hero Jordan Peterson, the Canadian psychologist, says, “always tell the truth and you will have the adventure of your life.” The adventure may not be easy, but it will be worthwhile. Have faith that continually telling the truth, whatever happens, will eventually be for the best. Don’t let falsehoods pass by you. Some people think I was courageous. I was not. With a timid and small voice, I barely dared to ask the first question. It was Duke’s pathetic answers and evasions that emboldened me. Its supervisors weren’t so smart, they were just more fearful of the people above them than I was. As Duke has quietly changed its pledge, I have grown to feel indomitable – and vindicated. My biggest takeaway was what this experience allowed me to tell my four children, “You will fear something. Fear God, not man. Never shy away from asking questions in the pursuit of truth.” Tyler Durden Fri, 08/15/2025 - 17:40",
    "publishedAt": "2025-08-15T21:40:00.000Z",
    "fetchedAt": "2025-08-16T02:22:48.088Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "34a274e3"
  },
  {
    "id": "wsj-opinion-98b86f2",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Will China Let Jimmy Lai Die in Prison?",
    "url": "https://www.wsj.com/opinion/will-china-let-jimmy-lai-die-in-prison-30275e9c",
    "summary": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "fullContent": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "publishedAt": "2025-08-15T21:38:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.777Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "98b86f2"
  },
  {
    "id": "wsj-world-news-6b5f7c14",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Will China Let Jimmy Lai Die in Prison?",
    "url": "https://www.wsj.com/opinion/will-china-let-jimmy-lai-die-in-prison-30275e9c",
    "summary": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "fullContent": "The 77-year-old publisher&#x2019;s Hong Kong trial is postponed again as his health worsens.",
    "publishedAt": "2025-08-15T21:38:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "6b5f7c14"
  },
  {
    "id": "wsj-world-news-15eb3535",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | In France, Sweltering Is a Climate Virtue",
    "url": "https://www.wsj.com/opinion/in-france-sweltering-is-a-climate-virtue-77145796",
    "summary": "Paris wants you to use a fan and limit the AC to a single room.",
    "fullContent": "Paris wants you to use a fan and limit the AC to a single room.",
    "publishedAt": "2025-08-15T21:38:00.000Z",
    "fetchedAt": "2025-08-16T02:22:47.780Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "15eb3535"
  }
]