[
  {
    "id": "marketwatch-3880d5ec",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Ford is readying a &#x2018;compelling EV.&#x2019; Will that be enough for the stock?",
    "url": "https://www.marketwatch.com/story/ford-is-readying-a-compelling-ev-will-that-be-enough-for-the-stock-732626e3?mod=mw_rss_topstories",
    "summary": "Ford plans to offer a new four-door, midsize $30,000 electric pickup truck two years from now. The new EV is to be built on a new, universal EV platform, which Ford says is expected to reduce parts by 20% and assembly time by 15%.",
    "fullContent": "Ford plans to offer a new four-door, midsize $30,000 electric pickup truck two years from now. The new EV is to be built on a new, universal EV platform, which Ford says is expected to reduce parts by 20% and assembly time by 15%.",
    "publishedAt": "2025-08-13T00:57:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.389Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3880d5ec"
  },
  {
    "id": "bloomberg-markets-12ffdb89",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "China’s Property Crisis Hits New Low With Evergrande Delisting",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/china-s-property-crisis-hits-new-low-with-evergrande-delisting",
    "summary": "China Evergrande Group’s delisting marks a bleak milestone for the nation’s property sector, now in a fourth year of paralysis that continues to weigh down the world’s second-largest economy.",
    "fullContent": "China Evergrande Group’s delisting marks a bleak milestone for the nation’s property sector, now in a fourth year of paralysis that continues to weigh down the world’s second-largest economy.",
    "publishedAt": "2025-08-13T00:56:12.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "12ffdb89"
  },
  {
    "id": "nse-online-announcements-406ab2d0",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Indo Farm Equipment Limited",
    "url": "https://nsearchives.nseindia.com/corporate/IFEL_13082025005523_Press_Release_Signed.pdf",
    "summary": "Indo Farm Equipment Limited has informed the Exchange regarding a press release dated August 13, 2025, titled \"Pursuant to Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements)Regulations, 2015, as amended, ( SEBI LODR Regulations ), we are enclosing...",
    "fullContent": "Indo Farm Equipment Limited has informed the Exchange regarding a press release dated August 13, 2025, titled \"Pursuant to Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements)Regulations, 2015, as amended, ( SEBI LODR Regulations ), we are enclosing herewith the PressRelease issued by the Company on the Unaudited Financial Results (Standalone andConsolidated) for the quarter ended 30th June, 2025.\". |SUBJECT: Press Release",
    "publishedAt": "2025-08-13T00:55:37.000Z",
    "fetchedAt": "2025-08-13T02:33:53.467Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "406ab2d0"
  },
  {
    "id": "et-markets-4ae2a2a9",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Apollo Healthtech targets listing by Jan-Mar 2027",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/apollo-healthtech-targets-listing-by-jan-mar-2027/articleshow/123268984.cms",
    "summary": "Apollo Healthtech, a part of Apollo Hospitals, may get listed by early 2027. This move aims to unlock value for shareholders. Promoters will remain the same. Apollo Hospitals reported a strong Q1 with a 42% profit increase. Revenue also grew by 15%.",
    "fullContent": "Apollo Healthtech, a part of Apollo Hospitals, may get listed by early 2027. This move aims to unlock value for shareholders. Promoters will remain the same. Apollo Hospitals reported a strong Q1 with a 42% profit increase. Revenue also grew by 15%. The company plans to add over 4,300 beds in the next few years.",
    "publishedAt": "2025-08-13T00:55:26.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ae2a2a9"
  },
  {
    "id": "cnbc-markets-346aa998",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Perplexity offers to buy Google's Chrome browser for $34.5 billion",
    "url": "https://www.cnbc.com/2025/08/12/perplexity-google-chrome-ai.html",
    "summary": "AI startup Perplexity has offered to buy Google's Chrome browser for $34.5 billion.",
    "fullContent": "AI startup Perplexity has offered to buy Google's Chrome browser for $34.5 billion",
    "publishedAt": "2025-08-13T00:55:09.000Z",
    "fetchedAt": "2025-08-13T02:24:51.142Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "346aa998"
  },
  {
    "id": "zerohedge-7fd6cfac",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "How Oil Production Might Help California Meet Its Environmental Goals: Study",
    "url": "https://www.zerohedge.com/energy/how-oil-production-might-help-california-meet-its-environmental-goals-study",
    "summary": "How Oil Production Might Help California Meet Its Environmental Goals: Study Authored by Beige Luciano-Adams via The Epoch Times (emphasis ours), LOS ANGELES—When students in Jamie Rector’s Energy and Civilization course at the University of California–Berkeley came to him...",
    "fullContent": "How Oil Production Might Help California Meet Its Environmental Goals: Study Authored by Beige Luciano-Adams via The Epoch Times (emphasis ours), LOS ANGELES—When students in Jamie Rector’s Energy and Civilization course at the University of California–Berkeley came to him with the idea for a project on California’s abandoned oil wells, he was intrigued. A tar seep from oil deposits is seen at the La Brea Tar Pits in Los Angeles on July 30, 2025. John Fredricks/The Epoch Times The state has more than 120,000 abandoned oil and gas wells, as well as 30,000 idle wells and 70,000 active wells. Many were drilled or dug in the late 1800s, clustered in areas such as downtown Los Angeles and near present-day Dodger Stadium, where the California oil boom began. The concern among some is that these wells might be emitting methane or other hydrocarbons. Older ones are likely to have been improperly or shallowly sealed. The federal government has spent $4.7 billion to plug and reclaim abandoned wells. California has plugged about 1,400 wells at a cost of $29.5 million since 1977, and now requires operators to eliminate idle wells or face increasing fees. As they researched California’s abandoned oil wells, Rector’s students discovered an abundance of natural oil seeps located above the same fields—and came to a surprising conclusion. According to them, geologically driven, natural oil seeps are a major contributor to California’s greenhouse gas emissions. And drilling—long seen as the problem, not the answer—might be a panacea for emissions. Natural seeps occur when liquid oil and gas leak to the Earth’s surface, both on land and under water. California sits on actively moving tectonic plates, which create fractured reservoirs and pathways for the oil to escape. Waters off Southern California are rife with seeps, and oil and gas fields, including the Salt Lake field beneath the La Brea Tar Pits, and the Coal Oil Point field off the coast of Goleta, have some of the highest natural hydrocarbon seep rates in the world, emitting gases such as methane, as well as toxic volatile organic compounds (VOCs). But these geologically driven seeps, Rector said, have been largely unaccounted for in assessing how oil production fields contribute to California’s greenhouse gas emissions. “There are hundreds of studies linking oil and gas fields to greenhouse gas emissions, to cancer rates, to climate justice, to groundwater pollution and everything else,” said Rector, a professor in the University of California–Berkeley’s Civil and Environmental Engineering Department. “And yet none of these studies ever considered the possibility that it wasn’t from equipment or production, but natural seeps above the oil fields.” Reviewing existing literature, Rector’s team calculated that natural seeps, together with orphaned wells, produce 50 times more methane emissions than oil and gas equipment leaks in Southern California. If seeps are driving emissions above oil fields, Rector said, then plugging abandoned wells may do little to help pollution. In fact, he said, the only demonstrated way to reduce natural seep emissions is by depleting underlying reservoirs—that is, by drilling. A tar seep from oil deposits is seen at the La Brea Tar Pits in Los Angeles on July 30, 2025. University of California–Berkeley professor Jamie Rector said that because of California’s geological characteristics, natural oil seeps contribute significantly to its greenhouse gas emissions. John Fredricks/The Epoch Times Pointing to studies showing that oil production has reduced and even eliminated seeps, he suggested that California’s current regulatory environment may be counterproductive. “The crazy thing is, by stopping oil and gas production in California, after we’ve regulated and really gotten equipment emissions way down, we may be increasing seep emissions,” Rector said. “Because these seeps come up through the oil and gas fields, and the only way to stop it is by producing oil.” Ira Leifer, a researcher in the Department of Chemical Engineering at the University of California–Santa Barbara, said the argument is valid but that Rector’s analysis gets ahead of available data. “The problem is that there is no statewide seep emissions estimate,” said Leifer, who studies marine seeps and oil field emissions. Arriving at a publishable estimate is “impossibly difficult,” he said. Rector characterized the student project as a “skunkworks” effort without any funding, which he said he planned to submit for peer-review by August. Ideally, it will be followed by field research. “We will have to go out and make measurements with the hypothesis that seeps are the principal cause rather than oil field equipment, and make measurements along traces of faults, above oil fields where faults intersect the surface,“ he said. ”That’s really the only way we’ll get to the bottom of this.” Meanwhile, Leifer is working on his own forthcoming paper analyzing satellite data of methane anomalies. The strongest ones, he said, are associated with refining and other large infrastructure, and with natural faults that have been punctured by man-made wells—something he calls “anthropogenically amplified seepage.” Of Rector’s paper, he said: “I fundamentally agree with their conclusion. I just don’t think it can be supported with data at this point.” Leifer acknowledged that petroleum-related hydrocarbon emissions, including a “poorly understood” geological component, “clearly are extremely significant to overall California methane budget emissions,” based on spatial patterns from satellite data he has been studying for years. Both Leifer and Rector agree that so far, emissions from orphaned wells and natural seeps have not been differentiated. Thus, the critical question remains unanswered: How much does natural seepage contribute to overall emissions? While California has some of the highest concentrations of recoverable oil and gas in the world, it also boasts the most stringent oil and gas regulations in the country, and production has been in steady decline as the state aims for a 2045 “decarbonization” goal. Some pumpjacks operate while others stand idle in the Belridge Oil Field near McKittrick, Calif., on Nov. 3, 2021. California has more than 120,000 abandoned oil and gas wells, plus 30,000 idle wells. Mario Tama/Getty Images “If we’re really worried about emissions, pollution, disadvantaged communities, health—even fire danger, earthquakes and public safety—this is all affected by seeps,” Rector said. By relying on studies that have broadly ignored them, he said, policymakers may have unknowingly implemented counterproductive policies. Ancient Rocks, Modern Problems Los Angeles sits atop one of the most petroleum-dense basins on the planet. Rector cited a 2015 U.S. Geological Survey (USGS) study estimating that there are still 1 billion barrels of recoverable oil in the Los Angeles Basin. This year, the USGS estimated that 61 million barrels of recoverable oil and 240 billion cubic feet of gas remain. The organic-rich sediment beneath us is oil-prone and “relatively immature,” Rector said, and hydrocarbon generation is ongoing. Massive natural seeps such as Coal Oil Point off the coast of Santa Barbara, California—one of the largest seep fields in the world—continue to actively produce petroleum. Seeps concentrated along the coast are fed by adjacent reservoirs deep within sedimentary rock beneath the region’s oil and gas fields. California’s geology is also uniquely affected by actively shifting tectonics. Along with organic-laden sediment deposits, the shifting plates create conditions for rich petroleum accumulations, as well as natural seepage and hydrocarbon venting, Rector said. Oil fields both in the Los Angeles Basin and throughout Southern California, he said, tend to concentrate along fault lines, allowing oil generated down deep to migrate into shallower pools and eventually make its way to the surface. The La Brea Tar Pits in Los Angeles is one of the largest seepage sites in the state, and hydrocarbon gas emissions there are the highest on record for any onshore seepage site in the United States, according to a 2017 research article published in the Journal of Geophysical Research: Atmospheres. California’s bubbling tar pits have been part of human culture for millennia, their bitumen used by the Chumash Tribe as a sealant long before anyone showed up to drill for oil. When they did, in the late 1800s, surface seeps and methane vents played a crucial role in the California oil boom, during which most of the state’s large oil fields were discovered, starting with the Los Angeles Oil Field. “Back a hundred years ago, they had people, they were called ‘smells,' and they would smell the ground trying to see if there were oil seeps in an area,” Rector said, describing how early oil pioneers would decide where to dig. An explosion and resultant fire on the Signal Hill Oil Field threatens nearby homes, in Long Beach, Calif., in June 1933. FPG/Hulton Archive/Getty Images More recently, trapped oil and methane have offered a pointed reminder of the city’s ancient subterranean history, including the mysterious 1985 explosion at a Ross Dress for Less store near the La Brea Tar Pits that sent 23 people to the hospital. In a report the same year, a city task force noted that the source of the explosion was likely natural seepage of methane gas. Oil production in Los Angeles County has declined dramatically since its peak in the 1920s, when it was one of the most prolific producers in the world. But the infrastructure left in place—and whatever interaction it may have with naturally occurring seeps—remains vast and, in some ways, hidden in plain sight. Health Impacts In a 2023 paper exploring health impacts of oil and gas facilities on “cumulatively burdened” communities in Los Angeles County, researchers point to this hidden infrastructure. “As government and industry negotiated to continue oil drilling within residential zones, oil extraction in L.A. County became increasingly hidden from public view, often by utilizing tall walls or hedges, and consolidating operations into fewer neighborhoods,” the authors and university researchers wrote. Read the rest here... Tyler Durden Tue, 08/12/2025 - 20:55",
    "publishedAt": "2025-08-13T00:55:00.000Z",
    "fetchedAt": "2025-08-13T02:24:52.069Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7fd6cfac"
  },
  {
    "id": "et-markets-68566af8",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Shriram Properties’ Q1 net profit rises 18% YoY, revenue up 24%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/shriram-properties-q1-net-profit-rises-18-yoy-revenue-up-24/articleshow/123268966.cms",
    "summary": "Shriram Properties Limited announced impressive first-quarter results. Net profit rose 18% to ₹20.6 crore. Total revenue reached ₹261.5 crore, a 24% increase. Revenue from operations jumped 57%. This growth was driven by successful project handovers.",
    "fullContent": "Shriram Properties Limited announced impressive first-quarter results. Net profit rose 18% to ₹20.6 crore. Total revenue reached ₹261.5 crore, a 24% increase. Revenue from operations jumped 57%. This growth was driven by successful project handovers. The company is expanding its project pipeline. They are evaluating multiple projects. CMD Murali M attributed the success to strong execution.",
    "publishedAt": "2025-08-13T00:54:33.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68566af8"
  },
  {
    "id": "marketwatch-2253b850",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Intel&#x2019;s CEO seems to have made nice with Trump. What comes next?",
    "url": "https://www.marketwatch.com/story/intels-ceo-seems-to-have-made-nice-with-trump-what-comes-next-1c9a69d0?mod=mw_rss_topstories",
    "summary": "The chip maker could ask for more monetary support and for the White House to encourage customers to use its advanced chips, Bernstein analysts said.",
    "fullContent": "The chip maker could ask for more monetary support and for the White House to encourage customers to use its advanced chips, Bernstein analysts said.",
    "publishedAt": "2025-08-13T00:54:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.389Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2253b850"
  },
  {
    "id": "nse-online-announcements-627e09b3",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "United Drilling Tools Limited",
    "url": "https://nsearchives.nseindia.com/corporate/UNIDT_13082025005337_Intimation_Balraj_Sharma.pdf",
    "summary": "United Drilling Tools Limited has informed the Exchange regarding Appointment of Ms Balraj Sharma Associates as Other of the company w.e.f. August 12, 2025. |SUBJECT: Appointment.",
    "fullContent": "United Drilling Tools Limited has informed the Exchange regarding Appointment of Ms Balraj Sharma Associates as Other of the company w.e.f. August 12, 2025. |SUBJECT: Appointment",
    "publishedAt": "2025-08-13T00:53:47.000Z",
    "fetchedAt": "2025-08-13T02:33:53.467Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "627e09b3"
  },
  {
    "id": "thehindubusinessline-2ee4abf",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Day Trading Guide for August 13, 2025: Intraday supports, resistances for Nifty50 stocks",
    "url": "https://www.thehindubusinessline.com/portfolio/day-trading-guide/day-trading-guide-for-august-13/article69924237.ece",
    "summary": "Day Trading Guide gives you the key intraday supports and resistances to watch out for on the Nifty Futures and other widely traded stocks such as Reliance Industries, Infosys, HDFC Bank, TCS, SBI.",
    "fullContent": "Day Trading Guide gives you the key intraday supports and resistances to watch out for on the Nifty Futures and other widely traded stocks such as Reliance Industries, Infosys, HDFC Bank, TCS, SBI",
    "publishedAt": "2025-08-13T00:52:00.000Z",
    "fetchedAt": "2025-08-13T02:24:51.350Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2ee4abf"
  },
  {
    "id": "yahoo-finance-ad5a6d4",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Dollar slips further as anticipation mounts of Fed interest rate cut",
    "url": "https://finance.yahoo.com/news/dollar-slips-investors-eye-september-004823911.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-13T00:48:23.000Z",
    "fetchedAt": "2025-08-14T09:46:37.273Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "ad5a6d4"
  },
  {
    "id": "trendlyne-youtube-42cf21dd",
    "sourceId": "trendlyne-youtube",
    "sourceName": "Trendlyne YouTube",
    "title": "National Securities Depository Earnings Call for Q1FY26",
    "url": "https://www.youtube.com/watch?v=WNzL8CV5-O4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-13T00:47:08.000Z",
    "fetchedAt": "2025-08-13T02:25:23.425Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "42cf21dd"
  },
  {
    "id": "bloomberg-markets-58871906",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Moutai Emerges as Dividend Play With Yield Topping AgBank’s",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/moutai-emerges-as-dividend-play-with-yield-topping-agbank-s",
    "summary": "Kweichow Moutai Co.’s dividend yield has surpassed Agricultural Bank of China Ltd.’s for the first time, boosting the premium liquor maker’s appeal to income investors despite slowing growth.",
    "fullContent": "Kweichow Moutai Co.’s dividend yield has surpassed Agricultural Bank of China Ltd.’s for the first time, boosting the premium liquor maker’s appeal to income investors despite slowing growth.",
    "publishedAt": "2025-08-13T00:45:02.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "58871906"
  },
  {
    "id": "thehindubusinessline-2aa16a95",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "How to beat Trump tariffs",
    "url": "https://www.thehindubusinessline.com/opinion/how-to-beat-trump-tariffs/article69925612.ece",
    "summary": "",
    "fullContent": "Speed up FTAs and diversify export markets",
    "publishedAt": "2025-08-13T00:45:00.000Z",
    "fetchedAt": "2025-08-13T02:24:51.350Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2aa16a95"
  },
  {
    "id": "scmp-business-2a9a75d5",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong issues T1 warning as Severe Typhoon Podul edges closer",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3321644/hong-kong-issues-t1-warning-severe-typhoon-podul-edges-closer?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. The Hong Kong Observatory has issued the No 1 storm warning signal as Severe Typhoon Podul approaches, bringing very hot weather to the city, ahead of heavy downpours. The weather forecaster raised the signal at 8.40am on Wednesday and said that it would assess the need to issue higher...",
    "publishedAt": "2025-08-13T00:41:23.000Z",
    "fetchedAt": "2025-08-13T02:24:53.592Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2a9a75d5"
  },
  {
    "id": "scmp-business-628cdfd5",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong issues T1 warning as Severe Typhoon Podul edges closer",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3321644/hong-kong-issues-t1-warning-severe-typhoon-podul-edges-closer?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. The Hong Kong Observatory has issued the No 1 storm warning signal, as Severe Typhoon Podul approaches and is expected to be closest to the city on Thursday morning. The weather forecaster raised the signal at 8.40am on Wednesday and said that it would assess the need to upgrade it to No 3...",
    "publishedAt": "2025-08-13T00:41:23.000Z",
    "fetchedAt": "2025-08-13T04:45:46.374Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "628cdfd5"
  },
  {
    "id": "scmp-business-25eb3f2c",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong issues T1 warning as Typhoon Podul edges closer",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3321644/hong-kong-issues-t1-warning-severe-typhoon-podul-edges-closer?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. The Hong Kong Observatory has issued the No 1 storm warning signal, as Typhoon Podul approaches and is expected to be closest to the city on Thursday morning. The weather forecaster raised the signal at 8.40am on Wednesday and said that it would assess the need to upgrade it to No 3 later in...",
    "publishedAt": "2025-08-13T00:41:23.000Z",
    "fetchedAt": "2025-08-13T09:46:01.122Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "25eb3f2c"
  },
  {
    "id": "scmp-business-896522d",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Typhoon Podul: 2 Taiwan-bound flights forced to return to Hong Kong",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3321644/hong-kong-issues-t1-warning-severe-typhoon-podul-edges-closer?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. Two Taiwan-bound flights operated by a Hong Kong budget carrier were forced to return to the city due to unstable weather from Typhoon Podul on Wednesday, while the forecaster said the No 1 storm warning signal would remain in effect for the rest of the day. The weather forecaster raised the...",
    "publishedAt": "2025-08-13T00:41:23.000Z",
    "fetchedAt": "2025-08-13T13:11:17.100Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "896522d"
  },
  {
    "id": "scmp-business-38a11a03",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Typhoon Podul: 2 Taiwan-bound flights forced to return to Hong Kong",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3321644/hong-kong-issues-t1-warning-severe-typhoon-podul-edges-closer?utm_source=rss_feed",
    "summary": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial.",
    "fullContent": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. New users who download our updated app get a seven-day free trial. Two Taiwan-bound flights operated by a Hong Kong budget carrier were forced to return to the city due to unstable weather from Typhoon Podul on Wednesday, while the forecaster said the No 1 storm warning signal would remain in effect at least until 6am on Thursday. The weather forecaster...",
    "publishedAt": "2025-08-13T00:41:23.000Z",
    "fetchedAt": "2025-08-14T02:26:07.949Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "38a11a03"
  },
  {
    "id": "nse-online-announcements-9116475",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "FSN E-Commerce Ventures Limited",
    "url": "https://nsearchives.nseindia.com/corporate/NYKAA_13082025003714_Audiorecording.pdf",
    "summary": "FSN E Commerce Ventures Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "FSN E Commerce Ventures Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-13T00:37:31.000Z",
    "fetchedAt": "2025-08-13T02:33:53.467Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "9116475"
  },
  {
    "id": "bloomberg-markets-4f5e9784",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Treasury Wine Warns on China Drinking Shift as Profits Rise",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/treasury-wine-warns-on-china-drinking-shift-after-profits-rise",
    "summary": "Treasury Wine Estates Ltd. is confident the Australian brand will keep growing in its key Chinese market, despite a shift in drinking habits sparked by a government directive banning alcohol from official banquets.",
    "fullContent": "Treasury Wine Estates Ltd. is confident the Australian brand will keep growing in its key Chinese market, despite a shift in drinking habits sparked by a government directive banning alcohol from official banquets.",
    "publishedAt": "2025-08-13T00:37:01.000Z",
    "fetchedAt": "2025-08-13T06:54:37.720Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4f5e9784"
  },
  {
    "id": "bloomberg-markets-169ad1f0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Japan’s Bond Market Risks in Focus Ahead of Five-Year Sale",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/japan-s-bond-market-risks-back-in-focus-ahead-of-five-year-sale",
    "summary": "Japan will auction five-year government bonds Wednesday against the backdrop of renewed concerns over poor liquidity and volatility in the nation’s debt market.",
    "fullContent": "Japan will auction five-year government bonds Wednesday against the backdrop of renewed concerns over poor liquidity and volatility in the nation’s debt market.",
    "publishedAt": "2025-08-13T00:36:50.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "169ad1f0"
  },
  {
    "id": "bloomberg-markets-42e1bb34",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Japan’s Bond Market Risks Loom Ahead of Five-Year Sale",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/japan-s-bond-market-risks-back-in-focus-ahead-of-five-year-sale",
    "summary": "Japan will auction five-year government bonds Wednesday against the backdrop of renewed concerns over poor liquidity and volatility in the nation’s debt market.",
    "fullContent": "Japan will auction five-year government bonds Wednesday against the backdrop of renewed concerns over poor liquidity and volatility in the nation’s debt market.",
    "publishedAt": "2025-08-13T00:36:50.000Z",
    "fetchedAt": "2025-08-13T04:45:41.769Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "42e1bb34"
  },
  {
    "id": "nse-online-announcements-22688ab5",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "United Drilling Tools Limited",
    "url": "https://nsearchives.nseindia.com/corporate/UNIDT_13082025003317_Intimation_KKN.pdf",
    "summary": "United Drilling Tools Limited has informed the Exchange regarding Appointment of Mr Khitisk Kumar Nayak as Non- Executive Independent Director of the company w.e.f. August 12, 2025. |SUBJECT: Appointment.",
    "fullContent": "United Drilling Tools Limited has informed the Exchange regarding Appointment of Mr Khitisk Kumar Nayak as Non- Executive Independent Director of the company w.e.f. August 12, 2025. |SUBJECT: Appointment",
    "publishedAt": "2025-08-13T00:33:24.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "22688ab5"
  },
  {
    "id": "et-markets-26cdc3ed",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Bessemer India Capital exits Medi Assist Healthcare",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/bessemer-india-capital-exits-medi-assist-healthcare/articleshow/123268694.cms",
    "summary": "These include ABSL Mutual Fund, Kotak Mahindra MF, Wasatch Emerging India Fund, ICICI Prudential MF, Edelweiss MF, HDFC Mutual Fund, and Public Sector Pension Investment Board.",
    "fullContent": "These include ABSL Mutual Fund, Kotak Mahindra MF, Wasatch Emerging India Fund, ICICI Prudential MF, Edelweiss MF, HDFC Mutual Fund, and Public Sector Pension Investment Board.",
    "publishedAt": "2025-08-13T00:32:17.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "26cdc3ed"
  },
  {
    "id": "bloomberg-markets-7cc378bd",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Suzuki’s India Unit Doubles Down on SUVs as Small Cars Slide",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/suzuki-s-india-unit-doubles-down-on-suvs-as-small-cars-slide",
    "summary": "Maruti Suzuki India Ltd. is set to expand its SUV portfolio with a second mid-sized model, people familiar with the plan said, as the nation’s top carmaker scrambles to counter slowing demand for its bread-and-butter small cars.",
    "fullContent": "Maruti Suzuki India Ltd. is set to expand its SUV portfolio with a second mid-sized model, people familiar with the plan said, as the nation’s top carmaker scrambles to counter slowing demand for its bread-and-butter small cars.",
    "publishedAt": "2025-08-13T00:32:02.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7cc378bd"
  },
  {
    "id": "bloomberg-markets-17ef7a68",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Chinese Thermal Coal Hits 5-Month High on Heat and Disruptions",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/chinese-thermal-coal-hits-5-month-high-on-heat-and-disruptions",
    "summary": "Power plant coal prices in China have risen to the highest level since March, as downpours in mining areas disrupt output and scorching heat in cities boosts cooling demand for the fuel.",
    "fullContent": "Power plant coal prices in China have risen to the highest level since March, as downpours in mining areas disrupt output and scorching heat in cities boosts cooling demand for the fuel.",
    "publishedAt": "2025-08-13T00:32:01.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "17ef7a68"
  },
  {
    "id": "the-verge-5721e168",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "How to choose which Apple Watch to buy",
    "url": "https://www.theverge.com/23037217/best-apple-watch-series-se-ultra",
    "summary": "It used to be easy to pick an Apple Watch. All you had to do was choose whether you wanted the larger model or the smaller one. Then Apple added optional cellular connectivity. Then, a more affordable Watch SE (now in its second generation) and, in 2022, the rugged Apple Watch...",
    "fullContent": "It used to be easy to pick an Apple Watch. All you had to do was choose whether you wanted the larger model or the smaller one. Then Apple added optional cellular connectivity. Then, a more affordable Watch SE (now in its second generation) and, in 2022, the rugged Apple Watch Ultra (also now in [&#8230;]",
    "publishedAt": "2025-08-13T00:30:23.000Z",
    "fetchedAt": "2025-08-13T02:24:52.836Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5721e168"
  },
  {
    "id": "scmp-business-751eb11e",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Is Hong Kong’s legislature becoming too timid, too tame? A year in review",
    "url": "https://www.scmp.com/news/hong-kong/politics/article/3321636/hong-kongs-legislature-becoming-too-timid-too-tame-year-review?utm_source=rss_feed",
    "summary": "A proposed piece of legislation by the Hong Kong government to recognise same-sex partnerships is set to be the first bill the legislature will reject since Beijing overhauled the city’s electoral system in 2021 to ensure only “patriots” held political power.",
    "fullContent": "A proposed piece of legislation by the Hong Kong government to recognise same-sex partnerships is set to be the first bill the legislature will reject since Beijing overhauled the city’s electoral system in 2021 to ensure only “patriots” held political power. The new law, opposed by the major political parties, was the government’s response to a landmark court ruling that found authorities had violated the city’s Bill of Rights by failing to offer some form of legal recognition, such as civil...",
    "publishedAt": "2025-08-13T00:30:13.000Z",
    "fetchedAt": "2025-08-13T02:24:53.593Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "751eb11e"
  },
  {
    "id": "thehindubusinessline-59fab9ef",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Secretarial audit, reimagined",
    "url": "https://www.thehindubusinessline.com/opinion/secretarial-audit-reimagined/article69925586.ece",
    "summary": "Secretarial Audit Report and the Annual Secretarial Compliance Report must be integrated into a Strategic Governance Report.",
    "fullContent": "Secretarial Audit Report and the Annual Secretarial Compliance Report must be integrated into a Strategic Governance Report",
    "publishedAt": "2025-08-13T00:30:00.000Z",
    "fetchedAt": "2025-08-13T02:24:51.350Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "59fab9ef"
  },
  {
    "id": "zerohedge-6dac8285",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Generation Alpha's Dream Careers, By Gender",
    "url": "https://www.zerohedge.com/personal-finance/generation-alphas-dream-careers-gender",
    "summary": "Generation Alpha's Dream Careers, By Gender For as long as there have been teenagers, there has been curiosity about what they want to be when they grow up. Today, that question is particularly interesting for Generation Alpha—those born from 2010 onward—because they will be...",
    "fullContent": "Generation Alpha's Dream Careers, By Gender For as long as there have been teenagers, there has been curiosity about what they want to be when they grow up. Today, that question is particularly interesting for Generation Alpha—those born from 2010 onward—because they will be the first cohort to grow up entirely in the 21st century, shaped by rapid technological change, global crises, and evolving ideas of work. This infographic, via Visual Capitalist's Niccolo Conte, sheds light on Gen Alpha’s dream careers based on a GWI survey of 11,452 kids aged 12–15 across 18 countries, revealing a broad mix of career aspirations among today’s teens. What Gen Alpha Wants to Be When They Grow Up Below is the breakdown of Gen Alpha’s career aspirations by gender, showing the percentage of boys and girls who named each profession as their dream job: Across both genders, science and technology careers dominate. Nearly a third of boys and almost one in five girls want to become scientists, engineers, or inventors—roles often associated with innovation, problem-solving, and impact. Video game design and tech development is another popular choice, highlighting the influence of digital entertainment and the growing familiarity Gen Alpha has with coding, gaming platforms, and emerging tech. For boys, professional sports is still a powerful aspiration, ranking third at 18%. For girls, careers in healthcare are particularly popular, with nearly one in five aspiring to become doctors or healthcare professionals. The Creative Pull Not all of Gen Alpha’s aspirations are STEM-oriented. Artistic careers—like musicians, dancers, actors, and painters—top the list for girls at 21% and still capture interest from 11% of boys. Meanwhile, the rise of content creators and influencers as a career goal underscores how social media is reshaping the idea of work. About 11–12% of both boys and girls express interest in this path, suggesting it’s not just a passing trend but a legitimate aspiration in the digital age. If you enjoyed today’s post, check out The Most Important Job Skills in 2025 on Voronoi, the app from Visual Capitalist. Tyler Durden Tue, 08/12/2025 - 20:30",
    "publishedAt": "2025-08-13T00:30:00.000Z",
    "fetchedAt": "2025-08-13T02:24:52.069Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6dac8285"
  },
  {
    "id": "ndtv-profit-rss-5ca317a0",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "BPCL, IRCTC, Samvardhana, Deepak Nitrite Q1 Results Today — Earnings Estimates",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/bpcl-irctc-samvardhana-deepak-nitrite-q1-results-today-earnings-estimates",
    "summary": "Other companies announcing their June quarter results on Wednesday include Campus Activewear and Muthoot Finance.",
    "fullContent": "Other companies announcing their June quarter results on Wednesday include Campus Activewear and Muthoot Finance.",
    "publishedAt": "2025-08-13T00:30:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.138Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5ca317a0"
  },
  {
    "id": "nse-online-announcements-7e324526",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "United Drilling Tools Limited",
    "url": "https://nsearchives.nseindia.com/corporate/UNIDT_13082025002704_Intimation_KG.pdf",
    "summary": "United Drilling Tools Limited has informed the Exchange regarding Change in Director(s) of the company. |SUBJECT: Change in Director(s)",
    "fullContent": "United Drilling Tools Limited has informed the Exchange regarding Change in Director(s) of the company. |SUBJECT: Change in Director(s)",
    "publishedAt": "2025-08-13T00:27:11.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "7e324526"
  },
  {
    "id": "et-markets-418d6e39",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Is investing in T-bills via SIP a smart move compared to FDs?",
    "url": "https://economictimes.indiatimes.com/markets/bonds/is-investing-in-t-bills-via-sip-a-smart-move-compared-to-fds/articleshow/123268599.cms",
    "summary": "The RBI now permits individuals to invest in Treasury bills (T-bills) via SIPs on its retail direct platform. An analysis reveals that bank fixed deposits offer higher returns in the one-year segment, while T-bills perform better in shorter tenures.",
    "fullContent": "The RBI now permits individuals to invest in Treasury bills (T-bills) via SIPs on its retail direct platform. An analysis reveals that bank fixed deposits offer higher returns in the one-year segment, while T-bills perform better in shorter tenures.",
    "publishedAt": "2025-08-13T00:25:28.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "418d6e39"
  },
  {
    "id": "techmeme-6bec929a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "1Kosmos, which provides identity verification and passwordless authentication software, raised a $57M Series B, including a $10M line of credit (Duncan Riley/SiliconANGLE)",
    "url": "http://www.techmeme.com/250812/p37#a250812p37",
    "summary": "Duncan Riley / SiliconANGLE: 1Kosmos, which provides identity verification and passwordless authentication software, raised a $57M Series B, including a $10M line of credit — Identity proofing and passwordless authentication company 1Kosmos Inc.",
    "fullContent": "Duncan Riley / SiliconANGLE: 1Kosmos, which provides identity verification and passwordless authentication software, raised a $57M Series B, including a $10M line of credit — Identity proofing and passwordless authentication company 1Kosmos Inc. announced today that it had raised $57 million in new funding for product innovation &hellip;",
    "publishedAt": "2025-08-13T00:25:01.000Z",
    "fetchedAt": "2025-08-13T02:24:53.028Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6bec929a"
  },
  {
    "id": "bloomberg-business-youtube-1209c1e8",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "US Core CPI Picks Up to Fastest Pace Since January | Balance of Power 8/12/2025",
    "url": "https://www.youtube.com/watch?v=kyrP6CDzjwQ",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-13T00:24:52.000Z",
    "fetchedAt": "2025-08-13T02:25:10.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1209c1e8"
  },
  {
    "id": "bloomberg-business-youtube-7a80f6f6",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Stocks Surge After CPI Report | The Close 8/12/2025",
    "url": "https://www.youtube.com/watch?v=z__zujJRMLc",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-13T00:24:38.000Z",
    "fetchedAt": "2025-08-13T02:25:10.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7a80f6f6"
  },
  {
    "id": "nse-online-announcements-4131d7be",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "United Drilling Tools Limited",
    "url": "https://nsearchives.nseindia.com/corporate/UNIDT_13082025002155_Intimation_PKG.pdf",
    "summary": "United Drilling Tools Limited has informed the Exchange regarding Change in Director(s) of the company. |SUBJECT: Change in Director(s)",
    "fullContent": "United Drilling Tools Limited has informed the Exchange regarding Change in Director(s) of the company. |SUBJECT: Change in Director(s)",
    "publishedAt": "2025-08-13T00:22:04.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "4131d7be"
  },
  {
    "id": "et-markets-6730cde5",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "India's bond market signals extended rate pause despite low inflation",
    "url": "https://economictimes.indiatimes.com/markets/bonds/indias-bond-market-signals-extended-rate-pause-despite-low-inflation/articleshow/123268539.cms",
    "summary": "India's bond market indicates a likely pause in the RBI's rate-easing cycle, despite retail inflation hitting an eight-year low. A surge in yields has significantly widened the spread between 10-year bonds and the repo rate, signaling market expectations of sustained policy hold.",
    "fullContent": "India's bond market indicates a likely pause in the RBI's rate-easing cycle, despite retail inflation hitting an eight-year low. A surge in yields has significantly widened the spread between 10-year bonds and the repo rate, signaling market expectations of sustained policy hold.",
    "publishedAt": "2025-08-13T00:20:21.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6730cde5"
  },
  {
    "id": "nse-online-announcements-793a1455",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Jubilant Ingrevia Limited",
    "url": "https://nsearchives.nseindia.com/corporate/JUBLINGREA_13082025001758_Intimation_Of_Record_Date_For_Maturity_Of_Commercial_Paper.pdf",
    "summary": "",
    "fullContent": "Record Date Updates |SUBJECT: Record Date Updates",
    "publishedAt": "2025-08-13T00:18:12.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "793a1455"
  },
  {
    "id": "nse-online-announcements-3660846b",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Jubilant Ingrevia Limited",
    "url": "https://nsearchives.nseindia.com/corporate/JUBLINGREA_13082025001610_Intimation_Of_Record_Date_For_Maturity_Of_Commercial_Paper.pdf",
    "summary": "Jubilant Ingrevia Limited has informed the Exchange that Record date for the purpose of Intimation of record date for maturity of Commercial Papers is 24-Sep-2025. |SUBJECT: Record Date.",
    "fullContent": "Jubilant Ingrevia Limited has informed the Exchange that Record date for the purpose of Intimation of record date for maturity of Commercial Papers is 24-Sep-2025. |SUBJECT: Record Date",
    "publishedAt": "2025-08-13T00:16:33.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "3660846b"
  },
  {
    "id": "marketwatch-f4658a1",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "CoreWeave&#x2019;s mixed earnings fail to wow AI bulls, and the stock falls",
    "url": "https://www.marketwatch.com/story/coreweaves-mixed-earnings-fail-to-wow-ai-bulls-and-the-stock-falls-6bc57d8d?mod=mw_rss_topstories",
    "summary": "The company beat revenue expectations on &#x2018;unprecedented&#x2019; AI demand but posted a wider loss than analysts were predicting.",
    "fullContent": "The company beat revenue expectations on &#x2018;unprecedented&#x2019; AI demand but posted a wider loss than analysts were predicting.",
    "publishedAt": "2025-08-13T00:13:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.389Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "f4658a1"
  },
  {
    "id": "marketwatch-68043ce4",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Cava trims sales outlook, stock tumbles as CEO says consumers are navigating a &#x2018;fog&#x2019;",
    "url": "https://www.marketwatch.com/story/cava-trims-its-sales-outlook-and-shares-tumble-its-ceo-says-consumers-are-navigating-a-fog-8326ee19?mod=mw_rss_topstories",
    "summary": "Shares of Cava Group tumbled late Tuesday after the Mediterranean fast-casual restaurant chain trimmed its full-year same-store sales outlook.",
    "fullContent": "Shares of Cava Group tumbled late Tuesday after the Mediterranean fast-casual restaurant chain trimmed its full-year same-store sales outlook.",
    "publishedAt": "2025-08-13T00:11:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.389Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68043ce4"
  },
  {
    "id": "techmeme-f9ed298",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Study: endoscopists used to AI-assisted colonoscopies detected fewer precancerous growths after AI assistance was removed, compared to before AI was introduced (Joedy McCreary/MedPage Today)",
    "url": "http://www.techmeme.com/250812/p36#a250812p36",
    "summary": "Joedy McCreary / MedPage Today: Study: endoscopists used to AI-assisted colonoscopies detected fewer precancerous growths after AI assistance was removed, compared to before AI was introduced — - The adenoma detection rate (ADR) in more than 1,400 non-AI assisted colonoscopies...",
    "fullContent": "Joedy McCreary / MedPage Today: Study: endoscopists used to AI-assisted colonoscopies detected fewer precancerous growths after AI assistance was removed, compared to before AI was introduced — - The adenoma detection rate (ADR) in more than 1,400 non-AI assisted colonoscopies dropped 6 percentage points, from 28.4% to 22.4% &hellip;",
    "publishedAt": "2025-08-13T00:10:01.000Z",
    "fetchedAt": "2025-08-13T02:24:53.029Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "f9ed298"
  },
  {
    "id": "techmeme-4e6679a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Study: endoscopists accustomed to using AI for colonoscopies detected fewer precancerous growths after the tools were removed (Joedy McCreary/MedPage Today)",
    "url": "http://www.techmeme.com/250812/p36#a250812p36",
    "summary": "Joedy McCreary / MedPage Today: Study: endoscopists accustomed to using AI for colonoscopies detected fewer precancerous growths after the tools were removed — - The adenoma detection rate (ADR) in more than 1,400 non-AI assisted colonoscopies dropped 6 percentage points, from...",
    "fullContent": "Joedy McCreary / MedPage Today: Study: endoscopists accustomed to using AI for colonoscopies detected fewer precancerous growths after the tools were removed — - The adenoma detection rate (ADR) in more than 1,400 non-AI assisted colonoscopies dropped 6 percentage points, from 28.4% to 22.4%, after endoscopists routinely used the technology in their practice.",
    "publishedAt": "2025-08-13T00:10:01.000Z",
    "fetchedAt": "2025-08-13T04:45:45.573Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4e6679a"
  },
  {
    "id": "et-markets-7f35de7b",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Spandana Sphoorty Financial raises Rs 400 crore through rights issue amid oversubscription",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/spandana-sphoorty-financial-raises-rs-400-crore-through-rights-issue-amid-oversubscription/articleshow/123268410.cms",
    "summary": "Spandana Sphoorty Financial announced the allotment of 17.3 million partly paid-up equity shares at ₹230 each to existing investors who participated in the rights issue. This allotment increases the company's paid-up equity share capital to ₹80 crore.",
    "fullContent": "Spandana Sphoorty Financial announced the allotment of 17.3 million partly paid-up equity shares at ₹230 each to existing investors who participated in the rights issue. This allotment increases the company's paid-up equity share capital to ₹80 crore. While the rights issue was oversubscribed, the company allotted slightly less than the targeted 17.4 million shares.",
    "publishedAt": "2025-08-13T00:09:58.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7f35de7b"
  },
  {
    "id": "et-markets-4b1b5e66",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "How did India's wealthiest investors perform in June quarter?",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/how-did-indias-wealthiest-investors-perform-in-june-quarter/articleshow/123268359.cms",
    "summary": "India's wealthiest investors witnessed a surge in their net worth during the June quarter, fueled by a stock market rebound. Portfolios of figures like the Jhunjhunwala family and Mukul Agrawal saw gains between 12% and 42%.",
    "fullContent": "India's wealthiest investors witnessed a surge in their net worth during the June quarter, fueled by a stock market rebound. Portfolios of figures like the Jhunjhunwala family and Mukul Agrawal saw gains between 12% and 42%. Conversely, Madhusudan Kela and Vijay Kedia experienced portfolio value declines as they strategically reduced exposure to certain stocks.",
    "publishedAt": "2025-08-13T00:08:17.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4b1b5e66"
  },
  {
    "id": "nse-online-announcements-1e55ca59",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Jubilant Ingrevia Limited",
    "url": "https://nsearchives.nseindia.com/corporate/JUBLINGREA_13082025000718_Credit_rating.pdf",
    "summary": "Jubilant Ingrevia Limited has informed the Exchange about Credit Rating |SUBJECT: Credit Rating.",
    "fullContent": "Jubilant Ingrevia Limited has informed the Exchange about Credit Rating |SUBJECT: Credit Rating",
    "publishedAt": "2025-08-13T00:07:32.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "1e55ca59"
  },
  {
    "id": "nse-online-announcements-2c1b0053",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Stallion India Fluorochemicals Limited",
    "url": "https://nsearchives.nseindia.com/corporate/STALLION_13082025000532_IntimationforaudiorecordingofearningcallSigned.pdf",
    "summary": "Stallion India Fluorochemicals Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Stallion India Fluorochemicals Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-13T00:06:09.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "2c1b0053"
  },
  {
    "id": "bbc-business-78c82737",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "'Cryptocrash king' Do Kwon pleads guilty to fraud",
    "url": "https://www.bbc.com/news/articles/c2kznpdvwwlo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
    "fullContent": "The South Korean former tech executive co-founded Singapore-based cryptocurrency firm Terraform Labs.",
    "publishedAt": "2025-08-13T00:05:09.000Z",
    "fetchedAt": "2025-08-13T02:24:53.363Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "78c82737"
  },
  {
    "id": "zerohedge-697c5f5d",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "The 16 Midterm Races That Could Determine Who Controls The Next Congress",
    "url": "https://www.zerohedge.com/political/16-midterm-races-could-determine-who-controls-next-congress",
    "summary": "The 16 Midterm Races That Could Determine Who Controls The Next Congress Authored by John Haughey via The Epoch Times (emphasis ours), The first 2026 midterm primaries are more than 200 days away, with Arkansas, North Carolina, and Texas kicking off inter-party preliminaries...",
    "fullContent": "The 16 Midterm Races That Could Determine Who Controls The Next Congress Authored by John Haughey via The Epoch Times (emphasis ours), The first 2026 midterm primaries are more than 200 days away, with Arkansas, North Carolina, and Texas kicking off inter-party preliminaries on March 3, 2026, but many congressional races are taking shape as incumbents and challengers launch campaigns. Illustration by The Epoch Times, Shutterstock, Alvesgaspar/CC Among the most closely-watched contests will be for supremacy in the House of Representatives, where Republicans now hold a 220-213 advantage. Democrats believe they can flip the chamber while the GOP is gunning to increase its majority in the Nov. 3, 2026 election. The Democratic Congressional Campaign Committee (DCCC) has identified 35 Republican-held congressional districts “in play,” while the National Republican Congressional Committee (NRCC) has a “target list” of 26 “vulnerable” incumbent Democrats it believes GOP challengers can unseat. Among these races are 13 House seats Democrats won in districts President Donald Trump captured, and three Republicans won in districts then-Vice President Kamala Harris secured in November 2024. These 61 House contests include anticipated tight tussles in eight of California’s 52 House seats, with the NRCC putting the bull’s eye on five incumbent Democrats, and the DCCC spotlighting three Republicans. Democrats now have a 43–9 bulge in California’s congressional delegation. Other states with multiple House races that could be 2026 dogfights include five each in Florida and Ohio. In both states, the NRCC believes it can knock off two incumbent Democrats, and the DCCC is targeting three sitting Republicans. Four New York House incumbents are in hot seats with the NRCC confident it can defeat three sitting Democrats—two on Long Island—and the DCCC targeting Rep. Mike Lawler (R-N.Y.) in the lower Hudson Valley. Once again, the NRCC will attempt to win at least one of three Democrat-held Nevada seats in the Las Vegas area. The sitting president’s party has lost House seats in every midterm but two since 1950. Of course, with Texas lawmakers set to redraw the state’s 38 congressional districts and California legislators threatening to do the same, the playing field could be significantly altered by the end of thr year. Stay tuned. Here are 16 prospective 2026 midterm House races listed chronologically by primary date that could determine which party controls the chamber when the 120th Congress convenes in January 2027. 1. North Carolina Congressional District 1 Two-term Rep. Donald Davis (D-N.C.), defeated Republican challenger Laurie Buckhout by 1.7 percentage points—6,300 votes—in the 2024 North Carolina Congressional District 1 (CD 1) race. Davis might be hard-pressed to retain his seat in a district that was once a Democratic stronghold but, following post-2020 Census redistricting, is now rated as a “toss up” by The Cook Political Report. To win a third term, Davis must fend off Rocky Mount Mayor Sandy Roberson, who enters the race with $2.2 million in his war chest, according to the Federal Elections Commission (FEC), a more than $1 million edge over the incumbent. (Left) Portrait of Rep. Don Davis (D-N.C.) for the 118th Congress on Dec. 6, 2022. Davis is seeking a third term representing North Carolina’s 1st Congressional District, one of 13 that backed Republican presidential candidate Donald Trump in 2024 but sent a Democrat to the House. (Right) Rocky Mount Mayor Sandy Roberson, who lost the GOP primary for the seat in 2022 by 2,000 votes, in a file image. Library of Congress, City of Rocky Mount Roberson, who owns home-care, hospice, and nursing home operations, ran for the seat in 2022 but lost the GOP primary by 2,000 votes. North Carolina CD 1 is among the 13 congressional districts where voters selected Trump in 2024, but sent a Democrat to the House. The president won the district by 3.1 percentage points, meaning Davis outperformed Harris by 4.8 percentage points while squeezing past Buckhout. While The Cook Political Report rates the race as a “toss-up” district, Larry J. Sabato’s Crystal Ball gives it a “Lean Democratic” classification. As of Aug. 1, neither Davis nor Roberson face challengers for the March 3, 2026, primary. 2. Texas Congressional District 34 At least five Republican challengers will vie in the March 3, 2026, GOP primary for the party nod to take on two-term Rep. Vicente Gonzalez Jr. (D-Texas) in Texas Congressional District 34. This is a seat Gonzalez retained by fewer than 5,000 votes—2.6 percentage points—in 2024, despite Trump winning by 4.4 percentage points. The 2024 election marked the second time Gonzalez edged out former Rep. Maya Flores (R-Texas), after ousting her in 2022 from the seat in the Gulf Coast district, which stretches from Brownsville to Corpus Christi. It was the tightest margin of victory in Texas’s 38 congressional district elections in 2024. Gonzalez will first need to brush aside a primary challenge from Brownsville policy researcher and rock musician Etienne Rosas before facing the winner of the GOP primary. As of Aug. 1, at least five Republicans have declared candidacy with the Dec. 8 primary filing deadline still months away. They are: Keith Allen, retail manager, ordained minister, and podcast host; Joshua Cortez, former senior advisor to Rep. Monica De La Cruz (R-Texas); Eric Flores, Army infantry veteran and former assistant U.S. Attorney for the Southern District of Texas; Mauro Garza, teacher and entrepreneur; and Bam Morales, Army veteran and law enforcement officer. As of June 30, Gonzalez’s campaign had more than $932,000 in its FEC campaign kitty while challengers had amassed nominal contributions. The Cook Political Report and Larry J. Sabato’s Crystal Ball rate Texas’s CD 34 as a “toss-up” district, while Inside Elections with Nathan L. Gonzales gives it a “Tilt Democratic” rating. Rep. Vicente Gonzalez (D-Texas) discusses funding from the bipartisan infrastructure bill for the north drain expansion project in Hidalgo County, Texas, in 2022. Public Domain 3. Ohio Congressional District 9 Rep. Marcy Kaptur (D-Ohio) has been on the GOP’s target list since she succeeded 14-term Rep. Thomas Ashley (D-Ohio) in 1982. In 2026, Republicans feel confident they can flip Ohio’s Congressional District 9 for the first time since 1930. The state’s longest-serving member of Congress is seeking an 18th term in the northwest Ohio district that Trump won by 7 percent and Kaptur retained by 1,382 votes—0.7 percentage points—over business owner, realtor, and former state representative Derrick Merrin. Merrin is among four Republicans who will contend for the party berth to challenge Kaptur in the May 5, 2026, GOP primary. The others include Alea Nadeem, an Air National Guard officer who has been a national security policy advisor at the Pentagon and the National Security Council; attorney and Ohio state Rep. Josh Williams; and Air Force veteran Wayne Kinsel. Kaptur, as of Aug. 1, does not have a primary opponent. She does, however, have a big fundraising advantage with nearly $950,000 in her FEC campaign fund. By contrast, of her opponents, only Nadeem has reported contributions—less than $86,000—as of June 30. The Cook Political Report and Crystal Ball rate Ohio’s CD 9 as a “toss-up.” (Left) Rep. Marcy Kaptur (D-Ohio) in a 2018 portrait. Kaptur, who has served in Congress since 1983, is seeking her 18th term representing Ohio’s 9th Congressional District. (Right) Ohio state Rep. Josh Williams is among four Republicans vying for the GOP nomination to challenge Kaptur in the primary next May. Franmarie Metzler/Public Domain, Ohio House of Representatives 4. Pennsylvania Congressional District 7 Newcomer Rep. Ryan Mackenzie (R-Pa.) in 2024 knocked out three-term incumbent Rep. Susan Wild (D-Pa.) by 4,062 votes—1 percentage point—in their Pennsylvania Congressional District 7 race. Wild, as of Aug. 1, is not among the three Democrats who have declared their candidacies for Pennsylvania’s May 19 primary for a space on the ballot opposite Mackenzie in 2026. The state candidate-filing deadline for the party preliminaries is March 10, 2026. The confirmed three are: Marine veteran and former federal prosecutor Ryan Crosswell, Northampton County Executive Lamont McClure, and nonprofit executive Carol Obando-Derstine. Mackenzie, who does not have a Republican primary challenger as yet, served on the Pennsylvania Economic Development Financing Authority before defeating Wild in CD 7, which includes all of Carbon, Lehigh, and Northampton counties in northeast Pennsylvania. Mackenzie’s campaign had $1.2 million in its FEC war chest as of June 30, significantly more in contributions than any of his potential opponents. The Cook Political Report, Inside Elections, and Crystal Ball all rate Pennsylvania’s CD 7 as a “toss-up” district. Rep.-elect Ryan Mackenzie (R-Pa.) speaks with a reporter as he arrives for a new member orientation program on Capitol Hill in Washington on Nov. 14, 2024. Andrew Harnik/Getty Images 5. Nebraska Congressional District 2 This key Omaha-area House seat is wide open after five-term Rep. Don Bacon (R-Neb.) announced on June 30 he is not seeking reelection in 2026, and Democrats believe they can win it. Nebraska Congressional District 2 is one of three districts in the country that Harris won in 2024 while also electing a Republican to the House. Bacon, a retired Air Force general, defeated Democrat Tony Vargas by less than 2 percentage points in their rematch from 2022. With Bacon out of the picture, four Democrats and one Republican have launched campaigns for the seat, which The Cook Political Report and Crystal Ball rate as “Lean Democratic,” and Inside Elections calls a “toss up.” As of Aug. 1, state Sen. Brett Lindstrom and Omaha City Councilman Brinker Harding have thrown their hats in the ring for the GOP primary. Vying for the Democratic nod are Kishla Askins, a former deputy assistant secretary of Veterans Affairs under President Joe Biden; state Sen. John Cavanaugh; Denise Powell, small business owner and former corporate executive; and Evangelos Argyrakis, immigration attorney. The Nebraska State Legislature has not yet set a date for the primary, but it is typically in May. 6. California Congressional District 13 Although Trump lost California by 20 percentage points in 2024, he won Congressional District 13 by 5.4 percentage points. Newcomer Rep. Adam Gray (D-Calif.) unseated one-term Rep. John Duarte (R-Calif.) by 187 votes in their 2024 slugfest—the closest House race nationwide—and Republicans will likely spend big to get the Central Valley seat back. As of Aug. 1, Gray doesn’t face a party rival in the June 2 primary, but Republicans Ceres Mayor Javier Lopez and business owner Vin Kruttiventi will face off for the GOP nod. Gray is one of 13 Democrats holding seats in crossover districts the president won. The district garners a “toss-up” rating from the Cook Political Report, Crystal Ball, and Inside Elections. 7. New Jersey Congressional District 7 Two-term Rep. Thomas Kean Jr. (R-N.J.) does not, as of Aug. 1, have any opponents in New Jersey’s June 2 primary, but at least eight Democrats will battle for a Congressional District 7 ballot berth to dislodge him in November 2026. The district, one of the most affluent in the nation, includes Hunterdon and Warren counties, and parts of Morris, Somerset, Sussex, and Union counties in north-central New Jersey. Kean was reelected in 2024 by 5.4 percentage points over Democrat Susan Altman after wresting the formerly blue stronghold from two-term Rep. Tom Malinowski (D-N.J.) by 2.8 percentage points—less than 9,000 votes—in 2020. It was a rematch from their 2020 race, which Malinowski won by 1.2 percentage points. The son of former New Jersey Gov. Thomas Kean Sr., Kean is a former state lawmaker who worked in the Environmental Protection Agency during the George H.W. Bush administration. The candidate-filing deadline for the primary is March 23, 2026, but the Democratic inter-party preliminary is already crowded. Among contenders are Rebecca Bennett, criminal justice professor; Beth Ellen Adubato, former Navy helicopter pilot, Air National Guard officer, and health care executive; Valentina “Vale” Mendoza, an attorney; Michael Roth, an official in the Biden administration’s Small Business Administration; Felipe Santos, an entrepreneur; Tina Shah, a physician; Brian Varela, a marketing agency owner; and Gregory Vartan, Common Council of Summit councilmember. Crystal Ball rates New Jersey CD 7 a “toss-up,” while The Cook Political Report classifies it as “Lean Republican,” and Inside Elections as “Tilt Republican.” 8. New Mexico Congressional District 2 Rep. Gabe Vasquez (D-N.M.) edged out incumbent Rep. Yvette Herrell (R-N.M.) by 0.7 percentage points in 2022—the nation’s closest House race during that midterm election. He beat Herrell again by more than 4.2 percentage points in their 2024 rematch in New Mexico’s Congressional District 2. As of Aug. 1, Vasquez does not face a challenger in the state’s June 2 primary, nor does Republican Eddy Aragon, although that could change by the Feb. 3 candidate-filing deadline. The district, which spans southern New Mexico—including Las Cruces and the southern reaches of Albuquerque—is one of 13 districts Trump won in 2024 while a Democrat was elected to the House. Vasquez, a former journalist, Hispano Chamber of Commerce de Las Cruces executive director, and field representative for Sen. Martin Heinrich (D-N.M.), served on the Las Cruces City Council before challenging Herrell. Aragon is CEO of Rock of Talk and a longtime Albuquerque radio broadcaster. As of Aug. 1, he had $3,000 in his FEC campaign fund compared to Vasquez’s $626,000. The Cook Political Report rates New Mexico’s CD 2 as a “toss-up,” while Inside Elections gives it a “Tilt Democratic” classification, and Crystal Ball calls it a “Lean Democratic.” 9. Maine Congressional District 2 Rep. Jared Golden (D-Maine) is seeking a fifth term in Maine’s Congressional District 2, a district he won in 2024 by 0.6 percentage points—2,706 votes—and Trump won by almost 7 percent. Next year, he’ll have to do that against former two-term Republican Gov. Paul LePage in the 27,326-square-mile district, the largest by area, east of the Mississippi River. As of Aug. 1, neither face party rivals in the state’s June 9 primary, but that could change before the March 15 candidate-filing deadline. Golden had $1 million in his FEC campaign fund as of June 30, while LePage had $527,781. The Cook Political Report and Crystal Ball rate Maine’s CD 2 as a “toss-up,” while Inside Elections pegs it as “Tilt Democratic.” 10. Virginia Congressional District 2 Rep. Jennifer Kiggans (R-Va.) has survived two races in Virginia’s Congressional District 2, unseating incumbent Rep. Elaine Luria (D-Va.) in 2022 by 10,000 votes—3.4 percentage points—and then fending off Democrat Missy Cotter Smasal by 3.8 percentage points in 2024. Another tussle awaits if she’s to three-peat in the tidewater district, which has a strong military, primarily Navy, constituency. Kiggans, a former Navy helicopter pilot and an adult-geriatric nurse practitioner, faces no GOP challengers in the June 16 primary as of Aug. 1, but party rivals could emerge before the April 2 candidate-filing deadline. Three Democrats have declared candidacies. They are U.S. Naval Academy graduate and fast-attack submarine veteran James Osyf; Navy veteran and entrepreneur John ‘Burk’ Stringfellow; and data center project manager Nicolaus Sleister. Kiggans had nearly $1.5 million in her FEC kitty as of June 30. The Democratic candidates had either nominal contributions or had not reported yet. Virginia’s CD 2 is rated a “toss-up” district by Inside Elections and Crystal Ball. The Cook Political Report calls it “Lean Republican.” 11. New York Congressional District 4 First-term Rep. Laura Gillen (D-N.Y.) defeated incumbent Rep. Anthony D‘Esposito (R-N.Y.) by 2.3 percentage points in their 2024 Congressional District 4 race. It was a rematch, and a reversal, of their 2022 race that D’Esposito won by 3.6 percentage points. As of Aug. 1, Gillen, the former Hempstead Town supervisor, faces two Democrat rivals in the party’s June 23 primary: real estate professional and veteran Democrat campaign manager Gian Jones, and artist and stagehand Nicholas Sciretta. Americord founder and CEO Martin Smithmyer is the only Republican seeking the party nod to take on Gillen, although more are likely to join the race before the April 2 candidate-filing deadline. Gillen has more than $1 million in her FEC campaign bank. None of her challengers in the Long Island district had significant contributions as of June 30. The Cook Political Report rates New York’s CD 4 as a “toss-up.” Inside Elections calls it “Tilt Democratic,” and Crystal Ball rates it as “Lean Democratic.” 12. Colorado Congressional District 8 Rep. Gabe Evans (R-Colo.) defeated incumbent Rep. Yadira Caraveo (D-Colo.) by 0.7 percentage points in 2022 in Colorado Congressional District 8 and again warded her off in 2024 by 1.2 percentage points. Evans will face a similar close race in 2026 if he’s to return to Congress for a third term representing Colorado’s newest district, which traces I-25 north of Denver in Adams, Larimer, and Weld counties. Nearly 40 percent of CD 8 voters are Hispanic, and Democrats have a 3 percent registration advantage, which is why at least seven Democrats have launched campaigns to win the June 30 primary to take on Evans in November 2026—including Caraveo, a pediatrician. The other six are: Amie Baca-Oehlert, executive director of the Denver Classroom Teachers Association; State Rep. Shannon Bird; Marine combat veteran and finance associate Evan Munsing; state Rep. Manny Rutinel; software management consultant John Szemler; and Colorado state Treasurer Dave Young. Evans, an Army combat veteran, farmer, and former police officer, as of Aug. 1 does not have a GOP primary challenger, although there’s time for rivals to declare before the March 17 candidate-filing deadline. He had $1.5 million in his FEC campaign kitty as of June 30, far more than the Democrat campaigns, although Rutinel had more than $800,000 in contributions. The Cook Political Report, Inside Elections, and Crystal Ball all rate Colorado’s CD 8 as a “toss-up” district. Read the rest here... Tyler Durden Tue, 08/12/2025 - 20:05",
    "publishedAt": "2025-08-13T00:05:00.000Z",
    "fetchedAt": "2025-08-13T02:24:52.070Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "697c5f5d"
  },
  {
    "id": "nse-online-announcements-77146da",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Selan Exploration Technology Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SELAN_13082025000254_SE_intimation_investor_presentation_Q1_sd.pdf",
    "summary": "Selan Exploration Technology Limited has informed the Exchange regarding 'Investor Presentation on Q1 FY'26'. |SUBJECT: Updates.",
    "fullContent": "Selan Exploration Technology Limited has informed the Exchange regarding 'Investor Presentation on Q1 FY'26'. |SUBJECT: Updates",
    "publishedAt": "2025-08-13T00:03:32.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "77146da"
  },
  {
    "id": "nse-online-announcements-126f4e9b",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Jubilant Ingrevia Limited",
    "url": "https://nsearchives.nseindia.com/corporate/JUBLINGREA_13082025000143_investors_meet-Stock_exchange_filing.pdf",
    "summary": "Jubilant Ingrevia Limited has informed the Exchange about Schedule of meet and Presentation |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Jubilant Ingrevia Limited has informed the Exchange about Schedule of meet and Presentation |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-13T00:01:54.000Z",
    "fetchedAt": "2025-08-13T02:33:53.468Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "126f4e9b"
  },
  {
    "id": "bloomberg-markets-54c969cf",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Australia’s SO4 Exports Potash From Billionaire’s Lake Way Site",
    "url": "https://www.bloomberg.com/news/articles/2025-08-13/australia-s-so4-exports-potash-from-billionaire-s-lake-way-site",
    "summary": "SO4, the Australian potash producer owned by Czech billionaire Pavel Tykac, said it made its first commercial shipment overseas and plans to become a major exporter of the fertilizer.",
    "fullContent": "SO4, the Australian potash producer owned by Czech billionaire Pavel Tykac, said it made its first commercial shipment overseas and plans to become a major exporter of the fertilizer.",
    "publishedAt": "2025-08-13T00:00:00.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "54c969cf"
  },
  {
    "id": "oil-price-2398b8c8",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Nigerian Oil Stands to Gain as India Shies Away From Russian Crude",
    "url": "https://oilprice.com/Energy/Crude-Oil/Nigerian-Oil-Stands-to-Gain-as-India-Shies-Away-From-Russian-Crude.html",
    "summary": "A week ago, U.S. President Donald Trump came down hard on India, doubling its tariff rate from 25% to 50% for fueling Putin’s war in Ukraine by continuing to buy massive quantities of Russian oil. We reported that India&#039;s imports of Russian commodities have skyrocketed...",
    "fullContent": "A week ago, U.S. President Donald Trump came down hard on India, doubling its tariff rate from 25% to 50% for fueling Putin’s war in Ukraine by continuing to buy massive quantities of Russian oil. We reported that India&#039;s imports of Russian commodities have skyrocketed since the war began, surging to $65.7 billion in 2024 from $8.25 billion in 2021, according to India’s The Business Standard. In sharp contrast, imports by the European Union and the U.S. have declined by more than 80% as they look to choke Russia’s war machine.…",
    "publishedAt": "2025-08-13T00:00:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.149Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "2398b8c8"
  },
  {
    "id": "yahoo-finance-4a4f7e53",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Scrappy Gas Billionaires Win Major Arbitration Case Against Shell",
    "url": "https://www.wsj.com/business/energy-oil/scrappy-gas-billionaires-win-major-arbitration-case-against-shell-5fced1ca?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:58:00.000Z",
    "fetchedAt": "2025-08-14T09:46:37.273Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4a4f7e53"
  },
  {
    "id": "bloomberg-business-youtube-249a1f65",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Evergrande to Delist in China Housing Crisis Milestone",
    "url": "https://www.youtube.com/watch?v=vGaEiu8bOFk",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:56:43.000Z",
    "fetchedAt": "2025-08-13T02:25:10.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "249a1f65"
  },
  {
    "id": "yahoo-finance-75ef6053",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Japan's wholesale inflation slows for 4th month in July",
    "url": "https://finance.yahoo.com/news/japans-wholesale-inflation-slows-4th-235630755.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:56:30.000Z",
    "fetchedAt": "2025-08-14T09:46:37.273Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "75ef6053"
  },
  {
    "id": "bloomberg-politics-558deec4",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Putin Briefs Kim Jong Un in Phone Call Ahead of Trump Meeting",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/putin-briefs-kim-jong-un-in-phone-call-ahead-of-trump-meeting",
    "summary": "Vladimir Putin held a phone conversation with North Korean leader Kim Jong Un to brief him on the war in Ukraine ahead of the Russian president’s planned summit with President Donald Trump in Alaska.",
    "fullContent": "Vladimir Putin held a phone conversation with North Korean leader Kim Jong Un to brief him on the war in Ukraine ahead of the Russian president’s planned summit with President Donald Trump in Alaska.",
    "publishedAt": "2025-08-12T23:56:28.000Z",
    "fetchedAt": "2025-08-13T02:24:51.449Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "558deec4"
  },
  {
    "id": "bloomberg-markets-35cf71e1",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Billionaire Kwek’s CDL Sees Muted Profit Rise After Feud",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/billionaire-kweks-cdl-sees-muted-profit-rise-after-family-feud",
    "summary": "The Singapore developer controlled by the city-state’s richest clan reported a small increase in profit in the first half of the year, a period overshadowed by a damaging family feud.",
    "fullContent": "The Singapore developer controlled by the city-state’s richest clan reported a small increase in profit in the first half of the year, a period overshadowed by a damaging family feud.",
    "publishedAt": "2025-08-12T23:55:58.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "35cf71e1"
  },
  {
    "id": "bloomberg-markets-13a154ca",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Billionaire Kweks’ CDL Profit Rises; Succession Plan ‘Fluid’",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/billionaire-kweks-cdl-sees-muted-profit-rise-after-family-feud",
    "summary": "The Singapore developer controlled by the country’s richest clan reported a small profit increase, as its leadership sought to demonstrate it has moved past a damaging family feud that erupted earlier this year.",
    "fullContent": "The Singapore developer controlled by the country’s richest clan reported a small profit increase, as its leadership sought to demonstrate it has moved past a damaging family feud that erupted earlier this year.",
    "publishedAt": "2025-08-12T23:55:58.000Z",
    "fetchedAt": "2025-08-13T09:45:58.631Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "13a154ca"
  },
  {
    "id": "techmeme-303ebc07",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "India's RBI grants Paytm \"in-principle\" approval to operate as a payment services provider for online merchants, after China's Ant Group sold its entire stake (Jagmeet Singh/TechCrunch)",
    "url": "http://www.techmeme.com/250812/p35#a250812p35",
    "summary": "Jagmeet Singh / TechCrunch: India's RBI grants Paytm \"in-principle\" approval to operate as a payment services provider for online merchants, after China's Ant Group sold its entire stake — Indian fintech giant Paytm has received long-awaited approval from the country's central...",
    "fullContent": "Jagmeet Singh / TechCrunch: India's RBI grants Paytm \"in-principle\" approval to operate as a payment services provider for online merchants, after China's Ant Group sold its entire stake — Indian fintech giant Paytm has received long-awaited approval from the country's central bank to operate &hellip;",
    "publishedAt": "2025-08-12T23:55:01.000Z",
    "fetchedAt": "2025-08-13T02:24:53.029Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "303ebc07"
  },
  {
    "id": "et-markets-32f004a2",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Banks boost equity investments by 49% in FY25 amid retail FOMO",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/banks-boost-equity-investments-by-49-in-fy25-amid-retail-fomo/articleshow/123268209.cms",
    "summary": "Indian banks significantly increased their equity investments in FY25, driven by strategic treasury diversification. An analysis of 16 major banks revealed a 49% surge, reaching ₹49,572 crore, with SBI's investments tripling.",
    "fullContent": "Indian banks significantly increased their equity investments in FY25, driven by strategic treasury diversification. An analysis of 16 major banks revealed a 49% surge, reaching ₹49,572 crore, with SBI's investments tripling. This rise coincided with growing retail participation in the market and the implementation of new accounting norms.",
    "publishedAt": "2025-08-12T23:54:30.000Z",
    "fetchedAt": "2025-08-13T02:24:50.967Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "32f004a2"
  },
  {
    "id": "bloomberg-markets-74f2ae80",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Evergrande to Delist in China Housing Crisis Milestone",
    "url": "https://www.bloomberg.com/news/videos/2025-08-12/evergrande-to-delist-in-china-housing-crisis-milestone",
    "summary": "China Evergrande Group said its Hong Kong stock will be delisted, according to a filing to the Hong Kong bourse on Tuesday. The shares will be removed on Aug. 25 and the Guangzhou-based company won’t apply for a review of the exchange’s decision.",
    "fullContent": "China Evergrande Group said its Hong Kong stock will be delisted, according to a filing to the Hong Kong bourse on Tuesday. The shares will be removed on Aug. 25 and the Guangzhou-based company won’t apply for a review of the exchange’s decision. Evergrande was once China’s largest developer by sales, and was worth more than $50 billion in 2017 at its peak. Bloomberg’s Minmin Low reports.",
    "publishedAt": "2025-08-12T23:53:56.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "74f2ae80"
  },
  {
    "id": "cnbc-tv18-youtube-4501c8e3",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Top News LIVE: 13 August की खबरें| Stray Dogs | Trump | PM Modi | Rahul | Priyanka | Monsoon Session",
    "url": "https://www.youtube.com/watch?v=VXbzNojP-38",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:51:40.000Z",
    "fetchedAt": "2025-08-13T02:25:04.459Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4501c8e3"
  },
  {
    "id": "yahoo-finance-4ec72b1b",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Cava Cuts Outlook on Weak Second Quarter as Consumers Face ‘Fog and Uncertainty’",
    "url": "https://www.wsj.com/business/earnings/cava-cuts-outlook-on-weak-second-quarter-as-consumers-face-fog-and-uncertainty-b08e17db?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:47:00.000Z",
    "fetchedAt": "2025-08-14T09:46:37.273Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ec72b1b"
  },
  {
    "id": "bloomberg-markets-570c3015",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Gold Holds Modest Gain as Inflation Data Aids US Rate-Cut Bets",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/gold-xauusd-holds-modest-gain-as-inflation-data-aids-us-rate-cut-bets",
    "summary": "Gold held a modest gain following a US inflation reading that was in line with expectations and reinforced wagers on an interest-rate cut next month.",
    "fullContent": "Gold held a modest gain following a US inflation reading that was in line with expectations and reinforced wagers on an interest-rate cut next month.",
    "publishedAt": "2025-08-12T23:46:26.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "570c3015"
  },
  {
    "id": "bloomberg-markets-73a1586b",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Gold Notches Small Gain as US Inflation Data Aids Rate-Cut Bets",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/gold-xauusd-holds-modest-gain-as-inflation-data-aids-us-rate-cut-bets",
    "summary": "Gold extended a modest gain, following a US inflation reading that was in line with expectations and reinforced wagers on the Federal Reserve cutting interest rates next month.",
    "fullContent": "Gold extended a modest gain, following a US inflation reading that was in line with expectations and reinforced wagers on the Federal Reserve cutting interest rates next month.",
    "publishedAt": "2025-08-12T23:46:26.000Z",
    "fetchedAt": "2025-08-13T09:45:58.631Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "73a1586b"
  },
  {
    "id": "bloomberg-markets-33544728",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Stocks Surge After CPI Report | The Close 8/12/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-12/the-close-8-12-2025-video",
    "summary": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Inflation Insights’s Omair Sharif, Principal Asset’s Seema Shah Portal Innovations’ John Flavin, Wells...",
    "fullContent": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Inflation Insights’s Omair Sharif, Principal Asset’s Seema Shah Portal Innovations’ John Flavin, Wells Fargo’s Aaron Rakers, Former Canadian Minister of International Trade Mary Ng, Morgan Stanley’s Andrew Slimmon, DA Davidson’s Gil Luria, JPMorgan’s Jay Barry, Milo’s Tea Company’s Tricia Wallwork, Duski. (Source: Bloomberg)",
    "publishedAt": "2025-08-12T23:43:29.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "33544728"
  },
  {
    "id": "zerohedge-5bd33243",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "These Are The Best-Selling Cars In The US So Far In 2025",
    "url": "https://www.zerohedge.com/personal-finance/these-are-best-selling-cars-us-so-far-2025",
    "summary": "These Are The Best-Selling Cars In The US So Far In 2025 The first half of 2025’s best-selling cars in the U.S. confirms America’s long-standing love affair with trucks and SUVs. Pickup models from Ford, Chevrolet, and Ram continue to dominate the top ranks, while compact SUVs...",
    "fullContent": "These Are The Best-Selling Cars In The US So Far In 2025 The first half of 2025’s best-selling cars in the U.S. confirms America’s long-standing love affair with trucks and SUVs. Pickup models from Ford, Chevrolet, and Ram continue to dominate the top ranks, while compact SUVs from Toyota and Honda also make strong showings. Sedans, once the default choice for many households, are now largely absent from the bestseller list. This ranking, via Visual Capitalist's Niccolo Conte, showcases the 20 best-selling vehicles in the U.S. from January through June 2025 using data from Cox Automotive and Automotive News via Kelley Blue Book. Pickups and SUVs Lead U.S. Car Sales With 3.17 million cars sold across America’s top 20 models in the first half of 2025, pickup trucks and SUVs dominate the top of the list, making up nine out of the top 10 most-sold cars. The data table below lists the top 20 car models and their sales figures for H1 2025, along with what kind of vehicle it is. Ford’s F-Series led with 412,848 units, with the Chevrolet Silverado close behind at 284,038. The Toyota RAV4 (239,451) and Honda CR-V (212,561) were the leading compact SUVs, reflecting the segment’s broad appeal. If you take a look at the best-selling cars by state, the Ford F-Series dominates the map, which is no surprise considering Ford is among the top three favorite car brands of every generation in America. Among the top 10 best-selling cars, pickups account for five spots and about 56% of volume, while SUVs take four spots and 36%. The top five models—three pickups and two compact SUVs—together make up about 42% of all top-20 sales. Few Sedans Among Best-Selling Vehicles Sedans claim just one place in the top 10 with the Toyota Camry at 155,330 units sold in America in the first half of 2025. The Honda Civic (128,236) and Toyota Corolla (120,052) follow just outside of the top 10, joined by Tesla’s Model 3 (101,323) in 17th place. Looking at the full top 20 sales by vehicle type, SUVs account for 47% of top-20 sales (1.49 million vehicles), followed by pickup trucks at 37% (1.17 million) and sedans at 16% (505,000). While sedans still find buyers, since 2015 a strong majority of car sales have continued to shift to crossovers and trucks. To learn more about car production around the world, check out this graphic on Voronoi which maps out global vehicle production by country in 2024. Tyler Durden Tue, 08/12/2025 - 19:40",
    "publishedAt": "2025-08-12T23:40:00.000Z",
    "fetchedAt": "2025-08-13T02:24:52.071Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5bd33243"
  },
  {
    "id": "yahoo-finance-1ac6aa95",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Bankrupt Property Developer China Evergrande to Delist From Hong Kong Exchange",
    "url": "https://www.wsj.com/business/bankrupt-property-developer-china-evergrande-to-delist-from-hong-kong-exchange-c6c78070?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:40:00.000Z",
    "fetchedAt": "2025-08-14T09:46:37.273Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1ac6aa95"
  },
  {
    "id": "bloomberg-markets-37f2c3a6",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Holds Decline With Focus on Trump-Putin Meeting on Ukraine",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/latest-oil-market-news-and-analysis-for-august-13",
    "summary": "Oil was steady after dropping in thin trading on Tuesday, with investors looking to talks between the US and Russian leaders on Friday for fresh impetus.",
    "fullContent": "Oil was steady after dropping in thin trading on Tuesday, with investors looking to talks between the US and Russian leaders on Friday for fresh impetus.",
    "publishedAt": "2025-08-12T23:37:50.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "37f2c3a6"
  },
  {
    "id": "bloomberg-markets-174fb674",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Slips After IEA Casts Gloomy Outlook for Months Ahead",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/latest-oil-market-news-and-analysis-for-august-13",
    "summary": "Crude edged lower after the International Energy Agency said oil markets are set to see a growing surplus at the end of this year and into next.",
    "fullContent": "Crude edged lower after the International Energy Agency said oil markets are set to see a growing surplus at the end of this year and into next.",
    "publishedAt": "2025-08-12T23:37:50.000Z",
    "fetchedAt": "2025-08-13T09:45:58.630Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "174fb674"
  },
  {
    "id": "bloomberg-markets-355784f1",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Oil Steadies After IEA Casts Gloomy Outlook for Months Ahead",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/latest-oil-market-news-and-analysis-for-august-13",
    "summary": "Crude held near $66 a barrel after the International Energy Agency said oil markets are set to see a growing surplus at the end of this year and into next.",
    "fullContent": "Crude held near $66 a barrel after the International Energy Agency said oil markets are set to see a growing surplus at the end of this year and into next.",
    "publishedAt": "2025-08-12T23:37:50.000Z",
    "fetchedAt": "2025-08-13T13:11:14.360Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "355784f1"
  },
  {
    "id": "yahoo-finance-18106fe4",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Is Ford Stock’s Juicy Dividend Still Safe Amid the Global Tariff War?",
    "url": "https://finance.yahoo.com/news/ford-stock-juicy-dividend-still-233002177.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:30:02.000Z",
    "fetchedAt": "2025-08-14T09:46:37.273Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "18106fe4"
  },
  {
    "id": "ft-technology-8c54b7f",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "CoreWeave shares drop after bigger than expected losses",
    "url": "https://www.ft.com/content/79d940e5-e298-4520-a0ae-2a0e3881bb05",
    "summary": "Data centre group has ridden wave of enthusiasm for artificial intelligence.",
    "fullContent": "Data centre group has ridden wave of enthusiasm for artificial intelligence",
    "publishedAt": "2025-08-12T23:19:39.000Z",
    "fetchedAt": "2025-08-13T02:24:52.216Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "8c54b7f"
  },
  {
    "id": "the-verge-3c88982e",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Russia might be responsible for the PACER hack",
    "url": "https://www.theverge.com/law/758440/federal-courts-hacked-pacer-cm-ecf-russia",
    "summary": "Just a few days after administrators announced that the “federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks,” the New York Times reports investigators have found evidence Russia is...",
    "fullContent": "Just a few days after administrators announced that the “federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks,” the New York Times reports investigators have found evidence Russia is “at least partially responsible” for a recent hack. Politico reported on the breach last week, saying [&#8230;]",
    "publishedAt": "2025-08-12T23:18:29.000Z",
    "fetchedAt": "2025-08-13T02:24:52.836Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3c88982e"
  },
  {
    "id": "bloomberg-markets-534db533",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Man Group’s Japan Fund Buying Bank Stocks in Bet on Inflation",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/man-group-s-japan-fund-buying-bank-stocks-in-bet-on-inflation",
    "summary": "An investment manager at the world’s largest publicly traded hedge fund, Man Group, is adding Japan’s financial shares to her portfolio on the view the nation’s central bank will need to hike interest rates to tame inflation.",
    "fullContent": "An investment manager at the world’s largest publicly traded hedge fund, Man Group, is adding Japan’s financial shares to her portfolio on the view the nation’s central bank will need to hike interest rates to tame inflation.",
    "publishedAt": "2025-08-12T23:15:24.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "534db533"
  },
  {
    "id": "zerohedge-5da872bb",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Eco Loons Suggest Proliferating A Plague Of Ticks To Prevent People Eating Meat",
    "url": "https://www.zerohedge.com/medical/eco-loons-suggest-proliferating-plague-ticks-prevent-people-eating-meat",
    "summary": "Eco Loons Suggest Proliferating A Plague Of Ticks To Prevent People Eating Meat Authored by Chris Morrison via DailySceptic.org, Perhaps it’s a drinking or smoking game at Western Michigan University.",
    "fullContent": "Eco Loons Suggest Proliferating A Plague Of Ticks To Prevent People Eating Meat Authored by Chris Morrison via DailySceptic.org, Perhaps it’s a drinking or smoking game at Western Michigan University. Try to come up with the most farcical, April Fool-style Net Zero nonsense and see if we can get it published. How about writing a paper titled ‘Beneficial Bloodsucking’ that states it is “morally obligatory” to promote a plague of the lone star tick whose bite can lead to medical problems including an allergy to red meat. Oh, and it could kill you, but more about that later. Promoting these ghastly ticks, which are already increasing in numbers in large areas of the United States, is said to: “prevent the world from becoming a significantly worse place… doesn’t violate anyone’s rights… promotes virtuous action or character”. How stupid can academics be? These clowns are prepared to unleash a proliferation of ticks on the general population because one side effect of a bite happens to induce an allergy to red meat, notably beef, pork and lamb. What is proposed is a deliberate tick injection of the sugar molecule alpha-gal into human tissue, leading to an immune defence response causing a syndrome known as AGS. This leads to potentially fatal allergic reactions to red meat and many associated products including dairy products such as milk, cheese, yoghurt and butter. Gelatine is also a problem, so no treats for children since it is found in many favourite brands of candy. It is not just mammalian products that cause problems. Alpha-gal-like structures have been found in carrageenan, a seaweed-derived thickener used in some processed food, and in a number of medicines. It is feasible to genetically edit the disease-carrying capacity of ticks, state the authors. “If we are right, then today we have the obligation to research and develop the capacity to proliferate tickborne AGS and, tomorrow, carry out that proliferation,” they add. Tickborne AGS is said by these maniacs to be a “moral bioenhancer”. So who are these temple-of-learning thickos, these climate-bothering cretins who are promoting a widespread Net Zero fantasy to abolish the eating of meat? Step forward Parker Crutchfield, a professor in the Department of Medical Ethics, Humanities and Law at Western Michigan University Homer Stryker MD School of Medicine. He is also an adjunct assistant professor in the university’s philosophy department. Our second bright spark is Blake Hereth and he is an assistant professor at the university’s medical ethics school. Of course, the full force of investigative journalist techniques have been employed (Grok) to assert the paper is genuine and not some bored academic’s idea of a lark. It appears to be 100% genuine and has been published in the John Wiley publication Bioethics. Just to be sure, it can be confirmed that Western Michigan University exists, although annual in-state tuition fees of $15,000 seem a little steep if this anti-human tosh is an example of the teaching on offer. Prof Parker Crutchfield & Asst Prof Blake Hereth, Western Michigan University Homer Stryker MD School of Medicine Alpha-Gal Syndrome is a growing concern in the United States and many other parts of the world, notably Australia. According to the Centre for Disease Control, AGS is a “serious, potentially life-threatening” tickborne allergy. The CDC suggests that between 2010 and 2022 nearly 450,000 people may have been affected. The numbers appear to have been rising due to better diagnosis and an expanding range of the lone star tick. From a southern base, the tick is moving northwards and there have been reports of bites in New York and Pennsylvania. High-risk areas are centred around the Southeast and Midwest. There is currently no vaccine or treatment available, and the usual defences against insect bites such as repellent and wearing covering clothing are suggested. AGS can significantly impact the quality of life of sufferers. The allergic reaction can involve symptoms such as hives, itching, stomach pain, lowered blood pressure or, in severe cases, anaphylaxis. There have been deaths recorded due to AGS, primarily involving medical products containing alpha-gal such as cetuximab and heparin. Cetuximab is a cancer treatment drug used widely in oncology, while heparin is a life-saving blood anticoagulant that is a staple in emergency centres and hospitals around the world. There are reported to be at least 10 deaths attributed to alpha-gal reactions to medical products, with most fatalities due to anaphylactic shock. It appears that no deaths have been directly linked to AGS and red meat consumption, but with cases on the recent rise this could be due to unreported or misdiagnosed cases. AGS is a serious and growing threat but manageable as a public-health issue. That is unless these Net Zero nutters at Western Michigan are allowed to set or even influence public policy. Tyler Durden Tue, 08/12/2025 - 19:15",
    "publishedAt": "2025-08-12T23:15:00.000Z",
    "fetchedAt": "2025-08-13T02:24:52.071Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5da872bb"
  },
  {
    "id": "bloomberg-politics-1a81b45e",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "South Korea Prosecutors Arrest Ex-First Lady in Corruption Probe",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/south-korea-prosecutors-arrest-ex-first-lady-in-corruption-probe",
    "summary": "Kim Keon Hee, wife of impeached South Korean President Yoon Suk Yeol, was arrested late Tuesday in an ongoing investigation into allegations ranging from suspected stock manipulation to bribery, investigators said.",
    "fullContent": "Kim Keon Hee, wife of impeached South Korean President Yoon Suk Yeol, was arrested late Tuesday in an ongoing investigation into allegations ranging from suspected stock manipulation to bribery, investigators said.",
    "publishedAt": "2025-08-12T23:14:04.000Z",
    "fetchedAt": "2025-08-13T02:24:51.449Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1a81b45e"
  },
  {
    "id": "yahoo-finance-30fcd869",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Electric vehicle sales growth eases to 21% in July, research firm says",
    "url": "https://finance.yahoo.com/news/electric-vehicle-sales-growth-eases-230811049.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:08:11.000Z",
    "fetchedAt": "2025-08-14T09:46:37.273Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "30fcd869"
  },
  {
    "id": "marketwatch-3982d1fc",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "These Eli Lilly executives have been scooping up stock after its big drop",
    "url": "https://www.marketwatch.com/story/these-eli-lilly-executives-have-been-scooping-up-stock-after-its-big-drop-73d2b767?mod=mw_rss_topstories",
    "summary": "Eli Lilly&#x2019;s weight-loss pill disappointed in a key trial, but CEO David Ricks and other insiders together bought nearly $3 million worth of stock in the aftermath of the selloff.",
    "fullContent": "Eli Lilly&#x2019;s weight-loss pill disappointed in a key trial, but CEO David Ricks and other insiders together bought nearly $3 million worth of stock in the aftermath of the selloff.",
    "publishedAt": "2025-08-12T23:07:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.389Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3982d1fc"
  },
  {
    "id": "yahoo-finance-7ec1ce41",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Japan manufacturers' sentiment rises in August after US trade deal, but tariffs cloud outlook: Reuters poll",
    "url": "https://finance.yahoo.com/news/japan-manufacturers-sentiment-rises-august-230652981.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T23:06:52.000Z",
    "fetchedAt": "2025-08-14T09:46:37.272Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7ec1ce41"
  },
  {
    "id": "bbc-business-2258d4f8",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Give under-22s free bus passes to help them into work, MPs say",
    "url": "https://www.bbc.com/news/articles/c9877kg42wjo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "A pilot scheme for free travel at any time of day would help them get to work and education, a report says.",
    "fullContent": "A pilot scheme for free travel at any time of day would help them get to work and education, a report says.",
    "publishedAt": "2025-08-12T23:01:13.000Z",
    "fetchedAt": "2025-08-13T02:24:53.363Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2258d4f8"
  },
  {
    "id": "bbc-business-17b71850",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Free bus pass pilot could help get under-22s to work, MPs say",
    "url": "https://www.bbc.com/news/articles/c9877kg42wjo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "A pilot scheme for free travel at any time of day would help them get to work and education, a report says.",
    "fullContent": "A pilot scheme for free travel at any time of day would help them get to work and education, a report says.",
    "publishedAt": "2025-08-12T23:01:13.000Z",
    "fetchedAt": "2025-08-13T09:46:00.836Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "17b71850"
  },
  {
    "id": "bbc-business-367333ac",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Under-22s should be given free bus passes to get to work, MPs say",
    "url": "https://www.bbc.com/news/articles/c9877kg42wjo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "A pilot scheme for free travel at any time of day would help them get to work and education, a report says.",
    "fullContent": "A pilot scheme for free travel at any time of day would help them get to work and education, a report says.",
    "publishedAt": "2025-08-12T23:01:13.000Z",
    "fetchedAt": "2025-08-13T13:11:16.881Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "367333ac"
  },
  {
    "id": "bbc-business-3a09369b",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Nuclear-powered AI could make Rolls Royce UK's most valuable firm, says boss",
    "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes.",
    "fullContent": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
    "publishedAt": "2025-08-12T23:01:03.000Z",
    "fetchedAt": "2025-08-13T02:24:53.363Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3a09369b"
  },
  {
    "id": "bbc-business-7652e198",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Nuclear-powered AI could make Rolls-Royce UK's most valuable firm, says boss",
    "url": "https://www.bbc.com/news/articles/ce8772d4jzgo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes.",
    "fullContent": "Tufan Erginbilgic says business deals to supply nuclear power for artificial intelligence could boost its fortunes",
    "publishedAt": "2025-08-12T23:01:03.000Z",
    "fetchedAt": "2025-08-13T06:54:40.605Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7652e198"
  },
  {
    "id": "bbc-business-4bdcf1c1",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "The UK car industry is at a crunch point - can it be saved?",
    "url": "https://www.bbc.com/news/articles/c23p028p200o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Tariffs, Brexit, pandemic havoc... All of this caused short-term disruption - but the impact concealed a deeper problem for the UK automotive industry.",
    "fullContent": "Tariffs, Brexit, pandemic havoc... All of this caused short-term disruption - but the impact concealed a deeper problem for the UK automotive industry",
    "publishedAt": "2025-08-12T23:00:58.000Z",
    "fetchedAt": "2025-08-13T02:24:53.363Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4bdcf1c1"
  },
  {
    "id": "bbc-business-487ff7a3",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "The UK car industry is at a tipping point - can it be saved?",
    "url": "https://www.bbc.com/news/articles/c23p028p200o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Tariffs, Brexit, pandemic havoc... All of this caused short-term disruption - but the impact concealed a deeper problem for the UK automotive industry.",
    "fullContent": "Tariffs, Brexit, pandemic havoc... All of this caused short-term disruption - but the impact concealed a deeper problem for the UK automotive industry",
    "publishedAt": "2025-08-12T23:00:58.000Z",
    "fetchedAt": "2025-08-13T13:11:16.882Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "487ff7a3"
  },
  {
    "id": "bloomberg-markets-bbbba5b",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "China’s $11 Trillion Stock Market Is Staging a Steady Resurgence",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/china-s-11-trillion-stock-market-is-staging-a-quiet-resurgence",
    "summary": "Chinese stocks have gained ground in recent months despite a lack of major catalysts, with ample domestic liquidity likely to sustain the rally.",
    "fullContent": "Chinese stocks have gained ground in recent months despite a lack of major catalysts, with ample domestic liquidity likely to sustain the rally.",
    "publishedAt": "2025-08-12T23:00:00.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "bbbba5b"
  },
  {
    "id": "oil-price-2cc3c31f",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Oil Trade Caught in Trump’s Global Tariff Crossfire",
    "url": "https://oilprice.com/Energy/Crude-Oil/Oil-Trade-Caught-in-Trumps-Global-Tariff-Crossfire.html",
    "summary": "The Trump-Putin meeting this Friday and the oil trade spat with India have been hogging the headlines these days, but meanwhile, the tariff war continues—and it may end with a complete rearrangement of global supply chains. The central target, of course, is China.",
    "fullContent": "The Trump-Putin meeting this Friday and the oil trade spat with India have been hogging the headlines these days, but meanwhile, the tariff war continues—and it may end with a complete rearrangement of global supply chains. The central target, of course, is China. Amid the latest negotiations between Beijing and Washington, China faces a 30% blanket tariff on goods sold to the United States. And in a positive turn of events, the deadline for the entry of these tariffs into effect has been pushed back by 90 days. This has provided space for…",
    "publishedAt": "2025-08-12T23:00:00.000Z",
    "fetchedAt": "2025-08-13T02:24:53.149Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "2cc3c31f"
  },
  {
    "id": "bloomberg-markets-3fba996c",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "China’s $11 Trillion Stock Market Stages Steady Resurgence",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/china-s-11-trillion-stock-market-is-staging-a-quiet-resurgence",
    "summary": "Chinese stocks have gained ground in recent months despite a lack of major catalysts, with ample domestic liquidity likely to sustain the rally.",
    "fullContent": "Chinese stocks have gained ground in recent months despite a lack of major catalysts, with ample domestic liquidity likely to sustain the rally.",
    "publishedAt": "2025-08-12T23:00:00.000Z",
    "fetchedAt": "2025-08-13T04:45:41.769Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3fba996c"
  },
  {
    "id": "ft-markets-3a833b7c",
    "sourceId": "ft-markets",
    "sourceName": "Financial Times Markets",
    "title": "Shell loses legal claim against US LNG operator Venture Global",
    "url": "https://www.ft.com/content/4d4da7f5-982d-44db-8bb8-9d85dc62a3fd",
    "summary": "Energy giant among several clients claiming gas provider broke supply contracts to profit from higher prices.",
    "fullContent": "Energy giant among several clients claiming gas provider broke supply contracts to profit from higher prices",
    "publishedAt": "2025-08-12T22:58:38.000Z",
    "fetchedAt": "2025-08-13T02:24:51.815Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3a833b7c"
  },
  {
    "id": "bloomberg-markets-7fbf3199",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "B. Riley Estimates Improved Net Income for Second Quarter",
    "url": "https://www.bloomberg.com/news/articles/2025-08-12/b-riley-estimates-improved-net-income-for-second-quarter",
    "summary": "B. Riley Financial Inc. estimated it swung to a profit in the second quarter, as the firm continues its efforts to curb the financial strain caused by soured investments.",
    "fullContent": "B. Riley Financial Inc. estimated it swung to a profit in the second quarter, as the firm continues its efforts to curb the financial strain caused by soured investments.",
    "publishedAt": "2025-08-12T22:58:08.000Z",
    "fetchedAt": "2025-08-13T02:24:50.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7fbf3199"
  },
  {
    "id": "wired-4bb549f",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "AOL Will Shut Down Dial-Up Internet Access in September",
    "url": "https://www.wired.com/story/aol-shutting-down-dial-up-internet-access-in-september/",
    "summary": "The move will pinch users in rural or remote areas not yet served by broadband infrastructure or satellite internet. Around 175,000 households still use dial-up internet in the US.",
    "fullContent": "The move will pinch users in rural or remote areas not yet served by broadband infrastructure or satellite internet. Around 175,000 households still use dial-up internet in the US.",
    "publishedAt": "2025-08-12T22:55:47.000Z",
    "fetchedAt": "2025-08-13T02:24:52.831Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4bb549f"
  },
  {
    "id": "bloomberg-business-youtube-267e3fca",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Druski Kicks Off First International Tour",
    "url": "https://www.youtube.com/watch?v=KIfuU82i6Ec",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T22:53:58.000Z",
    "fetchedAt": "2025-08-13T02:25:10.666Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "267e3fca"
  },
  {
    "id": "yahoo-finance-42818eda",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures rise as Fed rate cut bets surge after inflation data",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-rise-as-fed-rate-cut-bets-surge-after-inflation-data-225124395.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-12T22:51:24.000Z",
    "fetchedAt": "2025-08-13T13:11:14.332Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "42818eda"
  },
  {
    "id": "fortune-39704c18",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Cuomo accuses Mamdani of being a &#8216;very rich person,&#8217; demands he &#8216;move out immediately&#8217; from his rent-stabilized apartment",
    "url": "https://fortune.com/2025/08/12/cuomo-mamdani-rental-apartment-rent-stabilized-new-york-city/",
    "summary": "Mamdani earns $143,000 and has said he pays $2,300 per month for a one-bedroom apartment. Cuomo is a multimillionaire who moved to an $8,000-a-month midtown apartment last year.",
    "fullContent": "Mamdani earns $143,000 and has said he pays $2,300 per month for a one-bedroom apartment. Cuomo is a multimillionaire who moved to an $8,000-a-month midtown apartment last year.",
    "publishedAt": "2025-08-12T22:51:23.000Z",
    "fetchedAt": "2025-08-13T02:24:53.325Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39704c18"
  },
  {
    "id": "the-verge-24b28078",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "The best Fitbits for your fitness and health",
    "url": "https://www.theverge.com/22982833/best-fitbit-watch-fitness-tracker",
    "summary": "In 2025, you might wonder if Fitbit is still relevant. Despite getting acquired by Google, Fitbit remains one of the most recognizable names in the industry. Fitbit trackers aren’t meant for the most hardcore of athletes, but they’re still excellent devices for tracking...",
    "fullContent": "In 2025, you might wonder if Fitbit is still relevant. Despite getting acquired by Google, Fitbit remains one of the most recognizable names in the industry. Fitbit trackers aren’t meant for the most hardcore of athletes, but they’re still excellent devices for tracking overall activity as well as monitoring certain health and wellness metrics like [&#8230;]",
    "publishedAt": "2025-08-12T22:50:45.000Z",
    "fetchedAt": "2025-08-13T02:24:52.836Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "24b28078"
  }
]