[
  {
    "id": "thehindubusinessline-7a583574",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Cars, ACs, daily-use items to cost less under proposed GST review",
    "url": "https://www.thehindubusinessline.com/economy/cars-acs-daily-use-items-to-cost-less-under-proposed-gst-review/article69944473.ece",
    "summary": "GST rationalisation expected before Deepavali, subject to Council approval.",
    "fullContent": "GST rationalisation expected before Deepavali, subject to Council approval",
    "publishedAt": "2025-08-17T16:17:24.000Z",
    "fetchedAt": "2025-08-18T02:33:33.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a583574"
  },
  {
    "id": "ndtv-profit-rss-212bbeb3",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Steel Makers Hail Commerce Ministry For Recommending Safeguard Duty On Flat Steel Imports",
    "url": "https://www.ndtvprofit.com/business/steel-makers-hail-commerce-ministry-for-recommending-safeguard-duty-on-flat-steel-imports",
    "summary": "The DGTR has recommended final imposition of a safeguard duty on imports of certain flat steel products for three years to protect domestic manufacturers from sudden jump in the inbound shipments.",
    "fullContent": "The DGTR has recommended final imposition of a safeguard duty on imports of certain flat steel products for three years to protect domestic manufacturers from sudden jump in the inbound shipments.",
    "publishedAt": "2025-08-17T16:16:53.291Z",
    "fetchedAt": "2025-08-18T02:33:35.289Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "212bbeb3"
  },
  {
    "id": "zerohedge-54bc2a57",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Israel Bombs Power Plant Near Yemeni Capital After Houthi Ballistic Missile Launch",
    "url": "https://www.zerohedge.com/geopolitical/israel-bombs-power-plant-near-yemeni-capital-after-houthi-ballistic-missile-launch",
    "summary": "Israel Bombs Power Plant Near Yemeni Capital After Houthi Ballistic Missile Launch The Israeli navy launched strikes on a key power plant near Yemen’s capital, Sanaa, on Sunday. The Israeli military claimed the facility was being used by Houthi forces but did not provide...",
    "fullContent": "Israel Bombs Power Plant Near Yemeni Capital After Houthi Ballistic Missile Launch The Israeli navy launched strikes on a key power plant near Yemen’s capital, Sanaa, on Sunday. The Israeli military claimed the facility was being used by Houthi forces but did not provide evidence. The assault comes in the wake of the latest Houthi ballistic missile attack which targeted Tel Aviv's Ben Gurion airport, but which was reportedly intercepted and caused no damage or casualties. Houthi-affiliated Al Masirah TV said the new Israeli assault caused damage to generators at the Hezyaz power station and triggered a fire, which was soon after successfully contained. Screenshot from Al Masirah TV, via France24 The Israeli military (IDF) described the attack as a response to ongoing Houthi missile and drone launches on Israel, which have persisted in parallel to IDF expanded operations inside the Gaza Strip. A Sunday statement said Israeli forces \"struck... deep inside Yemen, targeting an energy infrastructure site that served the Houthi terrorist regime\" in an area of Sanaa, with without naming the specific site. These \"strikes were conducted in response to repeated attacks\" by the Iran-allied Shia militant group. Israel has off and on for months bombed various parts of Yemen’s infrastructure, including the critical port of Hodeidah and the country’s main international airport. These Israeli operations in Yemen have stepped-up after last spring the US withdrew from active Red Sea operations. Trump essentially declared mission accomplished, announced ceasefire, and called the US Navy away from the very costly (in terms of missiles and bombs expended) and risky mission. Currently, Houthi leadership has still vowed to attack alleged Israeli-linked ships in the Red Sea and Gulf of Aden. Foreign ships bound for Israeli ports have also been put on notice. International shipping transit routes have long ago been forced to adjust, taking longer and costlier routes to avoid the Red Sea, and also to the financial detriment of Egypt and its Suez canal. Neither Israel nor the Western allies have been able to do anything about this, and some observers have expressed awe that a group of largely poor Islamist militants in sandals have been able to inflict such punishment and an effective blockade on global shipping and Israeli and Western companies. Israeli Chief of Staff: We will continue striking until Hamas is defeated, placing the issue of the hostages at the forefront of our priorities. — First Squawk (@FirstSquawk) August 17, 2025 And given that Israel is actually expanding offensive operations into southern Gaza once again, and against Gaza City, the Red Sea conflict won't wind down anytime soon. Ceasefire efforts based in Doha have clearly failed at this point. Tyler Durden Sun, 08/17/2025 - 12:15",
    "publishedAt": "2025-08-17T16:15:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.901Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "54bc2a57"
  },
  {
    "id": "ndtv-profit-rss-27dd0a39",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "US, Russia Agreed On Ukraine Security Pledges, Witkoff Says",
    "url": "https://www.ndtvprofit.com/world/us-russia-agreed-on-ukraine-security-pledges-witkoff-says",
    "summary": "It remains unclear what kind of security guarantees are being discussed with Putin, and Rubio offered less certainty about the topic than Witkoff did.",
    "fullContent": "It remains unclear what kind of security guarantees are being discussed with Putin, and Rubio offered less certainty about the topic than Witkoff did.",
    "publishedAt": "2025-08-17T16:14:31.322Z",
    "fetchedAt": "2025-08-18T02:33:35.290Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "27dd0a39"
  },
  {
    "id": "ndtv-profit-rss-1ddda8a1",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Trump Tariffs Impact: 'Not A Reason To Sell Indian Equities,' Says Jefferies' Chris Wood — Here's Why",
    "url": "https://www.ndtvprofit.com/markets/trump-tariffs-impact-not-a-reason-to-sell-indian-equities-says-jefferies-chris-wood-heres-why",
    "summary": "India is better positioned compared to the emerging markets in the context of global trade and US-China tensions, Jefferies said in a GREED & Fear note.",
    "fullContent": "India is better positioned compared to the emerging markets in the context of global trade and US-China tensions, Jefferies said in a GREED & Fear note.",
    "publishedAt": "2025-08-17T16:04:19.406Z",
    "fetchedAt": "2025-08-18T02:33:35.290Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1ddda8a1"
  },
  {
    "id": "doomsday-machines-cbcae8b",
    "sourceId": "doomsday-machines",
    "sourceName": "Doomsday Machines",
    "title": "Wasteland Wrap-up #38",
    "url": "https://doomsdaymachines.net/p/wasteland-wrap-up-38",
    "summary": "A big update about my plans for the next year",
    "fullContent": "A big update about my plans for the next year...!",
    "publishedAt": "2025-08-17T16:03:57.000Z",
    "fetchedAt": "2025-08-18T02:39:29.078Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "cbcae8b"
  },
  {
    "id": "bloomberg-politics-59a78a42",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trade Partners Grow Restless Waiting for Trump’s Tariff Breaks",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/trade-partners-grow-restless-waiting-for-trump-s-tariff-breaks",
    "summary": "UK Prime Minister Keir Starmer declared at a Jaguar Land Rover factory in May that his world-leading trade deal with President Donald Trump included a cut in US tariffs on British steel to zero.",
    "fullContent": "UK Prime Minister Keir Starmer declared at a Jaguar Land Rover factory in May that his world-leading trade deal with President Donald Trump included a cut in US tariffs on British steel to zero.",
    "publishedAt": "2025-08-17T16:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "59a78a42"
  },
  {
    "id": "ndtv-profit-rss-258f8c3d",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Trade Setup For Aug. 18: Nifty Faces Resistance At 24,660",
    "url": "https://www.ndtvprofit.com/markets/trade-setup-for-aug-18-nifty-faces-resistance-at-24660",
    "summary": "For short-term traders, 24,500 will act as a key support zone, says Amol Athawale of Kotak Securities.",
    "fullContent": "For short-term traders, 24,500 will act as a key support zone, says Amol Athawale of Kotak Securities.",
    "publishedAt": "2025-08-17T15:58:02.407Z",
    "fetchedAt": "2025-08-18T02:33:35.290Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "258f8c3d"
  },
  {
    "id": "techmeme-677f938a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "NYC-based Protege, which prepares and sells real-world datasets like lab results and sports footage for AI training, raised a $25M Series A led by Footwork (Natasha Mascarenhas/The Information)",
    "url": "http://www.techmeme.com/250817/p9#a250817p9",
    "summary": "Natasha Mascarenhas / The Information: NYC-based Protege, which prepares and sells real-world datasets like lab results and sports footage for AI training, raised a $25M Series A led by Footwork — Companies like Scale AI and Surge have proven there's a market for human-labeled...",
    "fullContent": "Natasha Mascarenhas / The Information: NYC-based Protege, which prepares and sells real-world datasets like lab results and sports footage for AI training, raised a $25M Series A led by Footwork — Companies like Scale AI and Surge have proven there's a market for human-labeled data, like professionals' answers to complex math or law questions &hellip;",
    "publishedAt": "2025-08-17T15:55:01.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "677f938a"
  },
  {
    "id": "wsj-youtube-325d84f8",
    "sourceId": "wsj-youtube",
    "sourceName": "WSJ YouTube",
    "title": "U.S. Officials Praise Alaska Summit, Say Trump Wants to ‘Promote Peace’ | WSJ News",
    "url": "https://www.youtube.com/watch?v=r5hsB4de_kY",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T15:54:25.000Z",
    "fetchedAt": "2025-08-18T02:34:03.925Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "325d84f8"
  },
  {
    "id": "thehindubusinessline-62ffa6e",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Editorial. Wrong, SIR",
    "url": "https://www.thehindubusinessline.com/opinion/editorial/wrong-sir/article69943847.ece",
    "summary": "SC interim order in Bihar SIR, a major step in guarding right to vote.",
    "fullContent": "SC interim order in Bihar SIR, a major step in guarding right to vote",
    "publishedAt": "2025-08-17T15:52:54.000Z",
    "fetchedAt": "2025-08-18T02:33:33.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62ffa6e"
  },
  {
    "id": "thehindubusinessline-552cf09b",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Below the line",
    "url": "https://www.thehindubusinessline.com/opinion/below-the-line/article69944789.ece",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T15:52:21.000Z",
    "fetchedAt": "2025-08-18T02:33:33.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "552cf09b"
  },
  {
    "id": "scmp-business-7d89b171",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong CEOs get crash course in AI to pass on skills to 5,000 students",
    "url": "https://www.scmp.com/news/hong-kong/education/article/3322154/hong-kong-ceos-get-crash-course-ai-pass-skills-5000-students?utm_source=rss_feed",
    "summary": "More than a dozen CEOs and top-level executives in Hong Kong are taking a crash course in AI with the help of a non-profit to equip them with the skills to help 5,000 secondary school students learn the essentials of the technology.",
    "fullContent": "More than a dozen CEOs and top-level executives in Hong Kong are taking a crash course in AI with the help of a non-profit to equip them with the skills to help 5,000 secondary school students learn the essentials of the technology. The CEO training on Sunday was a key component of the AI-5000 Initiative, a collaborative effort between Project Melo and Preface, a Hong Kong-based education technology company. The project garnered support from 17 top-level executives and leaders, including M+...",
    "publishedAt": "2025-08-17T15:47:41.000Z",
    "fetchedAt": "2025-08-18T02:33:35.646Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d89b171"
  },
  {
    "id": "marginal-revolution-7d0c7a7c",
    "sourceId": "marginal-revolution",
    "sourceName": "Marginal Revolution",
    "title": "Sunday assorted links",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/08/sunday-assorted-links-529.html?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=sunday-assorted-links-529",
    "summary": "1. Australia&#8217;s great stagnation. 2. Ezra Klein interviews Natasha Sarin (NYT). She is not only an excellent economist, but she avoids exaggeration, an increasingly rare trait in public discourse. 3.",
    "fullContent": "1. Australia&#8217;s great stagnation. 2. Ezra Klein interviews Natasha Sarin (NYT). She is not only an excellent economist, but she avoids exaggeration, an increasingly rare trait in public discourse. 3. &#8220;Researchers at Johns Hopkins, Stanford, and Optosurgical trained SRT-H, a dual-transformer controller that let an off-the-shelf da Vinci robot clip and cut pig gallbladders without [&#8230;] The post Sunday assorted links appeared first on Marginal REVOLUTION.",
    "publishedAt": "2025-08-17T15:45:27.000Z",
    "fetchedAt": "2025-08-18T02:33:33.892Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "7d0c7a7c"
  },
  {
    "id": "wsj-world-news-77226694",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Israelis Hold Nationwide Protests and Strike to End Gaza War",
    "url": "https://www.wsj.com/world/middle-east/israelis-hold-nationwide-protests-and-strike-to-end-the-gaza-war-db3854e7",
    "summary": "Polls show that close to 80% of Israelis support stopping the fighting in exchange for the return of hostages, but the government plans to expand it.",
    "fullContent": "Polls show that close to 80% of Israelis support stopping the fighting in exchange for the return of hostages, but the government plans to expand it.",
    "publishedAt": "2025-08-17T15:41:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.295Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "77226694"
  },
  {
    "id": "zerohedge-6c32decb",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Amid DC Takeover, Trump Eyes Crime In Other Cities - Here's What To Know",
    "url": "https://www.zerohedge.com/political/amid-dc-takeover-trump-eyes-crime-ion-other-cities-heres-what-know",
    "summary": "Amid DC Takeover, Trump Eyes Crime In Other Cities - Here's What To Know Authored by Nathan Worcester via The Epoch Times (emphasis ours), While federalizing the local police and deploying the National Guard in Washington, D.C.",
    "fullContent": "Amid DC Takeover, Trump Eyes Crime In Other Cities - Here's What To Know Authored by Nathan Worcester via The Epoch Times (emphasis ours), While federalizing the local police and deploying the National Guard in Washington, D.C., President Donald Trump has suggested he could flex his authority to fight violent crime elsewhere. President Donald Trump (C) and (L-R) Army Secretary Dan Driscoll, Secretary of the Interior Doug Burgum, Defense Secretary Pete Hegseth, Attorney General Pam Bondi, FBI director Kash Patel, and District of Columbia Attorney Jeanine Pirro during a press briefing at the White House in Washington on Aug. 11, 2025.Madalina Kilroy/The Epoch Times “We have other cities also that are bad, very bad,” the president said during an Aug. 11 press conference. He listed Chicago, New York City, Los Angeles, Oakland, and Baltimore among the cities of concern. Although homicide and other violent crimes have recently dipped across America, the numbers from big cities are still high—in some cases, higher than they were before surges one to two decades ago. Trump’s power to deploy the National Guard outside the nation’s capital is also under debate. A federal judge is deciding whether his deployment of troops to Los Angeles was lawful. Here is what you should know. The President’s Powers Trump federalized D.C.’s Metropolitan Police Department after declaring a crime emergency. He did so under Section 740 of the District of Columbia Home Rule Act, which lets him control the district’s police for up to 30 days without Congressional authorization. He wants Congress to extend that power, suggesting a national emergency declaration could be a means of sidestepping the legislature if it does not act. * * * You can support ZeroHedge with the purchase of a high-quality, sharp, ZeroHedge Multitool. Click pic... add to cart... enjoy Multitool! Satisfaction guaranteed or your money back. There is no equivalent to the D.C. Home Rule Act in the other big cities Trump named. There, state and local authorities have control over law enforcement. The National Guard is a trickier question. U.S. District Judge Charles Breyer is assessing whether Trump’s deployment of National Guard troops to Los Angeles and nearby municipalities violated the Posse Comitatus Act (PCA). Members of the National Guard patrol at Union Station in Washington on Aug. 14, 2025. Madalina Kilroy/The Epoch Times In Washington, the president has deployed the District of Columbia National Guard, which is under clear presidential control. He did so while keeping them under Title 32 duty status. That shields the president from allegations of violating the PCA. It also leaves them under local authority as they back up the police who are making arrests. Trump highlighted other possible solutions involving Congress, which is currently in its August recess. “We’ll count on the Republicans in Congress and the Senate to vote” to end no-cash bail, he said, referencing a legal reality in many cities and states that have drawn his ire. Illinois, Chicago’s home state, eliminated cash bail in 2023. Los Angeles County did so too for almost all offenses. New York State made a similar change in 2019. “Maybe they’ll self-clean up, and maybe they’ll self-do this and get rid of the cashless bail thing and all of the things that caused this problem,” Trump said. Chicago Although his local authority outside Washington may be limited, Trump has floated interventions against crime outside the capital. The Second City seems to be first in his mind. “If we need to, we’re going to do the same thing in Chicago,” he said during his Aug. 11 press conference. The Chicago Police Department recorded 573 homicides in 2024, more than any other U.S. city. That is down from 620 in 2023. Shootings and the number of shooting victims also fell, though both still numbered in the thousands. Vehicular hijackings have declined, too. There were 188 homicides during the first half of 2025, marking a 32 percent decrease from the same period in 2024. Police investigate a crime scene where three people were shot at the Wentworth Gardens housing complex in the Bridgeport neighborhood in Chicago, Ill., on June 23, 2021. Scott Olson/Getty Images Chicago’s homicide rate stood at more than 21 per 100,000 in 2024. That homicide rate, though high, has trended down from even higher rates during the 1990s. Yet, rates were lower than today during the 2000s and early 2010s, according to an analysis from the University of Chicago Crime Lab. An Illinois Policy Institute analysis found that the arrest rate for homicides has also fallen, declining from 42 percent a decade ago to 27 percent from June 2024 through June 2025. New York City “I’m going to look at New York in a little while,” Trump said. Though rates and numbers differ, New York City’s violent crime trends resemble Chicago’s. Homicides and other serious felonies have recently trended down, but, in some cases, remain higher than they were 10 or 15 years ago. In 2024, for example, there were 382 murders and non-negligible manslaughters in the Big Apple, according to city data on crime complaints. That is below a recent peak in 2021, which saw 488 such cases, and well below much higher totals decades ago, like in 2000, when there were 673 murders and non-negligible manslaughters. Yet, 2024’s figure tops the numbers for 2013 through 2019, the start of Bill de Blasio’s mayoralty. Those totals dipped as low as 292 in 2017 before surging to the recent 488-murder peak during his last year in office. New York Mayor Bill de Blasio speaks during a meeting in New York City on Aug. 3, 2021. Richard Drew/AP Photo As of Aug. 10, the New York Police Department had recorded 188 murders in 2025—down 23.6 percent from the same period in 2024. Robberies and felonious assaults were also down relative to the same period, while rape was up 21.6 percent. In 2024, there were 29,461 felonious assaults in the city, up from recent years and from troughs as low as 16,284 in 2008. Rape was also up, with 1,748 incidents that year as compared to 1,455 in 2023. Los Angeles, Baltimore, and Oakland “Hopefully L.A. is watching,” Trump said during his press conference. He also referenced another California city, Oakland, and nearby Baltimore, saying the two are “so far gone.” Federal Bureau of Investigation data show 264 homicides in Los Angeles in 2024. That’s down from 327 in 2023 as reported by the Los Angeles Police Department. In 2013, there were 251 murders in the city. Los Angeles recorded a major decline in murders during the first half of 2025. Mayor Karen Bass touted a trend that suggests numbers could hit lows in 2025 not seen in 60 years. In 2024, Oakland witnessed 81 murders and non-negligent manslaughters, according to FBI data. The city saw 120 murders in 2023 as recorded by the Oakland Police Department in its end-of-year report. Immigration protestors confront federal agents and California Army National Guardsmen in Los Angeles, on June 8, 2025. John Fredricks/The Epoch Times The 2024 figure is comparable to lows from the late 1990s and early 2000s, as recorded in an analysis from the University of California, Berkeley School of Law. During the early 1990s, Oakland regularly had more than 140 homicides. During the first half of 2025, Oakland recorded a 21 percent decline in homicides relative to the first half of 2024. Baltimore saw 201 homicides in 2024, down from 260 in 2023, according to the Baltimore Police Department. Last year’s total is on par with numbers from a decade ago. The 2024 numbers give it a homicide rate of more than 35 per 100,000, making it one of America’s deadliest large cities. Charm City’s midyear report in 2025 recorded 68 homicides, down from 88 over the same period in 2024. Tyler Durden Sun, 08/17/2025 - 11:40",
    "publishedAt": "2025-08-17T15:40:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.902Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6c32decb"
  },
  {
    "id": "economist-finance-7363965b",
    "sourceId": "economist-finance",
    "sourceName": "Economist Finance",
    "title": "Why America can’t shake off inflation",
    "url": "https://www.economist.com/finance-and-economics/2025/08/17/why-america-cant-shake-off-inflation",
    "summary": "Our measure of entrenchment suggests its problem is the rich world’s worst.",
    "fullContent": "Our measure of entrenchment suggests its problem is the rich world’s worst",
    "publishedAt": "2025-08-17T15:36:18.000Z",
    "fetchedAt": "2025-08-18T02:33:33.413Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "7363965b"
  },
  {
    "id": "thehindubusinessline-77de76e4",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "CP Radhakrishnan is NDA’s candidate for Vice President",
    "url": "https://www.thehindubusinessline.com/news/national/cp-radhakrishnan-is-ndas-candidate-for-vice-president/article69944652.ece",
    "summary": "Radhakrishnan, 67, is considered a statesman, and commands respect in all sections of society in Tamil Nadu, he stated as the decision is being seen as a major initiative to reach out to southern part of the country.",
    "fullContent": "Radhakrishnan, 67, is considered a statesman, and commands respect in all sections of society in Tamil Nadu, he stated as the decision is being seen as a major initiative to reach out to southern part of the country",
    "publishedAt": "2025-08-17T15:36:02.000Z",
    "fetchedAt": "2025-08-18T02:33:33.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "77de76e4"
  },
  {
    "id": "wsj-world-news-75fe22a9",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | A Bad Summit&#x2019;s Silver Lining",
    "url": "https://www.wsj.com/opinion/a-bad-summits-silver-lining-russia-ukraine-war-trump-putin-summit-alaska-88ee5c42",
    "summary": "Trump&#x2019;s announcement that a cease-fire won&#x2019;t precede peace talks is good&#xa0;news for Ukraine.",
    "fullContent": "Trump&#x2019;s announcement that a cease-fire won&#x2019;t precede peace talks is good&#xa0;news for Ukraine.",
    "publishedAt": "2025-08-17T15:36:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.296Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "75fe22a9"
  },
  {
    "id": "techmeme-5e3b96d4",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: Meta may debut \"Hypernova\" smart glasses with display for ~$800 in Sept.; Apple slow-walks releasing immersive video it shot around Vision Pro's debut (Mark Gurman/Bloomberg)",
    "url": "http://www.techmeme.com/250817/p8#a250817p8",
    "summary": "Mark Gurman / Bloomberg: Sources: Meta may debut \"Hypernova\" smart glasses with display for ~$800 in Sept.; Apple slow-walks releasing immersive video it shot around Vision Pro's debut — Apple has slow-walked the release of immersive video, creating a conundrum for the Vision...",
    "fullContent": "Mark Gurman / Bloomberg: Sources: Meta may debut \"Hypernova\" smart glasses with display for ~$800 in Sept.; Apple slow-walks releasing immersive video it shot around Vision Pro's debut — Apple has slow-walked the release of immersive video, creating a conundrum for the Vision Pro.",
    "publishedAt": "2025-08-17T15:35:14.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5e3b96d4"
  },
  {
    "id": "wsj-opinion-2e19288c",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Newsom&#x2019;s Map Gambit Is a Short-Term Play",
    "url": "https://www.wsj.com/opinion/newsoms-map-gambit-is-a-short-term-play-redistricting-gerrymandering-elections-7c82822b",
    "summary": "Democrats stand to lose big after 2030, especially if the Supreme Court bars racial gerrymandering.",
    "fullContent": "Democrats stand to lose big after 2030, especially if the Supreme Court bars racial gerrymandering.",
    "publishedAt": "2025-08-17T15:33:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.294Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "2e19288c"
  },
  {
    "id": "thehindubusinessline-229c33b9",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "LS special discussion on astronaut Shubhanshu Shukla",
    "url": "https://www.thehindubusinessline.com/news/national/ls-special-discussion-on-astronaut-shubhanshu-shukla/article69944505.ece",
    "summary": "Alongside discussion on Group Captain Shukla, two bills -- Jan Vishwas (Amendment of Provisions) Bill, 2025, and Indian Institutes of Management (Amendment) Bill, 2025, will also be introduced in LS on Monday.",
    "fullContent": "Alongside discussion on Group Captain Shukla, two bills -- Jan Vishwas (Amendment of Provisions) Bill, 2025, and Indian Institutes of Management (Amendment) Bill, 2025, will also be introduced in LS on Monday",
    "publishedAt": "2025-08-17T15:29:41.000Z",
    "fetchedAt": "2025-08-18T02:33:33.175Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "229c33b9"
  },
  {
    "id": "nse-online-announcements-6be4c625",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Sansera Engineering Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SANSERA_17082025151807_Transcript.pdf",
    "summary": "Sansera Engineering Limited has informed the Exchange about Transcript |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Sansera Engineering Limited has informed the Exchange about Transcript |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-17T15:18:22.000Z",
    "fetchedAt": "2025-08-17T09:50:00.160Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "6be4c625"
  },
  {
    "id": "thehindubusinessline-6796147b",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Rahul Gandhi spreading lies, an insult to Constitution: CEC Kumar",
    "url": "https://www.thehindubusinessline.com/news/rahul-gandhi-spreading-lies-an-insult-to-constitution-cec-kumar/article69944331.ece",
    "summary": "The ECI held press conference on a day when India bloc parties hit the streets with ‘Voter Adhikar Yatra’ in poll-bound Bihar.",
    "fullContent": "The ECI held press conference on a day when India bloc parties hit the streets with ‘Voter Adhikar Yatra’ in poll-bound Bihar",
    "publishedAt": "2025-08-17T15:12:12.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6796147b"
  },
  {
    "id": "fortune-57813bd5",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Putin agreed to let US, Europe offer NATO-style security protections for Ukraine, Trump envoy says",
    "url": "https://fortune.com/2025/08/17/putin-us-europe-nato-style-security-protections-ukraine-war/",
    "summary": "Rubio, who is also Trump's national security adviser, said he did not believe issuing new sanctions on Russia would force Putin to accept a ceasefire.",
    "fullContent": "Rubio, who is also Trump's national security adviser, said he did not believe issuing new sanctions on Russia would force Putin to accept a ceasefire.",
    "publishedAt": "2025-08-17T15:05:50.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "57813bd5"
  },
  {
    "id": "thehindubusinessline-385885e7",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Why India remains an important piece in the textile puzzle",
    "url": "https://www.thehindubusinessline.com/economy/why-india-remains-an-important-piece-in-the-textile-puzzle/article69943926.ece",
    "summary": "Industry leaders agree that while tariffs may sting, India’s deeper advantages, its cotton base, integrated supply chain and skilled workforce, make it a piece of the global textile puzzle that no one can afford to ignore.",
    "fullContent": "Industry leaders agree that while tariffs may sting, India’s deeper advantages, its cotton base, integrated supply chain and skilled workforce, make it a piece of the global textile puzzle that no one can afford to ignore",
    "publishedAt": "2025-08-17T15:04:52.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "385885e7"
  },
  {
    "id": "thehindubusinessline-64fe50db",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "HP to double India manufacturing under PLI 2.0, eyes 35% scale-up in coming years",
    "url": "https://www.thehindubusinessline.com/info-tech/hp-to-double-india-manufacturing-under-pli-20-eyes-35-scale-up-in-coming-years/article69944408.ece",
    "summary": "HP leads India’s PC market, aiming to double manufacturing capacity under PLI 2.0, focusing on MSMEs and tier-II cities.",
    "fullContent": "HP leads India’s PC market, aiming to double manufacturing capacity under PLI 2.0, focusing on MSMEs and tier-II cities.",
    "publishedAt": "2025-08-17T15:04:33.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "64fe50db"
  },
  {
    "id": "fortune-4ec71446",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Miles &#8216;Burt&#8217; Marshall, 73-year-old upstate New Yorker, indicted for alleged $95 million Ponzi scheme",
    "url": "https://fortune.com/2025/08/17/miles-burt-marshall-ponzi-scheme-hamilton-new-york/",
    "summary": "In the charming village of Hamilton, Marshall was friendly and folksy. He gave away gift bags with maple syrup, with cute sayings like, “Don't be a sap. For proper insurance coverage call Miles B. Marshall.\"",
    "fullContent": "In the charming village of Hamilton, Marshall was friendly and folksy. He gave away gift bags with maple syrup, with cute sayings like, “Don't be a sap. For proper insurance coverage call Miles B. Marshall.\"",
    "publishedAt": "2025-08-17T15:00:05.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ec71446"
  },
  {
    "id": "bloomberg-economics-42a2bb28",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Fed’s Bostic Gets Earful on Tariff Costs, Consumer Pain on Tour",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/fed-s-bostic-gets-earful-on-tariff-costs-consumer-pain-on-tour",
    "summary": "Raphael Bostic had two key takeaways from a recent tour through a stretch of the southeast US overseen by the Federal Reserve Bank of Atlanta — consumers are growing more stressed, and tariff costs are real.",
    "fullContent": "Raphael Bostic had two key takeaways from a recent tour through a stretch of the southeast US overseen by the Federal Reserve Bank of Atlanta — consumers are growing more stressed, and tariff costs are real.",
    "publishedAt": "2025-08-17T15:00:01.000Z",
    "fetchedAt": "2025-08-18T02:33:33.214Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "42a2bb28"
  },
  {
    "id": "oil-price-76c68983",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Kenya’s Clean Energy Drive Gains Momentum Alongside Oil Ambitions",
    "url": "https://oilprice.com/Energy/Energy-General/Kenyas-Clean-Energy-Drive-Gains-Momentum-Alongside-Oil-Ambitions.html",
    "summary": "Kenya has developed a strong renewable energy sector in recent years, as it aimed to diversify its energy mix beyond fossil fuels to boost its energy security. The launch of a national energy plan and the launch of a wide variety of renewable energy projects are expected to...",
    "fullContent": "Kenya has developed a strong renewable energy sector in recent years, as it aimed to diversify its energy mix beyond fossil fuels to boost its energy security. The launch of a national energy plan and the launch of a wide variety of renewable energy projects are expected to help achieve the country’s renewable energy aims, as the East African country also develops its oil production capacity. Kenya began exporting crude oil in small quantities in 2019 and hopes to start commercial crude exports in 2026, following several development delays.…",
    "publishedAt": "2025-08-17T15:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:35.214Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "76c68983"
  },
  {
    "id": "thehindubusinessline-6c300b95",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "House panel flags delay in audit of India’s spot crude oil purchases",
    "url": "https://www.thehindubusinessline.com/markets/commodities/house-panel-flags-delay-in-audit-of-indias-spot-crude-oil-purchases/article69943571.ece",
    "summary": "The report deals with the actions taken by the government on recommendations on the subject—Review of Policy on Import of Crude Oil.",
    "fullContent": "The report deals with the actions taken by the government on recommendations on the subject—Review of Policy on Import of Crude Oil",
    "publishedAt": "2025-08-17T14:51:46.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6c300b95"
  },
  {
    "id": "thehindubusinessline-69c51283",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "State-owned banks tweak spreads on home loans to protect margins",
    "url": "https://www.thehindubusinessline.com/money-and-banking/state-owned-banks-tweak-spreads-on-home-loans-to-protect-margins/article69944469.ece",
    "summary": "The spreads are being re-calibrated upwards by public sector banks (PSBs) as they were aggressive in pricing their home loans vis-a-vis private sector banks (PVBs)",
    "fullContent": "The spreads are being re-calibrated upwards by public sector banks (PSBs) as they were aggressive in pricing their home loans vis-a-vis private sector banks (PVBs)",
    "publishedAt": "2025-08-17T14:50:40.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "69c51283"
  },
  {
    "id": "thehindubusinessline-4824a0aa",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Goa tourism department taps new markets, plans incentives for charter flights",
    "url": "https://www.thehindubusinessline.com/economy/logistics/goa-tourism-department-taps-new-markets-plans-incentives-for-charter-flights/article69943895.ece",
    "summary": "Goa used to receive charter flights in winter from the Scandinavian countries and the tourism department is keen to welcome them again.",
    "fullContent": "Goa used to receive charter flights in winter from the Scandinavian countries and the tourism department is keen to welcome them again",
    "publishedAt": "2025-08-17T14:49:22.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4824a0aa"
  },
  {
    "id": "cnbc-markets-2ba9552d",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Top Wall Street analysts recommend these three stocks for attractive growth potential",
    "url": "https://www.cnbc.com/2025/08/17/three-stocks-for-attractive-growth-according-to-tipranks.html",
    "summary": "TipRanks' analyst ranking service discusses three stocks, including Pinterest and CoreWeave.",
    "fullContent": "TipRanks' analyst ranking service discusses three stocks, including Pinterest and CoreWeave.",
    "publishedAt": "2025-08-17T14:48:36.000Z",
    "fetchedAt": "2025-08-18T02:33:32.679Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2ba9552d"
  },
  {
    "id": "thehindubusinessline-3831885",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "DGTR recommends 3-year safeguard duty on steel imports; 12% in Yr 1, 11.5% in Yr 2 and 11% in Yr 3",
    "url": "https://www.thehindubusinessline.com/economy/dgtr-recommends-3-year-safeguard-duty-on-steel-imports-12-in-yr-1-115-in-yr-2-and-11-in-yr-3/article69943943.ece",
    "summary": "Amongst the countries impacted include China, Vietnam and Nepal, depending on the nature of the imported offering.",
    "fullContent": "Amongst the countries impacted include China, Vietnam and Nepal, depending on the nature of the imported offering",
    "publishedAt": "2025-08-17T14:39:38.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3831885"
  },
  {
    "id": "thehindubusinessline-5fb1d740",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Portfolio newsletter - August 17, 2025",
    "url": "https://www.thehindubusinessline.com/newsletter/pick-of-blportfolio/portfolio-newsletter-august-17-2025/article69944490.ece",
    "summary": "With the Trump-Putin meeting concluding without any material announcement, that external trigger for markets is now out of the picture. However, the Indian government seems to be doing all it can to rev up the economy.",
    "fullContent": "With the Trump-Putin meeting concluding without any material announcement, that external trigger for markets is now out of the picture. However, the Indian government seems to be doing all it can to rev up the economy. After pushing regulators such as SEBI and RBI to weed out unnecessary regulations and announcing big personal tax cuts in the Budget, it has now embarked on GST rate rationalisation. Details of the GST proposals are not yet out and the GST Council’s nod to these changes is awaited. But markets could take cheer next week from this Independence Day announcement.",
    "publishedAt": "2025-08-17T14:38:20.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5fb1d740"
  },
  {
    "id": "fortune-758f6fdf",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Foreign holdings of Treasuries climbed to a record high in June",
    "url": "https://fortune.com/2025/08/17/foreign-holdings-treasury-bonds-us-debt-record-high-june/",
    "summary": "Britain and Belgium saw the biggest gains in holdings, while India — currently embroiled in a trade battle with the Trump administration — and Ireland posted declines.",
    "fullContent": "Britain and Belgium saw the biggest gains in holdings, while India — currently embroiled in a trade battle with the Trump administration — and Ireland posted declines.",
    "publishedAt": "2025-08-17T14:37:24.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "758f6fdf"
  },
  {
    "id": "nse-online-announcements-4922350a",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Fusion Finance Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/CIM_64493_1514089_17082025023609_WEB.xml",
    "summary": "FUSION FINANCE LIMITED has informed the Exchange about Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent |SUBJECT: Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent.",
    "fullContent": "FUSION FINANCE LIMITED has informed the Exchange about Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent |SUBJECT: Change in Directors/ Key Managerial Personnel/ Auditor/ Compliance Officer/ Share Transfer Agent",
    "publishedAt": "2025-08-17T14:36:10.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "4922350a"
  },
  {
    "id": "jacobin-magazine-2fe3c2cf",
    "sourceId": "jacobin-magazine",
    "sourceName": "Jacobin Magazine",
    "title": "Is Cormac McCarthy “Based”?",
    "url": "https://jacobin.com/2025/08/cormac-mccarthy-conservatism-catholicism-community/",
    "summary": "If there was ever an author who screamed “the great American novelist,” it’s Cormac McCarthy. From 1965’s The Orchard Keeper to the twinned publication of The Passenger with its companion novel, Stella Maris, shortly before his death in 2023, McCarthy produced a body of work...",
    "fullContent": "If there was ever an author who screamed “the great American novelist,” it’s Cormac McCarthy. From 1965’s The Orchard Keeper to the twinned publication of The Passenger with its companion novel, Stella Maris, shortly before his death in 2023, McCarthy produced a body of work which has been seriously (and reasonably) compared with not only [&hellip;]",
    "publishedAt": "2025-08-17T14:33:57.000Z",
    "fetchedAt": "2025-08-18T02:38:11.283Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "2fe3c2cf"
  },
  {
    "id": "zerohedge-d552183",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "As Energy Costs Soar, Home Bitcoin-Mining Is Going To Heat Europe",
    "url": "https://www.zerohedge.com/markets/energy-costs-soar-home-bitcoin-mining-going-heat-europe",
    "summary": "As Energy Costs Soar, Home Bitcoin-Mining Is Going To Heat Europe Authored by Joakim Book via BitcoinMagazine.com, As energy costs soar and grids destabilize, European innovators are turning to Bitcoin mining at home as a decentralized solution — blending heat, profit and...",
    "fullContent": "As Energy Costs Soar, Home Bitcoin-Mining Is Going To Heat Europe Authored by Joakim Book via BitcoinMagazine.com, As energy costs soar and grids destabilize, European innovators are turning to Bitcoin mining at home as a decentralized solution — blending heat, profit and power independence in one sleek radiator... Maximilian Obwexer had a problem. He was heating his home in Austria with conventional heating oil, and it was expensive. A tinkerer by nature, and a former engineer having worked on hydropower plants, he was trying to find a better way to heat his home. After many rounds of experimentation and having delved down the Bitcoin (mining) rabbit hole, three years ago he founded a company devoted to the effort. His company, 21energy, makes well-balanced, sturdy, and incredibly beautiful (and incredibly quiet!) miners for home use. The early models of Ofen 1 boasted up to 10 TH/s, while the premium model could reach, at top speed and making plenty of noise, 40 TH/s. Having scaled up production, hiring 12 new employees only this year and launching the new Ofen 2 (35-42 TH/s), the Bitcoin heater comes in the style of a conventional radiator — powered by Bitcoin. And yes, you can solo mine with this bitcoin heater… or join whichever pool you think is best. “Bitcoin heaters are decentralized grid balancing — at home!” he proclaimed on stage in Helsinki on Friday before hundreds of curious faces in the audience at the inaugural Nordic Bitcoin conference BTCHel. Refreshingly, he spent most of his presentation not selling his excellent products or explaining his story in bitcoin, but on the many troubles afflicting the European grid. Europeans are beholden to foreigners for importing energy. Its current electricity producers — legacy coal, gas and hydro — are increasingly asked to turn off their supply to the grid, in favor of the ever-more present wind turbines and solar panels. Fossil-fuel-based generation produces CO2 emissions as well as particles in the immediate environment, but its proposed replacements push dynamic and uncontrollable electricity generation onto the grid. At peak supply, even renewable energy providers are asked by grid management to curtail or wind down production; there is simply nobody to take the excess electricity, nowhere to put it This is obviously bad in that it wastes potential electricity that could have been used, but even worse is that it makes the investment calculations for renewable energy investors worse. Not unrelated, households in Europe pay exorbitant rates for their electricity… and on top of that, heating in general is quite expensive. When you put all of those aspects together, it’s like the old world is screaming out for Bitcoin mining. Obwexer agrees, “It’s a no-brainer — even if you don’t like or understand Bitcoin,” he tells me, standing next to his shiny green booth and radiators keeping the Expo hall in Helsinki real toasty. Indeed, a large portion of his client base are “solar guys” — devoted climate change activists wanting to do something hands-on to de-fossilize their own energy use. While it’s not exactly the first group you think about being interested in Bitcoin, “The economics just make sense,” Obwexer tells me. In a recent podcast interview with Knut Svanholm and Luke de Wolf, two of the co-organizers of BTCHel, Obwexer remarked that “Finland is really at the forefront of bitcoin heating and bitcoin district heating”: “Europe needs Bitcoin mining so badly, with the high volatility in the electricity grids… we don’t have to fear the politicians too much, because… they already wrote it down — they just don’t see that they wrote Bitcoin mining everywhere.” On stage in Helsinki, he showed one of the most important graphs in the entire economics and energy debate, which underlines precisely how crucial energy is for the well-being and flourishing of a society. “If you want a clean, rich, healthy society you need a lot of power.” via: Todd Moss, Eat More Electrons Up next for Obwexer and his team at 21energy is contributing to flexible load shedding on a grid level. Putting mobile miners in a truck and take production pressure off, e.g., hydro plants, is a perfect use case for Bitcoin mining: Instead of being asked to ramp down production because of an overloaded grid, they can divert the electricity stemming from their water flow to Bitcoin miners — which also changes their response time from minutes to seconds. Meet 21energy next week at #BTCHEL – the First Large-Scale Bitcoin Conference in the Nordics! ⚡ 📍 Join us at our booth and meet our team 🔥 Learn how we transform electricity into warmth & Bitcoin 🎤 Don’t miss talks from Harald, Maximilian & Lukas on Bitcoin mining,… pic.twitter.com/juBRMGWvWh — 21energy (@21energy_com) August 7, 2025 In general, using purpose-built or rebuilt Bitcoin miners for heating your home is the most obvious way to decentralize mining — especially since home miners are much less susceptible to the cutthroat economics of Bitcoin mining that, e.g., large mining farms are. While solving several real-world energy problems at once, Obwexer and his team at 21energy are doing precisely that — “From Tyrol to the World.” “I am super bullish on Bitcoin mining in Europe,” Obwexer concluded. Tyler Durden Sun, 08/17/2025 - 10:30",
    "publishedAt": "2025-08-17T14:30:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.902Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "d552183"
  },
  {
    "id": "fortune-462f86e",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Airbus is about to eclipse a record that Boeing held for decades",
    "url": "https://fortune.com/2025/08/17/airbus-a320-top-selling-commercial-jet-record-boeing-737/",
    "summary": "The A320 series is poised to overtake its US competitor as the most-delivered commercial airliner in history.",
    "fullContent": "The A320 series is poised to overtake its US competitor as the most-delivered commercial airliner in history.",
    "publishedAt": "2025-08-17T14:28:33.000Z",
    "fetchedAt": "2025-08-18T02:33:35.391Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "462f86e"
  },
  {
    "id": "scmp-business-70ca0050",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Cristiano Ronaldo surprises fans with museum visit in Hong Kong’s Tsim Sha Tsui",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3322149/cristiano-ronaldo-surprises-fans-museum-visit-hong-kongs-tsim-sha-tsui?utm_source=rss_feed",
    "summary": "Cristiano Ronaldo has made a surprise appearance at a museum in Tsim Sha Tsui dedicated to honouring his career during his visit to Hong Kong for the Saudi Super Cup, with fans waiting for hours outside the venue to catch a glimpse of the football legend.",
    "fullContent": "Cristiano Ronaldo has made a surprise appearance at a museum in Tsim Sha Tsui dedicated to honouring his career during his visit to Hong Kong for the Saudi Super Cup, with fans waiting for hours outside the venue to catch a glimpse of the football legend. A Post reporter saw Ronaldo arriving at the CR7 Life Museum in the K11 Musea shopping centre at 8.30pm on Sunday, with fans crowding the entrance and cheering as they spotted him touring the venue. The star player briefly stepped out and...",
    "publishedAt": "2025-08-17T14:25:08.000Z",
    "fetchedAt": "2025-08-18T02:33:35.646Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "70ca0050"
  },
  {
    "id": "nse-online-announcements-121d28a1",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Fusion Finance Limited",
    "url": "https://nsearchives.nseindia.com/corporate/FUSIONHO_17082025142330_STX_Intimation_ESOP_Grant.pdf",
    "summary": "Fusion Finance Limited has informed the Exchange about ESOP Grant |SUBJECT: General Updates.",
    "fullContent": "Fusion Finance Limited has informed the Exchange about ESOP Grant |SUBJECT: General Updates",
    "publishedAt": "2025-08-17T14:24:02.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "121d28a1"
  },
  {
    "id": "techmeme-5685b7a7",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "A look at the \"Palantir Mafia\", a group of Palantir alumni who have started or are leading 350+ tech companies, including at least a dozen valued at $1B+ (Angel Au-Yeung/Wall Street Journal)",
    "url": "http://www.techmeme.com/250817/p7#a250817p7",
    "summary": "Angel Au-Yeung / Wall Street Journal: A look at the \"Palantir Mafia\", a group of Palantir alumni who have started or are leading 350+ tech companies, including at least a dozen valued at $1B+ — The network connects founders and venture capitalists with 'Palantir Pals' and a...",
    "fullContent": "Angel Au-Yeung / Wall Street Journal: A look at the \"Palantir Mafia\", a group of Palantir alumni who have started or are leading 350+ tech companies, including at least a dozen valued at $1B+ — The network connects founders and venture capitalists with 'Palantir Pals' and a Russian River camping trip",
    "publishedAt": "2025-08-17T14:20:11.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "5685b7a7"
  },
  {
    "id": "bloomberg-business-youtube-76d08ccd",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "The New American Dream of Renting a Home",
    "url": "https://www.youtube.com/watch?v=2Wnsi7KXun0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T14:14:05.000Z",
    "fetchedAt": "2025-08-18T02:33:45.089Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "76d08ccd"
  },
  {
    "id": "nse-online-announcements-48a7003c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Fusion Finance Limited",
    "url": "https://nsearchives.nseindia.com/corporate/FUSIONHO_17082025141013_OutcomeCIMUpload.pdf",
    "summary": "Fusion Finance Limited has informed the Exchange about change in Management |SUBJECT: Change in Management.",
    "fullContent": "Fusion Finance Limited has informed the Exchange about change in Management |SUBJECT: Change in Management",
    "publishedAt": "2025-08-17T14:10:28.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "48a7003c"
  },
  {
    "id": "nse-online-announcements-2371f2d5",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Fusion Finance Limited",
    "url": "https://nsearchives.nseindia.com/corporate/FUSIONHO_17082025140833_OutcomeCIMUpload.pdf",
    "summary": "Fusion Finance Limited has informed the Exchange about Change in Company Secretary/Compliance Officer |SUBJECT: Change in Company Secretary/Compliance Officer.",
    "fullContent": "Fusion Finance Limited has informed the Exchange about Change in Company Secretary/Compliance Officer |SUBJECT: Change in Company Secretary/Compliance Officer",
    "publishedAt": "2025-08-17T14:08:45.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "2371f2d5"
  },
  {
    "id": "nse-online-announcements-f4d415e",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Fusion Finance Limited",
    "url": "https://nsearchives.nseindia.com/corporate/FUSIONHO_17082025140633_OutcomeCIMUpload.pdf",
    "summary": "",
    "fullContent": "Outcome |SUBJECT: Outcome of Board Meeting",
    "publishedAt": "2025-08-17T14:06:53.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "f4d415e"
  },
  {
    "id": "bloomberg-markets-1e0c1a94",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "The New American Dream of Renting a Home",
    "url": "https://www.bloomberg.com/news/videos/2025-08-17/the-new-american-dream-of-renting-a-home-video",
    "summary": "American home ownership rates are rapidly declining, and small home investors see opportunity where institutional investors and individual home owners are stepping back. They are creating communities of home renters to meet the demand for housing, but in places like Las Vegas,...",
    "fullContent": "American home ownership rates are rapidly declining, and small home investors see opportunity where institutional investors and individual home owners are stepping back. They are creating communities of home renters to meet the demand for housing, but in places like Las Vegas, it might be putting the American dream of homeownership out of reach for most residents. (Source: Bloomberg)",
    "publishedAt": "2025-08-17T14:04:46.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e0c1a94"
  },
  {
    "id": "cnbc-markets-209e84bf",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "I'm a psychologist who studies couples: People in the happiest relationships talk about 5 things every day—that most neglect",
    "url": "https://www.cnbc.com/2025/08/17/psychologist-people-in-the-happiest-relationships-talk-about-5-things-every-day.html",
    "summary": "The happiest couples don't wait for the \"perfect\" time to communicate. Mark Travers, a psychologist who studies couples, shares what people in successful relationships talk about every day — that most never bother to mention.",
    "fullContent": "The happiest couples don't wait for the \"perfect\" time to communicate. Mark Travers, a psychologist who studies couples, shares what people in successful relationships talk about every day — that most never bother to mention.",
    "publishedAt": "2025-08-17T14:01:04.000Z",
    "fetchedAt": "2025-08-18T02:33:32.679Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "209e84bf"
  },
  {
    "id": "bloomberg-markets-1df40f33",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Bond Market’s Rate-Cut Bets Enter Decisive Stretch With Powell",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/bond-market-s-rate-cut-bets-enter-decisive-stretch-with-powell",
    "summary": "Bond traders’ big bet that the Federal Reserve is poised to lower interest rates faces a key moment this week as Chair Jerome Powell gets a chance to weigh in on the economy.",
    "fullContent": "Bond traders’ big bet that the Federal Reserve is poised to lower interest rates faces a key moment this week as Chair Jerome Powell gets a chance to weigh in on the economy.",
    "publishedAt": "2025-08-17T14:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:32.696Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1df40f33"
  },
  {
    "id": "bloomberg-politics-1a3e2260",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Midterm Fight Over Trump Bill, Tariffs Starts Early at Iowa Fair",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/midterm-fight-over-trump-bill-tariffs-starts-early-at-iowa-fair",
    "summary": "Republican Representative Zach Nunn is making an Iowa State Fair video about President Donald Trump’s tax law, shot on a John Deere tractor under the blazing August sun.",
    "fullContent": "Republican Representative Zach Nunn is making an Iowa State Fair video about President Donald Trump’s tax law, shot on a John Deere tractor under the blazing August sun.",
    "publishedAt": "2025-08-17T14:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1a3e2260"
  },
  {
    "id": "thehindubusinessline-3e8d37a9",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "No deal is better than a bad deal",
    "url": "https://www.thehindubusinessline.com/opinion/no-deal-is-better-than-a-bad-deal/article69944290.ece",
    "summary": "Despite the hype and atmospherics, the Trump-Putin meeting didn’t achieve much.",
    "fullContent": "Despite the hype and atmospherics, the Trump-Putin meeting didn’t achieve much",
    "publishedAt": "2025-08-17T13:57:10.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3e8d37a9"
  },
  {
    "id": "zerohedge-17782b69",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "'Hilarious': White House Mocks NPR Over Alaska Summit 'Security Breach' Story",
    "url": "https://www.zerohedge.com/geopolitical/hilarious-white-house-mocks-npr-over-alaska-summit-security-breach-story",
    "summary": "'Hilarious': White House Mocks NPR Over Alaska Summit 'Security Breach' Story The White House on Saturday dismissed and mocked a report by National Public Radio (NPR) that claimed US government documents containing sensitive and secretive details about President Trump’s summit...",
    "fullContent": "'Hilarious': White House Mocks NPR Over Alaska Summit 'Security Breach' Story The White House on Saturday dismissed and mocked a report by National Public Radio (NPR) that claimed US government documents containing sensitive and secretive details about President Trump’s summit with Russian President Putin were found in an Alaskan hotel. The NPR story began, \"Papers with U.S. State Department markings, found Friday morning in the business center of an Alaskan hotel, revealed previously undisclosed and potentially sensitive details about the Aug. 15 meetings between President Donald Trump and Russian President Vladimir V. Putin in Anchorage.\" Shutterstock It continued, \"Eight pages, that appear to have been produced by U.S. staff and left behind accidentally, shared precise locations and meeting times of the summit and phone numbers of U.S. government employee.\" But White House deputy press secretary Anna Kelly has rejected that there's anything relevant here, going so far as to call out NPR for exaggerating its significance. She characterized the documents as nothing more than a \"multi-page lunch menu\" and blasted NPR for sensationalizing the discovery. “It’s hilarious that NPR is publishing a multi-page lunch menu and calling it a ‘security breach,’” Kelly told ABC News. She said: “This kind of so-called ‘investigative journalism’ is exactly why people don’t take them seriously anymore - and why they’re no longer taxpayer-funded thanks to President Trump.” NPR in its report observed that the documents went so far as to provide phonetic guides for Russian names, such as \"Mr. President POO-tihn.\" The report further cited 'experts' who alleged this shows carelessness and lack of proper security protocols in handling sensitive documents involving top level meetings with the US president and world leaders. A lunch menu and scheduling... pundits are framing this as some major scandal and breach... Interesting timetable and lunch menu. #AlaskaFiasco Government papers found in an Alaskan hotel reveal new details of Trump-Putin summit https://t.co/UDnCXJXcid pic.twitter.com/OwFSV8bpKj — @RGBAtlantica (@RGBAtlantica) August 16, 2025 Still, the NPR story didn't make much of a splash, given the avalanche of other, much more important headlines which came out of the 'constructive' Alaska summit. The mainstream US press has tended to present the historic summit with a perspective that Trump is somehow being 'compromised' by Russia's Putin - though there's zero evidence that this is the case. Tyler Durden Sun, 08/17/2025 - 09:55",
    "publishedAt": "2025-08-17T13:55:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.902Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "17782b69"
  },
  {
    "id": "bloomberg-politics-701518c9",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Singapore Prioritizes Jobs Amid Fragmenting World, Rise of AI",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/singapore-prioritizes-jobs-amid-fragmenting-world-rise-of-ai",
    "summary": "Singapore’s Prime Minister Lawrence Wong said jobs for citizens will be the government’s top priority as the city-state faces risks from rising global trade barriers and artificial intelligence.",
    "fullContent": "Singapore’s Prime Minister Lawrence Wong said jobs for citizens will be the government’s top priority as the city-state faces risks from rising global trade barriers and artificial intelligence.",
    "publishedAt": "2025-08-17T13:50:14.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "701518c9"
  },
  {
    "id": "cnbc-markets-7051bf3a",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "$20K pay cuts, lower titles, odd jobs: Workers are making big trade-offs to find meaningful work in today's job market",
    "url": "https://www.cnbc.com/2025/08/17/finding-a-meaningful-job-is-an-elusive-luxury-to-todays-job-seekers.html",
    "summary": "A majority of people say they want to do meaningful work in their jobs. It's proving to be a luxury not everyone can afford.",
    "fullContent": "A majority of people say they want to do meaningful work in their jobs. It's proving to be a luxury not everyone can afford.",
    "publishedAt": "2025-08-17T13:30:01.000Z",
    "fetchedAt": "2025-08-18T02:33:32.679Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7051bf3a"
  },
  {
    "id": "thehindubusinessline-1bb13497",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "STEM scheme for girls expands to 80,000 beneficiaries but uneven reach persist",
    "url": "https://www.thehindubusinessline.com/data-stories/stem-scheme-for-girls-expands-to-80000-beneficiaries-but-uneven-reach-persist/article69943730.ece",
    "summary": "Vigyan Jyoti programme encourages meritorious girls to pursue STEM education and careers through hands-on learning, role model interactions, lab visits, and career guidance.",
    "fullContent": "Vigyan Jyoti programme encourages meritorious girls to pursue STEM education and careers through hands-on learning, role model interactions, lab visits, and career guidance",
    "publishedAt": "2025-08-17T13:29:24.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1bb13497"
  },
  {
    "id": "the-verge-21376e88",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Why the former editor of Polygon is making a podcast for old gamers",
    "url": "https://www.theverge.com/games/760244/chris-plante-post-games-podcast-old-gamers-polygon",
    "summary": "In a recent episode of Post Games, host Chris Plante explores how video games can help players understand death. He's interviewing Kaitlin Tremblay, who is working on Ambrosia Sky, a game about death. \"What is it about games that is so useful for exploring the topic?",
    "fullContent": "In a recent episode of Post Games, host Chris Plante explores how video games can help players understand death. He's interviewing Kaitlin Tremblay, who is working on Ambrosia Sky, a game about death. \"What is it about games that is so useful for exploring the topic?\" Plante asks. \"I think there's something really lovely about [&#8230;]",
    "publishedAt": "2025-08-17T13:28:34.000Z",
    "fetchedAt": "2025-08-18T02:33:34.837Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "21376e88"
  },
  {
    "id": "business-insider-4f4288ae",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "35 of the most beautiful beaches across the US",
    "url": "https://www.businessinsider.com/most-beautiful-beaches-in-the-us",
    "summary": "If you're looking for the perfect summer getaway, check out these seaside spots, from Kiawah Island in South Carolina to Kā'anapali Beach in Hawaii.",
    "fullContent": "If you're looking for the perfect summer getaway, check out these seaside spots, from Kiawah Island in South Carolina to Kā'anapali Beach in Hawaii.",
    "publishedAt": "2025-08-17T13:24:01.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4f4288ae"
  },
  {
    "id": "zerohedge-2856909a",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Is The EU Preparing For Regime-Change In Hungary?",
    "url": "https://www.zerohedge.com/geopolitical/eu-preparing-regime-change-hungary",
    "summary": "Is The EU Preparing For Regime-Change In Hungary? Authored by Lucas Leiroz de Almeida via GlobalResearch.ca, Apparently, the EU is planning to further tighten its interventionist measures in the internal affairs of member countries.",
    "fullContent": "Is The EU Preparing For Regime-Change In Hungary? Authored by Lucas Leiroz de Almeida via GlobalResearch.ca, Apparently, the EU is planning to further tighten its interventionist measures in the internal affairs of member countries. According to information recently shared by Russian authorities, European political elites are planning a regime change in Hungary – a country that has stood out for leading a dissident position within the European bloc. This case is particularly serious because it highlights the absolute lack of political freedom for EU member states. The Russian Foreign Intelligence Service (SVR) revealed that it has information proving that EU authorities are planning a color revolution in Hungary. The goal is to remove Viktor Orban and his allies from power and replace them with a public figure more aligned with the interests of the Collective West – particularly regarding the Ukrainian conflict and sanctions against Russia. According to the SVR, the European Commission considers the current Hungarian government’s foreign policy to be too independent – that is, not integrated with the EU’s international guidelines. For this reason, a regime change would be the only way to realign Hungarian national interests with the European bloc’s foreign policy objectives. In this regard, a Russian security agency clearly states that European Commission President Ursula von der Leyen “is seriously studying regime change scenarios” in Hungary. One of von der Leyen’s plans would allegedly be to bring to power Peter Magyar, leader of the Tisza Party and one of Orban’s most vocal opponents. The SVR describes Magyar as “loyal to globalist elites,” which is why he is considered to become the next prime minister if the plan to oust Orban is successful. The EU initially plans to finalize this plan during next year’s parliamentary elections; however, the SVR believes that, if circumstances favor it, the EU could begin acting this year, advancing its regime change plans. In addition to trying to bring Hungary into the coalition supporting Ukraine and force it to implement sanctions against Moscow, one of the goals of the regime change operation is to eliminate Hungarian opposition to Ukraine’s accession to the EU. Currently, Orban is leading the opposition to the Kiev regime’s accession to the bloc, which is infuriating both the European Commission and the neo-Nazi proxy regime in Kiev. Further complicating Ukraine’s accession plan, Orban’s Hungary is fully supported by Slovakia’s Robert Fico. Both leaders coordinate a dissident wing within the EU, endorsing pacifist positions such as ending military support for Ukraine and sanctions against Moscow. Meanwhile, Poland has also begun to oppose Ukrainian accession to the EU. Despite strongly supporting the Kiev regime in the war, Poland is dissatisfied with the neighboring country’s Nazi-rehabilitating policies, which is why it is now against the Ukrainian accession. The European Commission hopes to dismantle this dissident coalition upon replacing Orban, carrying out a kind of “decapitation operation” against European dissent. It is important to remember that one of the reasons Hungary opposes Ukrainian accession is the regime’s persecution of ethnic Hungarians within its territory. In the Hungarian-majority region of Transcarpathia, ethnic persecution policies are becoming commonplace, a situation quite similar to that of the ethnic Russian population of Donbass. This clearly makes Orban unsympathetic to the Ukrainian regime, with his opposition to Ukrainian accession to the EU being not merely a matter of political pragmatism, but also of patriotic principles and solidarity with the Hungarian people abroad. All of Hungary’s legitimate concerns are ignored by European authorities, who continue to act motivated by Russophobic madness. The EU has implemented no measures to pressure Ukraine to change its treatment of the Hungarians of Transcarpathia, tacitly legitimizing ethnic persecution—just as it has done against the Russians for over a decade. The European bloc is only interested in irrational condemnation of Russia and unconditional support for Kiev. The SVR claims that preparatory measures are already being taken. The agency states that “significant administrative, media, and lobbying resources are being deployed to support Magyar through German party funds, the European People’s Party, and a number of Norwegian NGOs.” Foreign agents are expected to foment mass protests and other forms of social unrest against Orban’s legitimate government, attempting to create social instability to facilitate regime change. In fact, knowing this information in advance, it’s possible that the Hungarian government will immediately begin implementing measures to prevent the success of the foreign operation. Thanks to the work of Russian intelligence, Orban’s Hungary now has the necessary means to protect itself from the interference promoted by an international organization of which Hungary itself is a member. This only shows how politically bankrupt the EU is, becoming a mere instrument of foreign meddling—even against its own members. Tyler Durden Sun, 08/17/2025 - 09:20",
    "publishedAt": "2025-08-17T13:20:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.903Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2856909a"
  },
  {
    "id": "thehindubusinessline-26e07326",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Planning to make India a global steel hub; new export markets tapped: HD Kumaraswamy",
    "url": "https://www.thehindubusinessline.com/economy/planning-to-make-india-a-global-steel-hub-new-export-markets-tapped-hd-kumaraswamy/article69943763.ece",
    "summary": "PLI reforms will strengthen competitiveness and drive India’s steel leadership, says HD Kumaraswamy.",
    "fullContent": "PLI reforms will strengthen competitiveness and drive India’s steel leadership, says HD Kumaraswamy",
    "publishedAt": "2025-08-17T13:19:23.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "26e07326"
  },
  {
    "id": "bloomberg-politics-4c1b4ca8",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Singapore Targets Vaping With Stiffer Penalties, Jail Time",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/singapore-plans-stiffer-penalties-jail-time-for-vaping-offenses",
    "summary": "Singapore will introduce stiffer penalties for vaping offenses, including possible jail time for “severe” violations, Prime Minister Lawrence Wong announced on Sunday.",
    "fullContent": "Singapore will introduce stiffer penalties for vaping offenses, including possible jail time for “severe” violations, Prime Minister Lawrence Wong announced on Sunday.",
    "publishedAt": "2025-08-17T13:18:23.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4c1b4ca8"
  },
  {
    "id": "nse-online-announcements-9646746",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Bharat Petroleum Corporation Limited",
    "url": "https://nsearchives.nseindia.com/corporate/BPCL_17082025131028_analystmeet17825s.pdf",
    "summary": "Bharat Petroleum Corporation Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Bharat Petroleum Corporation Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-17T13:11:08.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "9646746"
  },
  {
    "id": "business-insider-6b7b546a",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "My brother didn't give me a plus-one for his wedding. I was upset at first, but I'm actually so relieved I went alone.",
    "url": "https://www.businessinsider.com/didnt-get-plus-one-going-alone-to-wedding-better-2025-8",
    "summary": "Looking back, I'm glad I didn't get a plus one for my brother's wedding. Going alone had a lot of benefits, and my date could've ruined the big day.",
    "fullContent": "Looking back, I'm glad I didn't get a plus one for my brother's wedding. Going alone had a lot of benefits, and my date could've ruined the big day.",
    "publishedAt": "2025-08-17T13:07:02.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6b7b546a"
  },
  {
    "id": "cnbc-markets-49efa5f1",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Dad of 11-year-old college graduate shares his No. 1 non-negotiable parenting rule: ‘She comes before everything’",
    "url": "https://www.cnbc.com/2025/08/17/dad-of-young-college-graduate-my-top-non-negotiable-parenting-rule.html",
    "summary": "Alisa Perales, 11, has two associate degrees and is headed to UC Riverside to study computer science. Her father Rafael, a single dad, shares how.",
    "fullContent": "Alisa Perales, 11, has two associate degrees and is headed to UC Riverside to study computer science. Her father Rafael, a single dad, shares how.",
    "publishedAt": "2025-08-17T13:05:01.000Z",
    "fetchedAt": "2025-08-18T02:33:32.679Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49efa5f1"
  },
  {
    "id": "bloomberg-politics-1697fe77",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Anti-War Protests Erupt in Israel Ahead of Gaza City Operation",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/netanyahu-slams-anti-war-protests-as-gaza-city-conquest-looms",
    "summary": "Hundreds of thousands of Israelis took to the streets on Sunday to protest Prime Minister Benjamin Netanyahu’s plan to expand operations in the Gaza Strip, rather than attempt to negotiate an end to the war under which Hamas would free its last hostages.",
    "fullContent": "Hundreds of thousands of Israelis took to the streets on Sunday to protest Prime Minister Benjamin Netanyahu’s plan to expand operations in the Gaza Strip, rather than attempt to negotiate an end to the war under which Hamas would free its last hostages.",
    "publishedAt": "2025-08-17T13:04:18.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1697fe77"
  },
  {
    "id": "thehindubusinessline-1a695289",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Customers file highest complaints against SBI in FY25, Axis Bank tops private bank list",
    "url": "https://www.thehindubusinessline.com/money-and-banking/customers-file-highest-complaints-against-sbi-in-fy25-axis-bank-tops-private-bank-list/article69943951.ece",
    "summary": "ICICI Bank saw a total of 5.34 lakh customer complaints related to delay in delivery of essential services in FY25, of which 45,151 were pending resolution as on March end.",
    "fullContent": "ICICI Bank saw a total of 5.34 lakh customer complaints related to delay in delivery of essential services in FY25, of which 45,151 were pending resolution as on March end",
    "publishedAt": "2025-08-17T13:04:12.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1a695289"
  },
  {
    "id": "bloomberg-politics-35c9a554",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "US, Russia Agreed on Ukraine Security Pledges, Witkoff Says",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/rubio-says-ukraine-ceasefire-still-on-table-as-trump-seeks-deal",
    "summary": "Donald Trump and Vladimir Putin agreed at their summit in Alaska last week that the US would be able to offer security guarantees to Ukraine, according to Steve Witkoff, Trump’s special envoy, even as many details of Friday’s meeting remain unclear.",
    "fullContent": "Donald Trump and Vladimir Putin agreed at their summit in Alaska last week that the US would be able to offer security guarantees to Ukraine, according to Steve Witkoff, Trump’s special envoy, even as many details of Friday’s meeting remain unclear.",
    "publishedAt": "2025-08-17T13:00:04.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "35c9a554"
  },
  {
    "id": "bloomberg-markets-794cc035",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Boom in Bespoke ETFs Drives Growth of Niche ‘A-La-Carte’ Options",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/boom-in-bespoke-etfs-drives-growth-of-niche-a-la-carte-options",
    "summary": "When Matt Kaufman needs to include options in Calamos Investments’ defined-outcome ETFs, he turns to a type of bespoke equity derivative that lets him — rather than an exchange — set the terms of the contract.",
    "fullContent": "When Matt Kaufman needs to include options in Calamos Investments’ defined-outcome ETFs, he turns to a type of bespoke equity derivative that lets him — rather than an exchange — set the terms of the contract.",
    "publishedAt": "2025-08-17T13:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "794cc035"
  },
  {
    "id": "wired-50224db1",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "These 5 Posture Corrector Picks Will Straighten You Out (2025)",
    "url": "https://www.wired.com/gallery/posture-correctors/",
    "summary": "You’re hunched over your desk and phone for hours. We rounded up gadgets, a DIY trick, and even some yoga advice to help you straighten up.",
    "fullContent": "You’re hunched over your desk and phone for hours. We rounded up gadgets, a DIY trick, and even some yoga advice to help you straighten up.",
    "publishedAt": "2025-08-17T13:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:34.950Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "50224db1"
  },
  {
    "id": "jacobin-magazine-36202264",
    "sourceId": "jacobin-magazine",
    "sourceName": "Jacobin Magazine",
    "title": "Cloud is a Techno-Thriller for the Age of Online Hustle Culture",
    "url": "https://jacobin.com/2025/08/cloud-kurosawa-japan-internet-thriller-review/",
    "summary": "In his 2001 horror classic Pulse, Kiyoshi Kurosawa portrays the internet as a space of dark enchantment, a portal for evil spirits to invade the world of the living. Cloud, a new thriller which sees Kurosawa return to the subject twenty-four years later, contends with a vastly...",
    "fullContent": "In his 2001 horror classic Pulse, Kiyoshi Kurosawa portrays the internet as a space of dark enchantment, a portal for evil spirits to invade the world of the living. Cloud, a new thriller which sees Kurosawa return to the subject twenty-four years later, contends with a vastly different online environment: whatever enchantment existed on the [&hellip;]",
    "publishedAt": "2025-08-17T12:55:45.000Z",
    "fetchedAt": "2025-08-18T02:38:11.283Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "36202264"
  },
  {
    "id": "nse-online-announcements-21e57bf1",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Brightcom Group Limited",
    "url": "https://nsearchives.nseindia.com/corporate/BCG_17082025124742_BCG_14082025225554_BOARDMEETINGOUTCOME14AUG25.pdf",
    "summary": "Brightcom Group Limited has submitted to the Exchange, the financial results for the period ended Jun 30, 2025. |SUBJECT: Outcome of Board Meeting.",
    "fullContent": "Brightcom Group Limited has submitted to the Exchange, the financial results for the period ended Jun 30, 2025. |SUBJECT: Outcome of Board Meeting",
    "publishedAt": "2025-08-17T12:50:23.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "21e57bf1"
  },
  {
    "id": "nse-online-announcements-10a5efcf",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Radiant Cash Management Services Limited",
    "url": "https://nsearchives.nseindia.com/corporate/RADIANTCASH_17082025124903_RADIANTCMSAGMandRecordDateIntimationSD.pdf",
    "summary": "Radiant Cash Management Services Limited has informed the Exchange that Record date for the purpose of Dividend is 02-Sep-2025. |SUBJECT: Record Date.",
    "fullContent": "Radiant Cash Management Services Limited has informed the Exchange that Record date for the purpose of Dividend is 02-Sep-2025. |SUBJECT: Record Date",
    "publishedAt": "2025-08-17T12:49:46.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "10a5efcf"
  },
  {
    "id": "zerohedge-1d3c662c",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "UK Authorities Deploy Undercover Police To Catch Men Who \"Catcall\"",
    "url": "https://www.zerohedge.com/political/uk-government-deploys-undercover-police-catch-men-who-catcall",
    "summary": "UK Authorities Deploy Undercover Police To Catch Men Who \"Catcall\" The political war on men and masculinity continues to escalate. A long running feminist propaganda narrative is that women in the west deal with random harassment from out-of-control men on a regular basis...",
    "fullContent": "UK Authorities Deploy Undercover Police To Catch Men Who \"Catcall\" The political war on men and masculinity continues to escalate. A long running feminist propaganda narrative is that women in the west deal with random harassment from out-of-control men on a regular basis while walking public streets. Previous attempts to replicate this claim on camera have led to minimal results, with feminist activists wearing revealing clothing pacing back and forth on sidewalks hoping for an incident. They catch a few men looking at them briefly, or saying something as innocuous as \"hi beautiful\", and this is held up as evidence of the terrible plight of women navigating a patriarchal \"rape culture\". In reality, most men barely take notice. Those that do are harmless and activists are left grasping at straws. These kinds of honey traps often become jokes on social media, with the participants readily mocked for their dishonesty or stupidity. In the US, woke rhetoric against men and the \"male gaze\" is dying as the public grows tired of feminist victimhood. However, in Europe, social and political evolution seems to be running several years behind America and political leaders there are still desperately trying to transcribe woke ideological cultism into enforceable law. Case in point: UK officials are recreating their own catcall honey traps using undercover female officers jogging back and forth on busy streets. If a man honks at them, looks at them too long or says something to them, they risk getting stopped by hidden patrol cars and chastised. In some cases their vehicles have even been seized by police. Female cops in the UK are jogging around in tight clothing, so they can arrest the men who catcall them. 😭pic.twitter.com/IfTRzP3GRd — Tiffany Fong (@TiffanyFong_) August 13, 2025 Keep in mind that this experiment is being operated in neighborhoods that are up to 90% majority white, native residents. It's highly unlikely that UK officials would allow a similar trap to be run in areas populated by migrants. This, of course, is a common double standard in European countries today. Native citizens are heavily scrutinized for misbehavior while police and politicians ignore the violence, rape, grooming gangs and murder common within migrant enclaves. Yet another migrant who assaults a woman when she says no... Mass deportation now! pic.twitter.com/WwavP14nn4 — Grifty (@TheGriftReport) July 5, 2025 Any attempt to jog a couple of attractive female officers through a neighborhood full of third-worlders would likely elicit an unpleasant experience in cultural exchange. African migrant slaps white woman in the face after she refuses his perverted advances, another migrant then kicks her from behind. They all laugh. These are very sick people. https://t.co/kTr5xbfBAr — iamyesyouareno (@iamyesyouareno) January 12, 2024 And what happens when women do report harassment and assault when they come in contact with foreigners? They get a lecture on politically correct speech. A migrant attacked and spat at a British woman. She described him, understandably, to the police as a \"filthy migrant\". She gets a lecture on her choice of language. pic.twitter.com/NhUqcJnQCt — David Atherton (@DaveAtherton20) September 10, 2024 This is the reason why very few people take feminist claims of catcalling seriously - Because scrutiny and enforcement are highly selective. Certain men are allowed to do whatever they want, while other men are portrayed as monsters simply for saying hello or giving a look. Police admit that there are no specific laws against these behaviors, but UK politicians and authorities have been using color-of-law enforcement since before the pandemic mandates. In other words, it doesn't matter what laws are written down, if they decide they don't like something you're doing they might threaten you or potentially arrest you regardless. Numerous people in Britain have been arrested for posting memes, praying silently within the vicinity of abortion clinics, and even for flying British flags within the sight of migrants. A widespread indoctrination campaign has been launched to demonize white males in particular, with many PSA commercials, TV shows and other media showing white men as the common perpetrators of harassment and assault. Meanwhile, numerous crimes involving migrants (specifically crimes against women) are buried and the identities of the assailants are kept confidential. Tyler Durden Sun, 08/17/2025 - 08:45",
    "publishedAt": "2025-08-17T12:45:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.903Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1d3c662c"
  },
  {
    "id": "nse-online-announcements-4398f40c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Somany Ceramics Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SOMANYCERA_17082025124240_IntimationofTemporaryShutdown_17082025sd.pdf",
    "summary": "Somany Ceramics Limited has informed the Exchange regarding Intimation Under Regulation 30 Of The SEBI (Listing Obligations And Disclosure Requirements) Regulations, 2015. |SUBJECT: Updates.",
    "fullContent": "Somany Ceramics Limited has informed the Exchange regarding Intimation Under Regulation 30 Of The SEBI (Listing Obligations And Disclosure Requirements) Regulations, 2015. |SUBJECT: Updates",
    "publishedAt": "2025-08-17T12:42:49.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "4398f40c"
  },
  {
    "id": "thehindubusinessline-5d7502eb",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "India preparing fresh round of PLI push for steel with sweeping relaxations: HD Kumaraswamy",
    "url": "https://www.thehindubusinessline.com/economy/india-preparing-fresh-round-of-pli-push-for-steel-with-sweeping-relaxations-hd-kumaraswamy/article69943684.ece",
    "summary": "The scheme is set to expand with new relaxations and incentives to boost sector growth.",
    "fullContent": "The scheme is set to expand with new relaxations and incentives to boost sector growth",
    "publishedAt": "2025-08-17T12:34:30.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5d7502eb"
  },
  {
    "id": "thehindubusinessline-68a1ad7e",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "PM seeks States’ cooperation in proposed GST reforms",
    "url": "https://www.thehindubusinessline.com/economy/pm-seeks-states-cooperation-in-proposed-gst-reforms/article69943823.ece",
    "summary": "The PM announced that the draft proposal for the GST revamp has already been circulated to states.",
    "fullContent": "The PM announced that the draft proposal for the GST revamp has already been circulated to states",
    "publishedAt": "2025-08-17T12:31:48.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "68a1ad7e"
  },
  {
    "id": "thehindubusinessline-24ea89f0",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "India’s data centres mull public listing as valuations swell",
    "url": "https://www.thehindubusinessline.com/info-tech/indias-data-centres-mull-public-listing-as-valuations-swell/article69943627.ece",
    "summary": "Analysts anticipate considerable growth for the industry in coming years driven by the AI boom.",
    "fullContent": "Analysts anticipate considerable growth for the industry in coming years driven by the AI boom",
    "publishedAt": "2025-08-17T12:31:33.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "24ea89f0"
  },
  {
    "id": "nse-online-announcements-55aee4bc",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "The Ruby Mills Limited",
    "url": "https://nsearchives.nseindia.com/corporate/COMSEC_17082025123022_npagmsigned.pdf",
    "summary": "The Ruby Mills Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication.",
    "fullContent": "The Ruby Mills Limited has informed the Exchange about Copy of Newspaper Publication |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-17T12:30:35.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "55aee4bc"
  },
  {
    "id": "thehindubusinessline-2980c38d",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "SPIC Q1 net profit rises to ₹66.71 cr on operational efficiency, lower input costs",
    "url": "https://www.thehindubusinessline.com/companies/spic-q1-net-profit-rises-to-6671-cr-on-operational-efficiency-lower-input-costs/article69943851.ece",
    "summary": "The company had posted a net profit of ₹62.55 crore in the same quarter of the previous fiscal year.",
    "fullContent": "The company had posted a net profit of ₹62.55 crore in the same quarter of the previous fiscal year",
    "publishedAt": "2025-08-17T12:23:40.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2980c38d"
  },
  {
    "id": "nse-online-announcements-7763efed",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Tembo Global Industries Limited",
    "url": "https://nsearchives.nseindia.com/corporate/TEMBO_17082025122106_ilovepdf.pdf",
    "summary": "Tembo Global Industries Limited has informed the Exchange about Investor Presentation |SUBJECT: Investor Presentation.",
    "fullContent": "Tembo Global Industries Limited has informed the Exchange about Investor Presentation |SUBJECT: Investor Presentation",
    "publishedAt": "2025-08-17T12:21:28.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "7763efed"
  },
  {
    "id": "business-insider-6b545fe5",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Florida's housing market was once red-hot. Now it's one of the coldest in the country.",
    "url": "https://www.businessinsider.com/hottest-coldest-housing-markets-usa-florida-2025-8",
    "summary": "For years, buyers went south to places like Florida for affordable homes and lifestyle perks. Now, the trend is reversing as the Northeast wins them over.",
    "fullContent": "For years, buyers went south to places like Florida for affordable homes and lifestyle perks. Now, the trend is reversing as the Northeast wins them over.",
    "publishedAt": "2025-08-17T12:19:01.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6b545fe5"
  },
  {
    "id": "nse-online-announcements-5b5a6841",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Radico Khaitan Limited",
    "url": "https://nsearchives.nseindia.com/corporate/RADICO_17082025121638_intimation17082025.pdf",
    "summary": "Radico Khaitan Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Radico Khaitan Limited has informed the Exchange about Schedule of meet |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-17T12:17:15.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "5b5a6841"
  },
  {
    "id": "business-insider-98dc4bd",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "As an upper-income dad, I spend most of my expendable income on my kids' activities. I fear I'm giving them an unfair advantage.",
    "url": "https://www.businessinsider.com/dad-spend-expendable-income-on-kids-expensive-activities-2025-8",
    "summary": "I pay for expensive after-school activities, but I fear my kids will be too privileged. I want to be more intentional about my parenting.",
    "fullContent": "I pay for expensive after-school activities, but I fear my kids will be too privileged. I want to be more intentional about my parenting.",
    "publishedAt": "2025-08-17T12:17:02.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "98dc4bd"
  },
  {
    "id": "techmeme-509d34c5",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "PitchBook: 15.9% of VC-backed deals in 2025 so far have been down rounds, a 10-year high, with AI and ML startups accounting for 29.3% of the down rounds (Allie Garfinkle/Fortune)",
    "url": "http://www.techmeme.com/250817/p6#a250817p6",
    "summary": "Allie Garfinkle / Fortune: PitchBook: 15.9% of VC-backed deals in 2025 so far have been down rounds, a 10-year high, with AI and ML startups accounting for 29.3% of the down rounds — Chime executives, along with family, celebrating the company's IPO at the Nasdaq.",
    "fullContent": "Allie Garfinkle / Fortune: PitchBook: 15.9% of VC-backed deals in 2025 so far have been down rounds, a 10-year high, with AI and ML startups accounting for 29.3% of the down rounds — Chime executives, along with family, celebrating the company's IPO at the Nasdaq. — The soaring valuations of the early 2020s are, finally, coming back to earth.",
    "publishedAt": "2025-08-17T12:15:01.000Z",
    "fetchedAt": "2025-08-18T02:33:34.881Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "509d34c5"
  },
  {
    "id": "bloomberg-business-youtube-1089ca",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "How Rule of Law Hits Wall Street",
    "url": "https://www.youtube.com/watch?v=Ool91gxjJeA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-17T12:14:08.000Z",
    "fetchedAt": "2025-08-18T02:33:45.089Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "1089ca"
  },
  {
    "id": "nse-online-announcements-61f7a9d0",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "KEC International Limited",
    "url": "https://nsearchives.nseindia.com/corporate/xbrl/ANN_AWARD_BAGGING_1514084_17082025121113_WEB.xml",
    "summary": "KEC International Limited has informed the Exchange about the event related to Bagging/Receiving of orders/contracts |SUBJECT: Awarding or Bagging of Orders/Contracts-XBRL.",
    "fullContent": "KEC International Limited has informed the Exchange about the event related to Bagging/Receiving of orders/contracts |SUBJECT: Awarding or Bagging of Orders/Contracts-XBRL",
    "publishedAt": "2025-08-17T12:11:14.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "61f7a9d0"
  },
  {
    "id": "thehindubusinessline-72ca0f39",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Indian spirit makers flag discrimination against foreign brands by states' excise policies",
    "url": "https://www.thehindubusinessline.com/economy/indian-spirit-makers-flag-discrimination-against-foreign-brands-by-states-excise-policies/article69943799.ece",
    "summary": "The Indian brands face ‘exorbitantly high brand registration fees’ compared to imported BIO (bottled in origin), hampering product entry in a number of states, said CIABC.",
    "fullContent": "The Indian brands face ‘exorbitantly high brand registration fees’ compared to imported BIO (bottled in origin), hampering product entry in a number of states, said CIABC",
    "publishedAt": "2025-08-17T12:10:23.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "72ca0f39"
  },
  {
    "id": "zerohedge-3ee276aa",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "German Air Traffic Remains Far Below Pre-COVID Levels",
    "url": "https://www.zerohedge.com/markets/german-air-traffic-far-below-pre-corona-levels",
    "summary": "German Air Traffic Remains Far Below Pre-COVID Levels Submitted by Thomas Kolbe Germany’s Air Traffic Falters: Ryanair Cuts Flights Air traffic in Germany remains far below 2019 levels. Expensive regulations and the country’s economic situation are preventing a recovery.",
    "fullContent": "German Air Traffic Remains Far Below Pre-COVID Levels Submitted by Thomas Kolbe Germany’s Air Traffic Falters: Ryanair Cuts Flights Air traffic in Germany remains far below 2019 levels. Expensive regulations and the country’s economic situation are preventing a recovery. Airlines are voicing their criticism of government policies. Passenger numbers at German airports confirm the overall crisis in the economy. With 99.4 million passengers in the first half of 2025, air traffic rose by 2.8% compared to last year but still remains 15.8% below pre-Corona levels. The decline is particularly dramatic at the capital airport, BER. Compared with the combined passenger numbers of the former Tegel and Schönefeld airports in 2019, BER today handles roughly 30% fewer passengers. A Gaping Capacity Gap This is a stark indicator of the industry’s troubles, which aligns with trends in other sectors of the German economy. Both construction and key industrial sectors are operating 12 to 15% below 2019 levels. This has consequences for the labor market. In aviation, about 24% of jobs—or 60,000 of 255,000 positions—have been cut since 2019. Nationwide, job losses now total roughly 700,000. The German economy is visibly running at low throttle. With a capacity utilization of 77.7% in Q2, well below the 83.4% average, the numbers indicate weak domestic demand as well as a cooling export sector. U.S. trade policies are likely to add further pressure. The German economy is in serious turbulence, and the country’s overall competitiveness has declined. Criticism Grows Louder Airlines and airport operators have long complained about Germany’s excessive costs and regulatory burden. The already strict rules of the EU Commission are compounded locally by additional taxes, levies, and bureaucratic hurdles. This combination weighs on carriers and hampers any meaningful recovery of German air traffic. The sharpest criticism in recent days came from Irish carrier Ryanair, which announced that due to high operating costs in Germany, it would completely cease flights at Dortmund, Leipzig, and Dresden, and reduce operations in Hamburg by 60% and at BER by 20%. Pars pro Toto Ryanair CMO Dara Brady summed up the situation bluntly: he sharply criticized the federal government for repeatedly failing to lower or at least reduce the high air travel tax, thereby blocking the market’s necessary recovery. Brady warned of far-reaching consequences for tourism, jobs, and Germany’s connectivity to international hubs. He announced that, if the air travel tax were abolished, Ryanair would invest $3 billion in Germany and create 1,000 new jobs. Passenger numbers could rise to 34 million annually. If high costs and access barriers remain, growth would have to shift to other European markets such as Sweden, Hungary, and Italy. Ryanair’s message is clear: without tangible relief, more firms will pack up—impacting Germany’s economic standing and jobs in the sector. Since 2019, the number of civil aircraft stationed in Germany has dropped from 190 to 130, resulting in the loss of roughly 10,000 jobs and an annual economic output loss of over €4 billion. Politics Remain Silent For now, policymakers remain quiet. Only Christoph Ploß (CDU), federal tourism coordinator, responded vaguely, announcing plans to reduce the air travel tax. Yet the 2026 federal budget contains no concrete relief measures. The sector remains politically unsupported and out in the rain. Germany’s Solo Flight into Isolation Regulations hit domestic flights hardest—reflecting an ideological stance against individual mobility and aviation. Up to 35% of ticket prices now go to government charges. These include the air travel tax, which rose 25% in 2024 and accounts for roughly 10–12% of total ticket cost, plus CO₂ levies, airport usage, and flight safety fees adding another 10–15%. Airport and air traffic control fees account for 8–10%. In a European comparison, German fees are well above those at competing locations. In Poland and Italy, for example, fiscal levies on tickets range from 10–15%. This difference is crucial in a highly competitive market. As long as the EU Commission does not implement unified regulations, location competition will persist. The looming flight of carriers to neighboring countries increases pressure on the finance minister to ease taxes. Given the tight fiscal situation, whether this is feasible remains questionable. * * * About the author: Thomas Kolbe, a German graduate economist, has worked for 25 years as a journalist and media producer for clients from various industries and business associations. As a publicist, he focuses on economic processes and observes geopolitical events from the perspective of the capital markets. His publications follow a philosophy that focuses on the individual and their right to self-determination. Tyler Durden Sun, 08/17/2025 - 08:10",
    "publishedAt": "2025-08-17T12:10:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.903Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3ee276aa"
  },
  {
    "id": "bloomberg-markets-110d25ab",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "How Rule of Law Hits Wall Street",
    "url": "https://www.bloomberg.com/news/videos/2025-08-17/how-rule-of-law-hits-wall-street-video",
    "summary": "Rule of law is an abstract concept that ensures that judgments and contracts will be enforced and upheld, but for businesses and investors the consequences are very real. Rick Deane, president of the American College of Trial Lawyers, warns that predictability is key to the...",
    "fullContent": "Rule of law is an abstract concept that ensures that judgments and contracts will be enforced and upheld, but for businesses and investors the consequences are very real. Rick Deane, president of the American College of Trial Lawyers, warns that predictability is key to the innovation that has grown the American economy. Harold Koh of Yale Law School calls the current threat to rule of law \"the worst legal crisis\" he has seen. And, Doug Melamed, former general counsel of Intel, tells us why business and rule of law go hand-in-hand. (Source: Bloomberg)",
    "publishedAt": "2025-08-17T12:06:21.000Z",
    "fetchedAt": "2025-08-18T02:33:32.697Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "110d25ab"
  },
  {
    "id": "bloomberg-politics-243b6471",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Decades of Socialist Rule at Stake as Bolivia Vote Count Starts",
    "url": "https://www.bloomberg.com/news/articles/2025-08-17/two-decades-of-socialist-rule-may-end-as-bolivians-start-voting",
    "summary": "The vote count is underway in Bolivia’s presidential and congressional elections that may end years of socialist rule and herald warmer relations with Washington.",
    "fullContent": "The vote count is underway in Bolivia’s presidential and congressional elections that may end years of socialist rule and herald warmer relations with Washington.",
    "publishedAt": "2025-08-17T12:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.222Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "243b6471"
  },
  {
    "id": "wired-31902c09",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Camp Snap CS-8 Review: Simple Video Capture",
    "url": "https://www.wired.com/review/camp-snap-cs-8/",
    "summary": "Modeled on a 1960s home movie camera, this cheap, stripped-down digital Super 8 is a laid-back antidote to the spec-chasing rat race of modern videography.",
    "fullContent": "Modeled on a 1960s home movie camera, this cheap, stripped-down digital Super 8 is a laid-back antidote to the spec-chasing rat race of modern videography.",
    "publishedAt": "2025-08-17T12:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:34.950Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "31902c09"
  },
  {
    "id": "wired-30130289",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Pebblebee Is Getting Serious About Personal Safety Tracking",
    "url": "https://www.wired.com/story/pebblebee-is-getting-serious-about-personal-safety-tracking/",
    "summary": "The Bluetooth tracker maker is adding free and paid SOS features to its products, including emergency contact alerts, silent alarms, and real-time location sharing.",
    "fullContent": "The Bluetooth tracker maker is adding free and paid SOS features to its products, including emergency contact alerts, silent alarms, and real-time location sharing.",
    "publishedAt": "2025-08-17T12:00:00.000Z",
    "fetchedAt": "2025-08-18T02:33:34.950Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "30130289"
  },
  {
    "id": "scmp-business-6f150ca6",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "1 in 3 eczema patients in Hong Kong face workplace hostility: poll",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3322142/1-3-eczema-patients-hong-kong-face-workplace-hostility-poll?utm_source=rss_feed",
    "summary": "One in three eczema patients in Hong Kong experienced workplace hostility, including exclusion or mockery by colleagues due to their condition, a survey by the Medical and Health Advancement Federation has found.",
    "fullContent": "One in three eczema patients in Hong Kong experienced workplace hostility, including exclusion or mockery by colleagues due to their condition, a survey by the Medical and Health Advancement Federation has found. The survey released on Sunday aimed to raise awareness of the physical and mental challenges faced by eczema patients, who accounted for 20 per cent of the population. The federation conducted the survey between June and July this year, interviewing 240 people who were employed and had...",
    "publishedAt": "2025-08-17T11:59:52.000Z",
    "fetchedAt": "2025-08-18T02:33:35.646Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6f150ca6"
  },
  {
    "id": "nse-online-announcements-59cb08b7",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Spectrum Electrical Industries Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SPECTRUM_17082025115109_SPECTRUM_UFR_NewsPaper_Publication_30062025.pdf",
    "summary": "Spectrum Electrical Industries Limited has informed the Exchange about Copy of Revised Newspaper Publication for the unaudited financial results for the Quarter Ended on June 30, 2025 |SUBJECT: Copy of Newspaper Publication.",
    "fullContent": "Spectrum Electrical Industries Limited has informed the Exchange about Copy of Revised Newspaper Publication for the unaudited financial results for the Quarter Ended on June 30, 2025 |SUBJECT: Copy of Newspaper Publication",
    "publishedAt": "2025-08-17T11:55:33.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "59cb08b7"
  },
  {
    "id": "jacobin-magazine-3f9b30ac",
    "sourceId": "jacobin-magazine",
    "sourceName": "Jacobin Magazine",
    "title": "How Rome’s Rulers Tried to Stamp Out the Right to Protest",
    "url": "https://jacobin.com/2025/08/ancient-rome-protest-rights-history/",
    "summary": "Protesters have taken to the streets to make their voices heard in huge numbers across the globe this year. According to data published by the Armed Conflict Location and Event Data (ACLED) project, June 2025 had the second-highest number of demonstrations in a single month...",
    "fullContent": "Protesters have taken to the streets to make their voices heard in huge numbers across the globe this year. According to data published by the Armed Conflict Location and Event Data (ACLED) project, June 2025 had the second-highest number of demonstrations in a single month within the United States, topped only by June 2020, at [&hellip;]",
    "publishedAt": "2025-08-17T11:55:28.000Z",
    "fetchedAt": "2025-08-18T02:38:11.283Z",
    "category": "eclectic",
    "tags": [
      "eclectic"
    ],
    "priority": "normal",
    "contentHash": "3f9b30ac"
  },
  {
    "id": "zerohedge-32dac5e2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Trump Calls For \"Peace Agreement\" To End \"Horrific War Between Russia & Ukraine\"",
    "url": "https://www.zerohedge.com/markets/history-making-summit-alaska-trump-en-route-meet-putin-everything-you-need-know",
    "summary": "Trump Calls For \"Peace Agreement\" To End \"Horrific War Between Russia & Ukraine\" Update (0748ET): After a night to digest the historic Trump-Putin summit in Alaska aimed at ending the devastating war in Ukraine - a conflict that has left more than a million killed or wounded...",
    "fullContent": "Trump Calls For \"Peace Agreement\" To End \"Horrific War Between Russia & Ukraine\" Update (0748ET): After a night to digest the historic Trump-Putin summit in Alaska aimed at ending the devastating war in Ukraine - a conflict that has left more than a million killed or wounded and destroyed an entire nation- the European Council has released a joint statement. At the same time, the U.S. president posted his update on Truth Social. Historic. Let's begin with President Trump's Truth Social post: A great and very successful day in Alaska! The meeting with President Vladimir Putin of Russia went very well, as did a late night phone call with President Zelenskyy of Ukraine, and various European Leaders, including the highly respected Secretary General of NATO. It was determined by all that the best way to end the horrific war between Russia and Ukraine is to go directly to a Peace Agreement, which would end the war, and not a mere Ceasefire Agreement, which often times do not hold up. President Zelenskyy will be coming to D.C., the Oval Office, on Monday afternoon. If all works out, we will then schedule a meeting with President Putin. Potentially, millions of people's lives will be saved. Thank you for your attention to this matter! Next, the European Council released a joint statement by the French president, Emmanuel Macron, the Italian prime minister, Giorgia Meloni, the German chancellor, Friedrich Merz, the British prime minister, Keir Starmer, the Finnish president, Alexander Stubb, the Polish prime minister, Donald Tusk, the European Council president, António Costa and the European Commission president, Ursula von der Leyen. EU leaders welcomed Trump's push to end the war in Ukraine. They backed his call for further talks with President Zelenskyy and signaled support for a potential trilateral summit. Here's a summary of the statement: Security Guarantees: Ukraine must receive ironclad security guarantees, with no restrictions on its military or foreign partnerships. Sovereignty: Territorial decisions rest solely with Ukraine; borders cannot be changed by force. Western Support: The U.S. and Europe pledged continued military and economic backing, with sanctions pressure on Russia maintained until a just and lasting peace is achieved.ent, Emmanuel Macron, the Italian prime minister, Giorgia Meloni, the German chancellor, Friedrich Merz, the British prime minister, Keir Starmer, the Finnish president, Alexander Stubb, the Polish prime minister, Donald Tusk, the European Council president, António Costa and the European Commission president, Ursula von der Leyen. What's next: Ukrainian President Zelenskyy is scheduled to arrive in Washington on Monday to discuss a potential peace deal with President Trump in the Oval Office. If talks go well (unlike last time), Trump is expected to meet with Putin to push toward ending the war. This conflict, as explained by Putin yesterday, would never have happened if Trump had been president, implicitly blaming the rogue deep staters in the Biden-Harris regime for the mess. * * * Update (2032ET): During a joint press conference following their multi-hour summit on ending the war in Ukraine, President Vladimir Putin said that if Donald Trump had been president in 2022, Russia would not have invaded Ukraine. This is essentially Putin blaming the Biden-Harris regime and its corrupt Deep State pals. We're sure Western corporate media will be all but silent on this new development. Putin stated: \"I'd like to remind you that in 2022, during the last contact with a previous administration, I tried to convince my previous American colleague it should not...the situation...should not be brought to the point of no return when it would come to hostilities. And I said quite directly back then that's a big mistake. Today, when President Trump saying that if he was the president back then there will be no war. And I'm quite sure it would indeed be so. I can confirm that. I think overall me and President Trump have built a very good business-like trustworthy contact. And every reason to believe moving down this path better to the end of the conflict in Ukraine.\" 🚨 BREAKING: Vladimir Putin CONFIRMS that the war in Ukraine NEVER would've happened if Trump was in office Trump was RIGHT! \"Today, when President Trump says that if he was President back [in 2022], there would be no war. And I'm quite sure that it would indeed be. I can… pic.twitter.com/glYtFFWCG5 — Nick Sortor (@nicksortor) August 15, 2025 Political commentator Rogan O'Handley emphasized on X that \"Democrat Media isn't going to like this clip, but it's true Biden and Kamala pushed for Ukraine to be added to NATO and then all hell broke loose Plus we all know Ukraine was Biden and the Deep State's money laundering playground And don't even get me started on the biolabs…\" After nearly three hours of talks, President Trump said, \"Many points were agreed to, and there are just a very few that are left,\" but gave no specifics, while Putin reiterated Russia's hard-line demands for Ukrainian territorial concessions, disarmament, NATO exclusion, and regime change in Kyiv. Both Trump and Putin seemed upbeat about finding a resolution to the war in Eastern Europe. They even shared a laugh... 🇷🇺🤝🇺🇸 Putin and Trump share a laugh after their JOINT press conference HANDSHAKE and light chatter follow Their HISTORICAL meeting is OFFICIALLY over https://t.co/eXtI2yDur0 pic.twitter.com/l7YEW8QbFF — RT (@RT_com) August 15, 2025 Before the summit, Putin was welcomed to Alaska with a red carpet, a joint limousine ride, and a B-2 bomber and fifth-generation fighter jet flyover.... The US flexes in the sky above the two negotiating leaders. pic.twitter.com/NHiKyQYWxz — James Hirsen (@thejimjams) August 15, 2025 Putin ended by inviting Trump to Moscow for a second round of talks to end the war in Ukraine. ⚡️ Putin switches to ENGLISH and invites Trump to MOSCOW for next round of talks Trump says he sees it as ‘possibly HAPPENING’ https://t.co/sLVkvyMV8Y pic.twitter.com/TKWZ3TwkZc — RT (@RT_com) August 15, 2025 Democrats today.... Democrats: “How dare Trump smile, shake hands, and have a casual conversation with Putin.” pic.twitter.com/fUq9Ef3tjB — I Meme Therefore I Am 🇺🇸 (@ImMeme0) August 15, 2025 Trumps stated earlier, \"There’s no deal until there’s a deal.\" * * * Putin began the joint press conference noting that negotiations were \"useful\" and held “in a constructive atmosphere.” Putin says there’s an agreement but Trump appears to dispute that fact, though he notes several points of alignment. The leaders didn’t spell out the points that had been agreed and those that hadn’t been. WATCH LIVE: Trump, Putin to hold news conference after talks on war in Ukrainehttps://t.co/pYHE36xFuY — Breaking911 (@Breaking911) August 15, 2025 Putin agreed with Trump that Ukraine's security must be guaranteed, and framed the agreement as a starting point for resolving the Ukraine situation, as well as restoring economic relations. “I would like to hope that the agreement we’ve reached together will help us bring closer that goal and will pave a path towards peace in Ukraine,” Putin says. “I expect that today’s agreements will be the starting point, not only for the solution of the Ukrainian issue, but also will help us bring back businesslike and pragmatic relations between Russia and the US.” He also notes that US and Russian investment and business cooperation have “tremendous potential.” Trump then spoke: “We had an extremely productive meeting and many points were agreed to. There are just a very few that are left. Some are not that significant; one is probably the most significant, but we have a very good chance of getting there. We didn’t get there but we have a very good chance of getting there.” “There’s no deal until there’s a deal,” Trump added. Trump added that he will confer with the leaders of NATO and Ukraine. “I’m going to start making a few phone calls and tell them what happened,” he said. Putin suggested the next meeting of the two leaders should be in Moscow. Trump frowned and suggested he would \"take some heat\" for that. Neither Putin nor Trump fielded any questions from reporters. * * * Update (1830ET): Discussions concluded after more than two-and-a-half hours at the summit in Alaska, marking the longest in-person meeting by Trump and Putin and offering a sign that by the US leader’s own metric the talks went well. Trump aide Dan Scavino said a three-on-three meeting was still ongoing at 1:25 p.m. Alaska time, more than two hours after reporters were ushered out of the room for the start of the formal discussions. ⚡️ Putin-Trump 3-on-3 talks have JUST ENDED https://t.co/vXOZ5S3hVb pic.twitter.com/9VZgboXCtu — RT (@RT_com) August 15, 2025 The Kremlin later said the narrow-format talks had finished. Joining the leaders in Friday’s meeting were US Secretary of State Marco Rubio and Trump special envoy Steve Witkoff, with Russian Foreign Minister Sergei Lavrov and Kremlin foreign policy aide Yuri Ushakov accompanying Putin. RT reports that Defense Minister Belousov is \"in a great mood.\" Fox News is reporting that Trump is currently holding a call with Ukrainian President Zelensky and other European leaders. Behind the scenes: Behind the scenes of Trump-Putin summit in Alaska pic.twitter.com/volHOKhZxP — RT (@RT_com) August 15, 2025 * * * Big B-2 flyover with both leaders on the tarmac, just after the handshake... Footage showing the fly-over earlier of a U.S. Air Force B-2A “Spirit” Long-Range Strategic Stealth Bomber escorted by 4 F-35 Lightning IIs as President Donald J. Trump and Russian President Vladimir Putin meet at Joint Base Elmendorf–Richardson in Anchorage, Alaska. pic.twitter.com/yDx6nQFm9u — OSINTdefender (@sentdefender) August 15, 2025 Update(1430ET): President Trump said just before landing in Anchorage that \"there's a good respect level on both sides\" - but he has also threatened to \"walk\" if things don't go well. Trump told Fox News' White House correspondent aboard Air Force One that if his meeting with Russian President Vladimir Putin doesn't go well, \"I would walk.\" According to the brief exchange: \"I mean, if it doesn't, you walk?\" Baier asked. \"I would walk, yeah,\" Trump said. But Trump also struck a tone of optimism: \"I think we're going to do very well. Our country is doing very well. We're setting records economically like we never have before, including the stock markets are all at record high,\" he said. the \"red carpet\" Trump told Fox further, \"We're taking in trillions and trillions of dollars with tariffs. We're going for a meeting with President Putin in Alaska, and I think it's going to work out very well. And if it doesn't, I'm gonna head back home real fast.\" \"Look, he's a smart guy. Been doing it for a long time, but so have I,\" Trump said of Putin. \"We get along. There's a good respect level on both sides.\" Per ABC and others: A White House official confirms President Donald Trump's meeting with Russian President Vladimir Putin will now be a three-on-three meeting. The president will be joined by White House Special Envoy Steve Witkoff and Secretary of State Marco Rubio. For the expanded working lunch, the president will be joined by Rubio, Witkoff, Defense Secretary Pete Hegseth, Treasury Secretary Scott Bessent, Commerce Secretary Howard Lutnick and White House chief of staff Susie Wiles, according to a White House official. Air Force One lands... BREAKING: President Trump has arrived at Alaska military base for summit with Putin on the Russia-Ukraine warpic.twitter.com/LdOLEy9Cjd — Insider Paper (@TheInsiderPaper) August 15, 2025 Trump warns Putin: 'very economically severe' consequences if meeting doesn't go to his liking Trump warns Putin: 'very economically severe' consequences if meeting doesn't go to his liking 'I'm not doing this for my health... I'm doing this to save a lot of lives' https://t.co/5no8dYOTbx pic.twitter.com/wlOPg8tZzt — RT (@RT_com) August 15, 2025 * * * President Trump has boarded Air Force One and is en route to Anchorage, Alaska - where what could be the most historic summit of his presidency is set to begin at 3pm Alaska time, which is 3pm eastern, and as the Russian delegation headed by Putin has already landed at Elmendorf-Richardson Air Force Base, which is venue for the talks. Trump himself has been busy trying to temper expectations, calling it a \"feel-out\" meeting and the White House elsewhere referring to a \"listening exercise\" on the Ukraine war and bilateral Moscow-Washington relations. While the consensus among Western officials and pundits is that deal to finally end the war is likely yet still far away, \"we do expect some progress in today’s meeting and a path set for further discussions,\" according to Mohit Kumar, chief European strategist at Jefferies International. \"If we move toward a peace deal, it would be positive for the European markets.\" 🚨President Trump is officially on his way to Anchorage, Alaska where he will meet with Russian President Vladimir Putin.pic.twitter.com/MHDw6NzjUx — Townhall.com (@townhallcom) August 15, 2025 Below is everything you need to know (via Newsquawk): Trump-Putin Summit in Alaska on Friday 15th August 2025; Summit to begin at 15:00 EDT/20:00 BST; Trump assigned a 25% chance the meeting will not be successful. OVERVIEW MEETING FORMAT US President Trump is to meet Russian President Putin in US territory at Elmendorf-Richardson Air Force Base near Anchorage, Alaska, on Friday, 15 August 2025. White House said US President Trump will participate in a bilateral program with the President of the Russian Federation in Alaska at 11:00AM (15:00EDT/20:00BST) and will depart Alaska at 17:45 (21:45/02:45BST). The Alaska summit will begin at 11:30 local time on Friday (20:30 BST/15:30 EDT), according to Russian Kremlin's Ushakov on Wednesday. Russian President Putin and US President Trump to have a one-on-one meeting with translators; also to have a wider meeting with delegations. US President Trump on Thursday said that he does not know if there will be a joint press conference with Russian President Putin after the Alaska meeting. Trump will have a press conference however the talks go. Russian delegation to include Russian Foreign Minister Lavrov, Advisor Ushakov, Defence Minister Belousov, Finance Minister Siluanov and Special Envoy and head of Sovereign Wealth Fund Dmitriev. The meeting will be the first time the Russian leader has set foot on US soil since 2015. Ukrainian President Zelensky is not invited to the Alaska summit. PURPOSE: The meeting aims to explore ways to end Russia’s war against Ukraine. Russia's Kremlin said the central topic is Ukraine. The sides are to discuss trade and economic cooperation where there is \"huge untapped potential\". White House spokeswoman Leavitt described it as a “listening exercise\" to hear what Putin proposes. \"At the end of that meeting, probably the first two minutes, I'll know exactly whether or not a deal can be made,\" Trump said at a White House press conference. EXPECTATIONS The White House downplayed expectations, describing the meeting as a listening exercise. President Trump called it a leel-out meeting. US President Trump on Thursday assigned a 25% chance that the first meeting (Alaska) is not successful; and said he could be more sanctions if the meeting is not successful. Trump added Have economic incentives and disincentives at his disposal for the meeting; would rather not say about specifics. Incentives/sanctions are \"very powerful\". There are no plans to sign documents on the outcome of the Alaska summit between Russia and the US, via Ifx citing the Kremlin; would be a mistake to predict the outcome of the talks. \"All in all, it is difficult to envision a smooth solution to the Russia-Ukraine war through this summit, with Moscow demanding Ukraine give up some territory, a red line for Kyiv.\" Analysts at Rane suggest the Friday summit \"risks side-lining Ukraine, fracturing Western unity and creating space for Russia to delay sanctions, consolidate battlefield gains and promote a US-Russia framework that advances Russian strategic interests.\" Markets will likely focus on several factors: the prospect of looser US sanctions on Russia. how far Russia is willing to go on concessions. any tangible progress towards a Russia-Ukraine ceasefire. TRUMP'S CALL WITH EUROPEAN LEADERS ON WEDNESDAY US President Trump held a call with European leaders and Ukrainian President Zelensky, which he said was a very good call and \"rate it a 10\", while he will meet with Russian President Putin, then will call Zelensky and European leaders. Trump said there is a good chance of a second meeting and he would like to do a second meeting almost immediately which would include Zelensky if the first meeting goes okay, but there may not be a second meeting if he feels it is inappropriate or if he does not get the answers he wants. Furthermore, he said the first meeting is finding out what they are doing and a second meeting will be more productive, but warned that Russia will face consequences if the war is not stopped. US President Trump discussed with European leaders possible locations for a meeting between Zelensky, Trump and Putin after the Alaska summit, while locations include cities in Europe and the Middle East, according to Reuters citing sources. US President Trump reportedly told those on Wednesday's call that he is willing to contribute US security guarantees for Ukraine with some conditions, via Politico citing sources; openness that helps explain the cautious European optimism. Guarantees which are seen as key by Europe and Ukraine. However, Politico caveats that Trump did not elaborate on what he meant by security guarantees, and would only make this commitment of the effort is not part of NATO. RUSSIA'S PRE-MEETING COMMENTS Russian Foreign Ministry says Moscow expects Trump's visit to Russia after Alaska summit, according to AI Arabiya. \"We have a clear position that we will present at the Alaska summit and hope to continue the dialogue\". \"We do not speculate on anything in the future and we have clear arguments and positions that we will present during the Alaska summit\". Russian President Putin said the US is making a sincere effort to find a solution for the Ukraine crisis; US are seeking agreements that are acceptable to all, via Ifx. Peace will be strengthened if at the next stage Russia and US reach agreements in the field of strategic offensive arms control. New arms agreements with US are possible. UKRAINE INVOLVEMENT President Trump said he may arrange a subsequent meeting involving Zelensky and Putin, but he dismissed Zelensky’s desire to participate directly, noting that the Ukrainian leader has ' been to a lot of meetings' without ending the war. Zelensky criticised the summit's bilateral format, warning that any peace deal must be approved in a national referendum and that the absence of Ukraine would render an agreement illegitimate. RENEWED OFFENSIVE Ukrainian President Zelensky on August 12th posted, \"We see that the Russian army is not preparing to end the war. On the contrary, they are making movements that indicate preparations for new offensive operations.” Zelensky added that Russia is moving troops from the Sumy region to Pokrovsky, Zaporizhzhia, and is preparing for a new assault at the start of September. Zelensky said the current Russian push in eastern Ukraine is timed to coincide with Trump-Putin talks. Ukrainian President Zelensky has repeatedly stated that Ukraine will not cede land. Russian President Putin reportedly appears ready to test new nuclear-armed, nuclear-powered cruise missiles even as he prepares for talks with US President Trump, according to US researchers and Western security sources cited by Reuters. Ukraine's military says it struck Russia's port Olya in the Astrakhan region on Thursday and hit a ship with drone parts and ammo from Iran. STANCES RUSSIA'S POSITION Russian President Putin is seek ng to lock in Russia's territorial gains and prevent Ukraine from joining NATO. Reports suggest Putin may have floated a ceasefire that asks Ukraine to cede much of Donetsk and to demilitarize Bloomberg reported on August 5th that the Kremlin is said to be mulling options for a concession to US President Trump that could include an air truce with Ukraine, in a bid to minimize the threat of secondary sanctions US and Russia reportedly planning Ukraine deal to cement Russ an territorial gains, according to Bloomberg (Aug 8th). Russia would halt its offensive in the Kherson and Zaporizhzhia regions of Ukraine Russian President Putin reportedly demands Ukraine cede Donetsk Lunansk and Crimea. Putin told Witkoff he would agree to a complete cease-fire if Ukraine agreed to withdraw forces from all of Ukraine s Eastern Donetsk region. UKRAINE'S POSITION Ukrainian President Zelensky said he understood that Russia wants Kyiv to pull out of Donbas and will not advance in other directions in exchange, he added that Ukraine will not pull out of Donbas as such a move would open the way for Russia to attack Dnipropetrovsk. Zaporizhzhia regions, and Kharkiv Zelensky added that territorial issues should be discussed after the ceasefire and along with security guarantees for Ukraine. In a press conference, he warned that Russia wants Ukraine to withdraw from the remaining 30% of the Donetsk region, but Ukraine's constitution prohibits surrendering territory. He also emphasized that giving up Donbas would become a springboard for future invasions; he insists Ukraine will not leave its fortifications or open an avenue for a Russian offensive. Ukraine insists on a durable ceasefire before any discussion of territorial issues. According to Politico Zelenskyy and European allies will use Wednesday's call tc push for a deal that demands a lasting ceasefire. Prior reports of softened Ukraine Stance Ukraine could agree to stop fighting and cede territory already held by Russia as pal of a European-backed plan for peace, according to The Telegraph (Aug 11th) Ukrainian President Zelensky reportedly told European leaders that they must reject any settlement produced by Trump, which sees them giving up Ukrainian land they still hold, but that Ukrainian territory in Russia's control could be on the table. This would mean freezing the frontline where it is and handing Russia de facto control of the territory it occupies EU/NATO POSITION EU and NATO leaders insist that Ukraine’s sovereignty and security guarantees are non-negotiable while analysts caution that land-swap proposals risk legitimizing aggression. NATO Secretary-Genera Rutte described the Alaska summit as a way to test Putin's seriousness and stressed that Ukraine must decide its own future he argued that only involving Ukraine and Europe will make any settlement EU Foreign Policy Chief Kallas said on August 11th that the EU will work on a 1st package of sanctions against Russia while she warned against concessions to Moscow. Germany said it will fund a USD 500m n package of military equipment and munitions Polish PM Tusk said they cannot allow the biggest powers to decide the fate of smaller countries without their participation and Russia wants to ink a reduction in NATO troops in Poland to the talks about Ukraine, while he added It will be easier for Poland's opponents to \"play us\" if we are not united. POTENTIAL SCENARIOS AND MARKET ANGLES No Deal [most likely]: Analysts consider it likely that the summit results n no ma or agreement Trump may simply gauge Put n s intentions and then coordinate with Zelenskyy and Europe. Broader sentiment will likely not be too swayed by a \"no deal\" amid low expectations heading into the meeting Limited Ceasefire [possible] This could be seen as progress toward de-escalation: on and potential easing of sanctions A \"limited ceasefire\" could be short-term negative for oil. defense stocks whilst stocks and EUR equities and EGBs could be buoyed Some analysts suggest Russia could use a limited ceasefire to regroup and delay sanctions. US-Russia Tensions Escalate [possible but not in bilateral interests] A further breakdown in relations between Moscow and Washington could see risk avers on and a rise in oil prices. Goldman Sachs: While lack of progress towards a ceasefire may lead renewed threats of secondary oil tariffs/sanctions, we see limited risk of large disruptions in Russia supply given the large volumes of Russian exports the possibility for deepening price discounts to maintain demand, and Iikely eagerness of the key buyers, India and especially China to continue energy cooperation with Russia As a reminder. US President Trump recently ordered two nuclear submarines to be \"positioned in the appropriate regions\" in response to \"highly provocative ’ comments by former Russian President Medvedev Land-Swap Proposal [possible but unlikely to be accepted]: If Trump agrees to a ceasefire that frontloads territorial concessions, analysts warn that Ukraine and Europe will reject it. Such a deal could trigger political backlash in Ukraine and may collapse due to constitutional and public opposition Short-term risk across markets amid progress toward de-escalation and potent al easing of sanctions with energy likely to slip. However, the reaction will likely fade if/when rejected by Ukraine. Comprehensive Framework [near-zero] Neither side currently appears willing to make the necessary concessions. Without Ukraine's participation on any framework is likely to faiI. Risk on. energy sold Goldman Sachs \"While a lasting peace agreement may potentially lead to a relaxation of US sanctions on Russian oil we wouldn't expect a significant short-term increase in Russian oiI supply in this scenario. The reason is that Russian production, in our view, has instead been constrained by CPEC+ quota decisions, low oi: investment, and a strong Ruble Here is what the most likely outcomes are according to a Bloomberg Markets Live poll: Source: Bloomberg HOUSE VIEWS BLOOMBERG: Bloomberg's John Authers citing Christopher Smart of the Arbroath Group says \"European defence stocks should fly on any lopsided deal that rewards Russia's aggression with oil prices likely to slump on even the whiff of looser sanctions on Russian oil... Beyond Europe, markets appear to have long since moved past the 2022 invasion, implying Friday s meeting has little potential to trigger a significant market shift. \" GOLDMAN SACHS: We don't expect the announced meeting between President Trump and President Putin, scheduled for Friday August 15 to cause a significant shift in Russian oil supply in key scenarios”. ING: If we do see some level of de-escalation, it could remove sanction risk from the oil market. This would likely drive prices lower, given the Bearish fundamentals . Tyler Durden Sun, 08/17/2025 - 07:48",
    "publishedAt": "2025-08-17T11:48:00.000Z",
    "fetchedAt": "2025-08-18T02:33:33.905Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "32dac5e2"
  },
  {
    "id": "thehindubusinessline-70ad320a",
    "sourceId": "thehindubusinessline",
    "sourceName": "The Hindu Business Line",
    "title": "Pick of BL commodities - August 17, 2025",
    "url": "https://www.thehindubusinessline.com/newsletter/pick-of-bl-commodities/pick-of-bl-commodities-august-17-2025/article69943714.ece",
    "summary": "Last week, data showed that a couple of listed Indian companies and firms floated by Indians abroad sourced basmati rice from Pakistan despite a ban by the Indian government. The Indian government is looking to mix soyameal in Bharat atta (flour) as part of its strategy to cut...",
    "fullContent": "Last week, data showed that a couple of listed Indian companies and firms floated by Indians abroad sourced basmati rice from Pakistan despite a ban by the Indian government. The Indian government is looking to mix soyameal in Bharat atta (flour) as part of its strategy to cut protein deficiency among Indians. The Technology Mission on Cotton is yet to be launched, as announced by the government in the Budget. The India Meteorological Department has said that the south-west monsoon was 20% deficient during August 1-15, and scientists are using drones to capture the mating behaviour of Humpback dolphins.",
    "publishedAt": "2025-08-17T11:47:48.000Z",
    "fetchedAt": "2025-08-18T02:33:33.176Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "70ad320a"
  },
  {
    "id": "business-insider-2292cafc",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Parenting is hard for everyone, so I've decided to stop faking it when others ask how I'm doing",
    "url": "https://www.businessinsider.com/parenting-is-hard-im-not-faking-it-when-people-ask-2025-8",
    "summary": "Nowadays, when other parents ask how I'm doing, they get the honest truth. Their reactions to my response have been refreshing.",
    "fullContent": "Nowadays, when other parents ask how I'm doing, they get the honest truth. Their reactions to my response have been refreshing.",
    "publishedAt": "2025-08-17T11:47:01.000Z",
    "fetchedAt": "2025-08-18T02:33:33.007Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2292cafc"
  },
  {
    "id": "nse-online-announcements-384d1864",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "IndoStar Capital Finance Limited",
    "url": "https://nsearchives.nseindia.com/corporate/INDOSTAR_17082025113246_Final.pdf",
    "summary": "IndoStar Capital Finance Limited has informed the Exchange about Appointment of Mr. Amit Kumar Khan as Chief Operating Officer |SUBJECT: Change in Management.",
    "fullContent": "IndoStar Capital Finance Limited has informed the Exchange about Appointment of Mr. Amit Kumar Khan as Chief Operating Officer |SUBJECT: Change in Management",
    "publishedAt": "2025-08-17T11:36:13.000Z",
    "fetchedAt": "2025-08-17T09:50:00.161Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "384d1864"
  }
]