[
  {
    "id": "marketwatch-31b79b72",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x2018;I&#x2019;m scared to lose&#x2019;: I have $140K in a 401(k) and earn $45K a year. Can I retire in 20 years?",
    "url": "https://www.marketwatch.com/story/im-scared-to-lose-too-much-in-risky-investments-i-have-140k-in-a-401-k-and-earn-45k-a-year-can-i-retire-in-20-years-239aaf81?mod=mw_rss_topstories",
    "summary": "&#x201c;My 401(k) retirement planner shows I&#x2019;ll likely be short $1,500 every month during my retirement.&#x201d;",
    "fullContent": "&#x201c;My 401(k) retirement planner shows I&#x2019;ll likely be short $1,500 every month during my retirement.&#x201d;",
    "publishedAt": "2025-08-04T22:44:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.492Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "31b79b72"
  },
  {
    "id": "fortune-169fc4f2",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Tech industry insiders share their picks for the next startups who will ride the IPO wave after Figma’s blockbuster debut",
    "url": "https://fortune.com/2025/08/04/figma-ipo-who-is-next-tech-industry-insiders-top-picks-startups-venture/",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:40:10.000Z",
    "fetchedAt": "2025-08-05T02:40:14.627Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "169fc4f2"
  },
  {
    "id": "the-verge-20932421",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/22997597/best-robot-vacuum-cleaner",
    "summary": "![CDATA[Robot vacuums are impressive devices that will clean your floors well and — thanks to bigger batteries and better robot brains — rarely get tired of doing their job. Over the last few years, they have gone from being utilitarian devices that sweep your floor to full-fledged home robots that",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:37:27.000Z",
    "fetchedAt": "2025-08-05T02:40:13.907Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "20932421"
  },
  {
    "id": "bloomberg-economics-a52c02",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/trump-administration-posts-guidance-on-reciprocal-tariff-rollout",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:33:51.000Z",
    "fetchedAt": "2025-08-05T02:40:12.335Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "a52c02"
  },
  {
    "id": "bloomberg-politics-a52c02",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/trump-administration-posts-guidance-on-reciprocal-tariff-rollout",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:33:51.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "a52c02"
  },
  {
    "id": "bloomberg-politics-3fc31396",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/trump-to-sign-order-creating-task-force-for-2028-olympics-in-la",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:33:40.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "3fc31396"
  },
  {
    "id": "wsj-world-news-2a9c0bf0",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Mexico&#x2019;s Drug Cartels Bedevil Sheinbaum&#x2019;s Dealmaking With Trump",
    "url": "https://www.wsj.com/world/americas/mexicos-drug-cartels-bedevil-sheinbaums-dealmaking-with-trump-80f46965",
    "summary": "The Mexican president wants to reach an agreement with the U.S. to further cooperate on security, but she has been undermined by the cartels&#x2019; pervasive influence.",
    "fullContent": "The Mexican president wants to reach an agreement with the U.S. to further cooperate on security, but she has been undermined by the cartels&#x2019; pervasive influence.",
    "publishedAt": "2025-08-04T22:33:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.898Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "2a9c0bf0"
  },
  {
    "id": "the-verge-48a4bf3",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/news/718692/ign-entertainment-layoffs-creators-guild-ziff-davis",
    "summary": "![CDATA[Ziff Davis-owned IGN Entertainment has laid off staff, including eight members of the IGN Creators Guild. Those cuts represent 12 percent of the bargaining unit. The layoffs are the latest shift in the turbulent gaming media landscape. Earlier this year, Verge parent company Vox Media sold",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:32:41.000Z",
    "fetchedAt": "2025-08-05T02:40:13.907Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "48a4bf3"
  },
  {
    "id": "business-insider-3d685999",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Companies are embracing a new hardcore culture. Here's what you should do.",
    "url": "https://www.businessinsider.com/companies-hardcore-era-employee-changes-att-memo-2025-8",
    "summary": "Companies like AT&T and Amazon have laid out new expectations. That means some employees and job seekers will need to shift their approach to work.",
    "fullContent": "Companies like AT&T and Amazon have laid out new expectations. That means some employees and job seekers will need to shift their approach to work.",
    "publishedAt": "2025-08-04T22:32:37.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3d685999"
  },
  {
    "id": "marketwatch-2c490bb2",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "&#x2018;She lives alone&#x2019;: My mother-in-law, 86, gets $1,300 in Social Security. Is that enough to live on?",
    "url": "https://www.marketwatch.com/story/she-lives-alone-my-mother-in-law-86-gets-1-300-in-social-security-is-that-enough-to-live-on-8c45dd3a?mod=mw_rss_topstories",
    "summary": "&#x201c;We provide housing for her and send her a couple of hundred dollars a month.&#x201d;",
    "fullContent": "&#x201c;We provide housing for her and send her a couple of hundred dollars a month.&#x201d;",
    "publishedAt": "2025-08-04T22:32:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.492Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2c490bb2"
  },
  {
    "id": "cnbc-tv18-youtube-23250829",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Bihar Weather Update: रेड अलर्ट जारी, बिहार में डेंजर सिग्नल ऑन| Rain | Monsoon 2025 #local18",
    "url": "https://www.youtube.com/watch?v=PFe5Lj9lqME",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:30:06.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "23250829"
  },
  {
    "id": "bloomberg-markets-725bb58e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/asian-stocks-poised-to-track-wall-street-rally-markets-wrap",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:29:13.000Z",
    "fetchedAt": "2025-08-05T02:40:11.876Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "725bb58e"
  },
  {
    "id": "bloomberg-markets-1d59970f",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/asian-stocks-poised-to-track-wall-street-rally-markets-wrap",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:29:13.000Z",
    "fetchedAt": "2025-08-05T04:57:57.241Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1d59970f"
  },
  {
    "id": "bloomberg-markets-5c1adaf4",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/asian-stocks-poised-to-track-wall-street-rally-markets-wrap",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:29:13.000Z",
    "fetchedAt": "2025-08-05T09:18:58.456Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5c1adaf4"
  },
  {
    "id": "bloomberg-markets-26db9f34",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/asian-stocks-poised-to-track-wall-street-rally-markets-wrap",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:29:13.000Z",
    "fetchedAt": "2025-08-05T10:26:07.860Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "26db9f34"
  },
  {
    "id": "bloomberg-markets-58f1a6f0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/asian-stocks-poised-to-track-wall-street-rally-markets-wrap",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:29:13.000Z",
    "fetchedAt": "2025-08-05T11:11:46.565Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "58f1a6f0"
  },
  {
    "id": "bloomberg-markets-7cb16fd0",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/cftc-explores-letting-futures-exchanges-trade-spot-crypto",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:25:12.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7cb16fd0"
  },
  {
    "id": "zerohedge-4ceb290c",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "VDH: Trump's Unknown Frontiers",
    "url": "https://www.zerohedge.com/political/vdh-trumps-unknown-frontiers",
    "summary": "VDH: Trump's Unknown Frontiers div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-summary field--label-hidden fi",
    "fullContent": "VDH: Trump's Unknown Frontiers Authored by Victor Davis Hanson via American Greatness, Donald Trump’s far-ranging counter-revolution, to quote the old Star Trek mission statement, seeks “To boldly go where no one has gone before.” Because no conservative president has dared to question the last 70 years of progressive cultural, social, economic, and political dominance, all traditional wisdom, all our renowned “experts,” and all the self-described “authorities” have no real credibility in their mostly flawed analyses and wrong prognoses. Read what our legacy media predicted in March for this summer’s economy, or in January for the future of the border, or what would happen should the U.S. Air Force enter Iranian airspace. Take the border. “Comprehensive immigration reform” (a euphemism for rolling amnesties and a still-open border) was the establishment’s answer to 10,000 foreign nationals storming the border during peak surges of the Biden administration. But no president had ever simultaneously: 1) pressured Mexico to close its borders and patrol ours, 2) announced a plan to complete a border wall along the entire US-Mexico boundary, 3) stopped catch-and-release, 4) ceased refugee applications after illegally entering the U.S., 5) introduced policies encouraging voluntary self-deportation, and 6) prevented all illegal entries at the border. The result is that we do not know the full effects of these combined border policies. So far, one million foreign nationals have lost jobs, and 2 million Americans have gained them since Trump’s inauguration. How much money will be saved in local, state, and federal entitlements if illegal immigrants return home? How much trauma and costs will be avoided if 500,000 criminal aliens are deported? How many serious and lethal hit-and-run accidents will be prevented? To what degree will the idea of citizenship be reenergized once it is not reduced to the equivalency of mere residence? How many emergency rooms will have more space for U.S. citizens? No one knows, but the consequences could be enormous. The U.S. has never applied so many tariffs in so many ways upon so many goods from so many countries. As a result, economists have sworn since March that we are headed to a recession, stock collapse, stagflation, and high unemployment. But do they really know the profit margins of our mercantile importers, who tariff our goods but expect easy entry for their exports to the U.S.? Can importers pay a 15% tariff, still make a handsome profit, and not raise costs excessively on the U.S. consumer? If trade surpluses do not matter and tariffs hurt those who implement them, why do sophisticated Europeans, adroit Japanese, and smart Chinese prefer surpluses and tariffs to our deficits and zero or low tariffs? Are they on to something? Do moderate tariffs encourage rather than retard American enterprise, on the theory that it will not be undercut by dumping and exchange manipulation and can also compete with far cheaper energy and transportation costs? No one really knows these answers because the U.S. has never tried the current policy in quite the present way before. We do know that the radical free trade and asymmetrical tariffs of the last half-century empowered China to world power status with a dangerous military and hollowed out the U.S. industrial interior. Is the $2 trillion budget deficit, as predicted, set in stone? Will the national debt only grow to unsustainable levels? However, federal agencies have never announced annual cuts of nearly $200 billion—along with a ten percent reduction in the budget deficit. Never has the government promised to deregulate and fast-track permits for construction, energy development, and manufacturing from 2-3 years to mere months. What will the financial results be? Interior Secretary Doug Burgum suggests that $15 trillion in new foreign investments are now promised. If accurate, what will such influxes do to employment? To federal revenues? To the economy in general? Is it possible that Treasury Secretary Scott Bessent could be right that $300 billion in federal income will come from new tariffs—if true, that might reduce the deficit by another 15 percent? What is the effect on the economy of cheaper energy costs when production is slated to rise without draining the strategic petroleum reserve on the eve of elections? No one has ever questioned universities before so systematically. We do know that student loan debt has spiraled to $1.7 trillion. Graduation rates have dropped to about 50-60 percent of those who enroll. The average student now takes six—not four—years to graduate. Today’s graduates, by all accounts, leave universities with fewer analytical skills, less language fluency, and reduced general knowledge than in past decades. Faculties have never been more weaponized, with 90-95 percent reportedly holding progressive views. If universities are taxed on their endowments, will that not force them to reconsider their efforts to maintain their non-profit status? Will 15 percent limits on overhead charges on federal grants force researchers to watch their budgets and universities to curb their bloated administrative legions? What is so wrong with curbing the tuition gouging and profiteering off foreign students, and limiting their numbers to ensure access to underserved, deserving Americans? Will the end of segregated dorms, safe spaces, and “affinity” graduations lead to more integration and assimilation than do the current tribal fixations on race and ethnicity? Historically, does tribalism or assimilation best serve a nation? Will meritocratic admissions improve student skills, rewarding those who study hard and encouraging those who do not to emulate those who do? Will minorities who are admitted under meritocratic criteria be seen as more or less qualified? Are far fewer administrators, more emphasis on instruction and less on politics, and more students from the heartland and fewer from communist China or the illiberal Middle East such bad things? In the last 50 years, affirmative action transmogrified into DEI racial separatism, chauvinism, and a system of reparatory spoils, played and manipulated by grifters, opportunists, and fakers, from Elizabeth Warren-style phonies and Jussie Smollett-like con artists to opportunists like Zohran Mamdani who game the system. Has any chauvinistic multiracial democracy—like Brazil or India—or any multiethnic or multireligious confederation—such as Lebanon, the former Yugoslavia, or Iraq—ever succeeded by prioritizing caste, race, religious sectarianism, or ethnic tribalism? Can any top-down imposed policy ever be successful when 70 percent of the electorate opposes it? Can any government that institutionalizes bias and preferences succeed while ignoring class in favor of race—without ever clearly defining which racial criteria justify the entire spoils system, or why? In our postmodern 21st-century system, no one knows exactly what will happen when race becomes incidental rather than essential. But we do know from history where we were headed under the current aberrant system. Abroad, in the last 30 years, NATO was voluntarily hollowed out—largely praised in the abstract by European grandees and shorted and ignored in the concrete by Euro budget technocrats. Yet since the days of the Cold War, NATO members had not met their defense expenditure promises. Now, most NATO members have met those commitments. Frontline NATO states like Sweden, Finland, and Poland are far better armed and prepared than legacy Western members like Belgium, Spain, or Italy. If there follows a rearmed and recommitted NATO, will not the world become a safer place? We were told for a half-century to steer clear of Iran, the supposed unhinged, lethal bully of the Middle East. Their henchmen blew up barracks and embassies, took and executed hostages, and sowed terror throughout the Middle East with their killer surrogates Hezbollah, Hamas, and the Houthis. But Iran had never really fought, much less won a war, since it pleaded with Saddam Hussein for an armistice from the catastrophic Iran-Iraq conflict. What will be the effect on the Middle East with a currently impotent Iran, an inert Hezbollah, and a subterranean Hamas in hiding? More importantly, what is the current regional role of Iran without a nuclear program, air defenses, a navy, or expeditionary terrorist forces? Again, no one knows. Finally, we have never seen anything quite so radical as the new Democratic Party, at least not since the McGovern blowout of 1972. In its 24/7, 360-degree fixation on hating Donald Trump and his MAGA agenda, rarely has a party embraced signature policies that are so despised by the American people. As a result, we have no idea what the result will be other than a national implosion at the polls. Why would any political party embrace open borders, the influx of 12 million illegal aliens, 600 sanctuary cities, biological men dominating women’s sports, dismantling the oil, gas, coal, and nuclear industries, prosecutors who release rather than indict and convict violent criminals, defunding the police, tribal fixations and racial spoils systems in defiance of the Supreme Court, the terrorists of Hamas over democratic Israel, and overt campus anti-Semitism? We are in the middle of a counter-revolution, whose fate will likely be decided in 15 months by the midterm elections and the status of the late 2026 economy. Structural changes across the economy, culture, and politics of the country are underway. Our bicoastal experts and authorities are mostly predicting a multifaceted systems failure—without explaining why or how. Yet the only constant in their predictions is that when and if they prove wrong, they will not pivot, correct, or apologize, but simply move on to their next flawed prognosis, fortified by their titles and letters after their names—but otherwise little else. Tyler Durden Mon, 08/04/2025 - 18:25",
    "publishedAt": "2025-08-04T22:25:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.179Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4ceb290c"
  },
  {
    "id": "fortune-380331dd",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Just 1% of health R&#038;D targets women. The Gates Foundation aims to change that with $2.5 billion push",
    "url": "https://fortune.com/2025/08/04/bill-gates-foundation-womens-healthcare-maternal-mortality/",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:24:16.000Z",
    "fetchedAt": "2025-08-05T02:40:14.627Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "380331dd"
  },
  {
    "id": "the-verge-7eb620a2",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/news/718639/gabe-newell-valve-superyacht-oceanco",
    "summary": "![CDATA[Valve founder Gabe Newell is setting out on a new adventure — and it doesn’t involve Half-Life 3. Instead, Newell is acquiring Oceanco, the yacht-building company that’s creating his $400 million super ship, as reported earlier by Boat International. In a post about the change, Oceanco says",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:16:25.000Z",
    "fetchedAt": "2025-08-05T02:40:13.907Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7eb620a2"
  },
  {
    "id": "cnbc-markets-7d3c061a",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Palantir tops $1 billion in revenue for the first time, boosts guidance",
    "url": "https://www.cnbc.com/2025/08/04/palantir-pltr-q2-earnings-2025.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:06:51.000Z",
    "fetchedAt": "2025-08-05T02:40:11.937Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d3c061a"
  },
  {
    "id": "business-insider-578df8b6",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Google mocks Apple's delayed AI features in new 'coming soon' ad",
    "url": "https://www.businessinsider.com/google-mocks-apple-intelligence-siri-delay-ai-pixel-10-ad-2025-8",
    "summary": "In a teaser for the Pixel 10, Google said that phone-buyers who wait &#34;a full year&#34; for a feature that's &#34;coming soon&#34; should change phones.",
    "fullContent": "In a teaser for the Pixel 10, Google said that phone-buyers who wait &#34;a full year&#34; for a feature that's &#34;coming soon&#34; should change phones.",
    "publishedAt": "2025-08-04T22:03:35.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "578df8b6"
  },
  {
    "id": "fortune-6fe30ca3",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Elon Musk retains title as the highest-paid CEO in history with $26 billion pay package—and the only thing he has to do is show up for two years",
    "url": "https://fortune.com/2025/08/04/elon-musk-pay-package-tesla-compensation/",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:02:55.000Z",
    "fetchedAt": "2025-08-05T02:40:14.627Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6fe30ca3"
  },
  {
    "id": "cnbc-markets-58f23333",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Amazon lays off more than 100 employees in Wondery unit as part of audio business restructuring",
    "url": "https://www.cnbc.com/2025/08/04/amazon-cuts-some-wondery-podcast-jobs-as-part-of-audio-business-reorg.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:02:18.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "58f23333"
  },
  {
    "id": "cnbc-tv18-youtube-2bc8afaa",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Shibu Soren को PM Modi की विनम्र श्रद्धांजलि...फूट-फूट कर रोए Hemant Soren | News18 India",
    "url": "https://www.youtube.com/watch?v=DMbD4dq6_M0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T22:00:11.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2bc8afaa"
  },
  {
    "id": "zerohedge-6dadf54",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Eric And Donald Trump Jr. To Help Launch New U.S. Manufacturing SPAC",
    "url": "https://www.zerohedge.com/political/eric-and-donald-trump-jr-help-launch-new-us-manufacturing-spac",
    "summary": "Eric And Donald Trump Jr. To Help Launch New U.S. Manufacturing SPAC div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-te",
    "fullContent": "Eric And Donald Trump Jr. To Help Launch New U.S. Manufacturing SPAC Donald Trump Jr. and Eric Trump are spearheading New America Acquisition I Corp., a special purpose acquisition company (SPAC) targeting a $300 million initial public offering on the New York Stock Exchange, according to a securities filing reported by The Wall Street Journal. The SPAC seeks to acquire businesses with a combined enterprise value of at least $700 million, prioritizing the revitalization of U.S. manufacturing and the strengthening of domestic supply chains. The filing highlights New America’s strategy to target companies that “play a pivotal role in rejuvenating domestic manufacturing, fostering innovation ecosystems, and securing critical supply chains.” The venture will be led by Kevin McGurn, a seasoned technology executive, with Kyle Wool serving as an adviser. The offering is underwritten by investment banks D. Boral Capital and Dominari Securities, the latter a subsidiary of the firm where Wool holds a leadership role. This marks the Trump brothers’ latest foray into the SPAC market, building on prior ventures. Last year, Trump Media & Technology Group, the parent of Truth Social, went public via a SPAC merger. More recently, GrabAGun, an online firearms retailer backed by 1789 Capital—where Donald Trump Jr. is a partner—also completed a SPAC deal. The move aligns with President Donald Trump’s “America First” policies, which emphasize reshoring critical supply chains from China to enhance U.S. economic and national security. The administration has implemented sweeping tariffs, including a 10% baseline on imports from all countries and rates up to 125% on Chinese goods, to make foreign products costlier and encourage domestic production. These measures, enacted under the International Emergency Economic Powers Act, aim to address trade imbalances and bolster U.S. manufacturing. In May, U.S. and Chinese negotiators reached a 90-day tariff truce in Geneva, easing trade tensions. The agreement reduced U.S. tariffs on Chinese goods from 145% to 30% and China’s duties from 125% to 10%, providing temporary relief to businesses navigating global trade disruptions. The tariff policies have drawn support from U.S. industries, particularly steel. Nucor Corp., a leading steel producer, endorsed the measures. “Nucor strongly commends the actions taken today by President Trump to reimpose tariffs on all steel imports,” said Leon Topalian, president and CEO of Nucor Corp. “America’s national security depends on a robust and healthy American steel industry, which continues to be harmed by massive global steel overcapacity and the resulting surge of illegally dumped and subsidized imports from around the world. \"Many of our trading partners have taken advantage of our open market for far too long and have intentionally circumvented our trade laws or allowed other bad actors to transship illegally dumped and subsidized steel,\" Topalian added. \"The President’s actions will help level the playing field for American steel producers and the more than 24,000 men and women who work in our industry.” Tyler Durden Mon, 08/04/2025 - 18:00",
    "publishedAt": "2025-08-04T22:00:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.179Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6dadf54"
  },
  {
    "id": "oil-price-21fdd015",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "The Green Hydrogen Hype Is Fading",
    "url": "https://oilprice.com/Energy/Energy-General/The-Green-Hydrogen-Hype-Is-Fading.html",
    "summary": "The green hydrogen drive is losing momentum as start-ups face rising costs and uncertain demand while energy majors back out of multi-billion-dollar projects as they return to their core oil and gas business. Low-emissions hydrogen, including the “green” variety produced with electrolysis using re",
    "fullContent": "The green hydrogen drive is losing momentum as start-ups face rising costs and uncertain demand while energy majors back out of multi-billion-dollar projects as they return to their core oil and gas business. Low-emissions hydrogen, including the “green” variety produced with electrolysis using renewable energy, remains a small portion of global hydrogen use, which currently is mostly of the type using fossil fuels to make. Despite the promises of zero emissions in green hydrogen use and the environmentally-friendly…",
    "publishedAt": "2025-08-04T22:00:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.976Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "21fdd015"
  },
  {
    "id": "nyt-business-75a09cb0",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Amazon Cuts 100 Wondery Jobs Amid Podcast Strategy Shift",
    "url": "https://www.nytimes.com/2025/08/04/business/media/amazon-wondery-podcasts-layoffs.html",
    "summary": "The tech giant is leaning more into video and the creator world.",
    "fullContent": "The tech giant is leaning more into video and the creator world.",
    "publishedAt": "2025-08-04T21:59:13.000Z",
    "fetchedAt": "2025-08-05T02:40:12.739Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "75a09cb0"
  },
  {
    "id": "cnbc-markets-241059bb",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Hims & Hers stock falls 10% on revenue miss",
    "url": "https://www.cnbc.com/2025/08/04/hims-hers-hims-q2-earnings-2025.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:54:05.000Z",
    "fetchedAt": "2025-08-05T02:40:11.937Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "241059bb"
  },
  {
    "id": "wsj-opinion-213a1cff",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Texas Reopens the Gerrymander Wars",
    "url": "https://www.wsj.com/opinion/texas-gerrymandering-house-seats-democrats-republicans-congress-f1514f89",
    "summary": "Congress could limit the mutual assured political destruction as partisans move to redistrict more than once a decade.",
    "fullContent": "Congress could limit the mutual assured political destruction as partisans move to redistrict more than once a decade.",
    "publishedAt": "2025-08-04T21:53:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.902Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "213a1cff"
  },
  {
    "id": "wsj-opinion-8d943ba",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "A Rebuke for George Mason",
    "url": "https://www.wsj.com/opinion/george-mason-university-board-of-visitors-gregory-washington-dei-3f151189",
    "summary": "The school&#x2019;s president keeps his job, for now, but the Board of Visitors votes to eliminate DEI programs.",
    "fullContent": "The school&#x2019;s president keeps his job, for now, but the Board of Visitors votes to eliminate DEI programs.",
    "publishedAt": "2025-08-04T21:49:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.902Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "8d943ba"
  },
  {
    "id": "wsj-opinion-53ad3f0a",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Discriminating Against DACA Students",
    "url": "https://www.wsj.com/opinion/daca-students-trump-education-department-office-for-civil-rights-immigration-2f22c90b",
    "summary": "The feds claim schools can&#x2019;t offer scholarships to the Dreamers.",
    "fullContent": "The feds claim schools can&#x2019;t offer scholarships to the Dreamers.",
    "publishedAt": "2025-08-04T21:46:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.902Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "53ad3f0a"
  },
  {
    "id": "bloomberg-markets-32ba9e6a",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/opinion-the-bls-blame-game-has-two-sides-video",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:42:19.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "32ba9e6a"
  },
  {
    "id": "wsj-opinion-8ba71d3",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "A School-Choice Test for Josh Shapiro and JB Pritzker",
    "url": "https://www.wsj.com/opinion/a-school-choice-test-for-josh-shapiro-and-jb-pritzker-education-students-bad7c25a",
    "summary": "Will they opt in to a new federal tax-credit program, helping parents, or opt out, pandering to unions?",
    "fullContent": "Will they opt in to a new federal tax-credit program, helping parents, or opt out, pandering to unions?",
    "publishedAt": "2025-08-04T21:42:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.902Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "8ba71d3"
  },
  {
    "id": "zerohedge-767d5581",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Dead? Or Just 'Mostly' Dead?",
    "url": "https://www.zerohedge.com/political/dead-or-just-mostly-dead",
    "summary": "Dead? Or Just 'Mostly' Dead? div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--type-text-with-summary field--label-hidden fiel",
    "fullContent": "Dead? Or Just 'Mostly' Dead? Authored by Madelynn McLaughlin via RealClearPolitics, Until recently, anyone who believed there was anything fishy about the U.S. organ donation system was labeled a conspiracy theorist. Yet now the old adage: “What’s the difference between conspiracy and truth? About six months,” rings true again, as so-called conspiracy theorists have been proven right by none other than the federal Health and Resources Services Administration (HRSA) itself. The “conspiracy?” That organ procurement organizations (OPOs) and hospitals declare living individuals dead in order to harvest their organs. The truth? In March 2025, the federal Health Resources and Services Administration reported in its investigation of a procurement organization called Network for Hope that there had been dozens of instances where organ retrieval was nearly begun despite the donors exhibiting signs of life. The investigation was started in response to the infamous case of T. J. Hoover. Hoover, a resident of Kentucky (which along with parts of Ohio and West Virginia is exclusively served by Network for Hope) had overdosed on drugs in October 2021 and been declared brain dead. His body was being prepped for organ retrieval when he regained consciousness on the operating table, banging his legs and crying. Thankfully, the process was halted, but not without significant pressure to continue by the OPO representative in the room, according to doctors who testified. Hoover’s story is apparently one among many. HRSA reviewed 351 donation-authorized cases and found that 73 patients showed neurological activity and at least 28 patients may not have been deceased when the procurement process began. These shocking revelations led to a hearing last week by the House Energy and Commerce Subcommittee on Oversight and Investigations. Dr. Raymond Lynch, chief of the organ transplant branch within HRSA, testified to Congress regarding the safety and efficiency of the organ donation process. Lynch admitted that the current method of operation has serious issues, but argued that the root cause is a system that grants a quasi-monopoly to individual procurement operators. Only a single contractor per region can service the OPTN, which is the federal Organ Procurement and Transplantation Network that connects donated organs with patients needing transplants. Over-reliance on the OPOs has impeded “meaningful government oversight,” according to Lynch. Members of both parties peppered Lynch with questions about the practices of OPOs and the OPTN. Rep. Diana DeGette, a Colorado Democrat, referenced a New York Times article revealing the growing use of “circulatory death,” which is defined as the irreversible cessation of circulatory and respiratory functions, even though in some cases circulatory death is reversible through proper resuscitation. Nonetheless, using this definition to determine the end of life allowed hospitals to harvest organs faster, leading to concerns about a grim conflict of interest. Compounding this issue is pressure from OPO representatives, who are required to be present for donation. DeGette asserted that doctors may look to OPO representatives as “experts” and feel pressured to certify death. While Lynch did not affirm DeGette’s concerns, he conceded that “increased emphasis on performance in any area of medicine is not an excuse for noncompliance.” Lynch stressed that it is possible that a “good faith” assessment of death could be wrong, and that often, doctors are doing their best in a difficult and fast-paced environment. Rep. Gary Palmer wasn’t having it. “There’s clearly things that happened that I think could count as euthanasia,” said the Alabama Republican. In response, Lynch stressed that the HRSA has a Corrective Action Plan (CAP) in place for OPOs and the OPTN, with its authority stemming from Congress. The renewed interest in Congress follows passage of the Securing the OPTN Act, signed into law by President Biden two years ago. This new law the OPTN turns a single-vendor system into a multiple-vendor system, meaning that multiple OPOs can now service the same region. It also establishes a separate OPTN board from any other contractors to ensure transparency, removes the $7 million HRSA funding cap and allocates more money for modernization, and requires a GAO review of the OPTN’s financial history. The HRSA created its CAP to better implement the terms of the act. The CAP lists several important reforms: Any staff member will be allowed to halt procedures due to safety concerns; the OPTN must now monitor and report safety-related halted donations; the HRSA now has authority to decertify OPOs not meeting its standards; and the Network for Hope and any other implicated OPO must implement minimum safety standards, better documentation, clearer donor eligibility criteria, and family communication plans within six months. While the reforms listed in the CAP are unquestionably needed, a big question remains: Will they truly solve the problem? It will be an uphill fight. The CAP doesn’t address the issue of ambiguous death certification, such as circulatory death. Nor does it address the institutional incentives that push OPOs to aggressively advocate for more organ donations. CAPs tend to focus more on metrics rather than ethical gray zones, meaning that the potential of harvesting the organs of live patients is still a possibility. What needs to change to ensure that what T. J. Hoover endured – or worse – never happens again? Those pushing for further reform believe that the Uniform Determination of Death Act should be further strengthened so that that hospitals in this country operate by uniform and widely accepted standards for certification of death. Independent third-party certification of death might be a brake on misplaced priorities. Finally, some believe that harvesting organs should not be allowed until all brain activity has ceased. Madelynn McLaughlin is an intern at RealClearPolitics. She graduated from Liberty University in 2025 with a degree in Government: Politics and Policy. Tyler Durden Mon, 08/04/2025 - 17:40",
    "publishedAt": "2025-08-04T21:40:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.180Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "767d5581"
  },
  {
    "id": "cnbc-tv18-youtube-5b7f0c2",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Iran Exposes Israeli Pilots: A Major Security Breach for Netanyahu | N18G",
    "url": "https://www.youtube.com/watch?v=xCVYvoVhHsg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:30:26.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5b7f0c2"
  },
  {
    "id": "bloomberg-politics-1b816e4b",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/uk-to-detain-small-boat-migrants-within-days-to-return-to-france",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:30:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1b816e4b"
  },
  {
    "id": "fortune-2e369239",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump&#8217;s &#8216;Queen of Hearts&#8217; moment with the BLS echoes Putin&#8217;s purges and Orwell&#8217;s omens",
    "url": "https://fortune.com/2025/08/04/why-did-donald-trump-fire-mcentarfer-bureau-labor-statistics/",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:29:15.000Z",
    "fetchedAt": "2025-08-05T02:40:14.627Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2e369239"
  },
  {
    "id": "bloomberg-politics-4426127a",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/bolsonaro-ordered-into-house-arrest-for-disobeying-brazil-court",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:28:52.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4426127a"
  },
  {
    "id": "bbc-business-1a6e2119",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "",
    "url": "https://www.bbc.com/news/articles/cly647wx9l3o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:28:49.000Z",
    "fetchedAt": "2025-08-05T02:40:14.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1a6e2119"
  },
  {
    "id": "bloomberg-markets-62a8dd2e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/texas-governor-orders-arrest-of-democrats-who-left-state-video",
    "summary": "![CDATA[Texas Governor Greg Abbott ordered the arrest of Democratic lawmakers who left the state to block a controversial vote on new congressional maps. “Texas House Democrats abandoned their duty to Texans,” Abbott said in a statement Monday. “I ordered the Texas Department of Public Safety to l",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:26:48.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "62a8dd2e"
  },
  {
    "id": "bloomberg-markets-6e719f63",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/corporate-bond-spreads-flashing-signs-of-complacency-ubs-says",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:21:48.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6e719f63"
  },
  {
    "id": "bloomberg-markets-61582f92",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/palantir-reports-sales-up-48-cites-astonishing-ai-impact",
    "summary": "![CDATA[Palantir Technologies Inc. reported a 48% increase in revenue for the second quarter to more than $1 billion, citing the “astonishing impact” of artificial technology on its business. The data software company also raised its revenue outlook for the full year to $4.14 billion to $4.15 bil",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:21:40.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "61582f92"
  },
  {
    "id": "zerohedge-1b645f01",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Tyson Foods Confirms Protein Switching Underway Amid Record High Beef Prices",
    "url": "https://www.zerohedge.com/food/tyson-foods-confirms-protein-switching-underway-amid-record-high-beef-prices",
    "summary": "Tyson Foods Confirms Protein Switching Underway Amid Record High Beef Prices div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field",
    "fullContent": "Tyson Foods Confirms Protein Switching Underway Amid Record High Beef Prices Mega meatpacker Tyson Foods surged 4% in early New York cash trading after posting a surprise quarterly profit and raising its full-year revenue forecast. A boom in chicken demand offset deepening losses in its struggling beef unit, as sky-high beef prices continue to push consumers toward cheaper alternatives. Tyson Foods reported third-quarter adjusted EPS of .91 cents, beating Goldman Sachs and consensus estimates of 85 cents and 78 cents, respectively. Revenue rose 3.6% year-over-year to $13.88 billion, also topping estimates of $13.61 billion (GS) and $13.50 billion (consensus), driven by strong performance in chicken, offsetting losses in the beef unit. Tyson Foods (TSN) 3Q Summary: Beat and Raised EPS Beat: Adj. EPS of $0.91 vs. GS/consensus of $0.85/$0.78 Revenue Beat: Sales rose +3.6% YoY to $13.88B, above GS/consensus of $13.61B/$13.50B Segment Performance: Strength in Chicken, Beef, Prepared Foods; Pork and International/Other underperformed Operating Income: Adj. op income of $505M beat GS/consensus of $501M/$462M Guidance Raised: FY25 Adj. Operating Income: Now $2.1B–$2.3B (up from $1.9B–$2.3B), led by chicken strength, partially offset by beef FY25 Net Sales Growth: Now +2–3% (prior: flat to +1%), above GS/consensus of 1.5%/1.2% \"Our third quarter results demonstrate the strength of our multi-protein, multi-channel portfolio and our relentless focus on operational excellence,\" said Donnie King, President & CEO of Tyson Foods. \"Delivering our fifth consecutive quarter of year-over-year growth across sales, adjusted operating income and adjusted earnings per share underscores the resilience of our business model. Looking ahead, we are confident in our ability to meet consumer needs, capitalize on protein demand and deliver long-term value to our shareholders.\" \"Chicken continues to provide support to the business as the company continues to face beef headwinds,\" analysts at brokerage Stephens wrote in a note to clients. Making sense of all this is simple: rising chicken demand alongside sliding beef demand is known as \"protein switching.\" This trend is driven by excessively high supermarket beef prices, prompting low- and middle-income consumers to seek cheaper alternatives like chicken and pork. This comes as the latest USDA cattle report shows America's cattle and calves herd population has fallen to 94.2 million, its lowest mid-year level since 1973. The nation's shrinking herd size has pushed USDA retail ground beef prices to record highs... Related: Ground Beef Prices Hit Another Record High Got Beef? 12-Year Cycle Signals \"Cyclical Low\" Cattle Herd Rebuild Begins Just As Consumers Get Slaughtered By Record Beef Prices . . . Tyler Durden Mon, 08/04/2025 - 17:20",
    "publishedAt": "2025-08-04T21:20:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.180Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1b645f01"
  },
  {
    "id": "yahoo-finance-43acc186",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Earnings live: Palantir stock pops on raised outlook, Hims & Hers tumbles",
    "url": "https://finance.yahoo.com/news/live/earnings-live-palantir-stock-pops-on-raised-outlook-hims--hers-tumbles-211017773.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:10:17.000Z",
    "fetchedAt": "2025-08-05T10:26:07.598Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "43acc186"
  },
  {
    "id": "techmeme-1dce119a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Figma's stock dropped 27.4% to $88.60 on Monday after last week's IPO pop; its fully diluted valuation now sits at ~$56B, still almost triple Adobe's 2022 offer (Jordan Novet/CNBC)",
    "url": "http://www.techmeme.com/250804/p32#a250804p32",
    "summary": "IMG",
    "fullContent": "Jordan Novet / CNBC: Figma's stock dropped 27.4% to $88.60 on Monday after last week's IPO pop; its fully diluted valuation now sits at ~$56B, still almost triple Adobe's 2022 offer — Figma shares dropped 27% on Monday, cutting into the gains the design software company posted after hitting the market last week. ]]",
    "publishedAt": "2025-08-04T21:10:01.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1dce119a"
  },
  {
    "id": "wsj-opinion-235af686",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "The Decline and Fall of NGOs",
    "url": "https://www.wsj.com/opinion/the-decline-and-fall-of-ngos-83117acf",
    "summary": "&#x2018;Civil society&#x2019; looked like the future when the Cold War ended. It doesn&#x2019;t anymore.",
    "fullContent": "&#x2018;Civil society&#x2019; looked like the future when the Cold War ended. It doesn&#x2019;t anymore.",
    "publishedAt": "2025-08-04T21:10:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.901Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "235af686"
  },
  {
    "id": "wsj-opinion-590310df",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Hamas Starves Jews and Palestinians, and Israel Gets Blamed",
    "url": "https://www.wsj.com/opinion/hamas-starves-jews-and-palestinians-and-israel-gets-blamed-36adcea3",
    "summary": "The Western press and politicians play along with the terror group&#x2019;s ghastly propaganda campaign.",
    "fullContent": "The Western press and politicians play along with the terror group&#x2019;s ghastly propaganda campaign.",
    "publishedAt": "2025-08-04T21:10:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.902Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "590310df"
  },
  {
    "id": "wsj-world-news-3625324",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | The Decline and Fall of NGOs",
    "url": "https://www.wsj.com/opinion/the-decline-and-fall-of-ngos-83117acf",
    "summary": "&#x2018;Civil society&#x2019; looked like the future when the Cold War ended. It doesn&#x2019;t anymore.",
    "fullContent": "&#x2018;Civil society&#x2019; looked like the future when the Cold War ended. It doesn&#x2019;t anymore.",
    "publishedAt": "2025-08-04T21:10:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.899Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "3625324"
  },
  {
    "id": "wsj-world-news-3d0408bd",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Hamas Starves Jews and Palestinians, and Israel Gets Blamed",
    "url": "https://www.wsj.com/opinion/hamas-starves-jews-and-palestinians-and-israel-gets-blamed-36adcea3",
    "summary": "The Western press and politicians play along with the terror group&#x2019;s ghastly propaganda campaign.",
    "fullContent": "The Western press and politicians play along with the terror group&#x2019;s ghastly propaganda campaign.",
    "publishedAt": "2025-08-04T21:10:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.899Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "3d0408bd"
  },
  {
    "id": "marketwatch-483c13b5",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "There&#x2019;s no sure cure for what ails the U.S. jobs report. Trump&#x2019;s BLS firing could make matters worse.",
    "url": "https://www.marketwatch.com/story/theres-no-sure-cure-for-what-ails-the-u-s-jobs-report-trumps-bls-firing-could-make-matters-worse-86573d3a?mod=mw_rss_topstories",
    "summary": "President Trump&#x2019;s pick to run the federal agency that produces the critical U.S. jobs report might not be able to make it more reliable &#x2014; and a new commissioner could even make the problems worse.",
    "fullContent": "President Trump&#x2019;s pick to run the federal agency that produces the critical U.S. jobs report might not be able to make it more reliable &#x2014; and a new commissioner could even make the problems worse.",
    "publishedAt": "2025-08-04T21:09:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.492Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "483c13b5"
  },
  {
    "id": "wsj-opinion-1799be92",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Trump&#x2019;s Science Reform Veers off Course",
    "url": "https://www.wsj.com/opinion/trumps-science-reform-veers-off-course-05c13909",
    "summary": "His started off strong with an attack on DEI, but he&#x2019;s now pursuing misguided priorities of his own.",
    "fullContent": "His started off strong with an attack on DEI, but he&#x2019;s now pursuing misguided priorities of his own.",
    "publishedAt": "2025-08-04T21:09:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.902Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "1799be92"
  },
  {
    "id": "wsj-opinion-21d02072",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Notable & Quotable: Politicization at Harvard",
    "url": "https://www.wsj.com/opinion/notable-quotable-politicization-at-harvard-84a4ca29",
    "summary": "&#x2018;Perhaps the greatest danger in exerting political pressure of this kind is the risk of sacrificing academic independence.&#x2019;",
    "fullContent": "&#x2018;Perhaps the greatest danger in exerting political pressure of this kind is the risk of sacrificing academic independence.&#x2019;",
    "publishedAt": "2025-08-04T21:08:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.902Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "21d02072"
  },
  {
    "id": "bloomberg-economics-7c21248c",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/how-tariffs-work-explained-who-pays-who-collects-and-more",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:07:24.000Z",
    "fetchedAt": "2025-08-05T02:40:12.335Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "7c21248c"
  },
  {
    "id": "techmeme-57ea33d1",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Source: Figma considered a higher IPO price, but its CEO wanted to bring on board certain long-term institutional shareholders and signed off on $33 per share (Anthony Hughes/Bloomberg)",
    "url": "http://www.techmeme.com/250804/p31#a250804p31",
    "summary": "A TITLE=\"T",
    "fullContent": "Anthony Hughes / Bloomberg: Source: Figma considered a higher IPO price, but its CEO wanted to bring on board certain long-term institutional shareholders and signed off on $33 per share — Figma Inc.'s record-breaking debut gains are cooling, but they have still handed a windfall to investors including the select institutions &hellip; ]]",
    "publishedAt": "2025-08-04T21:05:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "57ea33d1"
  },
  {
    "id": "wsj-world-news-623f9d7d",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Trump Administration to Require Bonds of Up to $15,000 for Travelers to Enter the U.S.",
    "url": "https://www.wsj.com/politics/policy/trump-administration-to-require-bonds-of-up-to-15-000-for-travelers-to-enter-the-u-s-9f778f7e",
    "summary": "The pilot program targets applicants for business and tourist visas from countries with high rates of overstays.",
    "fullContent": "The pilot program targets applicants for business and tourist visas from countries with high rates of overstays.",
    "publishedAt": "2025-08-04T21:04:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.898Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "623f9d7d"
  },
  {
    "id": "bloomberg-politics-5a350617",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/features/2025-08-04/why-russia-plotted-to-kill-the-rheinmetall-ceo-arming-ukraine",
    "summary": "Armin Papperger runs a German defense company arming Ukraine. The efforts have brought the weapons supplier unprecedented riches, and put a target on his back.]]",
    "fullContent": "Armin Papperger runs a German defense company arming Ukraine. The efforts have brought the weapons supplier unprecedented riches, and put a target on his back.]]",
    "publishedAt": "2025-08-04T21:00:27.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5a350617"
  },
  {
    "id": "cnbc-tv18-youtube-53990bcd",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Flood News : राजौरी में नदी उफनाई,1 व्यक्ति लापता | Jammu Kashmir | Top News | N18V",
    "url": "https://www.youtube.com/watch?v=8CODstcEa18",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T21:00:08.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "53990bcd"
  },
  {
    "id": "zerohedge-101cf0e8",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "District Attorney's Office Announces Largest Gun Trafficking Case In County History",
    "url": "https://www.zerohedge.com/political/district-attorneys-office-announces-largest-gun-trafficking-case-county-history",
    "summary": "District Attorney's Office Announces Largest Gun Trafficking Case In County History div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body",
    "fullContent": "District Attorney's Office Announces Largest Gun Trafficking Case In County History Authored by Oliver Mantyk via The Epoch Times (emphasis ours), On Aug. 1, District Attorney David Hoovler gave a press conference along with other politicians and members of law enforcement on the success of the largest gun trafficking case in county history. Confiscated guns and narcotics on display at a press conference in Goshen, N.Y., regarding Operation Powder Burn on Aug. 1, 2025. Oliver Mantyk/The Epoch Times The operation, dubbed Operation Powder Burn, focused on taking down an illegal gun and narcotics trafficking ring based in Newburgh. The operation resulted in firearm, narcotics, and conspiracy charges against 20 individuals. Their ages range from 22 to 60, and they live mainly in New York, with some in Pennsylvania and Georgia. The severity of the charges range from probation to 15 to 30 years in prison. Ten of the individuals being charged are bail-eligible. The trafficking revolved around an “Iron Pipeline,” a gun trafficking route moving guns between states with differing gun laws. Most of the guns were shipped from Georgia or Pennsylvania via FedEx, where they were allegedly received by the investigation’s main focus, Christopher Brown, a 40-year-old resident of Newburgh. He operated out of a closed restaurant in Newburgh called The Kitchen, allegedly selling narcotics and firearms in and outside of the city. Investigations into Brown and people connected to him started in December 2024. What began as a small narcotics investigation by the OC Drug Task Force, over the course of eight months, turned into the largest gun trafficking bust by volume of firearms involved. Undercover officers bought a total of 55 firearms and 700 grams of cocaine and fentanyl from Brown. The $69,000 used to make these purchases was provided by the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF). The ATF also provided other resources and personnel for the investigation. The individuals were arrested on July 30, which was dubbed “Takedown Day.” The decision to end the investigation came after law enforcement intercepted messages indicating that Brown and his associates were planning on robbing and doing potential harm to the undercover officers. Takedown Day involved more than 20 law enforcement agencies and 300 officers in New York, Georgia, and Pennsylvania. The day ended with 19 of the 20 persons of interest in the hands of law enforcement. On Takedown Day, 12 illegal firearms, 4 ounces of fentanyl, 0.5 kilograms of cocaine, and $65,000 were confiscated. A large amount of synthetic marijuana was also taken by law enforcement. No officers were injured in the eight-month operation. Operation Powder Burn ended with the recovery of a total of 67 illegal guns and 1.5 kilos of cocaine and fentanyl. The guns trafficked were mostly handguns, but shotguns, rifles, and other larger firearms were also trafficked. The collection included several 3D-printed guns and a Glock handgun modified to be fully automatic. That is the only known automatic weapon among the confiscated guns. The guns and narcotics were on display at the conference. Several of the confiscated firearms are allegedly linked to shootings, including seven shootings in New York and Vermont. Hoovler said at the conference, “There is enough fentanyl here on this table to kill 190,000 residents of Orange County. The 20 people on the boards to my immediate left are nothing more than merchants of death.” Hoovler also wanted people to be clear that this case wasn’t about gun enthusiasts or other law-abiding gun owners; it was about people bringing guns to OC as part of the illegal drug trade. Orange County Sheriff Paul Arteta said in a press release, “These weren’t isolated offenses; they were part of a coordinated effort to profit off addiction and violence. Our teams, including the Special Operations Group and Drug Task Force, worked with precision and persistence to shut this network down. I’m proud of the role the Sheriff’s Office played in this historic case, and we remain committed to pursuing those who threaten the safety and stability of our communities.” A poster outlining the alleged connections between suspects involved in a firearms trafficking bust called Operation Powder Burn at a press conference in Goshen, N.Y., on Aug. 1, 2025. Oliver Mantyk/The Epoch Times Tyler Durden Mon, 08/04/2025 - 17:00",
    "publishedAt": "2025-08-04T21:00:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.180Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "101cf0e8"
  },
  {
    "id": "oil-price-40f4a324",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Big Oil’s Trading Arms Struggle to Navigate Trump-Era Volatility",
    "url": "https://oilprice.com/Energy/Energy-General/Big-Oils-Trading-Arms-Struggle-to-Navigate-Trump-Era-Volatility.html",
    "summary": "Over the past decade, scores of Big Oil companies have set up separate trading divisions that frequently rake in billions in profits that help pad their bottom lines whenever oil and gas prices fall. In fact, the oil majors typically handle more barrels than leading commodity traders such as Vitol,",
    "fullContent": "Over the past decade, scores of Big Oil companies have set up separate trading divisions that frequently rake in billions in profits that help pad their bottom lines whenever oil and gas prices fall. In fact, the oil majors typically handle more barrels than leading commodity traders such as Vitol, Trafigura, Glencore and Mercuria, according to Bloomberg. These companies usually view high volatility in the markets as a blessing, allowing them to make big bets and generate outsized profits. To wit, giant commodity traders generated record…",
    "publishedAt": "2025-08-04T21:00:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.976Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "40f4a324"
  },
  {
    "id": "nyt-business-3b5d3f73",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "‘Clash of Trades’ Reality Show Aims to Boost Prestige of US Manufacturing",
    "url": "https://www.nytimes.com/2025/08/04/business/clash-of-trades-manufacturing.html",
    "summary": "This reality show is short on scandal, betrayal and tears, and has an unusual aim: Elevating U.S. manufacturing.",
    "fullContent": "This reality show is short on scandal, betrayal and tears, and has an unusual aim: Elevating U.S. manufacturing.",
    "publishedAt": "2025-08-04T20:54:55.000Z",
    "fetchedAt": "2025-08-05T02:40:12.739Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b5d3f73"
  },
  {
    "id": "ft-technology-55455c5",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "",
    "url": "https://www.ft.com/content/d2f8e180-2b27-48ef-9d70-2d156733d25f",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:54:38.000Z",
    "fetchedAt": "2025-08-05T02:40:13.268Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "55455c5"
  },
  {
    "id": "the-verge-30da85c3",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/tech/718546/amazon-kindle-paperwhite-scribe-colorsoft-signature-edition-deal-sale",
    "summary": "![CDATA[A Kindle lets you carry an entire bookshelf while on the go, which is why almost every year we recommend the e-reader in our guides to the best back to school essentials. With a new semester just around the corner, it’s no surprise Best Buy is currently offering the latest versions of some",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:51:13.000Z",
    "fetchedAt": "2025-08-05T02:40:13.908Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "30da85c3"
  },
  {
    "id": "business-insider-7cac79f7",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Photos show how Meghan Markle's style has evolved over the years",
    "url": "https://www.businessinsider.com/meghan-markle-style-fashion",
    "summary": "Meghan Markle's fashion has transformed since she was an actor and senior royal. Here's a look at the Duchess of Sussex's outfits over the years.",
    "fullContent": "Meghan Markle's fashion has transformed since she was an actor and senior royal. Here's a look at the Duchess of Sussex's outfits over the years.",
    "publishedAt": "2025-08-04T20:50:24.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7cac79f7"
  },
  {
    "id": "techmeme-6eba1fab",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Google says Big Sleep, its vulnerability research tool \"powered by Gemini\", found 20 flaws in various popular open-source software projects (Lorenzo Franceschi-Bicchierai/TechCrunch)",
    "url": "http://www.techmeme.com/250804/p30#a250804p30",
    "summary": "A TITLE=\"Techmeme",
    "fullContent": "Lorenzo Franceschi-Bicchierai / TechCrunch: Google says Big Sleep, its vulnerability research tool \"powered by Gemini\", found 20 flaws in various popular open-source software projects — Google's AI-powered bug hunter has just reported its first batch of security vulnerabilities. — Heather Adkins, Google's vice president &hellip; ]]",
    "publishedAt": "2025-08-04T20:50:01.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6eba1fab"
  },
  {
    "id": "bloomberg-business-youtube-55850a5e",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Apple CEO: AI Is ‘Ours to Grab,' Generac Boosts Outlook | Bloomberg Businessweek Daily 8/04/2025",
    "url": "https://www.youtube.com/watch?v=cAOh0lv2RY4",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:50:00.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "55850a5e"
  },
  {
    "id": "bloomberg-markets-4072e32e",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/women-are-making-up-larger-share-of-vc-decision-makers-video",
    "summary": "![CDATA[Efforts to bring gender parity to the venture capital ecosystem are ahead of schedule, says Paige Buckner, CEO of All Raise, a nonprofit supporting women and non-binary people in the VC ecosystem. Buckner discusses All Raise's latest report with Bloomberg’s Caroline Hyde. (Source: Bloomberg",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:48:22.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4072e32e"
  },
  {
    "id": "wsj-markets-main-4a537193",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Dow Bounces Back From Last Week&#x2019;s Slump",
    "url": "https://www.wsj.com/finance/stocks/customurl-global-stocks-markets-dow-news-08-04-2025-f5e6f21b?mod=rss_markets_main",
    "summary": "Stocks turned in their best day since May following a weak jobs report Friday. The Dow industrials gained 585 points, or 1.3%, while the Nasdaq added 2%.",
    "fullContent": "Stocks turned in their best day since May following a weak jobs report Friday. The Dow industrials gained 585 points, or 1.3%, while the Nasdaq added 2%.",
    "publishedAt": "2025-08-04T20:46:00.000Z",
    "fetchedAt": "2025-08-05T02:40:12.096Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4a537193"
  },
  {
    "id": "marketwatch-763de01f",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Trump&#x2019;s budget law could widen the deficit by $718 billion more than previously estimated. Here&#x2019;s why.",
    "url": "https://www.marketwatch.com/story/trumps-budget-law-could-widen-the-deficit-by-718-billion-more-than-previously-estimated-heres-why-523d28db?mod=mw_rss_topstories",
    "summary": "Higher borrowing costs are driving up an estimate of the impact to the U.S. budget deficit from President Donald Trump&#x2019;s sprawling budget law, according to an analysis from the Congressional Budget Office.",
    "fullContent": "Higher borrowing costs are driving up an estimate of the impact to the U.S. budget deficit from President Donald Trump&#x2019;s sprawling budget law, according to an analysis from the Congressional Budget Office.",
    "publishedAt": "2025-08-04T20:46:00.000Z",
    "fetchedAt": "2025-08-05T02:40:14.492Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "763de01f"
  },
  {
    "id": "zerohedge-915caf7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Russian Nuclear Submarine Base Damaged By Tsunami, Satellite Images Reveal",
    "url": "https://www.zerohedge.com/geopolitical/russian-nuclear-submarine-base-damaged-tsunami-satellite-images-reveal",
    "summary": "Russian Nuclear Submarine Base Damaged By Tsunami, Satellite Images Reveal div property=\"schema:text\" class=\"clearfix text-formatted field field--name-body field--t",
    "fullContent": "Russian Nuclear Submarine Base Damaged By Tsunami, Satellite Images Reveal Last week's widely reported underwater earthquake off the coast of Russia's Kamchatka Peninsula (on July 30) resulted in a tsunami which appears to have impacted the Rybachiy naval base, newly published satellite images show. Crucially the Rybachiy base is Russia's primary hub for nuclear submarines in the Pacific, and so was bound to feel some level of impact from an earthquake measuring 8.8 in magnitude which erupted just 140km away. International reports say that when the earthquake struck, two Yasen-class nuclear-powered attack submarines were observed docked at the base - and in the path of the tsunami; however, there's as yet no evidence of damage to the vessels themselves. Watch the visual comparison below: Instead, some of the base infrastructure has been observed as suffering damage, according to satellite imagery analysis featured in The Telegraph. \"A section of one pier has bent away from its original position, possibly indicating that it was detached from its moorings, images taken by the Umbra Space satellite on Thursday morning have revealed,\" the report says. \"It does not appear that a submarine was moored alongside at the time of impact and experts said damage to the structure alone would have little military significance,\" it adds, before concluding: \"However, questions were raised about whether the tsunami caused any further harm to the base, which was thought to have been hit within 15 minutes of the earthquake.\" The before and after satellite images featured by The Telegraph: In the aftermath last week, pictures and videos widely circulated online showing significant damage to buildings and other infrastructure, amid flooding, at various locations in Kamchatka, particularly at Pacific ports and harbors. Adding to worries about the area, the Klyuchevskaya Sopka volcano on the peninsula had also erupted. Images showed that tsunami waves flooded an area in Severo-Kurilsk, Sakhalin Region, Russia: Via Reuters According to The War Zone, \"Russia has been moving in recent years to replace all of its remaining Soviet-era Delta class SSBNs with Borei types. The Delta III class submarine Ryazan, also known by its hull number K-44, appears to still be present at Rybachiy based on available satellite imagery, but whether it is actually operational or not is unclear.\" Tyler Durden Mon, 08/04/2025 - 16:40",
    "publishedAt": "2025-08-04T20:40:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.180Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "915caf7"
  },
  {
    "id": "bloomberg-politics-68bceff8",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/epstein-victims-express-disgust-and-fear-at-handling-of-files",
    "summary": "![CDATA[A pair of Jeffrey Epstein’s victims blasted the Trump administration and the Justice Department for their attempts to unseal grand jury testimony in the criminal case against the late financier, saying government officials haven’t listened to the voices of people who were harmed by his acti",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:39:15.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "68bceff8"
  },
  {
    "id": "bloomberg-business-youtube-3c672ff0",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Wall Street Rallies as S&P 500 Jumps 1.5% | Closing Bell",
    "url": "https://www.youtube.com/watch?v=HlZhxnqUzNU",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:38:55.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3c672ff0"
  },
  {
    "id": "bloomberg-markets-6196a1d6",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/palantir-price-is-a-cause-for-pause-analyst-luria-warns-video",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:35:37.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6196a1d6"
  },
  {
    "id": "bloomberg-politics-7439aef1",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-04/setting-the-odds-for-congress-avoiding-a-shutdown",
    "summary": "![CDATA[This is Washington Edition, the newsletter about money, power and politics in the nation’s capital. Every Monday, Bloomberg Intelligence senior analyst Nathan Dean gives his insights into what’s been happening and what’s coming up in the nooks and crannies of government and markets. Sign u",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:31:57.000Z",
    "fetchedAt": "2025-08-05T02:40:13.149Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "7439aef1"
  },
  {
    "id": "cnbc-markets-1bfd95c0",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Contentious July jobs report confirms the U.S. economy is slowing sharply. Here’s why",
    "url": "https://www.cnbc.com/2025/08/04/contentious-july-jobs-report-confirms-the-us-economy-is-slowing-sharply.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:30:48.000Z",
    "fetchedAt": "2025-08-05T02:40:11.937Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1bfd95c0"
  },
  {
    "id": "cnbc-economy-1bfd95c0",
    "sourceId": "cnbc-economy",
    "sourceName": "CNBC Economy",
    "title": "Contentious July jobs report confirms the U.S. economy is slowing sharply. Here’s why",
    "url": "https://www.cnbc.com/2025/08/04/contentious-july-jobs-report-confirms-the-us-economy-is-slowing-sharply.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:30:48.000Z",
    "fetchedAt": "2025-08-05T02:40:13.059Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "1bfd95c0"
  },
  {
    "id": "cnbc-tv18-youtube-2a7b2974",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "Delhi Rain: NCR में कल इतनी जगहों पर होगी बारिश, IMD ने जारी किया पूर्वानुमान| Weather #local18",
    "url": "https://www.youtube.com/watch?v=QNL15Gdxlx8",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:30:09.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2a7b2974"
  },
  {
    "id": "bloomberg-markets-41e3f7dd",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/articles/2025-08-04/andersons-buys-remaining-marathon-jv-stake-for-425-million",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:30:02.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "41e3f7dd"
  },
  {
    "id": "zerohedge-6d613c47",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "'Cowardice & Dereliction Of Duty' - Texas Governor Orders Arrest Of Fleeing Democratic Lawmakers",
    "url": "https://www.zerohedge.com/political/texas-democrat-lawmakers-flee-state-block-gop-house-map-overhaul",
    "summary": "'Cowardice & Dereliction Of Duty' - Texas Governor Orders Arrest Of Fleeing Democratic Lawmakers div property=\"schema:text\" class=\"clearfix text-formatted field",
    "fullContent": "'Cowardice & Dereliction Of Duty' - Texas Governor Orders Arrest Of Fleeing Democratic Lawmakers Update (1630ET): Promises made, promises kept... Texas Governor Greg Abbott ordered the arrest of Democratic lawmakers who left the state to block a controversial vote on new congressional maps. “Texas House Democrats abandoned their duty to Texans,” Abbott said in a statement Monday. “I ordered the Texas Department of Public Safety to locate, arrest, and return to the House chamber any member who has abandoned their duty to Texans.” Texas Attorney General Ken Paxton, who is running for the Republican nomination for US Senate, said he supported the speedy arrest of “jet-setting runaways” who left the state during the legislative session. “This is cowardice and dereliction of duty, and they should face the full force of the law without apology,” Paxton said in a tweet. ...and cue the lawsuits. * * * Absconding to -- where else -- Chicago, Democratic members of the Texas House of Representatives fled the state on Sunday to break a quorum and prevent a vote on a redistricting plan that promises to boost the GOP's share of seats in the US House of Representatives by five. In response, Gov. Greg Abbott threatened to remove them from office, replace them, and pursue felony charges against them, using extradition powers if need be. Texas state Rep. Jolanda “Jo” Jones (D) flips through maps during a public hearing Friday on congressional redistricting in Austin. (Eric Gay/AP) Their choice of exile location is positively drenched in hypocrisy, as Illinois arguably has the worst gerrymandering in America -- to Democrats' benefit, of course. In 2024, Democrats won 53% of the popular vote in Illinois House races, but took 82% of the seats (14 out of 17). This is the map Illinois Democrats drew. But I guess it’s a safe haven from gerrymandering now. https://t.co/isJazY56hQ pic.twitter.com/ozb6cMilcl — Dr. Rich McCormick for Congress (@RichforGA) August 3, 2025 A quorum is the minimum number of lawmakers present in order to conduct legislative business - a tactic they've used twice before in the 22 years since Republicans have controlled all of Texas state government (efforts which ultimately failed). The Democrats plan to stay away for two weeks to run the clock on a special legislative session called by Gov. Greg Abbott (R) in order to draw the new map. By state law, the Texas House can only conduct business when two-thirds of its 150 members are present, meaning at least 51 of the state's 62 Democrats will stay away. So far, 57 have fled the state, according to State Rep. Jon Rosenthal (D), with members fleeing to Chicago, Boston and New York. All plan to remain out of the state until Aug. 19, when the special session concludes. \"Our goal right now is to kill this session,\" said Rosenthal. Abbott said if the Democrats don't return by 3pm on Monday, he will invoke a Texas attorney general opinion and \"remove the missing Democrats from membership in the Texas House,\" and then pick their successors under power granted in the state constitution. Upping the ante, Abbott said many of the fleeing Democrats may have committed felonies, as they're soliciting donations to cover fines they face under Texas House rules -- arguing that they risk bribery charges for accepting money \"to assist in the violation of legislative duties.\" To bring them to justice, he said \"I will use my full extradition authority to demand the return to Texas of any potential out-of-state felons.\" Texas AG Ken Paxton (R), meanwhile, has threatened to arrest lawmakers who break quorum, though he won't have jurisdiction over them outside of the state. The governor of gerrymandered Illinois is lecturing about gerrymandering and praising obstructionist TX Democrats who fled their state, and his state is now harboring: \"This is a righteous act of courage!\" pic.twitter.com/7mOiZv4cAR — Western Lensman (@WesternLensman) August 4, 2025 Democrats dismissed the threats. “As the Texas Supreme Court has acknowledged, it is the right of legislators to deny quorum,\" State Rep. Chris Turner told the Dallas Morning News. \"And as Governor Abbott should know, we also have separation of powers in this country.” \"Today this corruption ends,\" said state Rep. Gene Wu, chairman of the Democratic caucus in his chamber, at a Chicago presser at a county Democratic Party office attended by other Texas Democrats and Illinois Gov. JB Pritzker. “This is not a decision we make lightly, but it is one we make with absolute moral clarity. Governor Abbott...is using an intentionally racist map to steal the voices of millions of Black and Latino Texans, all to execute a corrupt political deal. Apathy is complicity, and we will not be complicit in the silencing of hard-working communities who have spent decades fighting for the power that Trump wants to steal.” Wu also accused Gov. Greg Abbott of making \"hostages\" out of the victims of last month's terrible floods in Kerrville, since the voting on the redistricting initiative was placed ahead of handling bills that would deliver financial aid to affected communities. The map has been swiftly advancing during the special legislative session that Abbott convened in July to handle the redistricting and flood response, among many other issues. Texans deserve better! I won’t help pass a racist map drawn by Donald Trump and Washington D.C. to silence the voices of Texans. #txlege #redistricting pic.twitter.com/BjLe6BTpqL — Rep Ramón (@RepRamonRomero) August 3, 2025 That said, Wu admitted he didn't know what Texas Democrats would do if Abbott calls another special session after this one. \"We don’t know what the next steps are,\" he said. Texas House Democrats are screened before boarding their flight to Chicago on Sunday (Bob Daemmrich for The Texas Tribune) Republican leaders say the new map is a necessary correction, noting that the state’s population growth has warranted mid-decade changes. But Democrats contend the proposal is a blatant partisan power grab, part of a broader Republican effort in several states to shore up congressional majorities before what is expected to be a volatile midterm season. Texas Republicans currently control 25 of the state’s 38 congressional seats; the new map would likely give them 30, all of which Mr. Trump carried by at least 10 percentage points in 2024. The GOP holds a narrow 219-212 majority in the U.S. House, with four vacancies, and party leaders see Texas as central to preserving their legislative agenda. Before the map was unveiled, President Trump said he favored “a very simple redrawing” that would give Republicans more seats. “We pick up five seats [in Texas] but we have a couple other states where we’ll pick up seats also,” he said last month. Texas state Representative Todd Hunter, a Republican and sponsor of the legislation, called the proposal “a good plan for Texas” and said, “The primary changes … are focused on five districts for partisan purposes.” DNC Chair Ken Martin - of the party that continually floats packing the Supreme Court when they don't get their way - said, “Republicans thought they could just rig the maps and change the rules without the American people taking notice. They were dead wrong.” Former Attorney General Eric Holder said Sunday on ABC that Democrats might “have to do things that perhaps in the past I would not have supported” in response to the Texas plan. “I think we need to respond in kind,” said Gov. Laura Kelly of Kansas, and chair of the Democratic Governors Association. The new Texas map, unveiled last week under pressure from Trump and Abbott, was approved by a legislative committee on Saturday and was expected to reach the House floor on Tuesday. In a separate development that could have profound implications for redistricting battles across America, the US Supreme Court last week said it will consider the constitutionality of redistricting that's intentionally aimed at creating \"majority-minority districts\" with the goal securing power for blacks and Hispanics. In that Louisiana case filed by self-described \"non-African American voters,\" claiming a violation of the Equal Protection Clause, the high court said it will examine whether that kind of redistricting violates the 14th or 15th Amendments to the US Constitution. In April 2024, a federal panel of judges in the US District Court for the Western District of Louisiana ruled that purposefully creating a majority-black district was \"an impermissible racial gerrymander in violation of the Equal Protection Clause of the Fourteenth Amendment.” The 15th Amendment bars governments from denying or abridging the right to vote based on race or color. Tyler Durden Mon, 08/04/2025 - 16:30",
    "publishedAt": "2025-08-04T20:30:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.181Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6d613c47"
  },
  {
    "id": "bloomberg-markets-5fdae47",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/generac-hits-dec-high-after-ebitda-margin-outlook-boost-video",
    "summary": "![CDATA[Analysts raised price targets for Generac Holdings Inc. since the company reported earnings on July 30, according to data compiled by Bloomberg. Generac CEO Aaron Jagdfeld says the United States needs to be strategic with tariffs, and the AI boom is creating growth within their energy prod",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:29:08.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5fdae47"
  },
  {
    "id": "bbc-business-4397dcb5",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "",
    "url": "https://www.bbc.com/news/articles/c9wyp2kk1e5o?at_medium=RSS&amp;at_campaign=rss",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:28:09.000Z",
    "fetchedAt": "2025-08-05T02:40:14.415Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4397dcb5"
  },
  {
    "id": "bloomberg-markets-75c0fc02",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "",
    "url": "https://www.bloomberg.com/news/videos/2025-08-04/wall-street-rallies-as-s-p-500-jumps-1-5-closing-bell-video",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:27:08.000Z",
    "fetchedAt": "2025-08-05T02:40:11.877Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "75c0fc02"
  },
  {
    "id": "the-verge-3db3b321",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/reviews/691319/best-switch-2-cases",
    "summary": "![CDATA[You might find it kind of sad to put a hard-earned gadget into a protective case. To me, it’s freeing. Using a case relieves me of the worry that it will accumulate tons of little scratches. So, I wasted no time testing cases on the new Nintendo Switch 2, and it didn’t take long for [&#8230",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:26:31.000Z",
    "fetchedAt": "2025-08-05T02:40:13.907Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "3db3b321"
  },
  {
    "id": "techmeme-4a1a2b66",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Palantir reports Q2 revenue up 48% YoY to $1B, vs. $940M expected, and boosts full-year outlook guidance to ~$4.15B, up from ~$3.90B; PLTR up 4%+ after hours (Samantha Subin/CNBC)",
    "url": "http://www.techmeme.com/250804/p29#a250804p29",
    "summary": "IMG WIDTH=11 HEIGHT=12 S",
    "fullContent": "Samantha Subin / CNBC: Palantir reports Q2 revenue up 48% YoY to $1B, vs. $940M expected, and boosts full-year outlook guidance to ~$4.15B, up from ~$3.90B; PLTR up 4%+ after hours — Palantir topped Wall Street's estimates Monday, surpassing $1 billion in quarterly revenue for the first time, and hiking its full-year guidance. ]]",
    "publishedAt": "2025-08-04T20:25:02.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4a1a2b66"
  },
  {
    "id": "fortune-7fc50b1",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Michael Saylor’s Strategy makes its third-largest Bitcoin purchase ever",
    "url": "https://fortune.com/crypto/2025/08/04/michael-saylor-strategy-bitcoin-buy-third-largest/",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:22:23.000Z",
    "fetchedAt": "2025-08-05T02:40:14.627Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7fc50b1"
  },
  {
    "id": "cnbc-markets-34446b36",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Noted Tesla analyst Adam Jonas moving into new role at Morgan Stanley",
    "url": "https://www.cnbc.com/2025/08/04/noted-tesla-analyst-adam-jonas-moving-into-new-role-at-morgan-stanley.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:22:18.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "34446b36"
  },
  {
    "id": "zerohedge-7d2579f2",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Suspicious Minds",
    "url": "https://www.zerohedge.com/geopolitical/suspicious-minds",
    "summary": "Suspicious Minds",
    "fullContent": "Suspicious Minds Authored by James Howard Kunstler, \"It was a coup, and I'm using that term literally ... One egregious felony after another.\" - Stephen Miller America is tired of being driven insane, of having absurdities crammed into our collective consciousness. Reality is an agreement about what is going on in the world. That act of faith requires such an agreement be based on what is demonstrably true. Without it, society dissolves into chaos and failure. The RussiaGate psychodrama is about an agreement based on lies. It started with Hillary Clinton’s desperate ploy to save her foundering 2016 election campaign. Her emails somehow got sent to Wikileaks, a radical news org dedicated to revealing government secrets, implicating misconduct. It was easy to declare the Russians did it, by hacking — when it was much more likely, in fact, proven by a forensic audit, that a Clinton campaign insider downloaded the info on a thumb drive, perhaps one Seth Rich, found murdered on a DC sidewalk soon thereafter. Every lie after that met the kind of skepticism among the public that generates heat, controversy, scandal, and fire. Hillary managed to enlist President Barack Obama and his executive agencies into her project, and the party apparatus with it, because the Clinton Victory Fund had paid the DNC’s debts and took over its management. Soon, the Russia collusion project grew into a gigantic scaffold of flaming lies. The big newspapers and the TV news networks bought the story, and came along for the ride. They were all sure Hillary would win the 2016 election. All the heat and fire would get flushed away. The polls all said so. The agencies and the parties would pick up and go on as before, run the show, make careers, get wealthy, be important! They miscalculated. They lost. But they decided to keep building the scaffold of lies in order to protect themselves from the danger it represented — because they lived in that scaffold, it was the party’s house. And the scaffold of lies needed massive fortification. The house that the party lived in had to be protected at all costs, or they would all be cast out, homeless, a whole party on street, lost, broke, ruined, dying, like the pitiful tweakers bent over out on Kensington Avenue in Philly, in every Democrat-run city, really. And so, they undermined the winner of the election at every turn, worked furiously to drive him from office, made a plague happen, subverted the 2020 election, and spent four years under a fake president jamming absurdities into the public arena, turning it into a freak show, one drag-queen story hour after another, from sea to shining sea. All to defeat the return of a public consensus about reality based on what is demonstrably true — starting with the fact that there are men and there are women, and that the primary interaction between them keeps society going by producing offspring. This enormous, drawn-out insurrection, composed of serial felony crimes, amounts to the greatest insult against the republic — the res publica, in Latin, the public thing — in the nation’s history. And now it is coming apart as an overwhelming majority of citizens, including now many Democrats, can’t avoid discovering what has happened in the country. Because lies are weak and the truth is sturdy and eventually truth prevails, even after an arduous struggle. The old news media complex, the networks and the papers, are not reporting the recent disclosures by the Directors of the CIA, the FBI, and National Intel. What will it take to get their attention? Arrests and perp-walks of formerly important officials? And then, do they acknowledge and atone for their disgraceful participation in the events? Or pretend they couldn’t figure any of it out for years and years? Poor us, we didn’t know! Suddenly, it looks like many of these “legacy” news outfits are going out-of-business. They’re throwing their performers over the side like sinking ships casting off so much useless ballast. You knew this was coming, right? Now, here you are: the hour that consequence finally returns from its wanderings in a wilderness of institutional failure. There’s no evading it anymore. The scaffold of lies has collapsed, and trying to add additional lies will amount to throwing a few twigs on a heap of smoldering wreckage. The institutions themselves are under new management, and they show every sign of returning to regular operation, doing what they were designed to do in the first place: deliver a truthful account of what has happened and determine a just consequence for the people who made it happen. It’s going to happen, and then we can rebuild a coherent public consensus about what is really real, who we really are, and where we go from here. Tyler Durden Mon, 08/04/2025 - 16:20",
    "publishedAt": "2025-08-04T20:20:00.000Z",
    "fetchedAt": "2025-08-05T02:40:13.181Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7d2579f2"
  },
  {
    "id": "yahoo-finance-3b0797bf",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Palantir stock surges after company reports first billion-dollar quarter",
    "url": "https://finance.yahoo.com/news/palantir-stock-surges-after-company-reports-first-billion-dollar-quarter-201043179.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:10:43.000Z",
    "fetchedAt": "2025-08-05T09:18:57.587Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b0797bf"
  },
  {
    "id": "the-verge-779d8bcd",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "",
    "url": "https://www.theverge.com/22371561/best-4k-tv-deals-sale-lg-samsung-sony-tcl",
    "summary": "![CDATA[Things are looking bright for those who want to nab a great TV in 2025 at a substantial discount. There’s usually a great deal happening on a mid- or high-end TV from LG, Sony, TCL, Hisense, or Amazon’s own Fire TV brand — even if the biggest discounts remain reserved for Black Friday, Cybe",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:04:54.000Z",
    "fetchedAt": "2025-08-05T02:40:13.908Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "779d8bcd"
  },
  {
    "id": "cnbc-markets-2c912c10",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Figma's stock sinks 27% after last week's IPO pop",
    "url": "https://www.cnbc.com/2025/08/04/figmas-stock-sinks-after-last-weeks-post-ipo-surge.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:04:38.000Z",
    "fetchedAt": "2025-08-05T02:40:11.937Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2c912c10"
  },
  {
    "id": "bloomberg-business-youtube-4c6a74ae",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Will #AI make flying easier or harder?",
    "url": "https://www.youtube.com/shorts/0vQDLy-5dbg",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:03:00.000Z",
    "fetchedAt": "2025-08-05T02:40:24.989Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "4c6a74ae"
  },
  {
    "id": "cnbc-markets-205234ee",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Shares of American Eagle surge 20% after Trump calls Sydney Sweeney campaign 'hottest ad out there'",
    "url": "https://www.cnbc.com/2025/08/04/american-eagle-aeo-stock-sydney-sweeney-trump.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:02:47.000Z",
    "fetchedAt": "2025-08-05T02:40:11.938Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "205234ee"
  },
  {
    "id": "cnbc-business-205234ee",
    "sourceId": "cnbc-business",
    "sourceName": "CNBC Business",
    "title": "Shares of American Eagle surge 20% after Trump calls Sydney Sweeney campaign 'hottest ad out there'",
    "url": "https://www.cnbc.com/2025/08/04/american-eagle-aeo-stock-sydney-sweeney-trump.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:02:47.000Z",
    "fetchedAt": "2025-08-05T02:40:13.065Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "205234ee"
  },
  {
    "id": "cnbc-tv18-youtube-27c243ab",
    "sourceId": "cnbc-tv18-youtube",
    "sourceName": "CNBC TV18 YouTube",
    "title": "पहली बार... PM Modi को सुरक्षा देगी अफसर बिटिया, जानिए कौन हैं इंस्‍पेक्‍टर Adaso kapesa? | N18V",
    "url": "https://www.youtube.com/watch?v=gDnIS14r5Js",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-04T20:00:25.000Z",
    "fetchedAt": "2025-08-05T02:40:18.697Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "27c243ab"
  },
  {
    "id": "business-insider-1e10a2bb",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Procurement leaders talk about how AI is changing the way they plan, report, and solve problems",
    "url": "https://www.businessinsider.com/ai-procurement-data-innovation-supply-chain-leaders-virtual-event-2025-8",
    "summary": "Industry experts from Amazon Business, Bristol Myers Squibb, and SMBC Americas discuss AI-driven procurement strategies at BI's virtual event.",
    "fullContent": "Industry experts from Amazon Business, Bristol Myers Squibb, and SMBC Americas discuss AI-driven procurement strategies at BI's virtual event.",
    "publishedAt": "2025-08-04T19:59:59.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1e10a2bb"
  },
  {
    "id": "business-insider-74b58350",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I tried making boxed brownies in 3 different appliances to find the best method — my air fryer has potential",
    "url": "https://www.businessinsider.com/making-boxed-brownies-different-methods-oven-air-fryer-microwave-winner",
    "summary": "I made batches of chocolatey brownies in my oven, air fryer, and microwave to see which appliance produced the results with the best texture.",
    "fullContent": "I made batches of chocolatey brownies in my oven, air fryer, and microwave to see which appliance produced the results with the best texture.",
    "publishedAt": "2025-08-04T19:55:56.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "74b58350"
  },
  {
    "id": "techmeme-4c522bf4",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Google unveils Kaggle Game Arena, a benchmarking platform where AI models compete head-to-head in strategic games, starting with a chess tournament this week (Mike Wheatley/SiliconANGLE)",
    "url": "http://www.techmeme.com/250804/p28#a250804p28",
    "summary": "A HREF=\"http://www.techmeme.com/250804/p28#a250804p28",
    "fullContent": "Mike Wheatley / SiliconANGLE: Google unveils Kaggle Game Arena, a benchmarking platform where AI models compete head-to-head in strategic games, starting with a chess tournament this week — The world's top performing artificial intelligence models, including OpenAI's o3 and 04-mini, Google LLC's Gemini 2.5 Pro and Gemini 2.5 Flash &hellip; ]]",
    "publishedAt": "2025-08-04T19:55:02.000Z",
    "fetchedAt": "2025-08-05T02:40:14.332Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4c522bf4"
  },
  {
    "id": "business-insider-7e3f0096",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I was born and raised in Toronto. Here are the 8 mistakes I always see tourists make when they visit.",
    "url": "https://www.businessinsider.com/toronto-things-to-never-do-there-canada-according-to-local",
    "summary": "I see first-time visitors to Toronto, Canada, repeat a lot of the same mistakes, like only visiting in summer and missing out on seasonal events.",
    "fullContent": "I see first-time visitors to Toronto, Canada, repeat a lot of the same mistakes, like only visiting in summer and missing out on seasonal events.",
    "publishedAt": "2025-08-04T19:52:16.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7e3f0096"
  },
  {
    "id": "business-insider-663ca2bb",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "A possible iPhone 17 spotting in the wild is yet another reminder that cameras are everywhere",
    "url": "https://www.businessinsider.com/apple-iphone-17-possible-photo-in-wild-reminder-cameras-everywhere-2025-8",
    "summary": "More than 15 years after Apple's famous iPhone 4 leak, a possible iPhone 17 test unit photo has sparked excitement among Apple fans.",
    "fullContent": "More than 15 years after Apple's famous iPhone 4 leak, a possible iPhone 17 test unit photo has sparked excitement among Apple fans.",
    "publishedAt": "2025-08-04T19:50:29.000Z",
    "fetchedAt": "2025-08-05T02:40:12.329Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "663ca2bb"
  },
  {
    "id": "nyt-business-36ce9f7b",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Switzerland Rushes to Give Trump ‘More Attractive’ Offer to Cut Tariffs",
    "url": "https://www.nytimes.com/2025/08/04/business/switzerland-tariffs-trump.html",
    "summary": "The Swiss government said it had “no indication” the country would be hit with a 39 percent tariff, which is set to take effect this week.",
    "fullContent": "The Swiss government said it had “no indication” the country would be hit with a 39 percent tariff, which is set to take effect this week.",
    "publishedAt": "2025-08-04T19:49:45.000Z",
    "fetchedAt": "2025-08-05T02:40:12.739Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "36ce9f7b"
  }
]