[
  {
    "id": "nse-online-announcements-7f9ece29",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "The Andhra Pradesh Mineral Development Corporation Limited",
    "url": "https://nsearchives.nseindia.com/corporate/APMDC_09082025001931_INTIMATION.pdf",
    "summary": "Disclosure under Regulation 57(4) |SUBJECT: Disclosure under Regulation 57(4)",
    "fullContent": "Disclosure under Regulation 57(4) |SUBJECT: Disclosure under Regulation 57(4)",
    "publishedAt": "2025-08-09T00:20:57.000Z",
    "fetchedAt": "2025-08-09T02:35:23.644Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "7f9ece29"
  },
  {
    "id": "techmeme-4f838f9e",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: Periodic Labs, which is building AI for material science, is raising $200M led by a16z, valuing the company at $1B before the investment (Kate Clark/Bloomberg)",
    "url": "http://www.techmeme.com/250808/p28#a250808p28",
    "summary": "Kate Clark / Bloomberg: Sources: Periodic Labs, which is building AI for material science, is raising $200M led by a16z, valuing the company at $1B before the investment — Venture firm Andreessen Horowitz has agreed to lead a $200 million investment in Periodic Labs, a new...",
    "fullContent": "Kate Clark / Bloomberg: Sources: Periodic Labs, which is building AI for material science, is raising $200M led by a16z, valuing the company at $1B before the investment — Venture firm Andreessen Horowitz has agreed to lead a $200 million investment in Periodic Labs, a new startup building artificial intelligence &hellip;",
    "publishedAt": "2025-08-09T00:15:02.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4f838f9e"
  },
  {
    "id": "bloomberg-business-youtube-3ced8077",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "President Trump Confirms Meeting With Putin | Balance of Power: Late Edition 8/08/2025",
    "url": "https://www.youtube.com/watch?v=tJiGIchnLhA",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T00:06:04.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "3ced8077"
  },
  {
    "id": "nse-online-announcements-33324721",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "AU Small Finance Bank Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SUMIT1_08082025235722_Submisson_AGM_Proceedings.pdf",
    "summary": "AU Small Finance Bank Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "AU Small Finance Bank Limited has informed the Exchange regarding Proceedings of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-09T00:05:04.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "33324721"
  },
  {
    "id": "techmeme-4157231a",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Capacity, which uses AI to automate contact center support, raised $92.6M, including a $42.6M Series D and $50M in debt, bringing its total raised to $155M+ (Kay Aloha Villamor/The SaaS News)",
    "url": "http://www.techmeme.com/250808/p27#a250808p27",
    "summary": "Kay Aloha Villamor / The SaaS News: Capacity, which uses AI to automate contact center support, raised $92.6M, including a $42.6M Series D and $50M in debt, bringing its total raised to $155M+ — Capacity, a St.",
    "fullContent": "Kay Aloha Villamor / The SaaS News: Capacity, which uses AI to automate contact center support, raised $92.6M, including a $42.6M Series D and $50M in debt, bringing its total raised to $155M+ — Capacity, a St. Louis, Missouri-based AI-powered support automation platform for contact centers, has raised over $92.6 million in funding &hellip;",
    "publishedAt": "2025-08-09T00:05:02.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4157231a"
  },
  {
    "id": "zerohedge-186d72e9",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Doug Casey Responds To The Toughest Questions Facing Libertarians & Anarcho-Capitalists",
    "url": "https://www.zerohedge.com/political/doug-casey-responds-toughest-questions-facing-libertarians-anarcho-capitalists",
    "summary": "Doug Casey Responds To The Toughest Questions Facing Libertarians & Anarcho-Capitalists Via InternationalMan.com, International Man: Today, we’ll explore some of the most common criticisms of libertarianism and anarcho-capitalism. Imagine two tribes.",
    "fullContent": "Doug Casey Responds To The Toughest Questions Facing Libertarians & Anarcho-Capitalists Via InternationalMan.com, International Man: Today, we’ll explore some of the most common criticisms of libertarianism and anarcho-capitalism. Imagine two tribes. One is cohesive and tightly knit. The other promotes hyper-individualism. Which is likely to win in a conflict? Doug Casey: There’s nothing wrong with forming cohesive groups. Humans have always been tribal because it’s conducive to survival. Many hands make light work. And specialization and division of labor—which is critical for progress—is only possible with a group. The problem is whether the group is voluntary or coercive in nature. And you’re right. In a war, the tribe structured like a military unit has some advantages over a loose group of rugged individualists. But its only advantage is in war, which is something to be avoided at almost any cost. Why, then, do humans usually default to collectivism instead of libertarianism? Unfortunately, the institution of the family, which is the foundation of society, inadvertently sets a bad example. That’s because the family—by its very nature—is authoritarian and socialistic. The parents call the shots and provide free food and shelter, while the kids get into the habit early of having things provided for them. They give according to their ability and receive according to their needs, a Marxist ideal. So perhaps the family, which is a good thing, paradoxically gets people off on the wrong foot. Worse, in the real world, the arguments for liberty and individualism are all intellectual. They’re logical, they make sense—but most people don’t reason. The average person doesn’t live in an intellectual world; he lives in an emotional world. He acts according to what he feels, not what he thinks. He does what feels right without thinking about the consequences—even the immediate and direct ones, let alone the indirect and delayed ones. Reason is often used to justify emotions. Those are two major reasons—and there are lots of others—why socialism has more appeal than capitalism, not to mention libertarianism and anarcho-capitalism. The socialistic habits we learn with the family are reinforced by emotions, feelings, and, oftentimes, irrational assumptions. Unlike libertarianism, socialism promises something for nothing, the prospect of automatic security, and a perpetual free lunch. Socialism sounds better to those who haven’t got critical thinking skills. That’s a real problem, and a cause for pessimism about the future of humanity. The problem is compounded by the nature of politics, which brings out the worst in people. When you’re trying to influence “the masses,” emotion works 100 times better than reason. Worse yet, the people who are drawn to politics want power and want to manipulate others. Politics naturally attracts criminal personalities. It’s almost genetically guaranteed that individualists, AnCaps, and libertarians have the odds stacked against them. International Man: How, then, do you respond to critics who argue that libertarianism and anarcho-capitalism are impractical, utopian fantasies? Doug Casey: Well, you can look at this from two points of view—the practical and the moral. In primitive times, it was possible for a central power to dictate how much food would cost, how much laborers would be paid, and what the rules were in every area of life. It was counterproductive, but it was possible because things were very simple, unlike today’s world, with billions of people and trillions of transactions taking place every day. However, central authorities and socialism are at odds with a technological society. Collectivism is unworkable on any scale larger than a family, as the Soviets and the Maoists proved. It turned out that, in the real world, communism was the utopian fantasy. More importantly, any system other than radical libertarianism is immoral. I won’t discuss property rights at length here, but suffice it to say that your primary possession is your own body. And why should anybody else have a right to tell you what you must or must not do with your own body? That includes how you use it, what you ingest, what you think, what you say, and how you use your other possessions. Every person is a sovereign being. Unfortunately, humans’ innate character flaws and ingrained psychological tendencies cause them to do self-destructive things like trying to replicate the family on a giant scale, by creating the institution of the State. International Man: How do you respond to those who argue that libertarianism and anarcho-capitalism are, at best, irrelevant? And at worst, tools used by powerful interests to atomize individuals, making them easier to control and dominate? Doug Casey: Politicians are disinclined to treat people as individuals. They try to control and dominate by forcing individuals to become parts of a collective. Some say libertarianism is irrelevant because so few people understand its principles. And even if they do understand them, they don’t put them into effect. But libertarianism cyclically expands and contracts. For instance, the reason that America was unique in world history is that it was the first country ever founded on the principles of libertarianism. And those principles are responsible for its immense success. But over America’s history, sometimes those principles grow, and sometimes they fade. Libertarianism is basically a belief in the non-aggression principle and the limiting of force. Anarcho-capitalism goes beyond libertarianism because it doesn’t believe in the existence of the State as an entity, as an institution. And 50 years ago, the term “anarcho-capitalism” didn’t even exist. Now it’s widely discussed. The president of Argentina is an anarcho-capitalist, and the country is being radically transformed. Speaking as an Ancap myself, I’d like to see not just 200, but eight billion sovereign nations in the world. The key is to develop institutions and accepted ways of thinking that emphasize cooperation, not coercion, in everything. International Man: Many libertarians and anarcho-capitalists argue that fully privatizing all property would effectively solve the migrant and border issue. Critics, however, say this vision is unrealistic and not a serious solution, claiming it ultimately serves as cover for open-border advocacy and worsens the situation in practice. How do you respond to that criticism? Doug Casey: Moving the U.S. toward pure libertarianism—anarcho-capitalism—is by far the best solution to the border issue. Much better than walls and border guards checking to see if “your papers are in order.” If 100% of the U.S. were privately owned, with no exceptions, it would be up to the owner of that property to decide whether any given person or group could use it or trespass on it. The real problem is the welfare systems of the U.S. In the 19th century, there was immense immigration to the U.S. But there was zero government support. Arrivals were immediately responsible for feeding, clothing, and housing themselves—or they would, frankly, starve. Immigrants knew that. As a result, the U.S. drew the best and most enterprising people. Today, however, migrants are quite aware of the immense welfare systems available at the local, State, and national levels, in addition to what’s provided by NGOs, which are basically maintained with tax dollars, directly or indirectly. There are networks that actively facilitate the travel and upkeep of the migrants. If welfare were abolished, we wouldn’t draw these kinds of people. The argument can be made that George Soros might use his billions to purposely import them to property that he owns. But there they would have to stay; it’s a straw man argument. Without a government to support them, migrants would be discouraged. Of course, they could steal for a living. But thieves could expect to be treated harshly, perhaps with extreme prejudice. Ultimately, you can’t keep people from coming or going. And why should you? Groups have migrated throughout world history. But the best way to maintain stability is with 100% private property, not a reliance on political gimmicks. Politicians can be corrupted and bribed. In fact, that’s why many get into politics. Ancaps rely on the market, not politicos, bureaucrats, and storm troopers, to maintain stability. International Man: Libertarianism and anarcho-capitalism emphasize individual liberty and voluntary exchange, but critics argue they offer little guidance on deeper ethical or moral responsibilities beyond the non-aggression principle. How do you see these philosophies addressing complicated questions of ethics and morality in real-world situations? Doug Casey: Ancaps don’t intend to address issues of ethics and morality. Those things are settled by religion and philosophy. Libertarianism and ancapism are mainly concerned with how society can best protect itself from the initiation of force and fraud. It doesn’t really matter what philosophy or religion individuals are partial to, as long as they don’t initiate violence against each other. Remember, there are just two rules: Do all that you say you’re going to do, and don’t impinge upon other people or their property. With only two laws, you don’t need a legislature. And ignorance of the law is truly no excuse. Beyond that, you can believe or do whatever you’d like. The fact of the matter is that birds of a feather naturally flock together. People form into groups based on whatever is important to them. For some, it’s their race. For some, it’s their religion. For some, it’s their way of thinking. None of that matters as long as they don’t aggress against other individuals or other groups. There’s much more to be said about these things. I urge you to read “The Market for Liberty.” It’s a very short book. But one that can totally change how you see the world. * * * Economic turmoil isn’t a question of if—but when. Most will panic. The prepared will not only survive but come out ahead. We’ve put together a free special report revealing practical steps to protect your assets, secure your lifestyle, and uncover opportunities that emerge when the system breaks down. Download your Guide to Surviving and Thriving During an Economic Collapse now—free of charge. Tyler Durden Fri, 08/08/2025 - 20:05",
    "publishedAt": "2025-08-09T00:05:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.986Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "186d72e9"
  },
  {
    "id": "ndtv-profit-youtube-56f0508e",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Israel Gaza News | Israel Announces Plan To Retake Gaza City In Another Escalation Of The War",
    "url": "https://www.youtube.com/watch?v=iSr-bhCVkpM",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T00:03:33.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "56f0508e"
  },
  {
    "id": "yahoo-finance-19e367c",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Spending for Executive Protection Is on the Rise",
    "url": "https://www.barrons.com/articles/spending-for-executive-protection-is-on-the-rise-359c4fa7?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-09T00:02:00.000Z",
    "fetchedAt": "2025-08-10T09:42:18.261Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19e367c"
  },
  {
    "id": "nse-online-announcements-1a9e1ef1",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Reliance Infrastructure Limited",
    "url": "https://nsearchives.nseindia.com/corporate/RELINFRA_09082025000023_Rinfravotingresults08082025.pdf",
    "summary": "Reliance Infrastructure Limited has informed the Exchange regarding voting results of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting.",
    "fullContent": "Reliance Infrastructure Limited has informed the Exchange regarding voting results of Annual General Meeting held on August 08, 2025 |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-09T00:00:50.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "1a9e1ef1"
  },
  {
    "id": "bloomberg-politics-274d6278",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Indigenous Group Wins Land Claim Over Slice of Metro Vancouver",
    "url": "https://www.bloomberg.com/news/articles/2025-08-09/indigenous-group-wins-land-claim-over-slice-of-metro-vancouver",
    "summary": "An Indigenous group won claim to hundreds of acres of metropolitan Vancouver after a years-long trial and landmark judgment at British Columbia’s supreme court.",
    "fullContent": "An Indigenous group won claim to hundreds of acres of metropolitan Vancouver after a years-long trial and landmark judgment at British Columbia’s supreme court.",
    "publishedAt": "2025-08-09T00:00:46.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "274d6278"
  },
  {
    "id": "nse-online-announcements-5d4d341b",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Reliance Power Limited",
    "url": "https://nsearchives.nseindia.com/corporate/RPOWER_08082025235942_Rpower_Letter_to_SE_Voting_Results_AGM_2025.pdf",
    "summary": "Reliance Power Limited has submitted the Exchange a copy Srutinizers report of Annual General Meeting held on August 08, 2025. Further, the company has informed the Exchange regarding voting results. |SUBJECT: Shareholders meeting.",
    "fullContent": "Reliance Power Limited has submitted the Exchange a copy Srutinizers report of Annual General Meeting held on August 08, 2025. Further, the company has informed the Exchange regarding voting results. |SUBJECT: Shareholders meeting",
    "publishedAt": "2025-08-09T00:00:38.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "5d4d341b"
  },
  {
    "id": "nse-online-announcements-69c4ed6c",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Shera Energy Limited",
    "url": "https://nsearchives.nseindia.com/corporate/SHERA_08082025235952_Recording.pdf",
    "summary": "Shera Energy Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates.",
    "fullContent": "Shera Energy Limited has informed the Exchange about Link of Recording |SUBJECT: Analysts/Institutional Investor Meet/Con. Call Updates",
    "publishedAt": "2025-08-09T00:00:24.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "69c4ed6c"
  },
  {
    "id": "scmp-business-7a66e78e",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "Hong Kong needs ‘targeted law’ to tackle AI deepfake porn: Bar Association chief",
    "url": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3321257/hong-kong-needs-targeted-law-tackle-ai-deepfake-porn-bar-association-chief?utm_source=rss_feed",
    "summary": "Hong Kong should enact a “targeted law” to tackle the problem of AI-generated deepfake pornography instead of relying on legal tools designed to catch other mischief, the head of the city’s professional body for barristers has said.",
    "fullContent": "Hong Kong should enact a “targeted law” to tackle the problem of AI-generated deepfake pornography instead of relying on legal tools designed to catch other mischief, the head of the city’s professional body for barristers has said. In an interview with the Post on Thursday, Senior Counsel Jose-Antonio Maurellet, chairman of the Hong Kong Bar Association, also expressed confidence that such legislative efforts could be done “very quickly” if the government had the will to tackle the issue. The...",
    "publishedAt": "2025-08-09T00:00:08.000Z",
    "fetchedAt": "2025-08-09T02:26:38.886Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7a66e78e"
  },
  {
    "id": "nse-online-announcements-4a4eb187",
    "sourceId": "nse-online-announcements",
    "sourceName": "NSE Online Announcements",
    "title": "Godrej Seeds & Genetics Limited",
    "url": "https://nsearchives.nseindia.com/corporate/GODREJSEEDS_08082025235956_NSEBMOUTCOME08082025RESULTSFINAL.pdf",
    "summary": "Financial Results Updates |SUBJECT: Financial Results Updates.",
    "fullContent": "Financial Results Updates |SUBJECT: Financial Results Updates",
    "publishedAt": "2025-08-09T00:00:07.000Z",
    "fetchedAt": "2025-08-09T02:35:23.646Z",
    "category": "filings",
    "tags": [
      "filings"
    ],
    "priority": "normal",
    "contentHash": "4a4eb187"
  },
  {
    "id": "fortune-f6af774",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump crypto firm plans launch of public company that will hold family token",
    "url": "https://fortune.com/crypto/2025/08/08/donald-trump-world-liberty-financial-digital-asset-treasury-public-company/",
    "summary": "World Liberty Financial’s latest project would mimic other public firms that have amassed Bitcoin in hopes of boosting their share price.",
    "fullContent": "World Liberty Financial’s latest project would mimic other public firms that have amassed Bitcoin in hopes of boosting their share price.",
    "publishedAt": "2025-08-08T23:57:26.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "f6af774"
  },
  {
    "id": "business-insider-7cfa7f95",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Trump is burning through IRS heads at a rate of almost 1 a month. Here's who's held the job, and why they left.",
    "url": "https://www.businessinsider.com/trump-irs-commissioner-turnover-who-why-they-left-2025-8",
    "summary": "President Donald Trump's pick for IRS commissioner is moving on. Here's who else has had the job this year and why they left.",
    "fullContent": "President Donald Trump's pick for IRS commissioner is moving on. Here's who else has had the job this year and why they left.",
    "publishedAt": "2025-08-08T23:56:17.000Z",
    "fetchedAt": "2025-08-09T02:26:36.309Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7cfa7f95"
  },
  {
    "id": "bbc-business-3b34ba5a",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Beloved by bands and bank robbers, the Ford Transit turns 60",
    "url": "https://www.bbc.com/news/articles/c0j97xegz5no?at_medium=RSS&amp;at_campaign=rss",
    "summary": "The world's best-selling van has been in production since 1965.",
    "fullContent": "The world's best-selling van has been in production since 1965.",
    "publishedAt": "2025-08-08T23:50:21.000Z",
    "fetchedAt": "2025-08-09T09:42:11.378Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3b34ba5a"
  },
  {
    "id": "bloomberg-markets-782342cf",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Colombian Inflation Unexpectedly Speeds Up In Setback for Petro",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombian-inflation-unexpectedly-speeds-up-in-setback-for-petro",
    "summary": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "fullContent": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "publishedAt": "2025-08-08T23:49:46.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "782342cf"
  },
  {
    "id": "bloomberg-economics-782342cf",
    "sourceId": "bloomberg-economics",
    "sourceName": "Bloomberg Economics",
    "title": "Colombian Inflation Unexpectedly Speeds Up In Setback for Petro",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombian-inflation-unexpectedly-speeds-up-in-setback-for-petro",
    "summary": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "fullContent": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "publishedAt": "2025-08-08T23:49:46.000Z",
    "fetchedAt": "2025-08-09T09:42:09.206Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "782342cf"
  },
  {
    "id": "bloomberg-politics-782342cf",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Colombian Inflation Unexpectedly Speeds Up In Setback for Petro",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombian-inflation-unexpectedly-speeds-up-in-setback-for-petro",
    "summary": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "fullContent": "Colombia’s inflation rate ticked up last month potentially complicating President Gustavo Petro’s push for an interest rate cut that could boost the South American country’s economy.",
    "publishedAt": "2025-08-08T23:49:46.000Z",
    "fetchedAt": "2025-08-09T09:42:09.212Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "782342cf"
  },
  {
    "id": "bbc-business-609467f4",
    "sourceId": "bbc-business",
    "sourceName": "BBC Business",
    "title": "Is super skinny back? UK sees rise in ad complaints over thin models",
    "url": "https://www.bbc.com/news/articles/c4gm9rygdymo?at_medium=RSS&amp;at_campaign=rss",
    "summary": "Zara, M&S and Next had ads banned over models that look \"unhealthily thin\" - is size zero making a comeback.",
    "fullContent": "Zara, M&S and Next had ads banned over models that look \"unhealthily thin\" - is size zero making a comeback",
    "publishedAt": "2025-08-08T23:47:17.000Z",
    "fetchedAt": "2025-08-09T09:42:11.378Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "609467f4"
  },
  {
    "id": "yahoo-finance-5f74195d",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Ad Tech Company Trade Desk Downgraded as Amazon, AI Reshape Digital Market",
    "url": "https://www.wsj.com/articles/ad-tech-company-trade-desk-downgraded-as-amazon-ai-reshape-digital-market-e65b020b?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:43:00.000Z",
    "fetchedAt": "2025-08-10T09:42:18.262Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5f74195d"
  },
  {
    "id": "bloomberg-business-youtube-2c1b2873",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Entry-Level Jobs at Risk, Tariffs & Textile Companies, Powering Data Centers | Wall Street Week",
    "url": "https://www.youtube.com/watch?v=Ak6ahYlz_Qo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:40:58.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "2c1b2873"
  },
  {
    "id": "zerohedge-5911ebcf",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Global Food Prices Marching Higher Serves As Warning For 'Fragile States'",
    "url": "https://www.zerohedge.com/food/chart-global-food-prices-marching-higher-serves-warning",
    "summary": "Global Food Prices Marching Higher Serves As Warning For 'Fragile States' The Food and Agriculture Organization of the United Nations' Food Price Index, a global benchmark for food commodity prices, registered its highest level since early 2023 in July.",
    "fullContent": "Global Food Prices Marching Higher Serves As Warning For 'Fragile States' The Food and Agriculture Organization of the United Nations' Food Price Index, a global benchmark for food commodity prices, registered its highest level since early 2023 in July. This marks a notable inflection point after a multi-year downward trend that followed the Covid and Russia-Ukraine war price spikes. The FAO Food Price Index averaged 130.1 in July, up 1.6% from June, driven primarily by sharp increases in meat and vegetable oil prices. \"The index tracks monthly changes in the international prices of a set of globally traded food commodities. In July, price increases in the meat and vegetable oil indices more than offset declines in the cereal, dairy and sugar indices,\" FAO wrote in its monthly report. The FAO Food Price Index has undergone a significant reversal since bottoming out in early 2024, following a downturn after the price spikes during Covid and Russia's invasion of Ukraine. It is now at its highest level since February 2023, up 43% from its early Covid-era lows, and will likely remain elevated into next year. Here's a summary of the report: Headline Index: Averaged 130.1 (+1.6% MoM), driven by meat and vegetable oils. Still 18.8% below the March 2022 peak but 7.6% above July 2024. Cereals (106.5, -0.8% MoM): Wheat & sorghum prices fell on new harvests; maize & barley rose. Rice (-1.8%) declined on ample supply and weak demand. Vegetable Oils (166.8, +7.1% MoM): 3-year high. Palm oil up on strong demand; soy oil supported by biofuel sector; sunflower oil higher on Black Sea supply tightness; rapeseed oil down on new EU crop. Meat (127.3, +1.2% MoM): Record high. Bovine & ovine prices surged on China/U.S. demand; poultry edged higher as Brazil regained AI-free status; pig meat fell on oversupply & weak EU demand. Dairy (155.3, -0.1% MoM): First drop since April 2024. Butter & milk powders down on abundant supply; cheese prices up on strong Asia/Near East demand & tighter EU exports. Sugar (103.3, -0.2% MoM): Fifth monthly decline on expectations of 2025/26 production rebound (Brazil, India, Thailand), partly offset by recovering import demand. Last month's uptick signals increasing price momentum in global food markets. While the index remains well below its 160 peak in 2022, sustained upward pressure in global food prices could reignite inflationary pressures. Implications: Fragile States: A renewed price surge could spark food insecurity and social unrest in low-income, import-dependent nations. In the U.S., the Trump administration needs to place a larger emphasis on strengthening local food supply chains to mitigate external supply shocks. That means know your local rancher and farmer, as well as make plans for a backyard garden and chicken coop. Readers have been well-informed about this inflection point... Related: Global Food Prices Climb Toward Arab Spring-Era Highs Amid Trade War Turmoil Global Food Prices Are Creeping Up Again . . . Tyler Durden Fri, 08/08/2025 - 19:40",
    "publishedAt": "2025-08-08T23:40:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.986Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5911ebcf"
  },
  {
    "id": "bloomberg-markets-49b35b05",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump-Linked World Liberty Pitches a $1.5 Billion Crypto Vehicle",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-linked-world-liberty-pitches-a-1-5-billion-crypto-vehicle",
    "summary": "Big investors are being sounded out on a plan for World Liberty Financial, the Trump family-backed venture, to set up a public company that would hold its WLFI tokens, joining the boom in digital-asset treasury firms.",
    "fullContent": "Big investors are being sounded out on a plan for World Liberty Financial, the Trump family-backed venture, to set up a public company that would hold its WLFI tokens, joining the boom in digital-asset treasury firms.",
    "publishedAt": "2025-08-08T23:38:46.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "49b35b05"
  },
  {
    "id": "ndtv-profit-youtube-26c1ee12",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Trump Rules Out India Trade Talks: Who Faces The Brunt? | Trump Exposes Americans To Tariff Hurt",
    "url": "https://www.youtube.com/watch?v=Mp1v7-9Lx_Q",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:36:05.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "26c1ee12"
  },
  {
    "id": "ndtv-profit-rss-e68646e",
    "sourceId": "ndtv-profit-rss",
    "sourceName": "NDTV Profit RSS",
    "title": "Happy Raksha Bandhan 2025: Wishes, Quotes, Messages, Images To Share With Your Brother Or Sister",
    "url": "https://www.ndtvprofit.com/trending/happy-raksha-bandhan-2025-wishes-quotes-messages-images-to-share-with-your-brother-or-sister",
    "summary": "Raksha Bandhan 2025: Here's a collection of heartfelt wishes, touching greetings, vibrant images and Facebook and WhatsApp statuses to make this day even more special.",
    "fullContent": "Raksha Bandhan 2025: Here's a collection of heartfelt wishes, touching greetings, vibrant images and Facebook and WhatsApp statuses to make this day even more special.",
    "publishedAt": "2025-08-08T23:30:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.275Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "e68646e"
  },
  {
    "id": "the-verge-52f0bc52",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Why Donald Trump’s environmental data purge is so much worse this time",
    "url": "https://www.theverge.com/science/757084/data-purge-climate-change-environmental-justice-trump",
    "summary": "Now that we're about halfway into the first year of President Donald Trump's second term, we can take stock of his administration's destruction of online environmental resources. It's worse than last time.",
    "fullContent": "Now that we're about halfway into the first year of President Donald Trump's second term, we can take stock of his administration's destruction of online environmental resources. It's worse than last time. It's also, seemingly, just the beginning - paving the way forward for the president's polluting agenda. A watchdog group that monitors publicly-available environmental [&#8230;]",
    "publishedAt": "2025-08-08T23:25:48.000Z",
    "fetchedAt": "2025-08-10T02:52:49.550Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "52f0bc52"
  },
  {
    "id": "yahoo-finance-91b1ba9",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Inflation Is Rising, Growth Is Slowing, Stocks Are Bubbly. What Could Go Wrong?",
    "url": "https://www.barrons.com/articles/more-inflation-less-growth-and-bubbly-stocks-trouble-ahead-a17b5f8e?siteid=yhoof2&amp;yptr=yahoo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:24:00.000Z",
    "fetchedAt": "2025-08-10T09:42:18.262Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "91b1ba9"
  },
  {
    "id": "bloomberg-markets-28be2055",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "S&P Set For Best Week Since June As Gold Prices Spike | The Close 8/8/2025",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/the-close-8-8-2025-video",
    "summary": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Moneta’s Aoifinn Devitt, The City University of New York’s Paul Krugman, Interactive Brokers’ Steve...",
    "fullContent": "Bloomberg Television brings you the latest news and analysis leading up to the final minutes and seconds before and after the closing bell on Wall Street. Today's guests are Moneta’s Aoifinn Devitt, The City University of New York’s Paul Krugman, Interactive Brokers’ Steve Sosnick, TD Securities’ Bart Melek , AGF Investment,'s Gregory Valliere, Flyjets’ Jessica Fisher, Comscore’s Paul Dergarabedian. (Source: Bloomberg)",
    "publishedAt": "2025-08-08T23:22:48.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "28be2055"
  },
  {
    "id": "wired-7149fbf9",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Ex-NSA Chief Paul Nakasone Has a Warning for the Tech World",
    "url": "https://www.wired.com/story/ex-nsa-chief-paul-nakasone-has-a-warning-for-the-tech-world/",
    "summary": "At the Defcon security conference in Las Vegas on Friday, Nakasone tried to thread the needle in a politically fraught moment while hinting at major changes for the tech community around the corner.",
    "fullContent": "At the Defcon security conference in Las Vegas on Friday, Nakasone tried to thread the needle in a politically fraught moment while hinting at major changes for the tech community around the corner.",
    "publishedAt": "2025-08-08T23:21:40.000Z",
    "fetchedAt": "2025-08-09T02:26:38.145Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "7149fbf9"
  },
  {
    "id": "ndtv-profit-youtube-22cf8f35",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Pak Army Chief Munir To Visit US for2nd Time | Trump Backs Asim Munir's Presidential Ambitions?",
    "url": "https://www.youtube.com/watch?v=b7KL6iysF3E",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:19:33.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "22cf8f35"
  },
  {
    "id": "zerohedge-1cc2063c",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "5 Things To Know About Trump's Order Banning Political Debanking",
    "url": "https://www.zerohedge.com/personal-finance/5-things-know-about-trumps-order-banning-political-debanking",
    "summary": "5 Things To Know About Trump's Order Banning Political Debanking Authored by Kevin Stocklin via The Epoch Times, President Donald Trump’s executive order banning politicized debanking is intended to reverse what some analysts say is a trend of banks and payment services...",
    "fullContent": "5 Things To Know About Trump's Order Banning Political Debanking Authored by Kevin Stocklin via The Epoch Times, President Donald Trump’s executive order banning politicized debanking is intended to reverse what some analysts say is a trend of banks and payment services refusing service to people and companies for political, religious, or ideological reasons. Advocates against political debanking cite cases of Christians and conservatives who they say have been victims of this process. This includes allegations by Christian organizations including Tennessee-based nonprofit Indigenous Advance Ministries, as well as Sam Brownback, the chairman of the National Committee for Religious Freedom (NCRF), and the president himself. Speaking to bank executives at the World Economic Forum in January, Trump said, “I hope you start opening your bank to conservatives, because many conservatives complain that the banks are not allowing them to do business within the bank, and that included a place called Bank of America.” Many conservative groups expressed support for this executive order. “Everyone needs access to basic financial services,” Brian Knight, senior counsel at the Alliance Defending Freedom, a leading advocate against ideological debanking, told The Epoch Times. “No American should have to worry that they could lose their bank account or have a payment declined because of their religious or political beliefs.” Banks have denied that they have taken part in political debanking. “We don’t close accounts for political reasons, and we agree with President Trump that regulatory change is desperately needed,” Patricia Wexler, a spokesperson for JPMorgan Chase, told The Epoch Times in a statement. “We commend the White House for addressing this issue and look forward to working with them to get this right.” A Bank of America spokesperson told The Epoch Times in January: “We serve more than 70 million clients and we welcome conservatives. We are required to follow extensive government rules and regulations that sometimes result in decisions to exit client relationships. We never close accounts for political reasons and don’t have a political litmus test.” The Southern Poverty Law Center, a left-wing advocacy group, criticized efforts by groups including Alliance Defending Freedom, calling them “an ongoing crusade to force private businesses to adhere to conservative Christian theology, in part by spreading the false narrative that private sector banks have been dropping conservative religious clients since the Obama administration.” Trump’s executive order seeks to reorient federal regulators and law enforcement away from practices that may have supported political debanking and toward actions that will actively oppose it. Here are five key takeaways from the order. 1. Regulators Drop ‘Reputational Risk’ The order directs federal regulators to stop using criteria such as “reputational risk,” which some banks say have been used to pressure them to cancel customers whose political or religious views government officials don’t like. Some concerned shareholders say that banks that consider political views in deciding who they will serve also creates risks. One case in point, says Jerry Bowyer, CEO of Bowyer Research and an advocate for shareholders and customers against political debanking, is Trump’s allegation that several banks closed his accounts following the Jan. 6, 2021, riots at the Capitol. “Just think about that—you debanked someone who might be the President of the United States,” Bowyer told The Epoch Times. “That doesn’t sound like risk management to me; that sounds like courting risk.” “Turns out that it was,” he said. Bank regulators have already taken steps to remove “reputational risk” from their criteria. In June, the Federal Reserve announced that reputational risk will no longer be a component of its bank supervision process, and said it was working with other regulatory agencies to assist them in also dropping this criterion. 2. Investigations of Unlawful Debanking to Commence The executive order requires federal banking regulators to investigate complaints of political debanking and pass any cases on to the U.S. attorney general’s office. Penalties for violations could include fines and consent decrees, as well as reinstating any customers who were unlawfully cancelled. This could include not only persons who have been refused service for ideological reasons but also companies. Operation Choke Point, which was enacted under the Obama administration, was a case in which regulators allegedly pressured banks to refuse service to industries like gun retailers and payday lenders, treating them as high-risk entities. A more recent version of this was Citibank’s policy, which started in 2018 but ended in June of this year, to refuse banking services to gun stores that sold to customers under the age of 21, which effectively prohibited business with much of the industry. 3. Financial Privacy Also a Focus Trump’s executive order also urges a federal investigation into alleged warrantless data mining of customers’ accounts by Bank of America (BOA) to hand over information to law enforcement regarding customers who traveled to Washington D.C., shopped at sporting goods stores that sold guns like Bass Pro Shops or Cabela’s, or expressed conservative political views during the 2021 Capitol breach. In May 2023, U.S. House Judiciary Chair Jim Jordan (R-Ohio) issued a letter to BOA CEO Brian Moynihan that stated an FBI whistleblower charged that the bank “provided the FBI—voluntarily and without any legal process—with a list of individuals who had made transactions in the Washington, D.C., metropolitan area with a BoA credit or debit card between January 5 and January 7, 2021,” and highlighted customers who bought firearms with a BOA credit card. 4. SBA to Reinstate Religious Organizations Trump’s executive order also instructs the U.S. Small Business Administration (SBA) to reinstate clients who have been denied loans or other services for political reasons. Previously, the SBA had prohibited any group that was “principally engaged in teaching, instructing, counseling, or indoctrinating religion” from applying for Economic Injury Disaster Loans. The SBA ended this policy in July, in compliance with a 2016 Supreme Court decision in the case Trinity Lutheran Church v. Comer, which stated that excluding religious organizations from government programs was a violation of the First Amendment. 5. State ‘Fair Access’ Laws Several states have recently passed “fair access” banking laws that prohibit denying financial services by banks, insurance companies, and other financial institutions on political or religious grounds. Florida enacted such a law in 2023, and Tennessee did so in 2024. Similar laws have been introduced in state legislatures in Arizona, Georgia, Idaho, Indiana, Iowa, Kentucky, Louisiana, and South Dakota, according to a legal analysis by law firm Latham & Watkins. The firm stated that critics of laws against political debanking “see such initiatives as an attack on environmental, social, and corporate-governance (ESG) policies in the financial system.” Tyler Durden Fri, 08/08/2025 - 19:15",
    "publishedAt": "2025-08-08T23:15:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1cc2063c"
  },
  {
    "id": "bloomberg-politics-30758168",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Administration Threatens to Seize Valuable Harvard Patents",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-administration-threatens-to-seize-valuable-harvard-patents",
    "summary": "The Trump administration threatened to assume ownership of hundreds of millions of dollars worth of patents from Harvard University, accusing the Ivy League college of failing to comply with the law on federal research grants.",
    "fullContent": "The Trump administration threatened to assume ownership of hundreds of millions of dollars worth of patents from Harvard University, accusing the Ivy League college of failing to comply with the law on federal research grants.",
    "publishedAt": "2025-08-08T23:06:51.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "30758168"
  },
  {
    "id": "techmeme-6cd19593",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Tech trade groups CTA and CCIA back Anthropic's appeal of a court ruling allowing a copyright class action, fearing big settlements could chill AI investment (Ashley Belanger/Ars Technica)",
    "url": "http://www.techmeme.com/250808/p26#a250808p26",
    "summary": "Ashley Belanger / Ars Technica: Tech trade groups CTA and CCIA back Anthropic's appeal of a court ruling allowing a copyright class action, fearing big settlements could chill AI investment — AI industry groups are urging an appeals court to block what they say is the largest...",
    "fullContent": "Ashley Belanger / Ars Technica: Tech trade groups CTA and CCIA back Anthropic's appeal of a court ruling allowing a copyright class action, fearing big settlements could chill AI investment — AI industry groups are urging an appeals court to block what they say is the largest copyright class action ever certified.",
    "publishedAt": "2025-08-08T23:05:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "6cd19593"
  },
  {
    "id": "fortune-3da141b",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Match Group&#8217;s rape problem: A lawsuit alleges that inaction by Tinder and Hinge&#8217;s owner allowed abusers to stay on the apps",
    "url": "https://fortune.com/2025/08/08/match-group-tinder-hinge-lawsuit-rape-assault-sentinel/",
    "summary": "A shareholder alleges the company \"has known… which users have been reported for drugging, assaulting, or raping their dates since at least 2016\" but did not release a promised report.",
    "fullContent": "A shareholder alleges the company \"has known… which users have been reported for drugging, assaulting, or raping their dates since at least 2016\" but did not release a promised report.",
    "publishedAt": "2025-08-08T23:04:29.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3da141b"
  },
  {
    "id": "ndtv-profit-youtube-5c0ce1c1",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Israel Gaza News | UN Calls For Immediate Halt Of Israeli Plan To Retake Gaza City",
    "url": "https://www.youtube.com/watch?v=LTx6gePNKp0",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T23:03:28.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "5c0ce1c1"
  },
  {
    "id": "bloomberg-politics-5a782d2c",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "UK Arrests Hundreds of People in Clampdown on Illegal Delivery Rider Work",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/uk-arrests-hundreds-in-clampdown-on-illegal-delivery-rider-work",
    "summary": "The UK arrested hundreds of people in a clampdown on migrants working illegally as drivers for delivery firms, as part of Prime Minister Keir Starmer’s push to stem the flow of irregular immigration.",
    "fullContent": "The UK arrested hundreds of people in a clampdown on migrants working illegally as drivers for delivery firms, as part of Prime Minister Keir Starmer’s push to stem the flow of irregular immigration.",
    "publishedAt": "2025-08-08T23:01:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "5a782d2c"
  },
  {
    "id": "fortune-998a663",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Adidas stole sandal design from traditional Mexican artisans, Sheinbaum says",
    "url": "https://fortune.com/2025/08/08/adidas-stole-sandal-design-mexico-huaraches/",
    "summary": "Mexican President Claudia Sheinbaum said Adidas was already in talks with authorities in Oaxaca to provide “compensation for the people who were plagiarized.\"",
    "fullContent": "Mexican President Claudia Sheinbaum said Adidas was already in talks with authorities in Oaxaca to provide “compensation for the people who were plagiarized.\"",
    "publishedAt": "2025-08-08T23:00:28.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "998a663"
  },
  {
    "id": "scmp-business-eb41afe",
    "sourceId": "scmp-business",
    "sourceName": "SCMP Business",
    "title": "New Hong Kong Hospital Authority chief vows to foster staff ‘speak-up’ culture",
    "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3321281/new-hong-kong-hospital-authority-chief-vows-foster-staff-speak-culture?utm_source=rss_feed",
    "summary": "The new chief of Hong Kong’s public hospitals has vowed to foster a “speak-up” culture among staff as part of efforts to boost patient safety, while expressing hope that one day no one in the organisation will need to be a whistle-blower.",
    "fullContent": "The new chief of Hong Kong’s public hospitals has vowed to foster a “speak-up” culture among staff as part of efforts to boost patient safety, while expressing hope that one day no one in the organisation will need to be a whistle-blower. Dr Libby Lee Ha-yun, who took office as the Hospital Authority’s chief executive at the start of the month, said on Friday that she hoped services would be offered more from the patients’ perspective while further considering their opinions. She said fostering...",
    "publishedAt": "2025-08-08T23:00:07.000Z",
    "fetchedAt": "2025-08-09T02:26:38.886Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "eb41afe"
  },
  {
    "id": "wsj-markets-main-4613320a",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "A $15 Billion Herm&#xe8;s Mystery. A Sudden Death. And, Finally, Some Answers.",
    "url": "https://www.wsj.com/business/eric-freymond-nicolas-puech-hermes-lvmh-8577023f?mod=rss_markets_main",
    "summary": "The apparent suicide of a financial adviser to an Herm&#xe8;s heir marks a dramatic turn in one of the most baffling and epic financial sagas of the century.",
    "fullContent": "The apparent suicide of a financial adviser to an Herm&#xe8;s heir marks a dramatic turn in one of the most baffling and epic financial sagas of the century.",
    "publishedAt": "2025-08-08T23:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4613320a"
  },
  {
    "id": "oil-price-42a2db24",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "Iran’s Crude Builds as Tankers Drift in Limbo",
    "url": "https://oilprice.com/Energy/Crude-Oil/Irans-Crude-Builds-as-Tankers-Drift-in-Limbo.html",
    "summary": "President Trump’s return to the Oval Office saw US authorities sanction Iranian traders, middlemen and infrastructure with fervent intensity, triggering a string of new legislative measures targeting Tehran’s oil revenues.",
    "fullContent": "President Trump’s return to the Oval Office saw US authorities sanction Iranian traders, middlemen and infrastructure with fervent intensity, triggering a string of new legislative measures targeting Tehran’s oil revenues. The clampdown intensified amidst the Israel-Iran crisis, with the White House extending its sanctioning spree first on Chinese refiners (mostly smaller ‘teapots’ in Shandong province) and then also on China’s port operators and midstream companies allegedly dealing with Iranian oil. With more than…",
    "publishedAt": "2025-08-08T23:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.178Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "42a2db24"
  },
  {
    "id": "bloomberg-politics-1abef6b2",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Greystar Reaches Deal in US Justice Department’s Rental Market Collusion Case",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/greystar-reaches-deal-in-doj-s-rental-market-collusion-case",
    "summary": "Greystar Real Estate Partners LLC reached a tentative settlement with the Department of Justice in an antitrust lawsuit accusing the landlord of colluding to increase rents across the US, in part, through widely used industry software.",
    "fullContent": "Greystar Real Estate Partners LLC reached a tentative settlement with the Department of Justice in an antitrust lawsuit accusing the landlord of colluding to increase rents across the US, in part, through widely used industry software.",
    "publishedAt": "2025-08-08T22:57:06.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "1abef6b2"
  },
  {
    "id": "fortune-39571f8b",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump administration seeks $1 billion settlement from UCLA",
    "url": "https://fortune.com/2025/08/08/trump-administration-seeks-1-billion-settlement-from-ucla/",
    "summary": "UCLA is the first public university to be targeted by a widespread funding freeze over allegations of civil rights violations related to antisemitism and affirmative action.",
    "fullContent": "UCLA is the first public university to be targeted by a widespread funding freeze over allegations of civil rights violations related to antisemitism and affirmative action.",
    "publishedAt": "2025-08-08T22:55:07.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "39571f8b"
  },
  {
    "id": "bloomberg-politics-16c5efbd",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Colombia’s Biggest Cocaine Cartel to Talk Peace With Government",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/colombia-s-biggest-cocaine-cartel-to-talk-peace-with-government",
    "summary": "Colombia’s biggest cocaine cartel will sit down with government negotiators as President Gustavo Petro seeks peace deals with the nation’s illegal armed groups before he leaves office next year.",
    "fullContent": "Colombia’s biggest cocaine cartel will sit down with government negotiators as President Gustavo Petro seeks peace deals with the nation’s illegal armed groups before he leaves office next year.",
    "publishedAt": "2025-08-08T22:52:13.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "16c5efbd"
  },
  {
    "id": "fortune-5800e016",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump to replace Biden Fed appointee with Stephen Miran, chair of the White House’s Council of Economic Advisers",
    "url": "https://fortune.com/2025/08/08/trump-names-stephen-miran-federal-reserve/",
    "summary": "Adriana Kugler stepped down Friday. Miran, if approved by the Senate, will serve until January 31, 2026.",
    "fullContent": "Adriana Kugler stepped down Friday. Miran, if approved by the Senate, will serve until January 31, 2026.",
    "publishedAt": "2025-08-08T22:51:34.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5800e016"
  },
  {
    "id": "wsj-markets-main-34cfc5b2",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Opinion | Trump Is Right on &#x2018;Debanking&#x2019;",
    "url": "https://www.wsj.com/opinion/donald-trump-debanking-executive-order-bank-examiners-biden-obama-operation-choke-point-8396e49d?mod=rss_markets_main",
    "summary": "Regulators have abused their power to cut off political opponents.",
    "fullContent": "Regulators have abused their power to cut off political opponents.",
    "publishedAt": "2025-08-08T22:50:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.147Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "34cfc5b2"
  },
  {
    "id": "wsj-opinion-5c36aaa4",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Trump Is Right on &#x2018;Debanking&#x2019;",
    "url": "https://www.wsj.com/opinion/donald-trump-debanking-executive-order-bank-examiners-biden-obama-operation-choke-point-8396e49d",
    "summary": "Regulators have abused their power to cut off political opponents.",
    "fullContent": "Regulators have abused their power to cut off political opponents.",
    "publishedAt": "2025-08-08T22:50:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.850Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "5c36aaa4"
  },
  {
    "id": "zerohedge-3a7129b7",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "How Much Power Do Data Centers Use?",
    "url": "https://www.zerohedge.com/technology/how-much-power-do-data-centers-use",
    "summary": "How Much Power Do Data Centers Use? Data center demand is rising at a break neck speed, with little signs of slowing. As the electricity consumption of AI rises, by 2028, a projected 12% of U.S. electricity demand could be driven from data centers.",
    "fullContent": "How Much Power Do Data Centers Use? Data center demand is rising at a break neck speed, with little signs of slowing. As the electricity consumption of AI rises, by 2028, a projected 12% of U.S. electricity demand could be driven from data centers. Beyond America, countries are pouring billions into AI sovereignty efforts which require data center facilities running 24/7 to power them. This graphic, via Visual Capitalist's Dorothy Neufeld, shows data center demand as a share of total power consumption, based on data from the IEA. The Boom in Data Center Demand Here is the share of each region’s total power demand that is driven by center centers: As we can see, America’s data center demand leads globally, at 8.9% of total power consumption. In Virginia, data centers account for 26% of the state’s total power consumption—or nearly triple the national average. This year, the state’s leading utility firm expects to connect 15 new data centers given surging demand. As big tech ramps up AI spending, a significant share is being funnelled into massive data centers along with the energy sources that power them. In particular, demand for nuclear is expanding at the fastest rate in decades. By comparison, data centers comprise 4.8% of the total power share in the European Union and 2.3% in China. To learn more about this topic from a global perspective, check out this graphic on the growth of data center capacity worldwide since 2005. Tyler Durden Fri, 08/08/2025 - 18:50",
    "publishedAt": "2025-08-08T22:50:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3a7129b7"
  },
  {
    "id": "bloomberg-markets-86a741",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Summer Box Office Ends On ‘Edgy’ August: Dergarabedian",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/summer-box-office-ends-on-edgy-august-dergarabedian-video",
    "summary": "Paul Dergarabedian, Comscore senior media analyst, says this August is a strong finale to a summer of good movies. He speaks with Scarlet Fu and Katie Greifeld on “The Close,” emphasizing that comedy on the big screen is making a comeback and there’s something for everyone.",
    "fullContent": "Paul Dergarabedian, Comscore senior media analyst, says this August is a strong finale to a summer of good movies. He speaks with Scarlet Fu and Katie Greifeld on “The Close,” emphasizing that comedy on the big screen is making a comeback and there’s something for everyone. (Source: Bloomberg)",
    "publishedAt": "2025-08-08T22:48:45.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "86a741"
  },
  {
    "id": "nyt-business-45a9081c",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Trump Seeks to Sell Fannie Mae and Freddie Mac Shares to Public Investors",
    "url": "https://www.nytimes.com/2025/08/08/business/trump-fannie-mae-freddie-mac-mortgages.html",
    "summary": "More than a decade after the government bailed out the mortgage giants, the Trump administration is looking for a partial stock-market exit.",
    "fullContent": "More than a decade after the government bailed out the mortgage giants, the Trump administration is looking for a partial stock-market exit.",
    "publishedAt": "2025-08-08T22:48:04.000Z",
    "fetchedAt": "2025-08-09T02:26:36.613Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "45a9081c"
  },
  {
    "id": "bloomberg-markets-76f0b87a",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "FlyJets CEO On Rising Private Jet Rentals",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/flyjets-ceo-on-rising-private-jet-rentals-video",
    "summary": "Jessica Fisher, FlyJets CEO and Founder, describes FlyJets as an Airbnb for private jet bookings, where an operator or owner can list their plane and someone can book it. The company updates aircraft listings every five minutes and allows automatic booking.",
    "fullContent": "Jessica Fisher, FlyJets CEO and Founder, describes FlyJets as an Airbnb for private jet bookings, where an operator or owner can list their plane and someone can book it. The company updates aircraft listings every five minutes and allows automatic booking. She speaks with Scarlet Fu and Katie Greifeld on “The Close.” (Source: Bloomberg)",
    "publishedAt": "2025-08-08T22:46:35.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "76f0b87a"
  },
  {
    "id": "techmeme-1d806e3f",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Sources: the US has started issuing licenses to Nvidia to export H20 chips to China following weeks of inaction, after Jensen Huang met Trump on Wednesday (Financial Times)",
    "url": "http://www.techmeme.com/250808/p25#a250808p25",
    "summary": "Financial Times: Sources: the US has started issuing licenses to Nvidia to export H20 chips to China following weeks of inaction, after Jensen Huang met Trump on Wednesday — Jensen Huang personally lobbied president after he reversed course on sale of H20 chips — The US...",
    "fullContent": "Financial Times: Sources: the US has started issuing licenses to Nvidia to export H20 chips to China following weeks of inaction, after Jensen Huang met Trump on Wednesday — Jensen Huang personally lobbied president after he reversed course on sale of H20 chips — The US commerce department &hellip;",
    "publishedAt": "2025-08-08T22:45:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1d806e3f"
  },
  {
    "id": "bloomberg-business-youtube-f234e4a",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Trump Will Meet With Putin in Alaska on August 15",
    "url": "https://www.youtube.com/watch?v=C7QhuKHxAeU",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T22:40:15.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "f234e4a"
  },
  {
    "id": "fortune-5f20e617",
    "sourceId": "fortune",
    "sourceName": "Fortune",
    "title": "Trump says he&#8217;ll meet Putin next Friday in Alaska to discuss Ukraine war&#8217;s end and predicts &#8216;some swapping of territories&#8217;",
    "url": "https://fortune.com/2025/08/08/trump-putin-meeting-alaska-ukraine-war-ceasefire-territory-swap/",
    "summary": "Prior to his announcing the meeting with Putin, Trump’s efforts to pressure Russia into stopping the fighting have so far delivered no progress.",
    "fullContent": "Prior to his announcing the meeting with Putin, Trump’s efforts to pressure Russia into stopping the fighting have so far delivered no progress.",
    "publishedAt": "2025-08-08T22:38:40.000Z",
    "fetchedAt": "2025-08-09T02:26:38.567Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5f20e617"
  },
  {
    "id": "cnbc-markets-222c8c53",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Trump says he will meet with Putin in Alaska on Aug. 15",
    "url": "https://www.cnbc.com/2025/08/08/trumps-russia-deadline-comes-around-with-tariffs-at-stake.html",
    "summary": "Washington's deadline for Moscow to strike a ceasefire in Ukraine was slated to expire on Friday.",
    "fullContent": "Washington's deadline for Moscow to strike a ceasefire in Ukraine was slated to expire on Friday.",
    "publishedAt": "2025-08-08T22:34:19.000Z",
    "fetchedAt": "2025-08-09T02:26:36.013Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "222c8c53"
  },
  {
    "id": "bloomberg-markets-22f8b918",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Trump Will Meet With Putin in Alaska on August 15",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/trump-will-meet-with-putin-in-alaska-on-august-15-video",
    "summary": "Donald Trump announced that he plans to meet with Russian President Vladimir Putin next Friday in Alaska, as the US president looks to broker a ceasefire agreement in hopes of bringing an end to the war in Ukraine. Vonnie Quinn reports.",
    "fullContent": "Donald Trump announced that he plans to meet with Russian President Vladimir Putin next Friday in Alaska, as the US president looks to broker a ceasefire agreement in hopes of bringing an end to the war in Ukraine. Vonnie Quinn reports.",
    "publishedAt": "2025-08-08T22:30:23.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "22f8b918"
  },
  {
    "id": "et-markets-1620436b",
    "sourceId": "et-markets",
    "sourceName": "Economic Times Markets",
    "title": "Trump hits pause on trade talks with India, plays up tariff issue",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/trump-hits-pause-on-trade-talks-with-india-plays-up-tariff-issue/articleshow/123199509.cms",
    "summary": "Donald Trump has refused trade talks with India until tariff issues are settled. This follows the US raising tariffs on Indian imports to 50%. The US trade negotiators are still expected to visit New Delhi later this month for trade agreement talks.",
    "fullContent": "Donald Trump has refused trade talks with India until tariff issues are settled. This follows the US raising tariffs on Indian imports to 50%. The US trade negotiators are still expected to visit New Delhi later this month for trade agreement talks. An Indian official confirmed that the visit is still on schedule.",
    "publishedAt": "2025-08-08T22:30:00.000Z",
    "fetchedAt": "2025-08-09T09:42:08.939Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1620436b"
  },
  {
    "id": "the-verge-1cc2c7e8",
    "sourceId": "the-verge",
    "sourceName": "The Verge",
    "title": "Ditching my phone for an LTE smartwatch was a humbling experience",
    "url": "https://www.theverge.com/gadgets/756945/smartwatch-lte-minimalist-phone",
    "summary": "Leaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens?",
    "fullContent": "Leaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens? [&#8230;]",
    "publishedAt": "2025-08-08T22:28:28.000Z",
    "fetchedAt": "2025-08-11T02:36:55.864Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "1cc2c7e8"
  },
  {
    "id": "zerohedge-3c98d951",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Most COVID Lung Abnormalities Heal Over Time, New Guidelines Confirm",
    "url": "https://www.zerohedge.com/medical/most-covid-lung-abnormalities-heal-over-time-new-guidelines-confirm",
    "summary": "Most COVID Lung Abnormalities Heal Over Time, New Guidelines Confirm Authored by Rachel Ann T. Melegrito via The Epoch Times (emphasis ours), Up to half of hospitalized COVID-19 patients show lung abnormalities on chest CT scans long after the acute infection is over.",
    "fullContent": "Most COVID Lung Abnormalities Heal Over Time, New Guidelines Confirm Authored by Rachel Ann T. Melegrito via The Epoch Times (emphasis ours), Up to half of hospitalized COVID-19 patients show lung abnormalities on chest CT scans long after the acute infection is over. Many fear these changes mean lasting damage or worsening lung disease. However, new guidelines on treating long COVID confirm that lung abnormalities usually stabilize or even improve over time. Magic mine/ShutterStock “The lungs are an organ, like skin, that are in constant contact with the environment. Because of that, they have a significant amount of stem cells in reserve and cells ready for healing,” Dr. Panagis Galiatsatos, a pulmonary and critical care medicine physician and an associate professor at Johns Hopkins Medicine, told The Epoch Times. Recovery Takes Time Researchers found that in patients with lung damage following a COVID-19 infection, around 90 percent who continued to show lung abnormalities at the time of hospital discharge began to see improvements one to three years after infection. After a COVID-19 infection, roughly six in 100 people are estimated to develop persistent symptoms that can last for months to years—a condition known as long COVID. Common complaints include fatigue, joint and muscle aches, breathlessness, headaches, and difficulty concentrating, often called “brain fog.” Symptoms typically improve over time—usually within four to nine months. Lung recovery tends to follow a similar trajectory. After infection, the lungs can show changes that resemble scarring—such as inflammation, collapsed air sacs, or temporary thickening of lung tissue—but these often heal on their own, Dr. Joseph Varon, president and chief medical officer of Independent Medical Alliance, who is not one of the authors of the treatment guideline, told The Epoch Times. Based on Varon’s clinical experience, most patients with mild-to-moderate COVID-related lung issues show improvement on scans and of symptoms within three to six months. However, he noted that some people, especially older adults or those who had severe illness, can have lingering lung changes or symptoms for a year or more. In COVID-19, the early lung damage is mostly due to inflammation, not permanent destruction, he said. Once the infection clears and inflammation goes down, the lungs can start to heal, absorbing fluid and repairing tissue, a process that can take several months. “The body has the capacity to heal,” Dr. Pierre Kory, founder of Leading Edge Clinic, which treats long COVID patients, told The Epoch Times. COVID is typically an acute illness that heals over time rather than a chronic inflammatory condition—though in some cases, lingering lung inflammation or fibrosis can persist, he said. Many post-COVID lung changes seen in scans are not signs of permanent damage. They often reflect the lung’s natural healing process after inflammation, similar to what’s seen in other viral pneumonias or recovery from acute respiratory distress syndrome. Over time, these abnormalities often fade as the tissue repairs itself. Unlike chronic conditions such as interstitial lung disease, which involve ongoing triggers and progressive scarring, post-COVID changes are typically non-progressive. However, older patients who had been on mechanical ventilation or had severe or critical initial infection were more likely to have persistent lung changes, possibly due to the extent of initial lung injury. Residual Signs Versus Permanent Damage Chest CT scans often reveal lung changes long after COVID-19 infection that may look severe on imaging. These include ground glass opacities, which are hazy areas suggesting inflammation, or fibrous strands, thin bands of tissue left over from healing. However, many of these findings are residual effects from the infection, not signs of irreversible damage. “Radiologic findings often lag behind clinical recovery and must be interpreted within a broader clinical framework,” said Varon, “I have seen patients that have ‘white lungs’ for months and are doing well.” The disconnect between imaging and the actual patient condition may lead to confusion, unnecessary follow-up, or even overtreatment of long COVID. “Some patients report persistent symptoms despite near-normal imaging,” Varon said, likely due to lingering viral effects or nervous system issues rather than actual lung damage. “The key takeaway is that both lung damage and symptoms often improve—but not always in synchrony, and not always completely,” he said. That’s why an individualized, symptom-based follow-up approach remains essential in managing long COVID patients. Preventing Costly Overtreatment The new guidelines specifically address the tendency to over-interpret nonspecific findings as signs of progressive lung disease. The new consensus advises using CT only when clinically indicated, such as in patients with persistent or worsening respiratory symptoms. Mislabeling can also lead to costly treatments, repeated imaging, and even affect life insurance or disability claims. “These medications can cost up to $60,000 per year—and patients may not really need them,” Varon said. The new guidelines suggest providers request follow-up chest CT only in patients whose respiratory symptoms persist or worsen three months after infection, with those symptoms lasting at least two months and with no other identifiable cause. They also recommend low-dose protocols for follow-up imaging to reduce radiation exposure. CT was invaluable early in the pandemic, especially when RT-PCR testing was unreliable, Varon said, but its continued use in asymptomatic or mildly symptomatic long COVID patients is often unnecessary. The guidelines also urge radiologists to avoid using terms such as “fibrosis” or “interstitial lung disease,” which often imply progressive or permanent scarring, when describing nonspecific residual findings. The bigger concern, Kory said, is the tendency to over-label nonspecific findings, like ground-glass opacities or mild fibrotic changes, as definitive signs of fibrotic interstitial lung disease. “I see this in my practice every single day,” he said. “These interpretations can trigger unnecessary anxiety, inappropriate referrals, and misguided treatment plans.” Kory takes a symptom-focused approach, monitoring patients clinically and repeating imaging only if conditions worsen. “My experience in general is that yes, most things in medicine are overused, including imaging,” he said. Tyler Durden Fri, 08/08/2025 - 18:25",
    "publishedAt": "2025-08-08T22:25:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3c98d951"
  },
  {
    "id": "ft-economics-401d55c4",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "US licenses Nvidia to export chips to China after CEO meets Trump",
    "url": "https://www.ft.com/content/e9c52f00-9bde-4840-801e-ba66c792df9e",
    "summary": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips.",
    "fullContent": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips",
    "publishedAt": "2025-08-08T22:22:42.000Z",
    "fetchedAt": "2025-08-09T02:26:37.268Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "401d55c4"
  },
  {
    "id": "ft-technology-401d55c4",
    "sourceId": "ft-technology",
    "sourceName": "FT Technology",
    "title": "US licenses Nvidia to export chips to China after CEO meets Trump",
    "url": "https://www.ft.com/content/e9c52f00-9bde-4840-801e-ba66c792df9e",
    "summary": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips.",
    "fullContent": "Jensen Huang personally lobbied president after he reversed course on sale of H20 chips",
    "publishedAt": "2025-08-08T22:22:42.000Z",
    "fetchedAt": "2025-08-09T02:26:37.183Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "401d55c4"
  },
  {
    "id": "wired-40c2a944",
    "sourceId": "wired",
    "sourceName": "Wired",
    "title": "Truth Social’s New AI Chatbot Is Donald Trump’s Media Diet Incarnate",
    "url": "https://www.wired.com/story/i-fear-truth-search-ai-might-be-biased-but-it-says-it-isnt/",
    "summary": "Truth Search AI appears to rely heavily on conservative outlet Fox News to answer even the most basic questions.",
    "fullContent": "Truth Search AI appears to rely heavily on conservative outlet Fox News to answer even the most basic questions.",
    "publishedAt": "2025-08-08T22:20:48.000Z",
    "fetchedAt": "2025-08-09T02:26:38.145Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "40c2a944"
  },
  {
    "id": "nyt-business-1bbe60e9",
    "sourceId": "nyt-business",
    "sourceName": "NYT Business",
    "title": "Popular E.P.A. Database Is in Limbo Amid Science Cuts",
    "url": "https://www.nytimes.com/2025/08/08/climate/epa-database-useeio-greenhouse-gases.html",
    "summary": "The database helps companies calculate their greenhouse gas emissions. Its creator left the E.P.A. after being investigated for criticizing the Trump administration.",
    "fullContent": "The database helps companies calculate their greenhouse gas emissions. Its creator left the E.P.A. after being investigated for criticizing the Trump administration.",
    "publishedAt": "2025-08-08T22:20:46.000Z",
    "fetchedAt": "2025-08-09T02:26:36.613Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1bbe60e9"
  },
  {
    "id": "ft-economics-248b73b9",
    "sourceId": "ft-economics",
    "sourceName": "FT Economics",
    "title": "US foreign policy as it happened: Donald Trump to meet Vladimir Putin in Alaska and signals Ukraine may need to cede land; Armenia and Azerbaijan sign joint peace declaration",
    "url": "https://www.ft.com/content/a237d285-7033-4d46-9718-63e17b481e54",
    "summary": "US and Russian leaders to meet on August 15 in attempt to broker end to resolve war in Ukraine.",
    "fullContent": "US and Russian leaders to meet on August 15 in attempt to broker end to resolve war in Ukraine",
    "publishedAt": "2025-08-08T22:17:26.000Z",
    "fetchedAt": "2025-08-09T02:26:37.268Z",
    "category": "macro",
    "tags": [
      "macro"
    ],
    "priority": "normal",
    "contentHash": "248b73b9"
  },
  {
    "id": "techmeme-49a31c7c",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Silver Lake unveils a $400M project to secure powered land for data center developers; it has secured 3GW of power and is developing sites in Texas and Georgia (Isabelle Bousquette/Wall Street Journal)",
    "url": "http://www.techmeme.com/250808/p24#a250808p24",
    "summary": "Isabelle Bousquette / Wall Street Journal: Silver Lake unveils a $400M project to secure powered land for data center developers; it has secured 3GW of power and is developing sites in Texas and Georgia — The private-equity firm is looking to bundle land parcels with power...",
    "fullContent": "Isabelle Bousquette / Wall Street Journal: Silver Lake unveils a $400M project to secure powered land for data center developers; it has secured 3GW of power and is developing sites in Texas and Georgia — The private-equity firm is looking to bundle land parcels with power availability, which it said is now the biggest obstacle to data-center development",
    "publishedAt": "2025-08-08T22:10:04.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "49a31c7c"
  },
  {
    "id": "bloomberg-markets-381b3e41",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Entry-Level Jobs at Risk, Tariffs & Textile Companies, Powering Data Centers | Wall Street Week",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/side-effects-of-ai-wall-street-week-video",
    "summary": "This week, college graduates struggle to find entry-level jobs: is AI part of the problem? And, Centerview Partners’ Blair Effron on CEOs weathering policy uncertainty, and the importance of New York's next mayor to the city's business community.",
    "fullContent": "This week, college graduates struggle to find entry-level jobs: is AI part of the problem? And, Centerview Partners’ Blair Effron on CEOs weathering policy uncertainty, and the importance of New York's next mayor to the city's business community. Plus, how will President Trump’s tariffs impact the textile industry? Later, a small town pushes back against an Amazon data center - the pros and cons the town sees in data centers. (Source: Bloomberg)",
    "publishedAt": "2025-08-08T22:07:49.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "381b3e41"
  },
  {
    "id": "wsj-markets-main-7945319b",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "Trump Preparing IPO for Fannie Mae and Freddie Mac Later This Year",
    "url": "https://www.wsj.com/finance/regulation/trump-aiming-to-ipo-fannie-mae-and-freddie-mac-later-this-year-13b138cf?mod=rss_markets_main",
    "summary": "Some officials believe the offering could raise around $30 billion and value the combined firms at roughly $500 billion or more.",
    "fullContent": "Some officials believe the offering could raise around $30 billion and value the combined firms at roughly $500 billion or more.",
    "publishedAt": "2025-08-08T22:05:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7945319b"
  },
  {
    "id": "bloomberg-business-youtube-7245bd00",
    "sourceId": "bloomberg-business-youtube",
    "sourceName": "Bloomberg Business YouTube",
    "title": "Elon Musk’s Boring Company is turning into a flop #tech #shorts",
    "url": "https://www.youtube.com/shorts/KWdXD-sKtro",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T22:00:33.000Z",
    "fetchedAt": "2025-08-09T02:26:48.444Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "7245bd00"
  },
  {
    "id": "zerohedge-50185fd6",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "​​​​​​​Gun Sales Fall Under 1 Million For First Time In Six Years; Ammo Prices Sink To Lows",
    "url": "https://www.zerohedge.com/markets/gun-sales-sink-below-1-million-first-time-six-years-ammo-prices-low-market-bust",
    "summary": "​​​​​​​Gun Sales Fall Under 1 Million For First Time In Six Years; Ammo Prices Sink To Lows After years of pandemic-fueled surges and politically driven buying sprees, the U.S. gun market is sliding deeper into a downturn.",
    "fullContent": "​​​​​​​Gun Sales Fall Under 1 Million For First Time In Six Years; Ammo Prices Sink To Lows After years of pandemic-fueled surges and politically driven buying sprees, the U.S. gun market is sliding deeper into a downturn. With Republicans controlling both Congress and the White House, fears of sweeping federal gun bans from far-left Democrats have abated, stripping away one of the industry's most reliable sales catalysts. The latest July figures from the FBI show 1.94 million National Instant Criminal Background Check System (NICS) background checks, down 4.2% from July 2024. After removing permit-related checks, the National Shooting Sports Foundation (NSSF) estimated 978,731 checks directly tied to gun sales, an 8.1% drop year-over-year and the first sub-million reading in six years. \"Summer months routinely show lower background check figures than other times of the year, and we've watched as the background check figures came down from astronomical highs several years ago,\" Mark Oliva, public affairs officer with the NSSF, told firearms website Guns.com via an emailed response. Oliva noted, \"There are factors that contribute to this, including relief of concern that politics would deny some from being able to exercise Second Amendment rights to purchase a firearm of one's choice and economic uncertainty.\" The gun panic-buying frenzy of 2020 and 2021 was never sustainable and has since ended in a complete bust for the industry. Notably, the downturn is likely to persist through President Trump's second term, given that a pro-2A administration won't infringe on gun owners, unlike the Biden-Harris regime, which aggressively did so. Nowhere is the gun bust more evident than in the decline of Smith & Wesson's shares: SWBI vs. NICS... Meanwhile, precious metals such as gold might be at an all-time high, but ammo prices are at lows... 9mm retail prices via data from Black Basin. . . . Tyler Durden Fri, 08/08/2025 - 18:00",
    "publishedAt": "2025-08-08T22:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.987Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "50185fd6"
  },
  {
    "id": "bloomberg-politics-6f4f6f2a",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "William Webster, Only Person to Lead Both The FBI and CIA, Dies at 101",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/william-webster-only-person-to-lead-fbi-and-cia-dies-at-101",
    "summary": "William Webster, the only person to lead both the Federal Bureau of Investigation and the Central Intelligence Agency and, very briefly, the first head of the US accounting oversight board, has died. He was 101.",
    "fullContent": "William Webster, the only person to lead both the Federal Bureau of Investigation and the Central Intelligence Agency and, very briefly, the first head of the US accounting oversight board, has died. He was 101.",
    "publishedAt": "2025-08-08T21:55:04.000Z",
    "fetchedAt": "2025-08-09T02:26:36.256Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "6f4f6f2a"
  },
  {
    "id": "wsj-opinion-56cc901b",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "Hamas Pulls Israel Deeper Into Gaza",
    "url": "https://www.wsj.com/opinion/israel-gaza-city-benjamin-netanyahu-hamas-59a2f40d",
    "summary": "Netanyahu takes a middle road that will satisfy nobody.",
    "fullContent": "Netanyahu takes a middle road that will satisfy nobody.",
    "publishedAt": "2025-08-08T21:42:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.850Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "56cc901b"
  },
  {
    "id": "wsj-world-news-b8d7143",
    "sourceId": "wsj-world-news",
    "sourceName": "WSJ World News",
    "title": "Opinion | Hamas Pulls Israel Deeper Into Gaza",
    "url": "https://www.wsj.com/opinion/israel-gaza-city-benjamin-netanyahu-hamas-59a2f40d",
    "summary": "Netanyahu takes a middle road that will satisfy nobody.",
    "fullContent": "Netanyahu takes a middle road that will satisfy nobody.",
    "publishedAt": "2025-08-08T21:42:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.854Z",
    "category": "news",
    "tags": [
      "news"
    ],
    "priority": "normal",
    "contentHash": "b8d7143"
  },
  {
    "id": "zerohedge-249e45bf",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Watch: Feds Jump Out Of Truck, Ambush Illegals At LA Home Depot",
    "url": "https://www.zerohedge.com/political/watch-feds-jump-out-truck-ambush-illegals-la-home-depot",
    "summary": "Watch: Feds Jump Out Of Truck, Ambush Illegals At LA Home Depot Via Headline USA, U.S. Border Patrol agents jumped out of the back of a rented box truck and made arrests Wednesday at a Los Angeles Home Depot store during an immigration raid that an agency official called...",
    "fullContent": "Watch: Feds Jump Out Of Truck, Ambush Illegals At LA Home Depot Via Headline USA, U.S. Border Patrol agents jumped out of the back of a rented box truck and made arrests Wednesday at a Los Angeles Home Depot store during an immigration raid that an agency official called “Operation Trojan Horse.” “For those who thought immigration enforcement had stopped in Southern California, think again,” acting U.S. Atty. Bill Essayli posted on the social platform X after the raid. “The enforcement of federal law is not negotiable and there are no sanctuaries from the reach of the federal government.” Messages were sent to the U.S. Department of Homeland Security seeking details on the raid, including how many people were arrested. U.S. Border Patrol Sector Chief Greg Bovino reposted Fox News reports of Monday’s arrests on X, calling the action “Operation Trojan Horse.” Breaking: DHS arrives in Penske trucks at a Home Depot in McArthur Park area of LA for early morning immigration enforcement. The area was filled with migrants who scattered. DHS says MS 13 has a chokehold on this area, which is one reason they’re carrying out the highly… pic.twitter.com/hTskuM9Q4l — Matt Finn (@MattFinnFNC) August 6, 2025 Photos on social media showed the moment the rear door of the rented Penske truck opened, revealing several uniformed agents with guns. A spokesperson for Penske Truck Rental said the company was looking into the use of its vehicles by federal officials, saying its regulations prohibit transporting people in truck cargo areas. “The company was not made aware that its trucks would be used in today’s operation and did not authorize this,” spokesperson Randolph P. Ryerson said in an email. “Penske will reach out to DHS and reinforce its policy to avoid improper use of its vehicles in the future.” Tyler Durden Fri, 08/08/2025 - 17:40",
    "publishedAt": "2025-08-08T21:40:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.988Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "249e45bf"
  },
  {
    "id": "bloomberg-markets-55dd97c8",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Lincicome: Ton of Tariff Details Yet to Be Ironed Out",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/lincicome-ton-of-tariff-details-yet-to-be-ironed-out-video",
    "summary": "Cato Institute's General Economics Vice President Scott Lincicome shares his thoughts on the reaction to potential tariffs from the Trump administration on gold, overall tariff impacts to the global markets, and how tariffs might yet impact inflation and prices for US consumers.",
    "fullContent": "Cato Institute's General Economics Vice President Scott Lincicome shares his thoughts on the reaction to potential tariffs from the Trump administration on gold, overall tariff impacts to the global markets, and how tariffs might yet impact inflation and prices for US consumers. Scott Lincicome speaks with Joe Mathieu on the late edition of Bloomberg's \"Balance of Power.\" (Source: Bloomberg)",
    "publishedAt": "2025-08-08T21:39:09.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "55dd97c8"
  },
  {
    "id": "wsj-opinion-3e35d9ed",
    "sourceId": "wsj-opinion",
    "sourceName": "WSJ Opinion",
    "title": "James Arthur Lovell Jr., 1928-2025",
    "url": "https://www.wsj.com/opinion/jim-lovell-dies-apollo-13-nasa-astronaut-ba9950eb",
    "summary": "The commander of Apollo 13 exemplified the U.S. age of discovery.",
    "fullContent": "The commander of Apollo 13 exemplified the U.S. age of discovery.",
    "publishedAt": "2025-08-08T21:39:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.850Z",
    "category": "blogs",
    "tags": [
      "blogs"
    ],
    "priority": "normal",
    "contentHash": "3e35d9ed"
  },
  {
    "id": "bloomberg-markets-5702add9",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "United Site Services, Lenders Re-Engage Advisers for Debt Talks",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/united-site-services-lenders-re-engage-advisers-for-debt-talks",
    "summary": "Platinum Equity-backed portable toilet company United Site Services is working with advisers as its performance continues to struggle, according to people with knowledge of the matter.",
    "fullContent": "Platinum Equity-backed portable toilet company United Site Services is working with advisers as its performance continues to struggle, according to people with knowledge of the matter.",
    "publishedAt": "2025-08-08T21:36:43.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5702add9"
  },
  {
    "id": "ndtv-profit-youtube-c1d4327",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Modi's Good Conversation With Putin| Trump's Flip Flop On India Deal| US Headlines| Washington Watch",
    "url": "https://www.youtube.com/watch?v=ugr3kFM3Oac",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T21:34:58.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "c1d4327"
  },
  {
    "id": "ndtv-profit-youtube-51b0bc56",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Gaza Hunger Crisis | A Look At What Palestinian Families Eat In Gaza",
    "url": "https://www.youtube.com/watch?v=B7uMD9Dfc-U",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T21:34:08.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "51b0bc56"
  },
  {
    "id": "business-insider-14a8bf5d",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Why Instagram users think a new map feature is sharing their location, even though it isn't.",
    "url": "https://www.businessinsider.com/instagram-map-location-sharing-settings-default-privacy-how-2025-8",
    "summary": "Instagram rolled out a new map feature this week. Some users think it is sharing their location without their permission. I know why.",
    "fullContent": "Instagram rolled out a new map feature this week. Some users think it is sharing their location without their permission. I know why.",
    "publishedAt": "2025-08-08T21:27:05.000Z",
    "fetchedAt": "2025-08-09T02:26:36.309Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "14a8bf5d"
  },
  {
    "id": "techmeme-4682977f",
    "sourceId": "techmeme",
    "sourceName": "Techmeme",
    "title": "Microsoft will phase out its Lens scanner app, launched in 2014 as Office Lens, starting in September; users can create new scans in the app only until December (Rishaj Upadhyay/Windows Report)",
    "url": "http://www.techmeme.com/250808/p23#a250808p23",
    "summary": "Rishaj Upadhyay / Windows Report: Microsoft will phase out its Lens scanner app, launched in 2014 as Office Lens, starting in September; users can create new scans in the app only until December — Popular scanner app to retire soon — Microsoft is preparing to sunset another...",
    "fullContent": "Rishaj Upadhyay / Windows Report: Microsoft will phase out its Lens scanner app, launched in 2014 as Office Lens, starting in September; users can create new scans in the app only until December — Popular scanner app to retire soon — Microsoft is preparing to sunset another long-running product alongside the end of life for Windows 10 this year.",
    "publishedAt": "2025-08-08T21:25:03.000Z",
    "fetchedAt": "2025-08-09T02:26:38.583Z",
    "category": "technology",
    "tags": [
      "technology"
    ],
    "priority": "normal",
    "contentHash": "4682977f"
  },
  {
    "id": "zerohedge-11501a5",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "Epstein's Butler Of 18 Years Breaks Silence: 'No Way He Killed Himself’",
    "url": "https://www.zerohedge.com/political/epsteins-butler-18-years-breaks-silence-no-way-he-killed-himself",
    "summary": "Epstein's Butler Of 18 Years Breaks Silence: 'No Way He Killed Himself’ The longtime butler of Jeffrey Epstein is speaking out about the death of the deceased pedophile and disgraced financier, joining the chorus of voices expressing disbelief that he committed suicide.",
    "fullContent": "Epstein's Butler Of 18 Years Breaks Silence: 'No Way He Killed Himself’ The longtime butler of Jeffrey Epstein is speaking out about the death of the deceased pedophile and disgraced financier, joining the chorus of voices expressing disbelief that he committed suicide. Valdson Vieira Cotrin, who oversaw Epstein's residence in Paris for 18 years, made the admission in an interview with The Telegraph. \"I am like his brother [Mark Epstein]. I don't believe this was suicide. He loved life too much,\" Cotrin told the British newspaper. JUST IN - The Telegraph has posted a photo of Jeffrey Epstein on his private jet in 2019. This photo, may be one of the last taken of the financier, shows him wearing an Israel Defense Forces (IDF) sweatshirt, The Telegraph reports pic.twitter.com/hpJyxdHUoD — Insider Paper (@TheInsiderPaper) August 8, 2025 Cotrin described his final encounter with Epstein, painting a picture of a man who appeared far from suicidal. Epstein was relaxed and discussing future plans, including additional investments in his islands, having discreetly purchased a second property that Cotrin had visited, and spending more time in Paris. \"I drove him to Le Bourget airport. It was a Saturday, because on Monday he was supposed to appear before the judge regarding all these accusations,\" the longtime servant said. The gravity of the situation became clear shortly after Epstein's departure, according to Cotrin. \"When I got home, two young women rang, his main girlfriend who had been with him officially for several years, Karyna [Shuliak] and another who worked for him. And then they told me, 'Mr Epstein has gone to prison. He arrived in New York. The police were waiting for him'.\" Cotrin also claimed that he worked dozens of times at Epstein's properties in New York, Palm Beach, Florida and on Little St James, Epstein's private Caribbean island, dubbed by the media as \"pedophile island,\" where he is said to have trapped and raped often underage victims. \"He trusted me completely,\" said Cotrin, who has not worked since his boss's death six years ago, adding that he never saw Epstein commit any sex crimes. \"I was his chauffeur, his cook, his housekeeper. I did everything in Paris, I was his only full-time, paid-up employee and worked for him from 2001 until his death. If someone could have seen something, it's Valdson, there's no one else,\" he said. Epstein was found unresponsive in his cell at the Metropolitan Correctional Center in New York City on August 10, 2019, at 6:30 a.m., hanging from his bed. The shadowy investor was pronounced dead at New York Downtown Hospital at 6:39 a.m. The Department of Justice and the New York City medical examiner ruled his death a suicide by hanging. However, Mark Epstein, the brother of Jeffrey Epstein, has consistently rejected the government's conclusion and repeatedly stated that he does not believe his brother took his own life. \"I believe he was killed because I believe that, a day after he died, and I heard on CNN that he was found dead from assumed suicide,\" Mark Epstein said. \"They came out of the autopsy and they both concurred that this looked more like a homicide than a suicide.\" The autopsy findings have become a key source of dispute. Epstein's autopsy was performed by New York City's Chief Medical Examiner, Dr. Barbara Sampson and a pathologist hired by the Epstein family, Dr. Michael Baden. JUST IN - New photo surfaces of Bill Clinton with Epstein’s butler aboard Epstein’s private jet - The Telegraph pic.twitter.com/LboTnrFkSL — Insider Paper (@TheInsiderPaper) August 8, 2025 Mark Epstein has pointed to specific forensic evidence that he believes contradicts the suicide ruling. \"One of the major things was the three broken bones in his neck. Now, Dr. Baden has done about 500 autopsies. He's been doing this for over 50 years. And I've spoken to other pathologists and they say, you know, on a soft hanging. Which is supposedly what Jeffrey was supposed to have done. You know, you might get a broken bone, maybe two, but no one's ever seen three broken bones in this kind of hanging,\" Mark Epstein said. Earlier July, the joint DOJ-FBI memo declared an \"exhaustive review\" of evidence from Epstein's death definitively ruled out murder. The agencies also denied the existence of a \"client list\" tied to Epstein, directly contradicting earlier remarks by Attorney General Pam Bondi. Bondi had previously suggested on Fox News that such a list was \"sitting on my desk\" for review, igniting speculation about Epstein's possible blackmailing of globalist elites. Trump has repeatedly sought to dismiss the scandal, accusing Democrats of fabricating a hoax around Epstein to thwart his agenda. Tyler Durden Fri, 08/08/2025 - 17:20",
    "publishedAt": "2025-08-08T21:20:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.988Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "11501a5"
  },
  {
    "id": "business-insider-1a933fa0",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "'Weapons' has an ultra-violent ending that's going to keep you up at night",
    "url": "https://www.businessinsider.com/weapons-ending-explained-where-did-the-kids-go-2025-8",
    "summary": "The &#34;Weapons&#34; ending isn't for the faint of heart. But it is satisfying to find out where the kids went when they disappeared.",
    "fullContent": "The &#34;Weapons&#34; ending isn't for the faint of heart. But it is satisfying to find out where the kids went when they disappeared.",
    "publishedAt": "2025-08-08T21:19:57.000Z",
    "fetchedAt": "2025-08-09T02:26:36.309Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "1a933fa0"
  },
  {
    "id": "bloomberg-politics-4b0ad840",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Is Threatening To Take Over DC. Can He Do It?",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-is-threatening-to-take-over-dc-can-he-do-it",
    "summary": "President Donald Trump is threatening to have the federal government take over Washington, DC. However, his powers to take action inside the nation’s capital are limited. He’d need an act of Congress to have complete control.",
    "fullContent": "President Donald Trump is threatening to have the federal government take over Washington, DC. However, his powers to take action inside the nation’s capital are limited. He’d need an act of Congress to have complete control.",
    "publishedAt": "2025-08-08T21:13:29.000Z",
    "fetchedAt": "2025-08-09T02:26:36.257Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "4b0ad840"
  },
  {
    "id": "bloomberg-politics-696386fb",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump Wants Control Over Washington DC. What Are His Powers?",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-is-threatening-to-take-over-dc-can-he-do-it",
    "summary": "President Donald Trump is threatening to have the federal government take over Washington, DC. On Aug. 11, he announced that he would take control of the city’s Metropolitan Police Department and deploy the National Guard to crack down on crime and homelessness.",
    "fullContent": "President Donald Trump is threatening to have the federal government take over Washington, DC. On Aug. 11, he announced that he would take control of the city’s Metropolitan Police Department and deploy the National Guard to crack down on crime and homelessness.",
    "publishedAt": "2025-08-08T21:13:29.000Z",
    "fetchedAt": "2025-08-12T02:23:21.297Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "696386fb"
  },
  {
    "id": "bloomberg-markets-313411bc",
    "sourceId": "bloomberg-markets",
    "sourceName": "Bloomberg Markets",
    "title": "Krugman: Waller 'Solid,' Which Means He Won't Be Chosen",
    "url": "https://www.bloomberg.com/news/videos/2025-08-08/krugman-waller-solid-which-means-he-won-t-be-chosen-video",
    "summary": "Nobel laureate Paul Krugman, a distinguished professor at the City University of New York, explains why he thinks Christopher Waller won't be chosen to replace Federal Reserve Chair Jerome Powell. (Source: Bloomberg)",
    "fullContent": "Nobel laureate Paul Krugman, a distinguished professor at the City University of New York, explains why he thinks Christopher Waller won't be chosen to replace Federal Reserve Chair Jerome Powell. (Source: Bloomberg)",
    "publishedAt": "2025-08-08T21:08:02.000Z",
    "fetchedAt": "2025-08-09T02:26:35.711Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "313411bc"
  },
  {
    "id": "marketwatch-4b75bd8a",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Why investors are making a big mistake by not worrying more about tariffs",
    "url": "https://www.marketwatch.com/story/investors-are-now-less-concerned-about-tariffs-than-the-economy-says-bofa-survey-why-that-could-be-a-mistake-8798a2ac?mod=mw_rss_topstories",
    "summary": "President Trump&#x2019;s tariff fight no longer looks to be the biggest worry keeping investors up at night, according to a new BofA Global survey.",
    "fullContent": "President Trump&#x2019;s tariff fight no longer looks to be the biggest worry keeping investors up at night, according to a new BofA Global survey.",
    "publishedAt": "2025-08-08T21:08:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.526Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "4b75bd8a"
  },
  {
    "id": "business-insider-35785e09",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "I didn't want my son to overdose on screen time this summer, so we're fostering a puppy. He's learning responsibility and time management.",
    "url": "https://www.businessinsider.com/teen-didnt-get-summer-job-fostering-dog-taught-him-responsibility-2025-8",
    "summary": "My teen didn't get a job or volunteer gig for the summer, so we decided to let him foster a puppy. It has been a great experience.",
    "fullContent": "My teen didn't get a job or volunteer gig for the summer, so we decided to let him foster a puppy. It has been a great experience.",
    "publishedAt": "2025-08-08T21:05:01.000Z",
    "fetchedAt": "2025-08-09T02:26:36.309Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "35785e09"
  },
  {
    "id": "business-insider-7b938989",
    "sourceId": "business-insider",
    "sourceName": "Business Insider",
    "title": "Luigi Mangione's 120-page healthcare history was accidentally shared by Aetna and his own lawyers, prosecutor says",
    "url": "https://www.businessinsider.com/ny-blames-aetna-defense-lawyers-luigi-mangione-healthcare-records-2025-8",
    "summary": "In new finger pointing, Luigi Mangione's NY prosecutor says Aetna and defense lawyers were all sloppy with his private medical records.",
    "fullContent": "In new finger pointing, Luigi Mangione's NY prosecutor says Aetna and defense lawyers were all sloppy with his private medical records.",
    "publishedAt": "2025-08-08T21:04:21.000Z",
    "fetchedAt": "2025-08-09T02:26:36.309Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7b938989"
  },
  {
    "id": "wsj-markets-main-399f5adb",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "The Score: Apple, Palantir, Intel and More Stocks That Defined the Week",
    "url": "https://www.wsj.com/finance/stocks/the-score-apple-palantir-intel-and-more-stocks-that-defined-the-week-73ef9152?mod=rss_markets_main",
    "summary": "Here are some of the major companies whose stocks moved on the week&#x2019;s news.",
    "fullContent": "Here are some of the major companies whose stocks moved on the week&#x2019;s news.",
    "publishedAt": "2025-08-08T21:03:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "399f5adb"
  },
  {
    "id": "cnbc-markets-6828ba36",
    "sourceId": "cnbc-markets",
    "sourceName": "CNBC Markets",
    "title": "Apple has its best week since July 2020 after White House visit",
    "url": "https://www.cnbc.com/2025/08/08/apple-has-best-week-since-july-2020-after-tim-cooks-white-house-visit.html",
    "summary": "Apple is the third-most valuable company, behind Microsoft and Nvidia and ahead of Google and Amazon.",
    "fullContent": "Apple is the third-most valuable company, behind Microsoft and Nvidia and ahead of Google and Amazon.",
    "publishedAt": "2025-08-08T21:02:29.000Z",
    "fetchedAt": "2025-08-09T02:26:36.013Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "6828ba36"
  },
  {
    "id": "yahoo-finance-5a4b699a",
    "sourceId": "yahoo-finance",
    "sourceName": "Yahoo Finance",
    "title": "Earnings live: SoundHound AI stock soars, The Trade Desk tanks as Q2 earnings season starts winding down",
    "url": "https://finance.yahoo.com/news/live/earnings-live-soundhound-ai-stock-soars-the-trade-desk-tanks-as-q2-earnings-season-starts-winding-down-210131401.html",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T21:01:31.000Z",
    "fetchedAt": "2025-08-11T02:36:53.432Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "5a4b699a"
  },
  {
    "id": "zerohedge-7795ef6a",
    "sourceId": "zerohedge",
    "sourceName": "ZeroHedge",
    "title": "DOJ To Expunge Employees' COVID-19 Vaccination Records: Lawyers",
    "url": "https://www.zerohedge.com/covid-19/doj-expunge-employees-covid-19-vaccination-records-lawyers",
    "summary": "DOJ To Expunge Employees' COVID-19 Vaccination Records: Lawyers Authored by Zachary Stieber via The Epoch Times (emphasis ours), The government has agreed to a settlement that involves expunging records showing the COVID-19 vaccination status of employees, lawyers representing...",
    "fullContent": "DOJ To Expunge Employees' COVID-19 Vaccination Records: Lawyers Authored by Zachary Stieber via The Epoch Times (emphasis ours), The government has agreed to a settlement that involves expunging records showing the COVID-19 vaccination status of employees, lawyers representing workers who sued said on Aug. 7. Officials must expunge the records under the settlement and bar discrimination based on vaccine status, Feds for Freedom, the workers group, and its lawyers said in a statement. An email to the Department of Justice attorney who filed a voluntary dismissal in the case on Thursday returned a message saying he is on leave until Aug. 11. The department’s media office did not respond to a request for comment by publication time. The formal settlement has not been entered on the court docket, but lawyers for Feds for Freedom said it includes the reimbursement of some of the legal fees incurred in the case the organization brought against the government over the COVID-19 vaccine mandate for federal workers. Feds for Freedom sued the government in 2021, after President Joe Biden imposed COVID-19 vaccine requirements on all federal workers. U.S. District Judge Jeffrey Brown entered a preliminary injunction in January 2022 that blocked the mandate as the case proceeded, finding that Biden lacked the authority to issue such a mandate. A panel of the U.S. Court of Appeals for the Fifth Circuit several months later lifted the injunction, saying the federal workers who sued should have taken their complaints to an administrative board rather than the courts. The full appeals court in 2023 kept the mandate in place. The Supreme Court in late 2023 vacated the rulings in the case because Biden had rescinded the mandate, meaning none of the decisions will serve as precedent in future cases. Brown in March vacated the injunction. He also directed the government and plaintiffs to file a status report. The government in filings since then requested extensions to respond, saying officials were discussing appropriate next steps for the litigation and that they were dealing with staffing issues. Brown’s last order told the parties to enter a proposed briefing schedule no later than Aug. 7. Assistant U.S. Attorney James Gillingham on Aug 7 said in a stipulation that the parties had agreed to the dismissal of the case with prejudice. Biden defended the mandate, saying it prevented infections, hospitalizations, and deaths. President Donald Trump has criticized COVID-19 vaccine mandates, saying he supported people choosing not to receive a vaccine. In February, he signed an order that bars funding to schools that require COVID-19 vaccination. Tyler Durden Fri, 08/08/2025 - 17:00",
    "publishedAt": "2025-08-08T21:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.988Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "7795ef6a"
  },
  {
    "id": "oil-price-5804105b",
    "sourceId": "oil-price",
    "sourceName": "OilPrice.com",
    "title": "General Matter to Build $1.5 Billion Uranium Plant in Kentucky",
    "url": "https://oilprice.com/Energy/Energy-General/General-Matter-to-Build-15-Billion-Uranium-Plant-in-Kentucky.html",
    "summary": "Critical minerals startup General Matter announced ambitious plans this week to construct a $1.5 billion uranium enrichment facility at the Paducah Gaseous Diffusion Plant in McCracken County, Kentucky, as the Trump administration seeks to reduce reliance on rare earths from...",
    "fullContent": "Critical minerals startup General Matter announced ambitious plans this week to construct a $1.5 billion uranium enrichment facility at the Paducah Gaseous Diffusion Plant in McCracken County, Kentucky, as the Trump administration seeks to reduce reliance on rare earths from China. The groundbreaking project would be the first U.S.-owned, privately developed uranium enrichment facility and marks the largest economic development initiative in Western Kentucky&#039;s history. General Matter will develop the 100-acre uranium enrichment facility on the…",
    "publishedAt": "2025-08-08T21:00:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.178Z",
    "category": "commodities",
    "tags": [
      "commodities"
    ],
    "priority": "normal",
    "contentHash": "5804105b"
  },
  {
    "id": "wsj-markets-main-19a7d30",
    "sourceId": "wsj-markets-main",
    "sourceName": "WSJ Markets",
    "title": "S&P 500 Posts Best Week Since June",
    "url": "https://www.wsj.com/finance/stocks/s-p-500-posts-best-week-since-june-cbf987a3?mod=rss_markets_main",
    "summary": "The start of Trump&#x2019;s sweeping tariffs fails to damp investor enthusiasm.",
    "fullContent": "The start of Trump&#x2019;s sweeping tariffs fails to damp investor enthusiasm.",
    "publishedAt": "2025-08-08T20:51:00.000Z",
    "fetchedAt": "2025-08-09T02:26:36.146Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "19a7d30"
  },
  {
    "id": "marketwatch-2eb767e6",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Gold and bitcoin are both vying to be safe havens for investors. Why gold is winning so far this year.",
    "url": "https://www.marketwatch.com/story/gold-and-bitcoin-are-both-vying-to-be-safe-havens-for-investors-why-gold-is-winning-so-far-this-year-42e5fc9e?mod=mw_rss_topstories",
    "summary": "There has been no shortage of investor jitters in 2025, and gold is showing no sign of ceding its crown as the go-to safe haven.",
    "fullContent": "There has been no shortage of investor jitters in 2025, and gold is showing no sign of ceding its crown as the go-to safe haven.",
    "publishedAt": "2025-08-08T20:51:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.526Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "2eb767e6"
  },
  {
    "id": "ndtv-profit-youtube-20fdcdaa",
    "sourceId": "ndtv-profit-youtube",
    "sourceName": "NDTV Profit YouTube",
    "title": "Jeffrey Epstein Sexual Battery Accuser Breaks Down | Washington Watch: 'I Cry When I Hear His Name'",
    "url": "https://www.youtube.com/watch?v=PvPnW6chNfo",
    "summary": "",
    "fullContent": "",
    "publishedAt": "2025-08-08T20:49:32.000Z",
    "fetchedAt": "2025-08-09T02:26:45.355Z",
    "category": "videos",
    "tags": [
      "videos"
    ],
    "priority": "normal",
    "contentHash": "20fdcdaa"
  },
  {
    "id": "bloomberg-politics-2466f74d",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump DOJ Asks to Dismiss Harvard Suit Over Foreign Students",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-doj-asks-judge-to-dismiss-harvard-foreign-student-suit",
    "summary": "The Trump administration asked a federal judge to throw out Harvard University’s lawsuit over a proposed ban on international students, saying the president has broad authority to issue rules restricting the entry of non-citizens into the country.",
    "fullContent": "The Trump administration asked a federal judge to throw out Harvard University’s lawsuit over a proposed ban on international students, saying the president has broad authority to issue rules restricting the entry of non-citizens into the country.",
    "publishedAt": "2025-08-08T20:48:19.000Z",
    "fetchedAt": "2025-08-09T02:26:36.257Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "2466f74d"
  },
  {
    "id": "bloomberg-politics-2005b3ae",
    "sourceId": "bloomberg-politics",
    "sourceName": "Bloomberg Politics",
    "title": "Trump to Tap Biden Appointee to Lead US Agency Overseeing Natural Gas Exports",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-to-tap-democrat-to-lead-us-agency-overseeing-gas-power",
    "summary": "President Donald Trump is preparing to tap David Rosner to be chair of the Federal Energy Regulatory Commission, which oversees key decisions about natural gas export terminals and power lines.",
    "fullContent": "President Donald Trump is preparing to tap David Rosner to be chair of the Federal Energy Regulatory Commission, which oversees key decisions about natural gas export terminals and power lines.",
    "publishedAt": "2025-08-08T20:45:54.000Z",
    "fetchedAt": "2025-08-09T02:26:36.257Z",
    "category": "policy",
    "tags": [
      "policy"
    ],
    "priority": "normal",
    "contentHash": "2005b3ae"
  },
  {
    "id": "marketwatch-3a21f97b",
    "sourceId": "marketwatch",
    "sourceName": "MarketWatch",
    "title": "Sweetgreen&#x2019;s customers are cutting back on pricey salads. Will extra chicken help?",
    "url": "https://www.marketwatch.com/story/sweetgreens-customers-are-cutting-back-on-pricey-salads-will-extra-chicken-help-ccd79c31?mod=mw_rss_topstories",
    "summary": "Sweetgreen&#x2019;s stock is sliding toward its worst day on record, and the company says it&#x2019;s boosting some portion sizes to enhance the value proposition.",
    "fullContent": "Sweetgreen&#x2019;s stock is sliding toward its worst day on record, and the company says it&#x2019;s boosting some portion sizes to enhance the value proposition.",
    "publishedAt": "2025-08-08T20:45:00.000Z",
    "fetchedAt": "2025-08-09T02:26:38.526Z",
    "category": "markets",
    "tags": [
      "markets"
    ],
    "priority": "normal",
    "contentHash": "3a21f97b"
  }
]